       01  BAN0057I.                                                            
           02  FILLER PIC X(12).                                                
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(11).                                               
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AVBPRZL    COMP  PIC  S9(4).                                     
           02  AVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVBPRZF.                                        
             03 AVBPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBPRZI  PIC X(1).                                               
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADIRI  PIC X(3).                                                 
           02  AVBNAMEL    COMP  PIC  S9(4).                                    
           02  AVBNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAMEF.                                       
             03 AVBNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNAMEI  PIC X(20).                                             
           02  TVORSCL    COMP  PIC  S9(4).                                     
           02  TVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES TVORSCF.                                        
             03 TVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVORSCI  PIC X(7).                                               
           02  AVORSCL    COMP  PIC  S9(4).                                     
           02  AVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES AVORSCF.                                        
             03 AVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVORSCI  PIC X(17).                                              
           02  TVMNRL    COMP  PIC  S9(4).                                      
           02  TVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVMNRF.                                         
             03 TVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVMNRI  PIC X(11).                                               
           02  AVMNRL    COMP  PIC  S9(4).                                      
           02  AVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVMNRF.                                         
             03 AVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVMNRI  PIC X(7).                                                
           02  AVMPRZL    COMP  PIC  S9(4).                                     
           02  AVMPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVMPRZF.                                        
             03 AVMPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVMPRZI  PIC X(1).                                               
           02  AVMNAMEL    COMP  PIC  S9(4).                                    
           02  AVMNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVMNAMEF.                                       
             03 AVMNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVMNAMEI  PIC X(20).                                             
           02  TVBZEIL    COMP  PIC  S9(4).                                     
           02  TVBZEIF    PICTURE X.                                            
           02  FILLER REDEFINES TVBZEIF.                                        
             03 TVBZEIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVBZEII  PIC X(13).                                              
           02  AVBZEIL    COMP  PIC  S9(4).                                     
           02  AVBZEIF    PICTURE X.                                            
           02  FILLER REDEFINES AVBZEIF.                                        
             03 AVBZEIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBZEII  PIC X(7).                                               
           02  TPINL    COMP  PIC  S9(4).                                       
           02  TPINF    PICTURE X.                                              
           02  FILLER REDEFINES TPINF.                                          
             03 TPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPINI  PIC X(10).                                                
           02  EVSNR2L    COMP  PIC  S9(4).                                     
           02  EVSNR2F    PICTURE X.                                            
           02  FILLER REDEFINES EVSNR2F.                                        
             03 EVSNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVSNR2I  PIC X(15).                                              
           02  TKDNAML    COMP  PIC  S9(4).                                     
           02  TKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES TKDNAMF.                                        
             03 TKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDNAMI  PIC X(10).                                              
           02  EKDNAML    COMP  PIC  S9(4).                                     
           02  EKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES EKDNAMF.                                        
             03 EKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDNAMI  PIC X(26).                                              
           02  TKDVNAL    COMP  PIC  S9(4).                                     
           02  TKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES TKDVNAF.                                        
             03 TKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDVNAI  PIC X(10).                                              
           02  EKDVNAL    COMP  PIC  S9(4).                                     
           02  EKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES EKDVNAF.                                        
             03 EKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDVNAI  PIC X(26).                                              
           02  TPLZL    COMP  PIC  S9(4).                                       
           02  TPLZF    PICTURE X.                                              
           02  FILLER REDEFINES TPLZF.                                          
             03 TPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPLZI  PIC X(10).                                                
           02  EPLZL    COMP  PIC  S9(4).                                       
           02  EPLZF    PICTURE X.                                              
           02  FILLER REDEFINES EPLZF.                                          
             03 EPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPLZI  PIC X(5).                                                 
           02  EKDORTL    COMP  PIC  S9(4).                                     
           02  EKDORTF    PICTURE X.                                            
           02  FILLER REDEFINES EKDORTF.                                        
             03 EKDORTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDORTI  PIC X(21).                                              
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EAUSLI  PIC X(3).                                                
           02  TBGEBL    COMP  PIC  S9(4).                                      
           02  TBGEBF    PICTURE X.                                             
           02  FILLER REDEFINES TBGEBF.                                         
             03 TBGEBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TBGEBI  PIC X(12).                                               
           02  ABGEBL    COMP  PIC  S9(4).                                      
           02  ABGEBF    PICTURE X.                                             
           02  FILLER REDEFINES ABGEBF.                                         
             03 ABGEBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ABGEBI  PIC X(11).                                               
           02  TPRODL    COMP  PIC  S9(4).                                      
           02  TPRODF    PICTURE X.                                             
           02  FILLER REDEFINES TPRODF.                                         
             03 TPRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TPRODI  PIC X(4).                                                
           02  TSUMMEL    COMP  PIC  S9(4).                                     
           02  TSUMMEF    PICTURE X.                                            
           02  FILLER REDEFINES TSUMMEF.                                        
             03 TSUMMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSUMMEI  PIC X(9).                                               
           02  TZWPL    COMP  PIC  S9(4).                                       
           02  TZWPF    PICTURE X.                                              
           02  FILLER REDEFINES TZWPF.                                          
             03 TZWPA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TZWPI  PIC X(2).                                                 
           02  TLAUFZL    COMP  PIC  S9(4).                                     
           02  TLAUFZF    PICTURE X.                                            
           02  FILLER REDEFINES TLAUFZF.                                        
             03 TLAUFZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TLAUFZI  PIC X(12).                                              
           02  TEINHAL    COMP  PIC  S9(4).                                     
           02  TEINHAF    PICTURE X.                                            
           02  FILLER REDEFINES TEINHAF.                                        
             03 TEINHAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TEINHAI  PIC X(10).                                              
           02  EPROD1L    COMP  PIC  S9(4).                                     
           02  EPROD1F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD1F.                                        
             03 EPROD1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD1I  PIC X(3).                                               
           02  ESUMME1L    COMP  PIC  S9(4).                                    
           02  ESUMME1F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME1F.                                       
             03 ESUMME1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME1I  PIC X(9).                                              
           02  EZWP1L    COMP  PIC  S9(4).                                      
           02  EZWP1F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP1F.                                         
             03 EZWP1A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP1I  PIC X(1).                                                
           02  ELAUFZ1L    COMP  PIC  S9(4).                                    
           02  ELAUFZ1F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ1F.                                       
             03 ELAUFZ1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ1I  PIC X(4).                                              
           02  AEINH1L    COMP  PIC  S9(4).                                     
           02  AEINH1F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH1F.                                        
             03 AEINH1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH1I  PIC X(7).                                               
           02  EEINH1L    COMP  PIC  S9(4).                                     
           02  EEINH1F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH1F.                                        
             03 EEINH1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH1I  PIC X(7).                                               
           02  EPROD2L    COMP  PIC  S9(4).                                     
           02  EPROD2F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD2F.                                        
             03 EPROD2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD2I  PIC X(3).                                               
           02  ESUMME2L    COMP  PIC  S9(4).                                    
           02  ESUMME2F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME2F.                                       
             03 ESUMME2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME2I  PIC X(9).                                              
           02  EZWP2L    COMP  PIC  S9(4).                                      
           02  EZWP2F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP2F.                                         
             03 EZWP2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP2I  PIC X(1).                                                
           02  ELAUFZ2L    COMP  PIC  S9(4).                                    
           02  ELAUFZ2F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ2F.                                       
             03 ELAUFZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ2I  PIC X(4).                                              
           02  AEINH2L    COMP  PIC  S9(4).                                     
           02  AEINH2F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH2F.                                        
             03 AEINH2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH2I  PIC X(7).                                               
           02  EEINH2L    COMP  PIC  S9(4).                                     
           02  EEINH2F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH2F.                                        
             03 EEINH2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH2I  PIC X(7).                                               
           02  EPROD3L    COMP  PIC  S9(4).                                     
           02  EPROD3F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD3F.                                        
             03 EPROD3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD3I  PIC X(3).                                               
           02  ESUMME3L    COMP  PIC  S9(4).                                    
           02  ESUMME3F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME3F.                                       
             03 ESUMME3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME3I  PIC X(9).                                              
           02  EZWP3L    COMP  PIC  S9(4).                                      
           02  EZWP3F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP3F.                                         
             03 EZWP3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP3I  PIC X(1).                                                
           02  ELAUFZ3L    COMP  PIC  S9(4).                                    
           02  ELAUFZ3F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ3F.                                       
             03 ELAUFZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ3I  PIC X(4).                                              
           02  AEINH3L    COMP  PIC  S9(4).                                     
           02  AEINH3F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH3F.                                        
             03 AEINH3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH3I  PIC X(7).                                               
           02  EEINH3L    COMP  PIC  S9(4).                                     
           02  EEINH3F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH3F.                                        
             03 EEINH3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH3I  PIC X(7).                                               
           02  EPROD4L    COMP  PIC  S9(4).                                     
           02  EPROD4F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD4F.                                        
             03 EPROD4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD4I  PIC X(3).                                               
           02  ESUMME4L    COMP  PIC  S9(4).                                    
           02  ESUMME4F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME4F.                                       
             03 ESUMME4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME4I  PIC X(9).                                              
           02  EZWP4L    COMP  PIC  S9(4).                                      
           02  EZWP4F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP4F.                                         
             03 EZWP4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP4I  PIC X(1).                                                
           02  ELAUFZ4L    COMP  PIC  S9(4).                                    
           02  ELAUFZ4F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ4F.                                       
             03 ELAUFZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ4I  PIC X(4).                                              
           02  AEINH4L    COMP  PIC  S9(4).                                     
           02  AEINH4F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH4F.                                        
             03 AEINH4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH4I  PIC X(7).                                               
           02  EEINH4L    COMP  PIC  S9(4).                                     
           02  EEINH4F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH4F.                                        
             03 EEINH4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH4I  PIC X(7).                                               
           02  EPROD5L    COMP  PIC  S9(4).                                     
           02  EPROD5F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD5F.                                        
             03 EPROD5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD5I  PIC X(3).                                               
           02  ESUMME5L    COMP  PIC  S9(4).                                    
           02  ESUMME5F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME5F.                                       
             03 ESUMME5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME5I  PIC X(9).                                              
           02  EZWP5L    COMP  PIC  S9(4).                                      
           02  EZWP5F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP5F.                                         
             03 EZWP5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP5I  PIC X(1).                                                
           02  ELAUFZ5L    COMP  PIC  S9(4).                                    
           02  ELAUFZ5F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ5F.                                       
             03 ELAUFZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ5I  PIC X(4).                                              
           02  AEINH5L    COMP  PIC  S9(4).                                     
           02  AEINH5F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH5F.                                        
             03 AEINH5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH5I  PIC X(7).                                               
           02  EEINH5L    COMP  PIC  S9(4).                                     
           02  EEINH5F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH5F.                                        
             03 EEINH5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH5I  PIC X(7).                                               
           02  EPROD6L    COMP  PIC  S9(4).                                     
           02  EPROD6F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD6F.                                        
             03 EPROD6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD6I  PIC X(3).                                               
           02  ESUMME6L    COMP  PIC  S9(4).                                    
           02  ESUMME6F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME6F.                                       
             03 ESUMME6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME6I  PIC X(9).                                              
           02  EZWP6L    COMP  PIC  S9(4).                                      
           02  EZWP6F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP6F.                                         
             03 EZWP6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP6I  PIC X(1).                                                
           02  ELAUFZ6L    COMP  PIC  S9(4).                                    
           02  ELAUFZ6F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ6F.                                       
             03 ELAUFZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ6I  PIC X(4).                                              
           02  AEINH6L    COMP  PIC  S9(4).                                     
           02  AEINH6F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH6F.                                        
             03 AEINH6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH6I  PIC X(7).                                               
           02  EEINH6L    COMP  PIC  S9(4).                                     
           02  EEINH6F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH6F.                                        
             03 EEINH6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH6I  PIC X(7).                                               
           02  EPROD7L    COMP  PIC  S9(4).                                     
           02  EPROD7F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD7F.                                        
             03 EPROD7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD7I  PIC X(3).                                               
           02  ESUMME7L    COMP  PIC  S9(4).                                    
           02  ESUMME7F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME7F.                                       
             03 ESUMME7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME7I  PIC X(9).                                              
           02  EZWP7L    COMP  PIC  S9(4).                                      
           02  EZWP7F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP7F.                                         
             03 EZWP7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP7I  PIC X(1).                                                
           02  ELAUFZ7L    COMP  PIC  S9(4).                                    
           02  ELAUFZ7F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ7F.                                       
             03 ELAUFZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ7I  PIC X(4).                                              
           02  AEINH7L    COMP  PIC  S9(4).                                     
           02  AEINH7F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH7F.                                        
             03 AEINH7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH7I  PIC X(7).                                               
           02  EEINH7L    COMP  PIC  S9(4).                                     
           02  EEINH7F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH7F.                                        
             03 EEINH7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH7I  PIC X(7).                                               
           02  EPROD8L    COMP  PIC  S9(4).                                     
           02  EPROD8F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD8F.                                        
             03 EPROD8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD8I  PIC X(3).                                               
           02  ESUMME8L    COMP  PIC  S9(4).                                    
           02  ESUMME8F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME8F.                                       
             03 ESUMME8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME8I  PIC X(9).                                              
           02  EZWP8L    COMP  PIC  S9(4).                                      
           02  EZWP8F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP8F.                                         
             03 EZWP8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP8I  PIC X(1).                                                
           02  ELAUFZ8L    COMP  PIC  S9(4).                                    
           02  ELAUFZ8F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ8F.                                       
             03 ELAUFZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ8I  PIC X(4).                                              
           02  AEINH8L    COMP  PIC  S9(4).                                     
           02  AEINH8F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH8F.                                        
             03 AEINH8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH8I  PIC X(7).                                               
           02  EEINH8L    COMP  PIC  S9(4).                                     
           02  EEINH8F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH8F.                                        
             03 EEINH8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH8I  PIC X(7).                                               
           02  EPROD9L    COMP  PIC  S9(4).                                     
           02  EPROD9F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD9F.                                        
             03 EPROD9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD9I  PIC X(3).                                               
           02  ESUMME9L    COMP  PIC  S9(4).                                    
           02  ESUMME9F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME9F.                                       
             03 ESUMME9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME9I  PIC X(9).                                              
           02  EZWP9L    COMP  PIC  S9(4).                                      
           02  EZWP9F    PICTURE X.                                             
           02  FILLER REDEFINES EZWP9F.                                         
             03 EZWP9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZWP9I  PIC X(1).                                                
           02  ELAUFZ9L    COMP  PIC  S9(4).                                    
           02  ELAUFZ9F    PICTURE X.                                           
           02  FILLER REDEFINES ELAUFZ9F.                                       
             03 ELAUFZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELAUFZ9I  PIC X(4).                                              
           02  AEINH9L    COMP  PIC  S9(4).                                     
           02  AEINH9F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH9F.                                        
             03 AEINH9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH9I  PIC X(7).                                               
           02  EEINH9L    COMP  PIC  S9(4).                                     
           02  EEINH9F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH9F.                                        
             03 EEINH9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH9I  PIC X(7).                                               
           02  TANARTL    COMP  PIC  S9(4).                                     
           02  TANARTF    PICTURE X.                                            
           02  FILLER REDEFINES TANARTF.                                        
             03 TANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TANARTI  PIC X(3).                                               
           02  EANARTL    COMP  PIC  S9(4).                                     
           02  EANARTF    PICTURE X.                                            
           02  FILLER REDEFINES EANARTF.                                        
             03 EANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EANARTI  PIC X(1).                                               
           02  TDYNPRL    COMP  PIC  S9(4).                                     
           02  TDYNPRF    PICTURE X.                                            
           02  FILLER REDEFINES TDYNPRF.                                        
             03 TDYNPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TDYNPRI  PIC X(5).                                               
           02  EDYNPRL    COMP  PIC  S9(4).                                     
           02  EDYNPRF    PICTURE X.                                            
           02  FILLER REDEFINES EDYNPRF.                                        
             03 EDYNPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EDYNPRI  PIC X(7).                                               
           02  TAUFNDL    COMP  PIC  S9(4).                                     
           02  TAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES TAUFNDF.                                        
             03 TAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TAUFNDI  PIC X(4).                                               
           02  EAUFNDL    COMP  PIC  S9(4).                                     
           02  EAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES EAUFNDF.                                        
             03 EAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAUFNDI  PIC X(6).                                               
           02  TPESTRL    COMP  PIC  S9(4).                                     
           02  TPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES TPESTRF.                                        
             03 TPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TPESTRI  PIC X(4).                                               
           02  EPESTRL    COMP  PIC  S9(4).                                     
           02  EPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES EPESTRF.                                        
             03 EPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPESTRI  PIC X(6).                                               
           02  TSTATIL    COMP  PIC  S9(4).                                     
           02  TSTATIF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATIF.                                        
             03 TSTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATII  PIC X(6).                                               
           02  ESTATIL    COMP  PIC  S9(4).                                     
           02  ESTATIF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATIF.                                        
             03 ESTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATII  PIC X(6).                                               
           02  TSTATUL    COMP  PIC  S9(4).                                     
           02  TSTATUF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATUF.                                        
             03 TSTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATUI  PIC X(3).                                               
           02  ESTATUL    COMP  PIC  S9(4).                                     
           02  ESTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATUF.                                        
             03 ESTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATUI  PIC X(2).                                               
           02  ASTATUL    COMP  PIC  S9(4).                                     
           02  ASTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ASTATUF.                                        
             03 ASTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASTATUI  PIC X(10).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0057O REDEFINES BAN0057I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBPRZH    PICTURE X.                                            
           02  AVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIRH    PICTURE X.                                              
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNAMEH    PICTURE X.                                           
           02  AVBNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVORSCH    PICTURE X.                                            
           02  TVORSCO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORSCH    PICTURE X.                                            
           02  AVORSCO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVMNRH    PICTURE X.                                             
           02  TVMNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNRH    PICTURE X.                                             
           02  AVMNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMPRZH    PICTURE X.                                            
           02  AVMPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNAMEH    PICTURE X.                                           
           02  AVMNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVBZEIH    PICTURE X.                                            
           02  TVBZEIO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBZEIH    PICTURE X.                                            
           02  AVBZEIO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPINH    PICTURE X.                                              
           02  TPINO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVSNR2H    PICTURE X.                                            
           02  EVSNR2O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDNAMH    PICTURE X.                                            
           02  TKDNAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDNAMH    PICTURE X.                                            
           02  EKDNAMO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDVNAH    PICTURE X.                                            
           02  TKDVNAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDVNAH    PICTURE X.                                            
           02  EKDVNAO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPLZH    PICTURE X.                                              
           02  TPLZO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPLZH    PICTURE X.                                              
           02  EPLZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EKDORTH    PICTURE X.                                            
           02  EKDORTO  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUSLH    PICTURE X.                                             
           02  EAUSLO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBGEBH    PICTURE X.                                             
           02  TBGEBO  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABGEBH    PICTURE X.                                             
           02  ABGEBO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPRODH    PICTURE X.                                             
           02  TPRODO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUMMEH    PICTURE X.                                            
           02  TSUMMEO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZWPH    PICTURE X.                                              
           02  TZWPO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TLAUFZH    PICTURE X.                                            
           02  TLAUFZO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEINHAH    PICTURE X.                                            
           02  TEINHAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPROD1H    PICTURE X.                                            
           02  EPROD1O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME1H    PICTURE X.                                           
           02  ESUMME1O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP1H    PICTURE X.                                             
           02  EZWP1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ1H    PICTURE X.                                           
           02  ELAUFZ1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH1H    PICTURE X.                                            
           02  AEINH1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH1H    PICTURE X.                                            
           02  EEINH1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD2H    PICTURE X.                                            
           02  EPROD2O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME2H    PICTURE X.                                           
           02  ESUMME2O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP2H    PICTURE X.                                             
           02  EZWP2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ2H    PICTURE X.                                           
           02  ELAUFZ2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH2H    PICTURE X.                                            
           02  AEINH2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH2H    PICTURE X.                                            
           02  EEINH2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD3H    PICTURE X.                                            
           02  EPROD3O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME3H    PICTURE X.                                           
           02  ESUMME3O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP3H    PICTURE X.                                             
           02  EZWP3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ3H    PICTURE X.                                           
           02  ELAUFZ3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH3H    PICTURE X.                                            
           02  AEINH3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH3H    PICTURE X.                                            
           02  EEINH3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD4H    PICTURE X.                                            
           02  EPROD4O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME4H    PICTURE X.                                           
           02  ESUMME4O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP4H    PICTURE X.                                             
           02  EZWP4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ4H    PICTURE X.                                           
           02  ELAUFZ4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH4H    PICTURE X.                                            
           02  AEINH4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH4H    PICTURE X.                                            
           02  EEINH4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD5H    PICTURE X.                                            
           02  EPROD5O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME5H    PICTURE X.                                           
           02  ESUMME5O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP5H    PICTURE X.                                             
           02  EZWP5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ5H    PICTURE X.                                           
           02  ELAUFZ5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH5H    PICTURE X.                                            
           02  AEINH5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH5H    PICTURE X.                                            
           02  EEINH5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD6H    PICTURE X.                                            
           02  EPROD6O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME6H    PICTURE X.                                           
           02  ESUMME6O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP6H    PICTURE X.                                             
           02  EZWP6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ6H    PICTURE X.                                           
           02  ELAUFZ6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH6H    PICTURE X.                                            
           02  AEINH6O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH6H    PICTURE X.                                            
           02  EEINH6O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD7H    PICTURE X.                                            
           02  EPROD7O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME7H    PICTURE X.                                           
           02  ESUMME7O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP7H    PICTURE X.                                             
           02  EZWP7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ7H    PICTURE X.                                           
           02  ELAUFZ7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH7H    PICTURE X.                                            
           02  AEINH7O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH7H    PICTURE X.                                            
           02  EEINH7O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD8H    PICTURE X.                                            
           02  EPROD8O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME8H    PICTURE X.                                           
           02  ESUMME8O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP8H    PICTURE X.                                             
           02  EZWP8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ8H    PICTURE X.                                           
           02  ELAUFZ8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH8H    PICTURE X.                                            
           02  AEINH8O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH8H    PICTURE X.                                            
           02  EEINH8O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD9H    PICTURE X.                                            
           02  EPROD9O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME9H    PICTURE X.                                           
           02  ESUMME9O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWP9H    PICTURE X.                                             
           02  EZWP9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ELAUFZ9H    PICTURE X.                                           
           02  ELAUFZ9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH9H    PICTURE X.                                            
           02  AEINH9O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH9H    PICTURE X.                                            
           02  EEINH9O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TANARTH    PICTURE X.                                            
           02  TANARTO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EANARTH    PICTURE X.                                            
           02  EANARTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TDYNPRH    PICTURE X.                                            
           02  TDYNPRO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EDYNPRH    PICTURE X.                                            
           02  EDYNPRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUFNDH    PICTURE X.                                            
           02  TAUFNDO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUFNDH    PICTURE X.                                            
           02  EAUFNDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPESTRH    PICTURE X.                                            
           02  TPESTRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPESTRH    PICTURE X.                                            
           02  EPESTRO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATIH    PICTURE X.                                            
           02  TSTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATIH    PICTURE X.                                            
           02  ESTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATUH    PICTURE X.                                            
           02  TSTATUO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATUH    PICTURE X.                                            
           02  ESTATUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTATUH    PICTURE X.                                            
           02  ASTATUO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
