       01  BAN0045I.                                                            
           02  FILLER PIC X(12).                                                
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(11).                                               
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AVBPRZL    COMP  PIC  S9(4).                                     
           02  AVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVBPRZF.                                        
             03 AVBPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBPRZI  PIC X(1).                                               
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADIRI  PIC X(3).                                                 
           02  AVBNAMEL    COMP  PIC  S9(4).                                    
           02  AVBNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAMEF.                                       
             03 AVBNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNAMEI  PIC X(20).                                             
           02  TVORSCL    COMP  PIC  S9(4).                                     
           02  TVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES TVORSCF.                                        
             03 TVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVORSCI  PIC X(7).                                               
           02  AVORSCL    COMP  PIC  S9(4).                                     
           02  AVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES AVORSCF.                                        
             03 AVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVORSCI  PIC X(17).                                              
           02  TVMNRL    COMP  PIC  S9(4).                                      
           02  TVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVMNRF.                                         
             03 TVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVMNRI  PIC X(11).                                               
           02  AVMNRL    COMP  PIC  S9(4).                                      
           02  AVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVMNRF.                                         
             03 AVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVMNRI  PIC X(7).                                                
           02  AVMPRZL    COMP  PIC  S9(4).                                     
           02  AVMPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVMPRZF.                                        
             03 AVMPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVMPRZI  PIC X(1).                                               
           02  AVMNAMEL    COMP  PIC  S9(4).                                    
           02  AVMNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVMNAMEF.                                       
             03 AVMNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVMNAMEI  PIC X(20).                                             
           02  TVBZEIL    COMP  PIC  S9(4).                                     
           02  TVBZEIF    PICTURE X.                                            
           02  FILLER REDEFINES TVBZEIF.                                        
             03 TVBZEIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVBZEII  PIC X(13).                                              
           02  AVBZEIL    COMP  PIC  S9(4).                                     
           02  AVBZEIF    PICTURE X.                                            
           02  FILLER REDEFINES AVBZEIF.                                        
             03 AVBZEIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBZEII  PIC X(7).                                               
           02  TPINL    COMP  PIC  S9(4).                                       
           02  TPINF    PICTURE X.                                              
           02  FILLER REDEFINES TPINF.                                          
             03 TPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPINI  PIC X(10).                                                
           02  EPINL    COMP  PIC  S9(4).                                       
           02  EPINF    PICTURE X.                                              
           02  FILLER REDEFINES EPINF.                                          
             03 EPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPINI  PIC X(7).                                                 
           02  EPINPRL    COMP  PIC  S9(4).                                     
           02  EPINPRF    PICTURE X.                                            
           02  FILLER REDEFINES EPINPRF.                                        
             03 EPINPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPINPRI  PIC X(2).                                               
           02  TVSNRL    COMP  PIC  S9(4).                                      
           02  TVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVSNRF.                                         
             03 TVSNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVSNRI  PIC X(7).                                                
           02  AVSNRL    COMP  PIC  S9(4).                                      
           02  AVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVSNRF.                                         
             03 AVSNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVSNRI  PIC X(15).                                               
           02  TKDNAML    COMP  PIC  S9(4).                                     
           02  TKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES TKDNAMF.                                        
             03 TKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDNAMI  PIC X(10).                                              
           02  EKDNAML    COMP  PIC  S9(4).                                     
           02  EKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES EKDNAMF.                                        
             03 EKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDNAMI  PIC X(26).                                              
           02  TKDVNAL    COMP  PIC  S9(4).                                     
           02  TKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES TKDVNAF.                                        
             03 TKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDVNAI  PIC X(10).                                              
           02  EKDVNAL    COMP  PIC  S9(4).                                     
           02  EKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES EKDVNAF.                                        
             03 EKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDVNAI  PIC X(26).                                              
           02  TPLZL    COMP  PIC  S9(4).                                       
           02  TPLZF    PICTURE X.                                              
           02  FILLER REDEFINES TPLZF.                                          
             03 TPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPLZI  PIC X(10).                                                
           02  EPLZL    COMP  PIC  S9(4).                                       
           02  EPLZF    PICTURE X.                                              
           02  FILLER REDEFINES EPLZF.                                          
             03 EPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPLZI  PIC X(5).                                                 
           02  EKDORTL    COMP  PIC  S9(4).                                     
           02  EKDORTF    PICTURE X.                                            
           02  FILLER REDEFINES EKDORTF.                                        
             03 EKDORTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDORTI  PIC X(21).                                              
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EAUSLI  PIC X(3).                                                
           02  TPRODL    COMP  PIC  S9(4).                                      
           02  TPRODF    PICTURE X.                                             
           02  FILLER REDEFINES TPRODF.                                         
             03 TPRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TPRODI  PIC X(4).                                                
           02  TGEBURL    COMP  PIC  S9(4).                                     
           02  TGEBURF    PICTURE X.                                            
           02  FILLER REDEFINES TGEBURF.                                        
             03 TGEBURA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TGEBURI  PIC X(8).                                               
           02  TSUMMEL    COMP  PIC  S9(4).                                     
           02  TSUMMEF    PICTURE X.                                            
           02  FILLER REDEFINES TSUMMEF.                                        
             03 TSUMMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSUMMEI  PIC X(9).                                               
           02  TZWPL    COMP  PIC  S9(4).                                       
           02  TZWPF    PICTURE X.                                              
           02  FILLER REDEFINES TZWPF.                                          
             03 TZWPA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TZWPI  PIC X(2).                                                 
           02  TVEBEGL    COMP  PIC  S9(4).                                     
           02  TVEBEGF    PICTURE X.                                            
           02  FILLER REDEFINES TVEBEGF.                                        
             03 TVEBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVEBEGI  PIC X(6).                                               
           02  TRBALTL    COMP  PIC  S9(4).                                     
           02  TRBALTF    PICTURE X.                                            
           02  FILLER REDEFINES TRBALTF.                                        
             03 TRBALTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TRBALTI  PIC X(8).                                               
           02  TEINHAL    COMP  PIC  S9(4).                                     
           02  TEINHAF    PICTURE X.                                            
           02  FILLER REDEFINES TEINHAF.                                        
             03 TEINHAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TEINHAI  PIC X(10).                                              
           02  EPROD1L    COMP  PIC  S9(4).                                     
           02  EPROD1F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD1F.                                        
             03 EPROD1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD1I  PIC X(3).                                               
           02  EGEBURL    COMP  PIC  S9(4).                                     
           02  EGEBURF    PICTURE X.                                            
           02  FILLER REDEFINES EGEBURF.                                        
             03 EGEBURA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EGEBURI  PIC X(4).                                               
           02  ESUMME1L    COMP  PIC  S9(4).                                    
           02  ESUMME1F    PICTURE X.                                           
           02  FILLER REDEFINES ESUMME1F.                                       
             03 ESUMME1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESUMME1I  PIC X(9).                                              
           02  EZAHLWL    COMP  PIC  S9(4).                                     
           02  EZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES EZAHLWF.                                        
             03 EZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLWI  PIC X(1).                                               
           02  EVEBEGL    COMP  PIC  S9(4).                                     
           02  EVEBEGF    PICTURE X.                                            
           02  FILLER REDEFINES EVEBEGF.                                        
             03 EVEBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEGI  PIC X(6).                                               
           02  ERBALTL    COMP  PIC  S9(4).                                     
           02  ERBALTF    PICTURE X.                                            
           02  FILLER REDEFINES ERBALTF.                                        
             03 ERBALTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ERBALTI  PIC X(2).                                               
           02  AEINH1L    COMP  PIC  S9(4).                                     
           02  AEINH1F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH1F.                                        
             03 AEINH1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH1I  PIC X(7).                                               
           02  EEINH1L    COMP  PIC  S9(4).                                     
           02  EEINH1F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH1F.                                        
             03 EEINH1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH1I  PIC X(7).                                               
           02  TANARTL    COMP  PIC  S9(4).                                     
           02  TANARTF    PICTURE X.                                            
           02  FILLER REDEFINES TANARTF.                                        
             03 TANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TANARTI  PIC X(3).                                               
           02  EANARTL    COMP  PIC  S9(4).                                     
           02  EANARTF    PICTURE X.                                            
           02  FILLER REDEFINES EANARTF.                                        
             03 EANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EANARTI  PIC X(1).                                               
           02  TDYNPRL    COMP  PIC  S9(4).                                     
           02  TDYNPRF    PICTURE X.                                            
           02  FILLER REDEFINES TDYNPRF.                                        
             03 TDYNPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TDYNPRI  PIC X(5).                                               
           02  EDYNPRL    COMP  PIC  S9(4).                                     
           02  EDYNPRF    PICTURE X.                                            
           02  FILLER REDEFINES EDYNPRF.                                        
             03 EDYNPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EDYNPRI  PIC X(7).                                               
           02  TAUFNDL    COMP  PIC  S9(4).                                     
           02  TAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES TAUFNDF.                                        
             03 TAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TAUFNDI  PIC X(4).                                               
           02  EAUFNDL    COMP  PIC  S9(4).                                     
           02  EAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES EAUFNDF.                                        
             03 EAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAUFNDI  PIC X(6).                                               
           02  TPESTRL    COMP  PIC  S9(4).                                     
           02  TPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES TPESTRF.                                        
             03 TPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TPESTRI  PIC X(4).                                               
           02  EPESTRL    COMP  PIC  S9(4).                                     
           02  EPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES EPESTRF.                                        
             03 EPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPESTRI  PIC X(6).                                               
           02  TSTATIL    COMP  PIC  S9(4).                                     
           02  TSTATIF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATIF.                                        
             03 TSTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATII  PIC X(6).                                               
           02  ESTATIL    COMP  PIC  S9(4).                                     
           02  ESTATIF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATIF.                                        
             03 ESTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATII  PIC X(6).                                               
           02  TSTATUL    COMP  PIC  S9(4).                                     
           02  TSTATUF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATUF.                                        
             03 TSTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATUI  PIC X(3).                                               
           02  ESTATUL    COMP  PIC  S9(4).                                     
           02  ESTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATUF.                                        
             03 ESTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATUI  PIC X(2).                                               
           02  ASTATUL    COMP  PIC  S9(4).                                     
           02  ASTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ASTATUF.                                        
             03 ASTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASTATUI  PIC X(10).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0045O REDEFINES BAN0045I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBPRZH    PICTURE X.                                            
           02  AVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIRH    PICTURE X.                                              
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNAMEH    PICTURE X.                                           
           02  AVBNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVORSCH    PICTURE X.                                            
           02  TVORSCO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORSCH    PICTURE X.                                            
           02  AVORSCO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVMNRH    PICTURE X.                                             
           02  TVMNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNRH    PICTURE X.                                             
           02  AVMNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMPRZH    PICTURE X.                                            
           02  AVMPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNAMEH    PICTURE X.                                           
           02  AVMNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVBZEIH    PICTURE X.                                            
           02  TVBZEIO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBZEIH    PICTURE X.                                            
           02  AVBZEIO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPINH    PICTURE X.                                              
           02  TPINO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPINH    PICTURE X.                                              
           02  EPINO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPINPRH    PICTURE X.                                            
           02  EPINPRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVSNRH    PICTURE X.                                             
           02  TVSNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSNRH    PICTURE X.                                             
           02  AVSNRO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  TKDNAMH    PICTURE X.                                            
           02  TKDNAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDNAMH    PICTURE X.                                            
           02  EKDNAMO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDVNAH    PICTURE X.                                            
           02  TKDVNAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDVNAH    PICTURE X.                                            
           02  EKDVNAO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPLZH    PICTURE X.                                              
           02  TPLZO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPLZH    PICTURE X.                                              
           02  EPLZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EKDORTH    PICTURE X.                                            
           02  EKDORTO  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUSLH    PICTURE X.                                             
           02  EAUSLO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPRODH    PICTURE X.                                             
           02  TPRODO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TGEBURH    PICTURE X.                                            
           02  TGEBURO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSUMMEH    PICTURE X.                                            
           02  TSUMMEO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZWPH    PICTURE X.                                              
           02  TZWPO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TVEBEGH    PICTURE X.                                            
           02  TVEBEGO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRBALTH    PICTURE X.                                            
           02  TRBALTO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEINHAH    PICTURE X.                                            
           02  TEINHAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPROD1H    PICTURE X.                                            
           02  EPROD1O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGEBURH    PICTURE X.                                            
           02  EGEBURO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMME1H    PICTURE X.                                           
           02  ESUMME1O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHLWH    PICTURE X.                                            
           02  EZAHLWO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVEBEGH    PICTURE X.                                            
           02  EVEBEGO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERBALTH    PICTURE X.                                            
           02  ERBALTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEINH1H    PICTURE X.                                            
           02  AEINH1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH1H    PICTURE X.                                            
           02  EEINH1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TANARTH    PICTURE X.                                            
           02  TANARTO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EANARTH    PICTURE X.                                            
           02  EANARTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TDYNPRH    PICTURE X.                                            
           02  TDYNPRO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EDYNPRH    PICTURE X.                                            
           02  EDYNPRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUFNDH    PICTURE X.                                            
           02  TAUFNDO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUFNDH    PICTURE X.                                            
           02  EAUFNDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPESTRH    PICTURE X.                                            
           02  TPESTRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPESTRH    PICTURE X.                                            
           02  EPESTRO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATIH    PICTURE X.                                            
           02  TSTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATIH    PICTURE X.                                            
           02  ESTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATUH    PICTURE X.                                            
           02  TSTATUO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATUH    PICTURE X.                                            
           02  ESTATUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTATUH    PICTURE X.                                            
           02  ASTATUO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
