      *   Micro Focus Enterprise Developer for Eclipse  5.0.00256
      *   Micro Focus BMS Screen Painter (ver BMSIDE_5-0-01)
      *   MapSet Name   BAN0053
      *   Date Created  08/27/2021
      *   Time Created  09:46:13

      *  Input Data For Map BAN0053
         01 BAN0053I.
            03 FILLER                         PIC X(12).
            03 TVBNRL                         PIC S9(4) COMP.
            03 TVBNRF                         PIC X.
            03 FILLER REDEFINES TVBNRF.
               05 TVBNRA                         PIC X.
            03 FILLER                         PIC X(1).
            03 TVBNRI                         PIC X(11).
            03 AVBNRL                         PIC S9(4) COMP.
            03 AVBNRF                         PIC X.
            03 FILLER REDEFINES AVBNRF.
               05 AVBNRA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVBNRI                         PIC X(7).
            03 AVBPRZL                        PIC S9(4) COMP.
            03 AVBPRZF                        PIC X.
            03 FILLER REDEFINES AVBPRZF.
               05 AVBPRZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVBPRZI                        PIC X(1).
            03 ADIRL                          PIC S9(4) COMP.
            03 ADIRF                          PIC X.
            03 FILLER REDEFINES ADIRF.
               05 ADIRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADIRI                          PIC X(3).
            03 AVBNAMEL                       PIC S9(4) COMP.
            03 AVBNAMEF                       PIC X.
            03 FILLER REDEFINES AVBNAMEF.
               05 AVBNAMEA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVBNAMEI                       PIC X(20).
            03 TVORSCL                        PIC S9(4) COMP.
            03 TVORSCF                        PIC X.
            03 FILLER REDEFINES TVORSCF.
               05 TVORSCA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TVORSCI                        PIC X(7).
            03 AVORSCL                        PIC S9(4) COMP.
            03 AVORSCF                        PIC X.
            03 FILLER REDEFINES AVORSCF.
               05 AVORSCA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVORSCI                        PIC X(17).
            03 TVMNRL                         PIC S9(4) COMP.
            03 TVMNRF                         PIC X.
            03 FILLER REDEFINES TVMNRF.
               05 TVMNRA                         PIC X.
            03 FILLER                         PIC X(1).
            03 TVMNRI                         PIC X(11).
            03 AVMNRL                         PIC S9(4) COMP.
            03 AVMNRF                         PIC X.
            03 FILLER REDEFINES AVMNRF.
               05 AVMNRA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVMNRI                         PIC X(7).
            03 AVMPRZL                        PIC S9(4) COMP.
            03 AVMPRZF                        PIC X.
            03 FILLER REDEFINES AVMPRZF.
               05 AVMPRZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVMPRZI                        PIC X(1).
            03 AVMNAMEL                       PIC S9(4) COMP.
            03 AVMNAMEF                       PIC X.
            03 FILLER REDEFINES AVMNAMEF.
               05 AVMNAMEA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVMNAMEI                       PIC X(20).
            03 TVBZEIL                        PIC S9(4) COMP.
            03 TVBZEIF                        PIC X.
            03 FILLER REDEFINES TVBZEIF.
               05 TVBZEIA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TVBZEII                        PIC X(13).
            03 AVBZEIL                        PIC S9(4) COMP.
            03 AVBZEIF                        PIC X.
            03 FILLER REDEFINES AVBZEIF.
               05 AVBZEIA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVBZEII                        PIC X(7).
            03 TPINL                          PIC S9(4) COMP.
            03 TPINF                          PIC X.
            03 FILLER REDEFINES TPINF.
               05 TPINA                          PIC X.
            03 FILLER                         PIC X(1).
            03 TPINI                          PIC X(10).
            03 EPINL                          PIC S9(4) COMP.
            03 EPINF                          PIC X.
            03 FILLER REDEFINES EPINF.
               05 EPINA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPINI                          PIC X(7).
            03 EPINPRL                        PIC S9(4) COMP.
            03 EPINPRF                        PIC X.
            03 FILLER REDEFINES EPINPRF.
               05 EPINPRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPINPRI                        PIC X(2).
            03 TVSNR2L                        PIC S9(4) COMP.
            03 TVSNR2F                        PIC X.
            03 FILLER REDEFINES TVSNR2F.
               05 TVSNR2A                        PIC X.
            03 FILLER                         PIC X(1).
            03 TVSNR2I                        PIC X(8).
            03 EVSNR2L                        PIC S9(4) COMP.
            03 EVSNR2F                        PIC X.
            03 FILLER REDEFINES EVSNR2F.
               05 EVSNR2A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVSNR2I                        PIC X(15).
            03 TVSNRL                         PIC S9(4) COMP.
            03 TVSNRF                         PIC X.
            03 FILLER REDEFINES TVSNRF.
               05 TVSNRA                         PIC X.
            03 FILLER                         PIC X(1).
            03 TVSNRI                         PIC X(7).
            03 AVSNRL                         PIC S9(4) COMP.
            03 AVSNRF                         PIC X.
            03 FILLER REDEFINES AVSNRF.
               05 AVSNRA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVSNRI                         PIC X(15).
            03 TKDNAML                        PIC S9(4) COMP.
            03 TKDNAMF                        PIC X.
            03 FILLER REDEFINES TKDNAMF.
               05 TKDNAMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TKDNAMI                        PIC X(6).
            03 EKDNAML                        PIC S9(4) COMP.
            03 EKDNAMF                        PIC X.
            03 FILLER REDEFINES EKDNAMF.
               05 EKDNAMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKDNAMI                        PIC X(23).
            03 TKDVNAL                        PIC S9(4) COMP.
            03 TKDVNAF                        PIC X.
            03 FILLER REDEFINES TKDVNAF.
               05 TKDVNAA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TKDVNAI                        PIC X(7).
            03 EKDVNAL                        PIC S9(4) COMP.
            03 EKDVNAF                        PIC X.
            03 FILLER REDEFINES EKDVNAF.
               05 EKDVNAA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKDVNAI                        PIC X(23).
            03 TKDSTAAL                       PIC S9(4) COMP.
            03 TKDSTAAF                       PIC X.
            03 FILLER REDEFINES TKDSTAAF.
               05 TKDSTAAA                       PIC X.
            03 FILLER                         PIC X(1).
            03 TKDSTAAI                       PIC X(7).
            03 EKDSTAAL                       PIC S9(4) COMP.
            03 EKDSTAAF                       PIC X.
            03 FILLER REDEFINES EKDSTAAF.
               05 EKDSTAAA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKDSTAAI                       PIC X(3).
            03 TPLZL                          PIC S9(4) COMP.
            03 TPLZF                          PIC X.
            03 FILLER REDEFINES TPLZF.
               05 TPLZA                          PIC X.
            03 FILLER                         PIC X(1).
            03 TPLZI                          PIC X(10).
            03 EPLZL                          PIC S9(4) COMP.
            03 EPLZF                          PIC X.
            03 FILLER REDEFINES EPLZF.
               05 EPLZA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPLZI                          PIC X(5).
            03 EKDORTL                        PIC S9(4) COMP.
            03 EKDORTF                        PIC X.
            03 FILLER REDEFINES EKDORTF.
               05 EKDORTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKDORTI                        PIC X(21).
            03 EAUSLL                         PIC S9(4) COMP.
            03 EAUSLF                         PIC X.
            03 FILLER REDEFINES EAUSLF.
               05 EAUSLA                         PIC X.
            03 FILLER                         PIC X(1).
            03 EAUSLI                         PIC X(3).
            03 TKDGEBL                        PIC S9(4) COMP.
            03 TKDGEBF                        PIC X.
            03 FILLER REDEFINES TKDGEBF.
               05 TKDGEBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TKDGEBI                        PIC X(6).
            03 EKDGEBL                        PIC S9(4) COMP.
            03 EKDGEBF                        PIC X.
            03 FILLER REDEFINES EKDGEBF.
               05 EKDGEBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKDGEBI                        PIC X(6).
            03 TKDPEPL                        PIC S9(4) COMP.
            03 TKDPEPF                        PIC X.
            03 FILLER REDEFINES TKDPEPF.
               05 TKDPEPA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TKDPEPI                        PIC X(6).
            03 EKDPEPL                        PIC S9(4) COMP.
            03 EKDPEPF                        PIC X.
            03 FILLER REDEFINES EKDPEPF.
               05 EKDPEPA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKDPEPI                        PIC X(1).
            03 TKDBGRPL                       PIC S9(4) COMP.
            03 TKDBGRPF                       PIC X.
            03 FILLER REDEFINES TKDBGRPF.
               05 TKDBGRPA                       PIC X.
            03 FILLER                         PIC X(1).
            03 TKDBGRPI                       PIC X(5).
            03 EKDBGRPL                       PIC S9(4) COMP.
            03 EKDBGRPF                       PIC X.
            03 FILLER REDEFINES EKDBGRPF.
               05 EKDBGRPA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKDBGRPI                       PIC X(30).
            03 TKDBRANL                       PIC S9(4) COMP.
            03 TKDBRANF                       PIC X.
            03 FILLER REDEFINES TKDBRANF.
               05 TKDBRANA                       PIC X.
            03 FILLER                         PIC X(1).
            03 TKDBRANI                       PIC X(7).
            03 EKDBRANL                       PIC S9(4) COMP.
            03 EKDBRANF                       PIC X.
            03 FILLER REDEFINES EKDBRANF.
               05 EKDBRANA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKDBRANI                       PIC X(31).
            03 TPRODL                         PIC S9(4) COMP.
            03 TPRODF                         PIC X.
            03 FILLER REDEFINES TPRODF.
               05 TPRODA                         PIC X.
            03 FILLER                         PIC X(1).
            03 TPRODI                         PIC X(4).
            03 TFNAMEL                        PIC S9(4) COMP.
            03 TFNAMEF                        PIC X.
            03 FILLER REDEFINES TFNAMEF.
               05 TFNAMEA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TFNAMEI                        PIC X(8).
            03 TSUMMEL                        PIC S9(4) COMP.
            03 TSUMMEF                        PIC X.
            03 FILLER REDEFINES TSUMMEF.
               05 TSUMMEA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TSUMMEI                        PIC X(9).
            03 TZWPL                          PIC S9(4) COMP.
            03 TZWPF                          PIC X.
            03 FILLER REDEFINES TZWPF.
               05 TZWPA                          PIC X.
            03 FILLER                         PIC X(1).
            03 TZWPI                          PIC X(2).
            03 TLAUFZL                        PIC S9(4) COMP.
            03 TLAUFZF                        PIC X.
            03 FILLER REDEFINES TLAUFZF.
               05 TLAUFZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TLAUFZI                        PIC X(12).
            03 TEINHAL                        PIC S9(4) COMP.
            03 TEINHAF                        PIC X.
            03 FILLER REDEFINES TEINHAF.
               05 TEINHAA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TEINHAI                        PIC X(10).
            03 TSEITEL                        PIC S9(4) COMP.
            03 TSEITEF                        PIC X.
            03 FILLER REDEFINES TSEITEF.
               05 TSEITEA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TSEITEI                        PIC X(6).
            03 ASEITEL                        PIC S9(4) COMP.
            03 ASEITEF                        PIC X.
            03 FILLER REDEFINES ASEITEF.
               05 ASEITEA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEITEI                        PIC X(3).
            03 EPROD1L                        PIC S9(4) COMP.
            03 EPROD1F                        PIC X.
            03 FILLER REDEFINES EPROD1F.
               05 EPROD1A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD1I                        PIC X(3).
            03 AFNAME1L                       PIC S9(4) COMP.
            03 AFNAME1F                       PIC X.
            03 FILLER REDEFINES AFNAME1F.
               05 AFNAME1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME1I                       PIC X(10).
            03 ESUMME1L                       PIC S9(4) COMP.
            03 ESUMME1F                       PIC X.
            03 FILLER REDEFINES ESUMME1F.
               05 ESUMME1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME1I                       PIC X(9).
            03 EZWP1L                         PIC S9(4) COMP.
            03 EZWP1F                         PIC X.
            03 FILLER REDEFINES EZWP1F.
               05 EZWP1A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP1I                         PIC X(1).
            03 ELAUFZ1L                       PIC S9(4) COMP.
            03 ELAUFZ1F                       PIC X.
            03 FILLER REDEFINES ELAUFZ1F.
               05 ELAUFZ1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ1I                       PIC X(4).
            03 AEINH1L                        PIC S9(4) COMP.
            03 AEINH1F                        PIC X.
            03 FILLER REDEFINES AEINH1F.
               05 AEINH1A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH1I                        PIC X(7).
            03 EEINH1L                        PIC S9(4) COMP.
            03 EEINH1F                        PIC X.
            03 FILLER REDEFINES EEINH1F.
               05 EEINH1A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH1I                        PIC X(7).
            03 EPROD2L                        PIC S9(4) COMP.
            03 EPROD2F                        PIC X.
            03 FILLER REDEFINES EPROD2F.
               05 EPROD2A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD2I                        PIC X(3).
            03 AFNAME2L                       PIC S9(4) COMP.
            03 AFNAME2F                       PIC X.
            03 FILLER REDEFINES AFNAME2F.
               05 AFNAME2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME2I                       PIC X(10).
            03 ESUMME2L                       PIC S9(4) COMP.
            03 ESUMME2F                       PIC X.
            03 FILLER REDEFINES ESUMME2F.
               05 ESUMME2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME2I                       PIC X(9).
            03 EZWP2L                         PIC S9(4) COMP.
            03 EZWP2F                         PIC X.
            03 FILLER REDEFINES EZWP2F.
               05 EZWP2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP2I                         PIC X(1).
            03 ELAUFZ2L                       PIC S9(4) COMP.
            03 ELAUFZ2F                       PIC X.
            03 FILLER REDEFINES ELAUFZ2F.
               05 ELAUFZ2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ2I                       PIC X(4).
            03 AEINH2L                        PIC S9(4) COMP.
            03 AEINH2F                        PIC X.
            03 FILLER REDEFINES AEINH2F.
               05 AEINH2A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH2I                        PIC X(7).
            03 EEINH2L                        PIC S9(4) COMP.
            03 EEINH2F                        PIC X.
            03 FILLER REDEFINES EEINH2F.
               05 EEINH2A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH2I                        PIC X(7).
            03 EPROD3L                        PIC S9(4) COMP.
            03 EPROD3F                        PIC X.
            03 FILLER REDEFINES EPROD3F.
               05 EPROD3A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD3I                        PIC X(3).
            03 AFNAME3L                       PIC S9(4) COMP.
            03 AFNAME3F                       PIC X.
            03 FILLER REDEFINES AFNAME3F.
               05 AFNAME3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME3I                       PIC X(10).
            03 ESUMME3L                       PIC S9(4) COMP.
            03 ESUMME3F                       PIC X.
            03 FILLER REDEFINES ESUMME3F.
               05 ESUMME3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME3I                       PIC X(9).
            03 EZWP3L                         PIC S9(4) COMP.
            03 EZWP3F                         PIC X.
            03 FILLER REDEFINES EZWP3F.
               05 EZWP3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP3I                         PIC X(1).
            03 ELAUFZ3L                       PIC S9(4) COMP.
            03 ELAUFZ3F                       PIC X.
            03 FILLER REDEFINES ELAUFZ3F.
               05 ELAUFZ3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ3I                       PIC X(4).
            03 AEINH3L                        PIC S9(4) COMP.
            03 AEINH3F                        PIC X.
            03 FILLER REDEFINES AEINH3F.
               05 AEINH3A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH3I                        PIC X(7).
            03 EEINH3L                        PIC S9(4) COMP.
            03 EEINH3F                        PIC X.
            03 FILLER REDEFINES EEINH3F.
               05 EEINH3A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH3I                        PIC X(7).
            03 EPROD4L                        PIC S9(4) COMP.
            03 EPROD4F                        PIC X.
            03 FILLER REDEFINES EPROD4F.
               05 EPROD4A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD4I                        PIC X(3).
            03 AFNAME4L                       PIC S9(4) COMP.
            03 AFNAME4F                       PIC X.
            03 FILLER REDEFINES AFNAME4F.
               05 AFNAME4A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME4I                       PIC X(10).
            03 ESUMME4L                       PIC S9(4) COMP.
            03 ESUMME4F                       PIC X.
            03 FILLER REDEFINES ESUMME4F.
               05 ESUMME4A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME4I                       PIC X(9).
            03 EZWP4L                         PIC S9(4) COMP.
            03 EZWP4F                         PIC X.
            03 FILLER REDEFINES EZWP4F.
               05 EZWP4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP4I                         PIC X(1).
            03 ELAUFZ4L                       PIC S9(4) COMP.
            03 ELAUFZ4F                       PIC X.
            03 FILLER REDEFINES ELAUFZ4F.
               05 ELAUFZ4A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ4I                       PIC X(4).
            03 AEINH4L                        PIC S9(4) COMP.
            03 AEINH4F                        PIC X.
            03 FILLER REDEFINES AEINH4F.
               05 AEINH4A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH4I                        PIC X(7).
            03 EEINH4L                        PIC S9(4) COMP.
            03 EEINH4F                        PIC X.
            03 FILLER REDEFINES EEINH4F.
               05 EEINH4A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH4I                        PIC X(7).
            03 EPROD5L                        PIC S9(4) COMP.
            03 EPROD5F                        PIC X.
            03 FILLER REDEFINES EPROD5F.
               05 EPROD5A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD5I                        PIC X(3).
            03 AFNAME5L                       PIC S9(4) COMP.
            03 AFNAME5F                       PIC X.
            03 FILLER REDEFINES AFNAME5F.
               05 AFNAME5A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME5I                       PIC X(10).
            03 ESUMME5L                       PIC S9(4) COMP.
            03 ESUMME5F                       PIC X.
            03 FILLER REDEFINES ESUMME5F.
               05 ESUMME5A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME5I                       PIC X(9).
            03 EZWP5L                         PIC S9(4) COMP.
            03 EZWP5F                         PIC X.
            03 FILLER REDEFINES EZWP5F.
               05 EZWP5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP5I                         PIC X(1).
            03 ELAUFZ5L                       PIC S9(4) COMP.
            03 ELAUFZ5F                       PIC X.
            03 FILLER REDEFINES ELAUFZ5F.
               05 ELAUFZ5A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ5I                       PIC X(4).
            03 AEINH5L                        PIC S9(4) COMP.
            03 AEINH5F                        PIC X.
            03 FILLER REDEFINES AEINH5F.
               05 AEINH5A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH5I                        PIC X(7).
            03 EEINH5L                        PIC S9(4) COMP.
            03 EEINH5F                        PIC X.
            03 FILLER REDEFINES EEINH5F.
               05 EEINH5A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH5I                        PIC X(7).
            03 EPROD6L                        PIC S9(4) COMP.
            03 EPROD6F                        PIC X.
            03 FILLER REDEFINES EPROD6F.
               05 EPROD6A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD6I                        PIC X(3).
            03 AFNAME6L                       PIC S9(4) COMP.
            03 AFNAME6F                       PIC X.
            03 FILLER REDEFINES AFNAME6F.
               05 AFNAME6A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME6I                       PIC X(10).
            03 ESUMME6L                       PIC S9(4) COMP.
            03 ESUMME6F                       PIC X.
            03 FILLER REDEFINES ESUMME6F.
               05 ESUMME6A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME6I                       PIC X(9).
            03 EZWP6L                         PIC S9(4) COMP.
            03 EZWP6F                         PIC X.
            03 FILLER REDEFINES EZWP6F.
               05 EZWP6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP6I                         PIC X(1).
            03 ELAUFZ6L                       PIC S9(4) COMP.
            03 ELAUFZ6F                       PIC X.
            03 FILLER REDEFINES ELAUFZ6F.
               05 ELAUFZ6A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ6I                       PIC X(4).
            03 AEINH6L                        PIC S9(4) COMP.
            03 AEINH6F                        PIC X.
            03 FILLER REDEFINES AEINH6F.
               05 AEINH6A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH6I                        PIC X(7).
            03 EEINH6L                        PIC S9(4) COMP.
            03 EEINH6F                        PIC X.
            03 FILLER REDEFINES EEINH6F.
               05 EEINH6A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH6I                        PIC X(7).
            03 EPROD7L                        PIC S9(4) COMP.
            03 EPROD7F                        PIC X.
            03 FILLER REDEFINES EPROD7F.
               05 EPROD7A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD7I                        PIC X(3).
            03 AFNAME7L                       PIC S9(4) COMP.
            03 AFNAME7F                       PIC X.
            03 FILLER REDEFINES AFNAME7F.
               05 AFNAME7A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME7I                       PIC X(10).
            03 ESUMME7L                       PIC S9(4) COMP.
            03 ESUMME7F                       PIC X.
            03 FILLER REDEFINES ESUMME7F.
               05 ESUMME7A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME7I                       PIC X(9).
            03 EZWP7L                         PIC S9(4) COMP.
            03 EZWP7F                         PIC X.
            03 FILLER REDEFINES EZWP7F.
               05 EZWP7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP7I                         PIC X(1).
            03 ELAUFZ7L                       PIC S9(4) COMP.
            03 ELAUFZ7F                       PIC X.
            03 FILLER REDEFINES ELAUFZ7F.
               05 ELAUFZ7A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ7I                       PIC X(4).
            03 AEINH7L                        PIC S9(4) COMP.
            03 AEINH7F                        PIC X.
            03 FILLER REDEFINES AEINH7F.
               05 AEINH7A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH7I                        PIC X(7).
            03 EEINH7L                        PIC S9(4) COMP.
            03 EEINH7F                        PIC X.
            03 FILLER REDEFINES EEINH7F.
               05 EEINH7A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH7I                        PIC X(7).
            03 EPROD8L                        PIC S9(4) COMP.
            03 EPROD8F                        PIC X.
            03 FILLER REDEFINES EPROD8F.
               05 EPROD8A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROD8I                        PIC X(3).
            03 AFNAME8L                       PIC S9(4) COMP.
            03 AFNAME8F                       PIC X.
            03 FILLER REDEFINES AFNAME8F.
               05 AFNAME8A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFNAME8I                       PIC X(10).
            03 ESUMME8L                       PIC S9(4) COMP.
            03 ESUMME8F                       PIC X.
            03 FILLER REDEFINES ESUMME8F.
               05 ESUMME8A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESUMME8I                       PIC X(9).
            03 EZWP8L                         PIC S9(4) COMP.
            03 EZWP8F                         PIC X.
            03 FILLER REDEFINES EZWP8F.
               05 EZWP8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZWP8I                         PIC X(1).
            03 ELAUFZ8L                       PIC S9(4) COMP.
            03 ELAUFZ8F                       PIC X.
            03 FILLER REDEFINES ELAUFZ8F.
               05 ELAUFZ8A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELAUFZ8I                       PIC X(4).
            03 AEINH8L                        PIC S9(4) COMP.
            03 AEINH8F                        PIC X.
            03 FILLER REDEFINES AEINH8F.
               05 AEINH8A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AEINH8I                        PIC X(7).
            03 EEINH8L                        PIC S9(4) COMP.
            03 EEINH8F                        PIC X.
            03 FILLER REDEFINES EEINH8F.
               05 EEINH8A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EEINH8I                        PIC X(7).
            03 TANARTL                        PIC S9(4) COMP.
            03 TANARTF                        PIC X.
            03 FILLER REDEFINES TANARTF.
               05 TANARTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TANARTI                        PIC X(3).
            03 EANARTL                        PIC S9(4) COMP.
            03 EANARTF                        PIC X.
            03 FILLER REDEFINES EANARTF.
               05 EANARTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EANARTI                        PIC X(1).
            03 TDYNPRL                        PIC S9(4) COMP.
            03 TDYNPRF                        PIC X.
            03 FILLER REDEFINES TDYNPRF.
               05 TDYNPRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TDYNPRI                        PIC X(5).
            03 EDYNPRL                        PIC S9(4) COMP.
            03 EDYNPRF                        PIC X.
            03 FILLER REDEFINES EDYNPRF.
               05 EDYNPRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EDYNPRI                        PIC X(7).
            03 TAUFNDL                        PIC S9(4) COMP.
            03 TAUFNDF                        PIC X.
            03 FILLER REDEFINES TAUFNDF.
               05 TAUFNDA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TAUFNDI                        PIC X(4).
            03 EAUFNDL                        PIC S9(4) COMP.
            03 EAUFNDF                        PIC X.
            03 FILLER REDEFINES EAUFNDF.
               05 EAUFNDA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EAUFNDI                        PIC X(6).
            03 TPESTRL                        PIC S9(4) COMP.
            03 TPESTRF                        PIC X.
            03 FILLER REDEFINES TPESTRF.
               05 TPESTRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TPESTRI                        PIC X(4).
            03 EPESTRL                        PIC S9(4) COMP.
            03 EPESTRF                        PIC X.
            03 FILLER REDEFINES EPESTRF.
               05 EPESTRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPESTRI                        PIC X(6).
            03 TSTATIL                        PIC S9(4) COMP.
            03 TSTATIF                        PIC X.
            03 FILLER REDEFINES TSTATIF.
               05 TSTATIA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TSTATII                        PIC X(6).
            03 ESTATIL                        PIC S9(4) COMP.
            03 ESTATIF                        PIC X.
            03 FILLER REDEFINES ESTATIF.
               05 ESTATIA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ESTATII                        PIC X(6).
            03 TSTATUL                        PIC S9(4) COMP.
            03 TSTATUF                        PIC X.
            03 FILLER REDEFINES TSTATUF.
               05 TSTATUA                        PIC X.
            03 FILLER                         PIC X(1).
            03 TSTATUI                        PIC X(3).
            03 ESTATUL                        PIC S9(4) COMP.
            03 ESTATUF                        PIC X.
            03 FILLER REDEFINES ESTATUF.
               05 ESTATUA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ESTATUI                        PIC X(2).
            03 ASTATUL                        PIC S9(4) COMP.
            03 ASTATUF                        PIC X.
            03 FILLER REDEFINES ASTATUF.
               05 ASTATUA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASTATUI                        PIC X(10).
            03 AFCZANZL                       PIC S9(4) COMP.
            03 AFCZANZF                       PIC X.
            03 FILLER REDEFINES AFCZANZF.
               05 AFCZANZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZANZI                       PIC X(79).

      *  Output Data For Map BAN0053
         01 BAN0053O REDEFINES BAN0053I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 TVBNRH                         PIC X.
            03 TVBNRO                         PIC X(11).
            03 FILLER                         PIC X(3).
            03 AVBNRH                         PIC X.
            03 AVBNRO                         PIC X(7).
            03 FILLER                         PIC X(3).
            03 AVBPRZH                        PIC X.
            03 AVBPRZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADIRH                          PIC X.
            03 ADIRO                          PIC X(3).
            03 FILLER                         PIC X(3).
            03 AVBNAMEH                       PIC X.
            03 AVBNAMEO                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 TVORSCH                        PIC X.
            03 TVORSCO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 AVORSCH                        PIC X.
            03 AVORSCO                        PIC X(17).
            03 FILLER                         PIC X(3).
            03 TVMNRH                         PIC X.
            03 TVMNRO                         PIC X(11).
            03 FILLER                         PIC X(3).
            03 AVMNRH                         PIC X.
            03 AVMNRO                         PIC X(7).
            03 FILLER                         PIC X(3).
            03 AVMPRZH                        PIC X.
            03 AVMPRZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 AVMNAMEH                       PIC X.
            03 AVMNAMEO                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 TVBZEIH                        PIC X.
            03 TVBZEIO                        PIC X(13).
            03 FILLER                         PIC X(3).
            03 AVBZEIH                        PIC X.
            03 AVBZEIO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 TPINH                          PIC X.
            03 TPINO                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 EPINH                          PIC X.
            03 EPINO                          PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPINPRH                        PIC X.
            03 EPINPRO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 TVSNR2H                        PIC X.
            03 TVSNR2O                        PIC X(8).
            03 FILLER                         PIC X(3).
            03 EVSNR2H                        PIC X.
            03 EVSNR2O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 TVSNRH                         PIC X.
            03 TVSNRO                         PIC X(7).
            03 FILLER                         PIC X(3).
            03 AVSNRH                         PIC X.
            03 AVSNRO                         PIC X(15).
            03 FILLER                         PIC X(3).
            03 TKDNAMH                        PIC X.
            03 TKDNAMO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 EKDNAMH                        PIC X.
            03 EKDNAMO                        PIC X(23).
            03 FILLER                         PIC X(3).
            03 TKDVNAH                        PIC X.
            03 TKDVNAO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EKDVNAH                        PIC X.
            03 EKDVNAO                        PIC X(23).
            03 FILLER                         PIC X(3).
            03 TKDSTAAH                       PIC X.
            03 TKDSTAAO                       PIC X(7).
            03 FILLER                         PIC X(3).
            03 EKDSTAAH                       PIC X.
            03 EKDSTAAO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 TPLZH                          PIC X.
            03 TPLZO                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 EPLZH                          PIC X.
            03 EPLZO                          PIC X(5).
            03 FILLER                         PIC X(3).
            03 EKDORTH                        PIC X.
            03 EKDORTO                        PIC X(21).
            03 FILLER                         PIC X(3).
            03 EAUSLH                         PIC X.
            03 EAUSLO                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 TKDGEBH                        PIC X.
            03 TKDGEBO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 EKDGEBH                        PIC X.
            03 EKDGEBO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 TKDPEPH                        PIC X.
            03 TKDPEPO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 EKDPEPH                        PIC X.
            03 EKDPEPO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 TKDBGRPH                       PIC X.
            03 TKDBGRPO                       PIC X(5).
            03 FILLER                         PIC X(3).
            03 EKDBGRPH                       PIC X.
            03 EKDBGRPO                       PIC X(30).
            03 FILLER                         PIC X(3).
            03 TKDBRANH                       PIC X.
            03 TKDBRANO                       PIC X(7).
            03 FILLER                         PIC X(3).
            03 EKDBRANH                       PIC X.
            03 EKDBRANO                       PIC X(31).
            03 FILLER                         PIC X(3).
            03 TPRODH                         PIC X.
            03 TPRODO                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 TFNAMEH                        PIC X.
            03 TFNAMEO                        PIC X(8).
            03 FILLER                         PIC X(3).
            03 TSUMMEH                        PIC X.
            03 TSUMMEO                        PIC X(9).
            03 FILLER                         PIC X(3).
            03 TZWPH                          PIC X.
            03 TZWPO                          PIC X(2).
            03 FILLER                         PIC X(3).
            03 TLAUFZH                        PIC X.
            03 TLAUFZO                        PIC X(12).
            03 FILLER                         PIC X(3).
            03 TEINHAH                        PIC X.
            03 TEINHAO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 TSEITEH                        PIC X.
            03 TSEITEO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 ASEITEH                        PIC X.
            03 ASEITEO                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 EPROD1H                        PIC X.
            03 EPROD1O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME1H                       PIC X.
            03 AFNAME1O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME1H                       PIC X.
            03 ESUMME1O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP1H                         PIC X.
            03 EZWP1O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ1H                       PIC X.
            03 ELAUFZ1O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH1H                        PIC X.
            03 AEINH1O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH1H                        PIC X.
            03 EEINH1O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD2H                        PIC X.
            03 EPROD2O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME2H                       PIC X.
            03 AFNAME2O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME2H                       PIC X.
            03 ESUMME2O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP2H                         PIC X.
            03 EZWP2O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ2H                       PIC X.
            03 ELAUFZ2O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH2H                        PIC X.
            03 AEINH2O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH2H                        PIC X.
            03 EEINH2O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD3H                        PIC X.
            03 EPROD3O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME3H                       PIC X.
            03 AFNAME3O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME3H                       PIC X.
            03 ESUMME3O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP3H                         PIC X.
            03 EZWP3O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ3H                       PIC X.
            03 ELAUFZ3O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH3H                        PIC X.
            03 AEINH3O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH3H                        PIC X.
            03 EEINH3O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD4H                        PIC X.
            03 EPROD4O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME4H                       PIC X.
            03 AFNAME4O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME4H                       PIC X.
            03 ESUMME4O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP4H                         PIC X.
            03 EZWP4O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ4H                       PIC X.
            03 ELAUFZ4O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH4H                        PIC X.
            03 AEINH4O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH4H                        PIC X.
            03 EEINH4O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD5H                        PIC X.
            03 EPROD5O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME5H                       PIC X.
            03 AFNAME5O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME5H                       PIC X.
            03 ESUMME5O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP5H                         PIC X.
            03 EZWP5O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ5H                       PIC X.
            03 ELAUFZ5O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH5H                        PIC X.
            03 AEINH5O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH5H                        PIC X.
            03 EEINH5O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD6H                        PIC X.
            03 EPROD6O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME6H                       PIC X.
            03 AFNAME6O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME6H                       PIC X.
            03 ESUMME6O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP6H                         PIC X.
            03 EZWP6O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ6H                       PIC X.
            03 ELAUFZ6O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH6H                        PIC X.
            03 AEINH6O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH6H                        PIC X.
            03 EEINH6O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD7H                        PIC X.
            03 EPROD7O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME7H                       PIC X.
            03 AFNAME7O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME7H                       PIC X.
            03 ESUMME7O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP7H                         PIC X.
            03 EZWP7O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ7H                       PIC X.
            03 ELAUFZ7O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH7H                        PIC X.
            03 AEINH7O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH7H                        PIC X.
            03 EEINH7O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPROD8H                        PIC X.
            03 EPROD8O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFNAME8H                       PIC X.
            03 AFNAME8O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ESUMME8H                       PIC X.
            03 ESUMME8O                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 EZWP8H                         PIC X.
            03 EZWP8O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ELAUFZ8H                       PIC X.
            03 ELAUFZ8O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AEINH8H                        PIC X.
            03 AEINH8O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EEINH8H                        PIC X.
            03 EEINH8O                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 TANARTH                        PIC X.
            03 TANARTO                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANARTH                        PIC X.
            03 EANARTO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 TDYNPRH                        PIC X.
            03 TDYNPRO                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 EDYNPRH                        PIC X.
            03 EDYNPRO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 TAUFNDH                        PIC X.
            03 TAUFNDO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 EAUFNDH                        PIC X.
            03 EAUFNDO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 TPESTRH                        PIC X.
            03 TPESTRO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 EPESTRH                        PIC X.
            03 EPESTRO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 TSTATIH                        PIC X.
            03 TSTATIO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 ESTATIH                        PIC X.
            03 ESTATIO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 TSTATUH                        PIC X.
            03 TSTATUO                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 ESTATUH                        PIC X.
            03 ESTATUO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 ASTATUH                        PIC X.
            03 ASTATUO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 AFCZANZH                       PIC X.
            03 AFCZANZO                       PIC X(79).

