       01  BAN0036I.                                                            
           02  FILLER PIC X(12).                                                
           02  TGESL    COMP  PIC  S9(4).                                       
           02  TGESF    PICTURE X.                                              
           02  FILLER REDEFINES TGESF.                                          
             03 TGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TGESI  PIC X(28).                                                
           02  EGESNRL    COMP  PIC  S9(4).                                     
           02  EGESNRF    PICTURE X.                                            
           02  FILLER REDEFINES EGESNRF.                                        
             03 EGESNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EGESNRI  PIC X(2).                                               
           02  TPINL    COMP  PIC  S9(4).                                       
           02  TPINF    PICTURE X.                                              
           02  FILLER REDEFINES TPINF.                                          
             03 TPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPINI  PIC X(28).                                                
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  TVORSCL    COMP  PIC  S9(4).                                     
           02  TVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES TVORSCF.                                        
             03 TVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVORSCI  PIC X(28).                                              
           02  EVORSCL    COMP  PIC  S9(4).                                     
           02  EVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES EVORSCF.                                        
             03 EVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVORSCI  PIC X(17).                                              
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(28).                                               
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRI  PIC X(7).                                                
           02  TMCKUNL    COMP  PIC  S9(4).                                     
           02  TMCKUNF    PICTURE X.                                            
           02  FILLER REDEFINES TMCKUNF.                                        
             03 TMCKUNA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TMCKUNI  PIC X(28).                                              
           02  EKDMCL    COMP  PIC  S9(4).                                      
           02  EKDMCF    PICTURE X.                                             
           02  FILLER REDEFINES EKDMCF.                                         
             03 EKDMCA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EKDMCI  PIC X(8).                                                
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0036O REDEFINES BAN0036I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TGESH    PICTURE X.                                              
           02  TGESO  PIC X(28).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESNRH    PICTURE X.                                            
           02  EGESNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPINH    PICTURE X.                                              
           02  TPINO  PIC X(28).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVORSCH    PICTURE X.                                            
           02  TVORSCO  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVORSCH    PICTURE X.                                            
           02  EVORSCO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(28).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRH    PICTURE X.                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TMCKUNH    PICTURE X.                                            
           02  TMCKUNO  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDMCH    PICTURE X.                                             
           02  EKDMCO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
