       01  BAN0032I.                                                            
           02  FILLER PIC X(12).                                                
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(28).                                               
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRI  PIC X(7).                                                
           02  EVBPRZL    COMP  PIC  S9(4).                                     
           02  EVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES EVBPRZF.                                        
             03 EVBPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBPRZI  PIC X(1).                                               
           02  TGESL    COMP  PIC  S9(4).                                       
           02  TGESF    PICTURE X.                                              
           02  FILLER REDEFINES TGESF.                                          
             03 TGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TGESI  PIC X(28).                                                
           02  EGESNRL    COMP  PIC  S9(4).                                     
           02  EGESNRF    PICTURE X.                                            
           02  FILLER REDEFINES EGESNRF.                                        
             03 EGESNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EGESNRI  PIC X(2).                                               
           02  TPRTAL    COMP  PIC  S9(4).                                      
           02  TPRTAF    PICTURE X.                                             
           02  FILLER REDEFINES TPRTAF.                                         
             03 TPRTAA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TPRTAI  PIC X(28).                                               
           02  EPRTAL    COMP  PIC  S9(4).                                      
           02  EPRTAF    PICTURE X.                                             
           02  FILLER REDEFINES EPRTAF.                                         
             03 EPRTAA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EPRTAI  PIC X(15).                                               
           02  TEZWL    COMP  PIC  S9(4).                                       
           02  TEZWF    PICTURE X.                                              
           02  FILLER REDEFINES TEZWF.                                          
             03 TEZWA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TEZWI  PIC X(28).                                                
           02  EEZWL    COMP  PIC  S9(4).                                       
           02  EEZWF    PICTURE X.                                              
           02  FILLER REDEFINES EEZWF.                                          
             03 EEZWA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EEZWI  PIC X(1).                                                 
           02  TP34CL    COMP  PIC  S9(4).                                      
           02  TP34CF    PICTURE X.                                             
           02  FILLER REDEFINES TP34CF.                                         
             03 TP34CA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TP34CI  PIC X(28).                                               
           02  EP34CL    COMP  PIC  S9(4).                                      
           02  EP34CF    PICTURE X.                                             
           02  FILLER REDEFINES EP34CF.                                         
             03 EP34CA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EP34CI  PIC X(7).                                                
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0032O REDEFINES BAN0032I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(28).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRH    PICTURE X.                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVBPRZH    PICTURE X.                                            
           02  EVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TGESH    PICTURE X.                                              
           02  TGESO  PIC X(28).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESNRH    PICTURE X.                                            
           02  EGESNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPRTAH    PICTURE X.                                             
           02  TPRTAO  PIC X(28).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPRTAH    PICTURE X.                                             
           02  EPRTAO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEZWH    PICTURE X.                                              
           02  TEZWO  PIC X(28).                                                
           02  FILLER PICTURE X(3).                                             
           02  EEZWH    PICTURE X.                                              
           02  EEZWO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TP34CH    PICTURE X.                                             
           02  TP34CO  PIC X(28).                                               
           02  FILLER PICTURE X(3).                                             
           02  EP34CH    PICTURE X.                                             
           02  EP34CO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
