       01  BAT0006I.                                                            
           02  FILLER PIC X(12).                                                
           02  EOFFKZL    COMP  PIC  S9(4).                                     
           02  EOFFKZF    PICTURE X.                                            
           02  FILLER REDEFINES EOFFKZF.                                        
             03 EOFFKZA    PICTURE X.                                           
           02  EOFFKZI  PIC X(1).                                               
           02  AOFFKZL    COMP  PIC  S9(4).                                     
           02  AOFFKZF    PICTURE X.                                            
           02  FILLER REDEFINES AOFFKZF.                                        
             03 AOFFKZA    PICTURE X.                                           
           02  AOFFKZI  PIC X(6).                                               
           02  EBERL    COMP  PIC  S9(4).                                       
           02  EBERF    PICTURE X.                                              
           02  FILLER REDEFINES EBERF.                                          
             03 EBERA    PICTURE X.                                             
           02  EBERI  PIC X(2).                                                 
           02  EOFFPGML    COMP  PIC  S9(4).                                    
           02  EOFFPGMF    PICTURE X.                                           
           02  FILLER REDEFINES EOFFPGMF.                                       
             03 EOFFPGMA    PICTURE X.                                          
           02  EOFFPGMI  PIC X(8).                                              
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1PGML    COMP  PIC  S9(4).                                      
           02  E1PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E1PGMF.                                         
             03 E1PGMA    PICTURE X.                                            
           02  E1PGMI  PIC X(8).                                                
           02  E1EZSTL    COMP  PIC  S9(4).                                     
           02  E1EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E1EZSTF.                                        
             03 E1EZSTA    PICTURE X.                                           
           02  E1EZSTI  PIC X(2).                                               
           02  E1NRL    COMP  PIC  S9(4).                                       
           02  E1NRF    PICTURE X.                                              
           02  FILLER REDEFINES E1NRF.                                          
             03 E1NRA    PICTURE X.                                             
           02  E1NRI  PIC X(4).                                                 
           02  E1TEXTL    COMP  PIC  S9(4).                                     
           02  E1TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E1TEXTF.                                        
             03 E1TEXTA    PICTURE X.                                           
           02  E1TEXTI  PIC X(52).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2PGML    COMP  PIC  S9(4).                                      
           02  E2PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E2PGMF.                                         
             03 E2PGMA    PICTURE X.                                            
           02  E2PGMI  PIC X(8).                                                
           02  E2EZSTL    COMP  PIC  S9(4).                                     
           02  E2EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E2EZSTF.                                        
             03 E2EZSTA    PICTURE X.                                           
           02  E2EZSTI  PIC X(2).                                               
           02  E2NRL    COMP  PIC  S9(4).                                       
           02  E2NRF    PICTURE X.                                              
           02  FILLER REDEFINES E2NRF.                                          
             03 E2NRA    PICTURE X.                                             
           02  E2NRI  PIC X(4).                                                 
           02  E2TEXTL    COMP  PIC  S9(4).                                     
           02  E2TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E2TEXTF.                                        
             03 E2TEXTA    PICTURE X.                                           
           02  E2TEXTI  PIC X(52).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3PGML    COMP  PIC  S9(4).                                      
           02  E3PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E3PGMF.                                         
             03 E3PGMA    PICTURE X.                                            
           02  E3PGMI  PIC X(8).                                                
           02  E3EZSTL    COMP  PIC  S9(4).                                     
           02  E3EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E3EZSTF.                                        
             03 E3EZSTA    PICTURE X.                                           
           02  E3EZSTI  PIC X(2).                                               
           02  E3NRL    COMP  PIC  S9(4).                                       
           02  E3NRF    PICTURE X.                                              
           02  FILLER REDEFINES E3NRF.                                          
             03 E3NRA    PICTURE X.                                             
           02  E3NRI  PIC X(4).                                                 
           02  E3TEXTL    COMP  PIC  S9(4).                                     
           02  E3TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E3TEXTF.                                        
             03 E3TEXTA    PICTURE X.                                           
           02  E3TEXTI  PIC X(52).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4PGML    COMP  PIC  S9(4).                                      
           02  E4PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E4PGMF.                                         
             03 E4PGMA    PICTURE X.                                            
           02  E4PGMI  PIC X(8).                                                
           02  E4EZSTL    COMP  PIC  S9(4).                                     
           02  E4EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E4EZSTF.                                        
             03 E4EZSTA    PICTURE X.                                           
           02  E4EZSTI  PIC X(2).                                               
           02  E4NRL    COMP  PIC  S9(4).                                       
           02  E4NRF    PICTURE X.                                              
           02  FILLER REDEFINES E4NRF.                                          
             03 E4NRA    PICTURE X.                                             
           02  E4NRI  PIC X(4).                                                 
           02  E4TEXTL    COMP  PIC  S9(4).                                     
           02  E4TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E4TEXTF.                                        
             03 E4TEXTA    PICTURE X.                                           
           02  E4TEXTI  PIC X(52).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5PGML    COMP  PIC  S9(4).                                      
           02  E5PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E5PGMF.                                         
             03 E5PGMA    PICTURE X.                                            
           02  E5PGMI  PIC X(8).                                                
           02  E5EZSTL    COMP  PIC  S9(4).                                     
           02  E5EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E5EZSTF.                                        
             03 E5EZSTA    PICTURE X.                                           
           02  E5EZSTI  PIC X(2).                                               
           02  E5NRL    COMP  PIC  S9(4).                                       
           02  E5NRF    PICTURE X.                                              
           02  FILLER REDEFINES E5NRF.                                          
             03 E5NRA    PICTURE X.                                             
           02  E5NRI  PIC X(4).                                                 
           02  E5TEXTL    COMP  PIC  S9(4).                                     
           02  E5TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E5TEXTF.                                        
             03 E5TEXTA    PICTURE X.                                           
           02  E5TEXTI  PIC X(52).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6PGML    COMP  PIC  S9(4).                                      
           02  E6PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E6PGMF.                                         
             03 E6PGMA    PICTURE X.                                            
           02  E6PGMI  PIC X(8).                                                
           02  E6EZSTL    COMP  PIC  S9(4).                                     
           02  E6EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E6EZSTF.                                        
             03 E6EZSTA    PICTURE X.                                           
           02  E6EZSTI  PIC X(2).                                               
           02  E6NRL    COMP  PIC  S9(4).                                       
           02  E6NRF    PICTURE X.                                              
           02  FILLER REDEFINES E6NRF.                                          
             03 E6NRA    PICTURE X.                                             
           02  E6NRI  PIC X(4).                                                 
           02  E6TEXTL    COMP  PIC  S9(4).                                     
           02  E6TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E6TEXTF.                                        
             03 E6TEXTA    PICTURE X.                                           
           02  E6TEXTI  PIC X(52).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7PGML    COMP  PIC  S9(4).                                      
           02  E7PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E7PGMF.                                         
             03 E7PGMA    PICTURE X.                                            
           02  E7PGMI  PIC X(8).                                                
           02  E7EZSTL    COMP  PIC  S9(4).                                     
           02  E7EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E7EZSTF.                                        
             03 E7EZSTA    PICTURE X.                                           
           02  E7EZSTI  PIC X(2).                                               
           02  E7NRL    COMP  PIC  S9(4).                                       
           02  E7NRF    PICTURE X.                                              
           02  FILLER REDEFINES E7NRF.                                          
             03 E7NRA    PICTURE X.                                             
           02  E7NRI  PIC X(4).                                                 
           02  E7TEXTL    COMP  PIC  S9(4).                                     
           02  E7TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E7TEXTF.                                        
             03 E7TEXTA    PICTURE X.                                           
           02  E7TEXTI  PIC X(52).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8PGML    COMP  PIC  S9(4).                                      
           02  E8PGMF    PICTURE X.                                             
           02  FILLER REDEFINES E8PGMF.                                         
             03 E8PGMA    PICTURE X.                                            
           02  E8PGMI  PIC X(8).                                                
           02  E8EZSTL    COMP  PIC  S9(4).                                     
           02  E8EZSTF    PICTURE X.                                            
           02  FILLER REDEFINES E8EZSTF.                                        
             03 E8EZSTA    PICTURE X.                                           
           02  E8EZSTI  PIC X(2).                                               
           02  E8NRL    COMP  PIC  S9(4).                                       
           02  E8NRF    PICTURE X.                                              
           02  FILLER REDEFINES E8NRF.                                          
             03 E8NRA    PICTURE X.                                             
           02  E8NRI  PIC X(4).                                                 
           02  E8TEXTL    COMP  PIC  S9(4).                                     
           02  E8TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E8TEXTF.                                        
             03 E8TEXTA    PICTURE X.                                           
           02  E8TEXTI  PIC X(52).                                              
       01  BAT0006O REDEFINES BAT0006I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EOFFKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AOFFKZO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBERO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EOFFPGMO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E1TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E2TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E3TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E4TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E5TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E6TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E7TEXTO  PIC X(52).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8PGMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8EZSTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8NRO PIC ZZZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  E8TEXTO  PIC X(52).                                              
