       01  BAT0003I.                                                            
           02  FILLER PIC X(12).                                                
           02  ABEZL    COMP  PIC  S9(4).                                       
           02  ABEZF    PICTURE X.                                              
           02  FILLER REDEFINES ABEZF.                                          
             03 ABEZA    PICTURE X.                                             
           02  ABEZI  PIC X(50).                                                
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1KNRL    COMP  PIC  S9(4).                                      
           02  E1KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E1KNRF.                                         
             03 E1KNRA    PICTURE X.                                            
           02  E1KNRI  PIC X(4).                                                
           02  E1BEZL    COMP  PIC  S9(4).                                      
           02  E1BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E1BEZF.                                         
             03 E1BEZA    PICTURE X.                                            
           02  E1BEZI  PIC X(72).                                               
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2KNRL    COMP  PIC  S9(4).                                      
           02  E2KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E2KNRF.                                         
             03 E2KNRA    PICTURE X.                                            
           02  E2KNRI  PIC X(4).                                                
           02  E2BEZL    COMP  PIC  S9(4).                                      
           02  E2BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E2BEZF.                                         
             03 E2BEZA    PICTURE X.                                            
           02  E2BEZI  PIC X(72).                                               
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3KNRL    COMP  PIC  S9(4).                                      
           02  E3KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E3KNRF.                                         
             03 E3KNRA    PICTURE X.                                            
           02  E3KNRI  PIC X(4).                                                
           02  E3BEZL    COMP  PIC  S9(4).                                      
           02  E3BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E3BEZF.                                         
             03 E3BEZA    PICTURE X.                                            
           02  E3BEZI  PIC X(72).                                               
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4KNRL    COMP  PIC  S9(4).                                      
           02  E4KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E4KNRF.                                         
             03 E4KNRA    PICTURE X.                                            
           02  E4KNRI  PIC X(4).                                                
           02  E4BEZL    COMP  PIC  S9(4).                                      
           02  E4BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E4BEZF.                                         
             03 E4BEZA    PICTURE X.                                            
           02  E4BEZI  PIC X(72).                                               
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5KNRL    COMP  PIC  S9(4).                                      
           02  E5KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E5KNRF.                                         
             03 E5KNRA    PICTURE X.                                            
           02  E5KNRI  PIC X(4).                                                
           02  E5BEZL    COMP  PIC  S9(4).                                      
           02  E5BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E5BEZF.                                         
             03 E5BEZA    PICTURE X.                                            
           02  E5BEZI  PIC X(72).                                               
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6KNRL    COMP  PIC  S9(4).                                      
           02  E6KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E6KNRF.                                         
             03 E6KNRA    PICTURE X.                                            
           02  E6KNRI  PIC X(4).                                                
           02  E6BEZL    COMP  PIC  S9(4).                                      
           02  E6BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E6BEZF.                                         
             03 E6BEZA    PICTURE X.                                            
           02  E6BEZI  PIC X(72).                                               
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7KNRL    COMP  PIC  S9(4).                                      
           02  E7KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E7KNRF.                                         
             03 E7KNRA    PICTURE X.                                            
           02  E7KNRI  PIC X(4).                                                
           02  E7BEZL    COMP  PIC  S9(4).                                      
           02  E7BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E7BEZF.                                         
             03 E7BEZA    PICTURE X.                                            
           02  E7BEZI  PIC X(72).                                               
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8KNRL    COMP  PIC  S9(4).                                      
           02  E8KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E8KNRF.                                         
             03 E8KNRA    PICTURE X.                                            
           02  E8KNRI  PIC X(4).                                                
           02  E8BEZL    COMP  PIC  S9(4).                                      
           02  E8BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E8BEZF.                                         
             03 E8BEZA    PICTURE X.                                            
           02  E8BEZI  PIC X(72).                                               
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9KNRL    COMP  PIC  S9(4).                                      
           02  E9KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E9KNRF.                                         
             03 E9KNRA    PICTURE X.                                            
           02  E9KNRI  PIC X(4).                                                
           02  E9BEZL    COMP  PIC  S9(4).                                      
           02  E9BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E9BEZF.                                         
             03 E9BEZA    PICTURE X.                                            
           02  E9BEZI  PIC X(72).                                               
           02  E10FCL    COMP  PIC  S9(4).                                      
           02  E10FCF    PICTURE X.                                             
           02  FILLER REDEFINES E10FCF.                                         
             03 E10FCA    PICTURE X.                                            
           02  E10FCI  PIC X(1).                                                
           02  E10KNRL    COMP  PIC  S9(4).                                     
           02  E10KNRF    PICTURE X.                                            
           02  FILLER REDEFINES E10KNRF.                                        
             03 E10KNRA    PICTURE X.                                           
           02  E10KNRI  PIC X(4).                                               
           02  E10BEZL    COMP  PIC  S9(4).                                     
           02  E10BEZF    PICTURE X.                                            
           02  FILLER REDEFINES E10BEZF.                                        
             03 E10BEZA    PICTURE X.                                           
           02  E10BEZI  PIC X(72).                                              
       01  BAT0003O REDEFINES BAT0003I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ABEZO  PIC X(50).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9BEZO  PIC X(72).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10KNRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10BEZO  PIC X(72).                                              
