       01  BAT0021I.                                                            
           02  FILLER PIC X(12).                                                
           02  EOFFST1L    COMP  PIC  S9(4).                                    
           02  EOFFST1F    PICTURE X.                                           
           02  FILLER REDEFINES EOFFST1F.                                       
             03 EOFFST1A    PICTURE X.                                          
           02  EOFFST1I  PIC X(3).                                              
           02  EOFFST2L    COMP  PIC  S9(4).                                    
           02  EOFFST2F    PICTURE X.                                           
           02  FILLER REDEFINES EOFFST2F.                                       
             03 EOFFST2A    PICTURE X.                                          
           02  EOFFST2I  PIC X(3).                                              
           02  TDATL    COMP  PIC  S9(4).                                       
           02  TDATF    PICTURE X.                                              
           02  FILLER REDEFINES TDATF.                                          
             03 TDATA    PICTURE X.                                             
           02  TDATI  PIC X(3).                                                 
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1GESL    COMP  PIC  S9(4).                                      
           02  E1GESF    PICTURE X.                                             
           02  FILLER REDEFINES E1GESF.                                         
             03 E1GESA    PICTURE X.                                            
           02  E1GESI  PIC X(3).                                                
           02  E1SCHLL    COMP  PIC  S9(4).                                     
           02  E1SCHLF    PICTURE X.                                            
           02  FILLER REDEFINES E1SCHLF.                                        
             03 E1SCHLA    PICTURE X.                                           
           02  E1SCHLI  PIC X(3).                                               
           02  E1PRKBZL    COMP  PIC  S9(4).                                    
           02  E1PRKBZF    PICTURE X.                                           
           02  FILLER REDEFINES E1PRKBZF.                                       
             03 E1PRKBZA    PICTURE X.                                          
           02  E1PRKBZI  PIC X(10).                                             
           02  E1PRLBZL    COMP  PIC  S9(4).                                    
           02  E1PRLBZF    PICTURE X.                                           
           02  FILLER REDEFINES E1PRLBZF.                                       
             03 E1PRLBZA    PICTURE X.                                          
           02  E1PRLBZI  PIC X(40).                                             
           02  E1PSNRL    COMP  PIC  S9(4).                                     
           02  E1PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E1PSNRF.                                        
             03 E1PSNRA    PICTURE X.                                           
           02  E1PSNRI  PIC X(3).                                               
           02  A1PSBEZL    COMP  PIC  S9(4).                                    
           02  A1PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A1PSBEZF.                                       
             03 A1PSBEZA    PICTURE X.                                          
           02  A1PSBEZI  PIC X(22).                                             
           02  E1PTNRL    COMP  PIC  S9(4).                                     
           02  E1PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E1PTNRF.                                        
             03 E1PTNRA    PICTURE X.                                           
           02  E1PTNRI  PIC X(2).                                               
           02  A1PTBEZL    COMP  PIC  S9(4).                                    
           02  A1PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A1PTBEZF.                                       
             03 A1PTBEZA    PICTURE X.                                          
           02  A1PTBEZI  PIC X(10).                                             
           02  A1VDATL    COMP  PIC  S9(4).                                     
           02  A1VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A1VDATF.                                        
             03 A1VDATA    PICTURE X.                                           
           02  A1VDATI  PIC X(10).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2GESL    COMP  PIC  S9(4).                                      
           02  E2GESF    PICTURE X.                                             
           02  FILLER REDEFINES E2GESF.                                         
             03 E2GESA    PICTURE X.                                            
           02  E2GESI  PIC X(3).                                                
           02  E2SCHLL    COMP  PIC  S9(4).                                     
           02  E2SCHLF    PICTURE X.                                            
           02  FILLER REDEFINES E2SCHLF.                                        
             03 E2SCHLA    PICTURE X.                                           
           02  E2SCHLI  PIC X(3).                                               
           02  E2PRKBZL    COMP  PIC  S9(4).                                    
           02  E2PRKBZF    PICTURE X.                                           
           02  FILLER REDEFINES E2PRKBZF.                                       
             03 E2PRKBZA    PICTURE X.                                          
           02  E2PRKBZI  PIC X(10).                                             
           02  E2PRLBZL    COMP  PIC  S9(4).                                    
           02  E2PRLBZF    PICTURE X.                                           
           02  FILLER REDEFINES E2PRLBZF.                                       
             03 E2PRLBZA    PICTURE X.                                          
           02  E2PRLBZI  PIC X(40).                                             
           02  E2PSNRL    COMP  PIC  S9(4).                                     
           02  E2PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E2PSNRF.                                        
             03 E2PSNRA    PICTURE X.                                           
           02  E2PSNRI  PIC X(3).                                               
           02  A2PSBEZL    COMP  PIC  S9(4).                                    
           02  A2PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A2PSBEZF.                                       
             03 A2PSBEZA    PICTURE X.                                          
           02  A2PSBEZI  PIC X(22).                                             
           02  E2PTNRL    COMP  PIC  S9(4).                                     
           02  E2PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E2PTNRF.                                        
             03 E2PTNRA    PICTURE X.                                           
           02  E2PTNRI  PIC X(2).                                               
           02  A2PTBEZL    COMP  PIC  S9(4).                                    
           02  A2PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A2PTBEZF.                                       
             03 A2PTBEZA    PICTURE X.                                          
           02  A2PTBEZI  PIC X(10).                                             
           02  A2VDATL    COMP  PIC  S9(4).                                     
           02  A2VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A2VDATF.                                        
             03 A2VDATA    PICTURE X.                                           
           02  A2VDATI  PIC X(10).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3GESL    COMP  PIC  S9(4).                                      
           02  E3GESF    PICTURE X.                                             
           02  FILLER REDEFINES E3GESF.                                         
             03 E3GESA    PICTURE X.                                            
           02  E3GESI  PIC X(3).                                                
           02  E3SCHLL    COMP  PIC  S9(4).                                     
           02  E3SCHLF    PICTURE X.                                            
           02  FILLER REDEFINES E3SCHLF.                                        
             03 E3SCHLA    PICTURE X.                                           
           02  E3SCHLI  PIC X(3).                                               
           02  E3PRKBZL    COMP  PIC  S9(4).                                    
           02  E3PRKBZF    PICTURE X.                                           
           02  FILLER REDEFINES E3PRKBZF.                                       
             03 E3PRKBZA    PICTURE X.                                          
           02  E3PRKBZI  PIC X(10).                                             
           02  E3PRLBZL    COMP  PIC  S9(4).                                    
           02  E3PRLBZF    PICTURE X.                                           
           02  FILLER REDEFINES E3PRLBZF.                                       
             03 E3PRLBZA    PICTURE X.                                          
           02  E3PRLBZI  PIC X(40).                                             
           02  E3PSNRL    COMP  PIC  S9(4).                                     
           02  E3PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E3PSNRF.                                        
             03 E3PSNRA    PICTURE X.                                           
           02  E3PSNRI  PIC X(3).                                               
           02  A3PSBEZL    COMP  PIC  S9(4).                                    
           02  A3PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A3PSBEZF.                                       
             03 A3PSBEZA    PICTURE X.                                          
           02  A3PSBEZI  PIC X(22).                                             
           02  E3PTNRL    COMP  PIC  S9(4).                                     
           02  E3PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E3PTNRF.                                        
             03 E3PTNRA    PICTURE X.                                           
           02  E3PTNRI  PIC X(2).                                               
           02  A3PTBEZL    COMP  PIC  S9(4).                                    
           02  A3PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A3PTBEZF.                                       
             03 A3PTBEZA    PICTURE X.                                          
           02  A3PTBEZI  PIC X(10).                                             
           02  A3VDATL    COMP  PIC  S9(4).                                     
           02  A3VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A3VDATF.                                        
             03 A3VDATA    PICTURE X.                                           
           02  A3VDATI  PIC X(10).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4GESL    COMP  PIC  S9(4).                                      
           02  E4GESF    PICTURE X.                                             
           02  FILLER REDEFINES E4GESF.                                         
             03 E4GESA    PICTURE X.                                            
           02  E4GESI  PIC X(3).                                                
           02  E4SCHLL    COMP  PIC  S9(4).                                     
           02  E4SCHLF    PICTURE X.                                            
           02  FILLER REDEFINES E4SCHLF.                                        
             03 E4SCHLA    PICTURE X.                                           
           02  E4SCHLI  PIC X(3).                                               
           02  E4PRKBZL    COMP  PIC  S9(4).                                    
           02  E4PRKBZF    PICTURE X.                                           
           02  FILLER REDEFINES E4PRKBZF.                                       
             03 E4PRKBZA    PICTURE X.                                          
           02  E4PRKBZI  PIC X(10).                                             
           02  E4PRLBZL    COMP  PIC  S9(4).                                    
           02  E4PRLBZF    PICTURE X.                                           
           02  FILLER REDEFINES E4PRLBZF.                                       
             03 E4PRLBZA    PICTURE X.                                          
           02  E4PRLBZI  PIC X(40).                                             
           02  E4PSNRL    COMP  PIC  S9(4).                                     
           02  E4PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E4PSNRF.                                        
             03 E4PSNRA    PICTURE X.                                           
           02  E4PSNRI  PIC X(3).                                               
           02  A4PSBEZL    COMP  PIC  S9(4).                                    
           02  A4PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A4PSBEZF.                                       
             03 A4PSBEZA    PICTURE X.                                          
           02  A4PSBEZI  PIC X(22).                                             
           02  E4PTNRL    COMP  PIC  S9(4).                                     
           02  E4PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E4PTNRF.                                        
             03 E4PTNRA    PICTURE X.                                           
           02  E4PTNRI  PIC X(2).                                               
           02  A4PTBEZL    COMP  PIC  S9(4).                                    
           02  A4PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A4PTBEZF.                                       
             03 A4PTBEZA    PICTURE X.                                          
           02  A4PTBEZI  PIC X(10).                                             
           02  A4VDATL    COMP  PIC  S9(4).                                     
           02  A4VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A4VDATF.                                        
             03 A4VDATA    PICTURE X.                                           
           02  A4VDATI  PIC X(10).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5GESL    COMP  PIC  S9(4).                                      
           02  E5GESF    PICTURE X.                                             
           02  FILLER REDEFINES E5GESF.                                         
             03 E5GESA    PICTURE X.                                            
           02  E5GESI  PIC X(3).                                                
           02  E5SCHLL    COMP  PIC  S9(4).                                     
           02  E5SCHLF    PICTURE X.                                            
           02  FILLER REDEFINES E5SCHLF.                                        
             03 E5SCHLA    PICTURE X.                                           
           02  E5SCHLI  PIC X(3).                                               
           02  E5PRKBZL    COMP  PIC  S9(4).                                    
           02  E5PRKBZF    PICTURE X.                                           
           02  FILLER REDEFINES E5PRKBZF.                                       
             03 E5PRKBZA    PICTURE X.                                          
           02  E5PRKBZI  PIC X(10).                                             
           02  E5PRLBZL    COMP  PIC  S9(4).                                    
           02  E5PRLBZF    PICTURE X.                                           
           02  FILLER REDEFINES E5PRLBZF.                                       
             03 E5PRLBZA    PICTURE X.                                          
           02  E5PRLBZI  PIC X(40).                                             
           02  E5PSNRL    COMP  PIC  S9(4).                                     
           02  E5PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E5PSNRF.                                        
             03 E5PSNRA    PICTURE X.                                           
           02  E5PSNRI  PIC X(3).                                               
           02  A5PSBEZL    COMP  PIC  S9(4).                                    
           02  A5PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A5PSBEZF.                                       
             03 A5PSBEZA    PICTURE X.                                          
           02  A5PSBEZI  PIC X(22).                                             
           02  E5PTNRL    COMP  PIC  S9(4).                                     
           02  E5PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E5PTNRF.                                        
             03 E5PTNRA    PICTURE X.                                           
           02  E5PTNRI  PIC X(2).                                               
           02  A5PTBEZL    COMP  PIC  S9(4).                                    
           02  A5PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A5PTBEZF.                                       
             03 A5PTBEZA    PICTURE X.                                          
           02  A5PTBEZI  PIC X(10).                                             
           02  A5VDATL    COMP  PIC  S9(4).                                     
           02  A5VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A5VDATF.                                        
             03 A5VDATA    PICTURE X.                                           
           02  A5VDATI  PIC X(10).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6GESL    COMP  PIC  S9(4).                                      
           02  E6GESF    PICTURE X.                                             
           02  FILLER REDEFINES E6GESF.                                         
             03 E6GESA    PICTURE X.                                            
           02  E6GESI  PIC X(3).                                                
           02  E6SCHLL    COMP  PIC  S9(4).                                     
           02  E6SCHLF    PICTURE X.                                            
           02  FILLER REDEFINES E6SCHLF.                                        
             03 E6SCHLA    PICTURE X.                                           
           02  E6SCHLI  PIC X(3).                                               
           02  E6PRKBZL    COMP  PIC  S9(4).                                    
           02  E6PRKBZF    PICTURE X.                                           
           02  FILLER REDEFINES E6PRKBZF.                                       
             03 E6PRKBZA    PICTURE X.                                          
           02  E6PRKBZI  PIC X(10).                                             
           02  E6PRLBZL    COMP  PIC  S9(4).                                    
           02  E6PRLBZF    PICTURE X.                                           
           02  FILLER REDEFINES E6PRLBZF.                                       
             03 E6PRLBZA    PICTURE X.                                          
           02  E6PRLBZI  PIC X(40).                                             
           02  E6PSNRL    COMP  PIC  S9(4).                                     
           02  E6PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E6PSNRF.                                        
             03 E6PSNRA    PICTURE X.                                           
           02  E6PSNRI  PIC X(3).                                               
           02  A6PSBEZL    COMP  PIC  S9(4).                                    
           02  A6PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A6PSBEZF.                                       
             03 A6PSBEZA    PICTURE X.                                          
           02  A6PSBEZI  PIC X(22).                                             
           02  E6PTNRL    COMP  PIC  S9(4).                                     
           02  E6PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E6PTNRF.                                        
             03 E6PTNRA    PICTURE X.                                           
           02  E6PTNRI  PIC X(2).                                               
           02  A6PTBEZL    COMP  PIC  S9(4).                                    
           02  A6PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A6PTBEZF.                                       
             03 A6PTBEZA    PICTURE X.                                          
           02  A6PTBEZI  PIC X(10).                                             
           02  A6VDATL    COMP  PIC  S9(4).                                     
           02  A6VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A6VDATF.                                        
             03 A6VDATA    PICTURE X.                                           
           02  A6VDATI  PIC X(10).                                              
       01  BAT0021O REDEFINES BAT0021I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EOFFST1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EOFFST2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TDATO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1GESO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1SCHLO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1PRKBZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1PRLBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A1PSBEZO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A1PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A1VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2GESO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2SCHLO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2PRKBZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E2PRLBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  E2PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2PSBEZO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  E2PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A2VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3GESO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3SCHLO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3PRKBZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E3PRLBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  E3PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A3PSBEZO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  E3PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A3PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A3VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4GESO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4SCHLO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4PRKBZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E4PRLBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  E4PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A4PSBEZO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  E4PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A4PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A4VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5GESO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5SCHLO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5PRKBZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E5PRLBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  E5PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A5PSBEZO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  E5PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A5PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A5VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6GESO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6SCHLO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6PRKBZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E6PRLBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  E6PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A6PSBEZO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  E6PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A6PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A6VDATO  PIC X(10).                                              
