       01  BAT0008I.                                                            
           02  FILLER PIC X(12).                                                
           02  ATRANS1L    COMP  PIC  S9(4).                                    
           02  ATRANS1F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS1F.                                       
             03 ATRANS1A    PICTURE X.                                          
           02  ATRANS1I  PIC X(4).                                              
           02  ATEXT1L    COMP  PIC  S9(4).                                     
           02  ATEXT1F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT1F.                                        
             03 ATEXT1A    PICTURE X.                                           
           02  ATEXT1I  PIC X(45).                                              
           02  ASTATU1L    COMP  PIC  S9(4).                                    
           02  ASTATU1F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU1F.                                       
             03 ASTATU1A    PICTURE X.                                          
           02  ASTATU1I  PIC X(8).                                              
           02  ATRANS2L    COMP  PIC  S9(4).                                    
           02  ATRANS2F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS2F.                                       
             03 ATRANS2A    PICTURE X.                                          
           02  ATRANS2I  PIC X(4).                                              
           02  ATEXT2L    COMP  PIC  S9(4).                                     
           02  ATEXT2F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT2F.                                        
             03 ATEXT2A    PICTURE X.                                           
           02  ATEXT2I  PIC X(45).                                              
           02  ASTATU2L    COMP  PIC  S9(4).                                    
           02  ASTATU2F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU2F.                                       
             03 ASTATU2A    PICTURE X.                                          
           02  ASTATU2I  PIC X(8).                                              
           02  ATRANS3L    COMP  PIC  S9(4).                                    
           02  ATRANS3F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS3F.                                       
             03 ATRANS3A    PICTURE X.                                          
           02  ATRANS3I  PIC X(4).                                              
           02  ATEXT3L    COMP  PIC  S9(4).                                     
           02  ATEXT3F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT3F.                                        
             03 ATEXT3A    PICTURE X.                                           
           02  ATEXT3I  PIC X(45).                                              
           02  ASTATU3L    COMP  PIC  S9(4).                                    
           02  ASTATU3F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU3F.                                       
             03 ASTATU3A    PICTURE X.                                          
           02  ASTATU3I  PIC X(8).                                              
           02  ATRANS4L    COMP  PIC  S9(4).                                    
           02  ATRANS4F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS4F.                                       
             03 ATRANS4A    PICTURE X.                                          
           02  ATRANS4I  PIC X(4).                                              
           02  ATEXT4L    COMP  PIC  S9(4).                                     
           02  ATEXT4F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT4F.                                        
             03 ATEXT4A    PICTURE X.                                           
           02  ATEXT4I  PIC X(45).                                              
           02  ASTATU4L    COMP  PIC  S9(4).                                    
           02  ASTATU4F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU4F.                                       
             03 ASTATU4A    PICTURE X.                                          
           02  ASTATU4I  PIC X(8).                                              
           02  ATRANS5L    COMP  PIC  S9(4).                                    
           02  ATRANS5F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS5F.                                       
             03 ATRANS5A    PICTURE X.                                          
           02  ATRANS5I  PIC X(4).                                              
           02  ATEXT5L    COMP  PIC  S9(4).                                     
           02  ATEXT5F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT5F.                                        
             03 ATEXT5A    PICTURE X.                                           
           02  ATEXT5I  PIC X(45).                                              
           02  ASTATU5L    COMP  PIC  S9(4).                                    
           02  ASTATU5F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU5F.                                       
             03 ASTATU5A    PICTURE X.                                          
           02  ASTATU5I  PIC X(8).                                              
           02  ATRANS6L    COMP  PIC  S9(4).                                    
           02  ATRANS6F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS6F.                                       
             03 ATRANS6A    PICTURE X.                                          
           02  ATRANS6I  PIC X(4).                                              
           02  ATEXT6L    COMP  PIC  S9(4).                                     
           02  ATEXT6F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT6F.                                        
             03 ATEXT6A    PICTURE X.                                           
           02  ATEXT6I  PIC X(45).                                              
           02  ASTATU6L    COMP  PIC  S9(4).                                    
           02  ASTATU6F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU6F.                                       
             03 ASTATU6A    PICTURE X.                                          
           02  ASTATU6I  PIC X(8).                                              
           02  ATRANS7L    COMP  PIC  S9(4).                                    
           02  ATRANS7F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS7F.                                       
             03 ATRANS7A    PICTURE X.                                          
           02  ATRANS7I  PIC X(4).                                              
           02  ATEXT7L    COMP  PIC  S9(4).                                     
           02  ATEXT7F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT7F.                                        
             03 ATEXT7A    PICTURE X.                                           
           02  ATEXT7I  PIC X(45).                                              
           02  ASTATU7L    COMP  PIC  S9(4).                                    
           02  ASTATU7F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU7F.                                       
             03 ASTATU7A    PICTURE X.                                          
           02  ASTATU7I  PIC X(8).                                              
           02  ATRANS8L    COMP  PIC  S9(4).                                    
           02  ATRANS8F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS8F.                                       
             03 ATRANS8A    PICTURE X.                                          
           02  ATRANS8I  PIC X(4).                                              
           02  ATEXT8L    COMP  PIC  S9(4).                                     
           02  ATEXT8F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT8F.                                        
             03 ATEXT8A    PICTURE X.                                           
           02  ATEXT8I  PIC X(45).                                              
           02  ASTATU8L    COMP  PIC  S9(4).                                    
           02  ASTATU8F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU8F.                                       
             03 ASTATU8A    PICTURE X.                                          
           02  ASTATU8I  PIC X(8).                                              
           02  ATRANS9L    COMP  PIC  S9(4).                                    
           02  ATRANS9F    PICTURE X.                                           
           02  FILLER REDEFINES ATRANS9F.                                       
             03 ATRANS9A    PICTURE X.                                          
           02  ATRANS9I  PIC X(4).                                              
           02  ATEXT9L    COMP  PIC  S9(4).                                     
           02  ATEXT9F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT9F.                                        
             03 ATEXT9A    PICTURE X.                                           
           02  ATEXT9I  PIC X(45).                                              
           02  ASTATU9L    COMP  PIC  S9(4).                                    
           02  ASTATU9F    PICTURE X.                                           
           02  FILLER REDEFINES ASTATU9F.                                       
             03 ASTATU9A    PICTURE X.                                          
           02  ASTATU9I  PIC X(8).                                              
       01  BAT0008O REDEFINES BAT0008I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ATRANS1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT1O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT2O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT3O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU3O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT4O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU4O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT5O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU5O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT6O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU6O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT7O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU7O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT8O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU8O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATRANS9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT9O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATU9O  PIC X(8).                                              
