       01  BAT0027I.                                                            
           02  FILLER PIC X(12).                                                
           02  EVGRPL    COMP  PIC  S9(4).                                      
           02  EVGRPF    PICTURE X.                                             
           02  FILLER REDEFINES EVGRPF.                                         
             03 EVGRPA    PICTURE X.                                            
           02  EVGRPI  PIC X(3).                                                
           02  ABEZLGL    COMP  PIC  S9(4).                                     
           02  ABEZLGF    PICTURE X.                                            
           02  FILLER REDEFINES ABEZLGF.                                        
             03 ABEZLGA    PICTURE X.                                           
           02  ABEZLGI  PIC X(40).                                              
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1VSTAL    COMP  PIC  S9(4).                                     
           02  E1VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E1VSTAF.                                        
             03 E1VSTAA    PICTURE X.                                           
           02  E1VSTAI  PIC X(4).                                               
           02  A1BEZL    COMP  PIC  S9(4).                                      
           02  A1BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A1BEZF.                                         
             03 A1BEZA    PICTURE X.                                            
           02  A1BEZI  PIC X(50).                                               
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2VSTAL    COMP  PIC  S9(4).                                     
           02  E2VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E2VSTAF.                                        
             03 E2VSTAA    PICTURE X.                                           
           02  E2VSTAI  PIC X(4).                                               
           02  A2BEZL    COMP  PIC  S9(4).                                      
           02  A2BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A2BEZF.                                         
             03 A2BEZA    PICTURE X.                                            
           02  A2BEZI  PIC X(50).                                               
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3VSTAL    COMP  PIC  S9(4).                                     
           02  E3VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E3VSTAF.                                        
             03 E3VSTAA    PICTURE X.                                           
           02  E3VSTAI  PIC X(4).                                               
           02  A3BEZL    COMP  PIC  S9(4).                                      
           02  A3BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A3BEZF.                                         
             03 A3BEZA    PICTURE X.                                            
           02  A3BEZI  PIC X(50).                                               
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4VSTAL    COMP  PIC  S9(4).                                     
           02  E4VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E4VSTAF.                                        
             03 E4VSTAA    PICTURE X.                                           
           02  E4VSTAI  PIC X(4).                                               
           02  A4BEZL    COMP  PIC  S9(4).                                      
           02  A4BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A4BEZF.                                         
             03 A4BEZA    PICTURE X.                                            
           02  A4BEZI  PIC X(50).                                               
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5VSTAL    COMP  PIC  S9(4).                                     
           02  E5VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E5VSTAF.                                        
             03 E5VSTAA    PICTURE X.                                           
           02  E5VSTAI  PIC X(4).                                               
           02  A5BEZL    COMP  PIC  S9(4).                                      
           02  A5BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A5BEZF.                                         
             03 A5BEZA    PICTURE X.                                            
           02  A5BEZI  PIC X(50).                                               
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6VSTAL    COMP  PIC  S9(4).                                     
           02  E6VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E6VSTAF.                                        
             03 E6VSTAA    PICTURE X.                                           
           02  E6VSTAI  PIC X(4).                                               
           02  A6BEZL    COMP  PIC  S9(4).                                      
           02  A6BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A6BEZF.                                         
             03 A6BEZA    PICTURE X.                                            
           02  A6BEZI  PIC X(50).                                               
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7VSTAL    COMP  PIC  S9(4).                                     
           02  E7VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E7VSTAF.                                        
             03 E7VSTAA    PICTURE X.                                           
           02  E7VSTAI  PIC X(4).                                               
           02  A7BEZL    COMP  PIC  S9(4).                                      
           02  A7BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A7BEZF.                                         
             03 A7BEZA    PICTURE X.                                            
           02  A7BEZI  PIC X(50).                                               
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8VSTAL    COMP  PIC  S9(4).                                     
           02  E8VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E8VSTAF.                                        
             03 E8VSTAA    PICTURE X.                                           
           02  E8VSTAI  PIC X(4).                                               
           02  A8BEZL    COMP  PIC  S9(4).                                      
           02  A8BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A8BEZF.                                         
             03 A8BEZA    PICTURE X.                                            
           02  A8BEZI  PIC X(50).                                               
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9VSTAL    COMP  PIC  S9(4).                                     
           02  E9VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E9VSTAF.                                        
             03 E9VSTAA    PICTURE X.                                           
           02  E9VSTAI  PIC X(4).                                               
           02  A9BEZL    COMP  PIC  S9(4).                                      
           02  A9BEZF    PICTURE X.                                             
           02  FILLER REDEFINES A9BEZF.                                         
             03 A9BEZA    PICTURE X.                                            
           02  A9BEZI  PIC X(50).                                               
           02  E10FCL    COMP  PIC  S9(4).                                      
           02  E10FCF    PICTURE X.                                             
           02  FILLER REDEFINES E10FCF.                                         
             03 E10FCA    PICTURE X.                                            
           02  E10FCI  PIC X(1).                                                
           02  E10VSTAL    COMP  PIC  S9(4).                                    
           02  E10VSTAF    PICTURE X.                                           
           02  FILLER REDEFINES E10VSTAF.                                       
             03 E10VSTAA    PICTURE X.                                          
           02  E10VSTAI  PIC X(4).                                              
           02  A10BEZL    COMP  PIC  S9(4).                                     
           02  A10BEZF    PICTURE X.                                            
           02  FILLER REDEFINES A10BEZF.                                        
             03 A10BEZA    PICTURE X.                                           
           02  A10BEZI  PIC X(50).                                              
           02  E11FCL    COMP  PIC  S9(4).                                      
           02  E11FCF    PICTURE X.                                             
           02  FILLER REDEFINES E11FCF.                                         
             03 E11FCA    PICTURE X.                                            
           02  E11FCI  PIC X(1).                                                
           02  E11VSTAL    COMP  PIC  S9(4).                                    
           02  E11VSTAF    PICTURE X.                                           
           02  FILLER REDEFINES E11VSTAF.                                       
             03 E11VSTAA    PICTURE X.                                          
           02  E11VSTAI  PIC X(4).                                              
           02  A11BEZL    COMP  PIC  S9(4).                                     
           02  A11BEZF    PICTURE X.                                            
           02  FILLER REDEFINES A11BEZF.                                        
             03 A11BEZA    PICTURE X.                                           
           02  A11BEZI  PIC X(50).                                              
           02  ATXFCL    COMP  PIC  S9(4).                                      
           02  ATXFCF    PICTURE X.                                             
           02  FILLER REDEFINES ATXFCF.                                         
             03 ATXFCA    PICTURE X.                                            
           02  ATXFCI  PIC X(32).                                               
       01  BAT0027O REDEFINES BAT0027I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVGRPO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  ABEZLGO  PIC X(40).                                              
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A1BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A3BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A4BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A5BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A6BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A7BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A8BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A9BEZO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10VSTAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  A10BEZO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E11FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E11VSTAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  A11BEZO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATXFCO  PIC X(32).                                               
