       01  BAT0015I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  APRODL    COMP  PIC  S9(4).                                      
           02  APRODF    PICTURE X.                                             
           02  FILLER REDEFINES APRODF.                                         
             03 APRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APRODI  PIC X(3).                                                
           02  APRODBZL    COMP  PIC  S9(4).                                    
           02  APRODBZF    PICTURE X.                                           
           02  FILLER REDEFINES APRODBZF.                                       
             03 APRODBZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODBZI  PIC X(40).                                             
           02  APRODKZL    COMP  PIC  S9(4).                                    
           02  APRODKZF    PICTURE X.                                           
           02  FILLER REDEFINES APRODKZF.                                       
             03 APRODKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODKZI  PIC X(10).                                             
           02  APGUELVL    COMP  PIC  S9(4).                                    
           02  APGUELVF    PICTURE X.                                           
           02  FILLER REDEFINES APGUELVF.                                       
             03 APGUELVA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGUELVI  PIC X(10).                                             
           02  APGUELBL    COMP  PIC  S9(4).                                    
           02  APGUELBF    PICTURE X.                                           
           02  FILLER REDEFINES APGUELBF.                                       
             03 APGUELBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGUELBI  PIC X(10).                                             
           02  AGUELABL    COMP  PIC  S9(4).                                    
           02  AGUELABF    PICTURE X.                                           
           02  FILLER REDEFINES AGUELABF.                                       
             03 AGUELABA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGUELABI  PIC X(10).                                             
           02  AGUELBIL    COMP  PIC  S9(4).                                    
           02  AGUELBIF    PICTURE X.                                           
           02  FILLER REDEFINES AGUELBIF.                                       
             03 AGUELBIA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGUELBII  PIC X(10).                                             
           02  AHAFTYPL    COMP  PIC  S9(4).                                    
           02  AHAFTYPF    PICTURE X.                                           
           02  FILLER REDEFINES AHAFTYPF.                                       
             03 AHAFTYPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFTYPI  PIC X(8).                                              
           02  ASELKRIL    COMP  PIC  S9(4).                                    
           02  ASELKRIF    PICTURE X.                                           
           02  FILLER REDEFINES ASELKRIF.                                       
             03 ASELKRIA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASELKRII  PIC X(2).                                              
           02  AHAFWERL    COMP  PIC  S9(4).                                    
           02  AHAFWERF    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWERF.                                       
             03 AHAFWERA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWERI  PIC X(3).                                              
           02  AHAFWE2L    COMP  PIC  S9(4).                                    
           02  AHAFWE2F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE2F.                                       
             03 AHAFWE2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE2I  PIC X(3).                                              
           02  AGEAEAML    COMP  PIC  S9(4).                                    
           02  AGEAEAMF    PICTURE X.                                           
           02  FILLER REDEFINES AGEAEAMF.                                       
             03 AGEAEAMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGEAEAMI  PIC X(10).                                             
           02  AGEAEVOL    COMP  PIC  S9(4).                                    
           02  AGEAEVOF    PICTURE X.                                           
           02  FILLER REDEFINES AGEAEVOF.                                       
             03 AGEAEVOA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGEAEVOI  PIC X(8).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(10).                                             
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(10).                                             
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(8).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(2).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(3).                                              
           02  AHAFWE3L    COMP  PIC  S9(4).                                    
           02  AHAFWE3F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE3F.                                       
             03 AHAFWE3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE3I  PIC X(3).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(10).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(8).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(10).                                             
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(10).                                             
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(8).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(2).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(3).                                              
           02  AHAFWE4L    COMP  PIC  S9(4).                                    
           02  AHAFWE4F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE4F.                                       
             03 AHAFWE4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE4I  PIC X(3).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(10).                                             
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(8).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(10).                                             
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(10).                                             
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(8).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(2).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(3).                                              
           02  AHAFWE5L    COMP  PIC  S9(4).                                    
           02  AHAFWE5F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE5F.                                       
             03 AHAFWE5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE5I  PIC X(3).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(8).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(10).                                             
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(8).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(2).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  AHAFWE6L    COMP  PIC  S9(4).                                    
           02  AHAFWE6F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE6F.                                       
             03 AHAFWE6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE6I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(10).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(8).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(8).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(2).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(3).                                              
           02  AHAFWE7L    COMP  PIC  S9(4).                                    
           02  AHAFWE7F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE7F.                                       
             03 AHAFWE7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE7I  PIC X(3).                                              
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(10).                                             
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(8).                                              
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(10).                                             
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(10).                                             
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(8).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(2).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(3).                                              
           02  AHAFWE8L    COMP  PIC  S9(4).                                    
           02  AHAFWE8F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE8F.                                       
             03 AHAFWE8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE8I  PIC X(3).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(10).                                             
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(8).                                              
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(10).                                             
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(10).                                             
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(8).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(2).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(3).                                              
           02  AHAFWE9L    COMP  PIC  S9(4).                                    
           02  AHAFWE9F    PICTURE X.                                           
           02  FILLER REDEFINES AHAFWE9F.                                       
             03 AHAFWE9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHAFWE9I  PIC X(3).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(10).                                             
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(8).                                              
       01  BAT0015O REDEFINES BAT0015I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODH    PICTURE X.                                             
           02  APRODO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  APRODBZH    PICTURE X.                                           
           02  APRODBZO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRODKZH    PICTURE X.                                           
           02  APRODKZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APGUELVH    PICTURE X.                                           
           02  APGUELVO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APGUELBH    PICTURE X.                                           
           02  APGUELBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGUELABH    PICTURE X.                                           
           02  AGUELABO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGUELBIH    PICTURE X.                                           
           02  AGUELBIO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHAFTYPH    PICTURE X.                                           
           02  AHAFTYPO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASELKRIH    PICTURE X.                                           
           02  ASELKRIO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWERH    PICTURE X.                                           
           02  AHAFWERO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE2H    PICTURE X.                                           
           02  AHAFWE2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEAEAMH    PICTURE X.                                           
           02  AGEAEAMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGEAEVOH    PICTURE X.                                           
           02  AGEAEVOO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE3H    PICTURE X.                                           
           02  AHAFWE3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE4H    PICTURE X.                                           
           02  AHAFWE4O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE5H    PICTURE X.                                           
           02  AHAFWE5O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE6H    PICTURE X.                                           
           02  AHAFWE6O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE7H    PICTURE X.                                           
           02  AHAFWE7O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE8H    PICTURE X.                                           
           02  AHAFWE8O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHAFWE9H    PICTURE X.                                           
           02  AHAFWE9O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(8).                                              
