       01  BKD0005I.                                                            
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  V0619L    COMP  PIC  S9(4).                                      
           02  V0619F    PICTURE X.                                             
           02  FILLER REDEFINES V0619F.                                         
             03 V0619A    PICTURE X.                                            
           02  V0619I  PIC X(3).                                                
           02  V0623L    COMP  PIC  S9(4).                                      
           02  V0623F    PICTURE X.                                             
           02  FILLER REDEFINES V0623F.                                         
             03 V0623A    PICTURE X.                                            
           02  V0623I  PIC X(4).                                                
           02  V0638L    COMP  PIC  S9(4).                                      
           02  V0638F    PICTURE X.                                             
           02  FILLER REDEFINES V0638F.                                         
             03 V0638A    PICTURE X.                                            
           02  V0638I  PIC X(36).                                               
           02  V1001L    COMP  PIC  S9(4).                                      
           02  V1001F    PICTURE X.                                             
           02  FILLER REDEFINES V1001F.                                         
             03 V1001A    PICTURE X.                                            
           02  V1001I  PIC X(3).                                                
           02  V1005L    COMP  PIC  S9(4).                                      
           02  V1005F    PICTURE X.                                             
           02  FILLER REDEFINES V1005F.                                         
             03 V1005A    PICTURE X.                                            
           02  V1005I  PIC X(4).                                                
           02  V1011L    COMP  PIC  S9(4).                                      
           02  V1011F    PICTURE X.                                             
           02  FILLER REDEFINES V1011F.                                         
             03 V1011A    PICTURE X.                                            
           02  V1011I  PIC X(1).                                                
           02  V1016L    COMP  PIC  S9(4).                                      
           02  V1016F    PICTURE X.                                             
           02  FILLER REDEFINES V1016F.                                         
             03 V1016A    PICTURE X.                                            
           02  V1016I  PIC X(1).                                                
           02  V1020L    COMP  PIC  S9(4).                                      
           02  V1020F    PICTURE X.                                             
           02  FILLER REDEFINES V1020F.                                         
             03 V1020A    PICTURE X.                                            
           02  V1020I  PIC X(25).                                               
           02  V1046L    COMP  PIC  S9(4).                                      
           02  V1046F    PICTURE X.                                             
           02  FILLER REDEFINES V1046F.                                         
             03 V1046A    PICTURE X.                                            
           02  V1046I  PIC X(10).                                               
           02  V1057L    COMP  PIC  S9(4).                                      
           02  V1057F    PICTURE X.                                             
           02  FILLER REDEFINES V1057F.                                         
             03 V1057A    PICTURE X.                                            
           02  V1057I  PIC X(16).                                               
           02  V1101L    COMP  PIC  S9(4).                                      
           02  V1101F    PICTURE X.                                             
           02  FILLER REDEFINES V1101F.                                         
             03 V1101A    PICTURE X.                                            
           02  V1101I  PIC X(3).                                                
           02  V1105L    COMP  PIC  S9(4).                                      
           02  V1105F    PICTURE X.                                             
           02  FILLER REDEFINES V1105F.                                         
             03 V1105A    PICTURE X.                                            
           02  V1105I  PIC X(4).                                                
           02  V1111L    COMP  PIC  S9(4).                                      
           02  V1111F    PICTURE X.                                             
           02  FILLER REDEFINES V1111F.                                         
             03 V1111A    PICTURE X.                                            
           02  V1111I  PIC X(1).                                                
           02  V1116L    COMP  PIC  S9(4).                                      
           02  V1116F    PICTURE X.                                             
           02  FILLER REDEFINES V1116F.                                         
             03 V1116A    PICTURE X.                                            
           02  V1116I  PIC X(1).                                                
           02  V1120L    COMP  PIC  S9(4).                                      
           02  V1120F    PICTURE X.                                             
           02  FILLER REDEFINES V1120F.                                         
             03 V1120A    PICTURE X.                                            
           02  V1120I  PIC X(25).                                               
           02  V1146L    COMP  PIC  S9(4).                                      
           02  V1146F    PICTURE X.                                             
           02  FILLER REDEFINES V1146F.                                         
             03 V1146A    PICTURE X.                                            
           02  V1146I  PIC X(10).                                               
           02  V1157L    COMP  PIC  S9(4).                                      
           02  V1157F    PICTURE X.                                             
           02  FILLER REDEFINES V1157F.                                         
             03 V1157A    PICTURE X.                                            
           02  V1157I  PIC X(16).                                               
           02  V1201L    COMP  PIC  S9(4).                                      
           02  V1201F    PICTURE X.                                             
           02  FILLER REDEFINES V1201F.                                         
             03 V1201A    PICTURE X.                                            
           02  V1201I  PIC X(3).                                                
           02  V1205L    COMP  PIC  S9(4).                                      
           02  V1205F    PICTURE X.                                             
           02  FILLER REDEFINES V1205F.                                         
             03 V1205A    PICTURE X.                                            
           02  V1205I  PIC X(4).                                                
           02  V1211L    COMP  PIC  S9(4).                                      
           02  V1211F    PICTURE X.                                             
           02  FILLER REDEFINES V1211F.                                         
             03 V1211A    PICTURE X.                                            
           02  V1211I  PIC X(1).                                                
           02  V1216L    COMP  PIC  S9(4).                                      
           02  V1216F    PICTURE X.                                             
           02  FILLER REDEFINES V1216F.                                         
             03 V1216A    PICTURE X.                                            
           02  V1216I  PIC X(1).                                                
           02  V1220L    COMP  PIC  S9(4).                                      
           02  V1220F    PICTURE X.                                             
           02  FILLER REDEFINES V1220F.                                         
             03 V1220A    PICTURE X.                                            
           02  V1220I  PIC X(25).                                               
           02  V1246L    COMP  PIC  S9(4).                                      
           02  V1246F    PICTURE X.                                             
           02  FILLER REDEFINES V1246F.                                         
             03 V1246A    PICTURE X.                                            
           02  V1246I  PIC X(10).                                               
           02  V1257L    COMP  PIC  S9(4).                                      
           02  V1257F    PICTURE X.                                             
           02  FILLER REDEFINES V1257F.                                         
             03 V1257A    PICTURE X.                                            
           02  V1257I  PIC X(16).                                               
           02  V1301L    COMP  PIC  S9(4).                                      
           02  V1301F    PICTURE X.                                             
           02  FILLER REDEFINES V1301F.                                         
             03 V1301A    PICTURE X.                                            
           02  V1301I  PIC X(3).                                                
           02  V1305L    COMP  PIC  S9(4).                                      
           02  V1305F    PICTURE X.                                             
           02  FILLER REDEFINES V1305F.                                         
             03 V1305A    PICTURE X.                                            
           02  V1305I  PIC X(4).                                                
           02  V1311L    COMP  PIC  S9(4).                                      
           02  V1311F    PICTURE X.                                             
           02  FILLER REDEFINES V1311F.                                         
             03 V1311A    PICTURE X.                                            
           02  V1311I  PIC X(1).                                                
           02  V1316L    COMP  PIC  S9(4).                                      
           02  V1316F    PICTURE X.                                             
           02  FILLER REDEFINES V1316F.                                         
             03 V1316A    PICTURE X.                                            
           02  V1316I  PIC X(1).                                                
           02  V1320L    COMP  PIC  S9(4).                                      
           02  V1320F    PICTURE X.                                             
           02  FILLER REDEFINES V1320F.                                         
             03 V1320A    PICTURE X.                                            
           02  V1320I  PIC X(25).                                               
           02  V1346L    COMP  PIC  S9(4).                                      
           02  V1346F    PICTURE X.                                             
           02  FILLER REDEFINES V1346F.                                         
             03 V1346A    PICTURE X.                                            
           02  V1346I  PIC X(10).                                               
           02  V1357L    COMP  PIC  S9(4).                                      
           02  V1357F    PICTURE X.                                             
           02  FILLER REDEFINES V1357F.                                         
             03 V1357A    PICTURE X.                                            
           02  V1357I  PIC X(16).                                               
           02  V1401L    COMP  PIC  S9(4).                                      
           02  V1401F    PICTURE X.                                             
           02  FILLER REDEFINES V1401F.                                         
             03 V1401A    PICTURE X.                                            
           02  V1401I  PIC X(3).                                                
           02  V1405L    COMP  PIC  S9(4).                                      
           02  V1405F    PICTURE X.                                             
           02  FILLER REDEFINES V1405F.                                         
             03 V1405A    PICTURE X.                                            
           02  V1405I  PIC X(4).                                                
           02  V1411L    COMP  PIC  S9(4).                                      
           02  V1411F    PICTURE X.                                             
           02  FILLER REDEFINES V1411F.                                         
             03 V1411A    PICTURE X.                                            
           02  V1411I  PIC X(1).                                                
           02  V1416L    COMP  PIC  S9(4).                                      
           02  V1416F    PICTURE X.                                             
           02  FILLER REDEFINES V1416F.                                         
             03 V1416A    PICTURE X.                                            
           02  V1416I  PIC X(1).                                                
           02  V1420L    COMP  PIC  S9(4).                                      
           02  V1420F    PICTURE X.                                             
           02  FILLER REDEFINES V1420F.                                         
             03 V1420A    PICTURE X.                                            
           02  V1420I  PIC X(25).                                               
           02  V1446L    COMP  PIC  S9(4).                                      
           02  V1446F    PICTURE X.                                             
           02  FILLER REDEFINES V1446F.                                         
             03 V1446A    PICTURE X.                                            
           02  V1446I  PIC X(10).                                               
           02  V1457L    COMP  PIC  S9(4).                                      
           02  V1457F    PICTURE X.                                             
           02  FILLER REDEFINES V1457F.                                         
             03 V1457A    PICTURE X.                                            
           02  V1457I  PIC X(16).                                               
           02  V1501L    COMP  PIC  S9(4).                                      
           02  V1501F    PICTURE X.                                             
           02  FILLER REDEFINES V1501F.                                         
             03 V1501A    PICTURE X.                                            
           02  V1501I  PIC X(3).                                                
           02  V1505L    COMP  PIC  S9(4).                                      
           02  V1505F    PICTURE X.                                             
           02  FILLER REDEFINES V1505F.                                         
             03 V1505A    PICTURE X.                                            
           02  V1505I  PIC X(4).                                                
           02  V1511L    COMP  PIC  S9(4).                                      
           02  V1511F    PICTURE X.                                             
           02  FILLER REDEFINES V1511F.                                         
             03 V1511A    PICTURE X.                                            
           02  V1511I  PIC X(1).                                                
           02  V1516L    COMP  PIC  S9(4).                                      
           02  V1516F    PICTURE X.                                             
           02  FILLER REDEFINES V1516F.                                         
             03 V1516A    PICTURE X.                                            
           02  V1516I  PIC X(1).                                                
           02  V1520L    COMP  PIC  S9(4).                                      
           02  V1520F    PICTURE X.                                             
           02  FILLER REDEFINES V1520F.                                         
             03 V1520A    PICTURE X.                                            
           02  V1520I  PIC X(25).                                               
           02  V1546L    COMP  PIC  S9(4).                                      
           02  V1546F    PICTURE X.                                             
           02  FILLER REDEFINES V1546F.                                         
             03 V1546A    PICTURE X.                                            
           02  V1546I  PIC X(10).                                               
           02  V1557L    COMP  PIC  S9(4).                                      
           02  V1557F    PICTURE X.                                             
           02  FILLER REDEFINES V1557F.                                         
             03 V1557A    PICTURE X.                                            
           02  V1557I  PIC X(16).                                               
           02  V1601L    COMP  PIC  S9(4).                                      
           02  V1601F    PICTURE X.                                             
           02  FILLER REDEFINES V1601F.                                         
             03 V1601A    PICTURE X.                                            
           02  V1601I  PIC X(3).                                                
           02  V1605L    COMP  PIC  S9(4).                                      
           02  V1605F    PICTURE X.                                             
           02  FILLER REDEFINES V1605F.                                         
             03 V1605A    PICTURE X.                                            
           02  V1605I  PIC X(4).                                                
           02  V1611L    COMP  PIC  S9(4).                                      
           02  V1611F    PICTURE X.                                             
           02  FILLER REDEFINES V1611F.                                         
             03 V1611A    PICTURE X.                                            
           02  V1611I  PIC X(1).                                                
           02  V1616L    COMP  PIC  S9(4).                                      
           02  V1616F    PICTURE X.                                             
           02  FILLER REDEFINES V1616F.                                         
             03 V1616A    PICTURE X.                                            
           02  V1616I  PIC X(1).                                                
           02  V1620L    COMP  PIC  S9(4).                                      
           02  V1620F    PICTURE X.                                             
           02  FILLER REDEFINES V1620F.                                         
             03 V1620A    PICTURE X.                                            
           02  V1620I  PIC X(25).                                               
           02  V1646L    COMP  PIC  S9(4).                                      
           02  V1646F    PICTURE X.                                             
           02  FILLER REDEFINES V1646F.                                         
             03 V1646A    PICTURE X.                                            
           02  V1646I  PIC X(10).                                               
           02  V1657L    COMP  PIC  S9(4).                                      
           02  V1657F    PICTURE X.                                             
           02  FILLER REDEFINES V1657F.                                         
             03 V1657A    PICTURE X.                                            
           02  V1657I  PIC X(16).                                               
           02  V1701L    COMP  PIC  S9(4).                                      
           02  V1701F    PICTURE X.                                             
           02  FILLER REDEFINES V1701F.                                         
             03 V1701A    PICTURE X.                                            
           02  V1701I  PIC X(3).                                                
           02  V1705L    COMP  PIC  S9(4).                                      
           02  V1705F    PICTURE X.                                             
           02  FILLER REDEFINES V1705F.                                         
             03 V1705A    PICTURE X.                                            
           02  V1705I  PIC X(4).                                                
           02  V1711L    COMP  PIC  S9(4).                                      
           02  V1711F    PICTURE X.                                             
           02  FILLER REDEFINES V1711F.                                         
             03 V1711A    PICTURE X.                                            
           02  V1711I  PIC X(1).                                                
           02  V1716L    COMP  PIC  S9(4).                                      
           02  V1716F    PICTURE X.                                             
           02  FILLER REDEFINES V1716F.                                         
             03 V1716A    PICTURE X.                                            
           02  V1716I  PIC X(1).                                                
           02  V1720L    COMP  PIC  S9(4).                                      
           02  V1720F    PICTURE X.                                             
           02  FILLER REDEFINES V1720F.                                         
             03 V1720A    PICTURE X.                                            
           02  V1720I  PIC X(25).                                               
           02  V1746L    COMP  PIC  S9(4).                                      
           02  V1746F    PICTURE X.                                             
           02  FILLER REDEFINES V1746F.                                         
             03 V1746A    PICTURE X.                                            
           02  V1746I  PIC X(10).                                               
           02  V1757L    COMP  PIC  S9(4).                                      
           02  V1757F    PICTURE X.                                             
           02  FILLER REDEFINES V1757F.                                         
             03 V1757A    PICTURE X.                                            
           02  V1757I  PIC X(16).                                               
           02  V1801L    COMP  PIC  S9(4).                                      
           02  V1801F    PICTURE X.                                             
           02  FILLER REDEFINES V1801F.                                         
             03 V1801A    PICTURE X.                                            
           02  V1801I  PIC X(3).                                                
           02  V1805L    COMP  PIC  S9(4).                                      
           02  V1805F    PICTURE X.                                             
           02  FILLER REDEFINES V1805F.                                         
             03 V1805A    PICTURE X.                                            
           02  V1805I  PIC X(4).                                                
           02  V1811L    COMP  PIC  S9(4).                                      
           02  V1811F    PICTURE X.                                             
           02  FILLER REDEFINES V1811F.                                         
             03 V1811A    PICTURE X.                                            
           02  V1811I  PIC X(1).                                                
           02  V1816L    COMP  PIC  S9(4).                                      
           02  V1816F    PICTURE X.                                             
           02  FILLER REDEFINES V1816F.                                         
             03 V1816A    PICTURE X.                                            
           02  V1816I  PIC X(1).                                                
           02  V1820L    COMP  PIC  S9(4).                                      
           02  V1820F    PICTURE X.                                             
           02  FILLER REDEFINES V1820F.                                         
             03 V1820A    PICTURE X.                                            
           02  V1820I  PIC X(25).                                               
           02  V1846L    COMP  PIC  S9(4).                                      
           02  V1846F    PICTURE X.                                             
           02  FILLER REDEFINES V1846F.                                         
             03 V1846A    PICTURE X.                                            
           02  V1846I  PIC X(10).                                               
           02  V1857L    COMP  PIC  S9(4).                                      
           02  V1857F    PICTURE X.                                             
           02  FILLER REDEFINES V1857F.                                         
             03 V1857A    PICTURE X.                                            
           02  V1857I  PIC X(16).                                               
           02  V1901L    COMP  PIC  S9(4).                                      
           02  V1901F    PICTURE X.                                             
           02  FILLER REDEFINES V1901F.                                         
             03 V1901A    PICTURE X.                                            
           02  V1901I  PIC X(3).                                                
           02  V1905L    COMP  PIC  S9(4).                                      
           02  V1905F    PICTURE X.                                             
           02  FILLER REDEFINES V1905F.                                         
             03 V1905A    PICTURE X.                                            
           02  V1905I  PIC X(4).                                                
           02  V1911L    COMP  PIC  S9(4).                                      
           02  V1911F    PICTURE X.                                             
           02  FILLER REDEFINES V1911F.                                         
             03 V1911A    PICTURE X.                                            
           02  V1911I  PIC X(1).                                                
           02  V1916L    COMP  PIC  S9(4).                                      
           02  V1916F    PICTURE X.                                             
           02  FILLER REDEFINES V1916F.                                         
             03 V1916A    PICTURE X.                                            
           02  V1916I  PIC X(1).                                                
           02  V1920L    COMP  PIC  S9(4).                                      
           02  V1920F    PICTURE X.                                             
           02  FILLER REDEFINES V1920F.                                         
             03 V1920A    PICTURE X.                                            
           02  V1920I  PIC X(25).                                               
           02  V1946L    COMP  PIC  S9(4).                                      
           02  V1946F    PICTURE X.                                             
           02  FILLER REDEFINES V1946F.                                         
             03 V1946A    PICTURE X.                                            
           02  V1946I  PIC X(10).                                               
           02  V1957L    COMP  PIC  S9(4).                                      
           02  V1957F    PICTURE X.                                             
           02  FILLER REDEFINES V1957F.                                         
             03 V1957A    PICTURE X.                                            
           02  V1957I  PIC X(16).                                               
           02  V2001L    COMP  PIC  S9(4).                                      
           02  V2001F    PICTURE X.                                             
           02  FILLER REDEFINES V2001F.                                         
             03 V2001A    PICTURE X.                                            
           02  V2001I  PIC X(3).                                                
           02  V2005L    COMP  PIC  S9(4).                                      
           02  V2005F    PICTURE X.                                             
           02  FILLER REDEFINES V2005F.                                         
             03 V2005A    PICTURE X.                                            
           02  V2005I  PIC X(4).                                                
           02  V2011L    COMP  PIC  S9(4).                                      
           02  V2011F    PICTURE X.                                             
           02  FILLER REDEFINES V2011F.                                         
             03 V2011A    PICTURE X.                                            
           02  V2011I  PIC X(1).                                                
           02  V2016L    COMP  PIC  S9(4).                                      
           02  V2016F    PICTURE X.                                             
           02  FILLER REDEFINES V2016F.                                         
             03 V2016A    PICTURE X.                                            
           02  V2016I  PIC X(1).                                                
           02  V2020L    COMP  PIC  S9(4).                                      
           02  V2020F    PICTURE X.                                             
           02  FILLER REDEFINES V2020F.                                         
             03 V2020A    PICTURE X.                                            
           02  V2020I  PIC X(25).                                               
           02  V2046L    COMP  PIC  S9(4).                                      
           02  V2046F    PICTURE X.                                             
           02  FILLER REDEFINES V2046F.                                         
             03 V2046A    PICTURE X.                                            
           02  V2046I  PIC X(10).                                               
           02  V2057L    COMP  PIC  S9(4).                                      
           02  V2057F    PICTURE X.                                             
           02  FILLER REDEFINES V2057F.                                         
             03 V2057A    PICTURE X.                                            
           02  V2057I  PIC X(16).                                               
           02  V2101L    COMP  PIC  S9(4).                                      
           02  V2101F    PICTURE X.                                             
           02  FILLER REDEFINES V2101F.                                         
             03 V2101A    PICTURE X.                                            
           02  V2101I  PIC X(3).                                                
           02  V2105L    COMP  PIC  S9(4).                                      
           02  V2105F    PICTURE X.                                             
           02  FILLER REDEFINES V2105F.                                         
             03 V2105A    PICTURE X.                                            
           02  V2105I  PIC X(4).                                                
           02  V2111L    COMP  PIC  S9(4).                                      
           02  V2111F    PICTURE X.                                             
           02  FILLER REDEFINES V2111F.                                         
             03 V2111A    PICTURE X.                                            
           02  V2111I  PIC X(1).                                                
           02  V2116L    COMP  PIC  S9(4).                                      
           02  V2116F    PICTURE X.                                             
           02  FILLER REDEFINES V2116F.                                         
             03 V2116A    PICTURE X.                                            
           02  V2116I  PIC X(1).                                                
           02  V2120L    COMP  PIC  S9(4).                                      
           02  V2120F    PICTURE X.                                             
           02  FILLER REDEFINES V2120F.                                         
             03 V2120A    PICTURE X.                                            
           02  V2120I  PIC X(25).                                               
           02  V2146L    COMP  PIC  S9(4).                                      
           02  V2146F    PICTURE X.                                             
           02  FILLER REDEFINES V2146F.                                         
             03 V2146A    PICTURE X.                                            
           02  V2146I  PIC X(10).                                               
           02  V2157L    COMP  PIC  S9(4).                                      
           02  V2157F    PICTURE X.                                             
           02  FILLER REDEFINES V2157F.                                         
             03 V2157A    PICTURE X.                                            
           02  V2157I  PIC X(16).                                               
           02  V2201L    COMP  PIC  S9(4).                                      
           02  V2201F    PICTURE X.                                             
           02  FILLER REDEFINES V2201F.                                         
             03 V2201A    PICTURE X.                                            
           02  V2201I  PIC X(79).                                               
           02  V2315L    COMP  PIC  S9(4).                                      
           02  V2315F    PICTURE X.                                             
           02  FILLER REDEFINES V2315F.                                         
             03 V2315A    PICTURE X.                                            
           02  V2315I  PIC X(4).                                                
           02  V2401L    COMP  PIC  S9(4).                                      
           02  V2401F    PICTURE X.                                             
           02  FILLER REDEFINES V2401F.                                         
             03 V2401A    PICTURE X.                                            
           02  V2401I  PIC X(55).                                               
       01  BKD0005O REDEFINES BKD0005I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  V0619O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0623O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0638O  PIC X(36).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1001O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1005O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1011O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1016O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1020O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1046O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1057O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1101O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1105O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1111O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1116O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1120O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1146O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1157O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1201O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1205O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1211O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1216O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1220O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1246O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1257O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1301O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1305O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1311O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1316O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1320O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1346O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1357O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1401O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1405O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1411O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1416O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1420O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1446O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1457O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1501O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1505O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1511O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1516O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1520O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1546O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1557O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1601O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1605O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1611O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1616O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1620O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1646O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1657O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1701O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1705O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1711O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1716O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1720O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1746O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1757O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1801O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1805O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1811O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1816O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1820O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1846O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1857O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1901O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1905O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1911O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1916O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1920O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1946O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1957O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2001O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2005O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2011O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2016O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2020O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2046O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2057O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2101O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2105O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2111O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2116O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2120O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2146O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2157O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2201O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2315O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2401O  PIC X(55).                                               
