       01  BKD0003I.                                                            
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  V0822L    COMP  PIC  S9(4).                                      
           02  V0822F    PICTURE X.                                             
           02  FILLER REDEFINES V0822F.                                         
             03 V0822A    PICTURE X.                                            
           02  V0822I  PIC X(3).                                                
           02  V0826L    COMP  PIC  S9(4).                                      
           02  V0826F    PICTURE X.                                             
           02  FILLER REDEFINES V0826F.                                         
             03 V0826A    PICTURE X.                                            
           02  V0826I  PIC X(4).                                                
           02  V1022L    COMP  PIC  S9(4).                                      
           02  V1022F    PICTURE X.                                             
           02  FILLER REDEFINES V1022F.                                         
             03 V1022A    PICTURE X.                                            
           02  V1022I  PIC X(2).                                                
           02  V1222L    COMP  PIC  S9(4).                                      
           02  V1222F    PICTURE X.                                             
           02  FILLER REDEFINES V1222F.                                         
             03 V1222A    PICTURE X.                                            
           02  V1222I  PIC X(15).                                               
           02  V2201L    COMP  PIC  S9(4).                                      
           02  V2201F    PICTURE X.                                             
           02  FILLER REDEFINES V2201F.                                         
             03 V2201A    PICTURE X.                                            
           02  V2201I  PIC X(79).                                               
           02  V2315L    COMP  PIC  S9(4).                                      
           02  V2315F    PICTURE X.                                             
           02  FILLER REDEFINES V2315F.                                         
             03 V2315A    PICTURE X.                                            
           02  V2315I  PIC X(4).                                                
           02  V2401L    COMP  PIC  S9(4).                                      
           02  V2401F    PICTURE X.                                             
           02  FILLER REDEFINES V2401F.                                         
             03 V2401A    PICTURE X.                                            
           02  V2401I  PIC X(30).                                               
       01  BKD0003O REDEFINES BKD0003I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  V0822O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0826O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1022O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1222O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2201O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2315O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2401O  PIC X(30).                                               
