       01  BPA0026I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  AUNTERL    COMP  PIC  S9(4).                                     
           02  AUNTERF    PICTURE X.                                            
           02  FILLER REDEFINES AUNTERF.                                        
             03 AUNTERA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUNTERI  PIC X(3).                                               
           02  ASCHICHL    COMP  PIC  S9(4).                                    
           02  ASCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ASCHICHF.                                       
             03 ASCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASCHICHI  PIC X(3).                                              
           02  APINFBL    COMP  PIC  S9(4).                                     
           02  APINFBF    PICTURE X.                                            
           02  FILLER REDEFINES APINFBF.                                        
             03 APINFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APINFBI  PIC X(4).                                               
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  EPRODSLL    COMP  PIC  S9(4).                                    
           02  EPRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES EPRODSLF.                                       
             03 EPRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPRODSLI  PIC X(3).                                              
           02  EORDNRL    COMP  PIC  S9(4).                                     
           02  EORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES EORDNRF.                                        
             03 EORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EORDNRI  PIC X(2).                                               
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  EFAEBTTL    COMP  PIC  S9(4).                                    
           02  EFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBTTF.                                       
             03 EFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBTTI  PIC X(2).                                              
           02  EFAEBMML    COMP  PIC  S9(4).                                    
           02  EFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBMMF.                                       
             03 EFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBMMI  PIC X(2).                                              
           02  EFAEBJJL    COMP  PIC  S9(4).                                    
           02  EFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBJJF.                                       
             03 EFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBJJI  PIC X(4).                                              
           02  EFOLGNRL    COMP  PIC  S9(4).                                    
           02  EFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EFOLGNRF.                                       
             03 EFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFOLGNRI  PIC X(3).                                              
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSTXTL    COMP  PIC  S9(4).                                    
           02  AFCSTXTF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSTXTF.                                       
             03 AFCSTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSTXTI  PIC X(10).                                             
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  EHISTNRL    COMP  PIC  S9(4).                                    
           02  EHISTNRF    PICTURE X.                                           
           02  FILLER REDEFINES EHISTNRF.                                       
             03 EHISTNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EHISTNRI  PIC X(3).                                              
           02  AFBKENNL    COMP  PIC  S9(4).                                    
           02  AFBKENNF    PICTURE X.                                           
           02  FILLER REDEFINES AFBKENNF.                                       
             03 AFBKENNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBKENNI  PIC X(8).                                              
           02  AGLKENNL    COMP  PIC  S9(4).                                    
           02  AGLKENNF    PICTURE X.                                           
           02  FILLER REDEFINES AGLKENNF.                                       
             03 AGLKENNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGLKENNI  PIC X(6).                                              
           02  APROARTL    COMP  PIC  S9(4).                                    
           02  APROARTF    PICTURE X.                                           
           02  FILLER REDEFINES APROARTF.                                       
             03 APROARTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROARTI  PIC X(2).                                              
           02  ADGVL    COMP  PIC  S9(4).                                       
           02  ADGVF    PICTURE X.                                              
           02  FILLER REDEFINES ADGVF.                                          
             03 ADGVA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADGVI  PIC X(5).                                                 
           02  AVNRAFBL    COMP  PIC  S9(4).                                    
           02  AVNRAFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVNRAFBF.                                       
             03 AVNRAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVNRAFBI  PIC X(19).                                             
           02  AVNRAL    COMP  PIC  S9(4).                                      
           02  AVNRAF    PICTURE X.                                             
           02  FILLER REDEFINES AVNRAF.                                         
             03 AVNRAA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNRAI  PIC X(15).                                               
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  ABRUTFBL    COMP  PIC  S9(4).                                    
           02  ABRUTFBF    PICTURE X.                                           
           02  FILLER REDEFINES ABRUTFBF.                                       
             03 ABRUTFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABRUTFBI  PIC X(24).                                             
           02  ABRUTTOL    COMP  PIC  S9(4).                                    
           02  ABRUTTOF    PICTURE X.                                           
           02  FILLER REDEFINES ABRUTTOF.                                       
             03 ABRUTTOA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABRUTTOI  PIC X(14).                                             
           02  ANAMENBL    COMP  PIC  S9(4).                                    
           02  ANAMENBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMENBF.                                       
             03 ANAMENBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMENBI  PIC X(19).                                             
           02  ANETBTRL    COMP  PIC  S9(4).                                    
           02  ANETBTRF    PICTURE X.                                           
           02  FILLER REDEFINES ANETBTRF.                                       
             03 ANETBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBTRI  PIC X(14).                                             
           02  APPFPTBL    COMP  PIC  S9(4).                                    
           02  APPFPTBF    PICTURE X.                                           
           02  FILLER REDEFINES APPFPTBF.                                       
             03 APPFPTBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFPTBI  PIC X(14).                                             
           02  AAVERML    COMP  PIC  S9(4).                                     
           02  AAVERMF    PICTURE X.                                            
           02  FILLER REDEFINES AAVERMF.                                        
             03 AAVERMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AAVERMI  PIC X(7).                                               
           02  APPFDFBL    COMP  PIC  S9(4).                                    
           02  APPFDFBF    PICTURE X.                                           
           02  FILLER REDEFINES APPFDFBF.                                       
             03 APPFDFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFDFBI  PIC X(25).                                             
           02  APPFDATL    COMP  PIC  S9(4).                                    
           02  APPFDATF    PICTURE X.                                           
           02  FILLER REDEFINES APPFDATF.                                       
             03 APPFDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFDATI  PIC X(10).                                             
           02  APTGSPL    COMP  PIC  S9(4).                                     
           02  APTGSPF    PICTURE X.                                            
           02  FILLER REDEFINES APTGSPF.                                        
             03 APTGSPA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APTGSPI  PIC X(14).                                              
           02  AGSPSTZL    COMP  PIC  S9(4).                                    
           02  AGSPSTZF    PICTURE X.                                           
           02  FILLER REDEFINES AGSPSTZF.                                       
             03 AGSPSTZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGSPSTZI  PIC X(10).                                             
           02  AGSPDATL    COMP  PIC  S9(4).                                    
           02  AGSPDATF    PICTURE X.                                           
           02  FILLER REDEFINES AGSPDATF.                                       
             03 AGSPDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGSPDATI  PIC X(10).                                             
           02  ARATAFBL    COMP  PIC  S9(4).                                    
           02  ARATAFBF    PICTURE X.                                           
           02  FILLER REDEFINES ARATAFBF.                                       
             03 ARATAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARATAFBI  PIC X(19).                                             
           02  ARATARWL    COMP  PIC  S9(4).                                    
           02  ARATARWF    PICTURE X.                                           
           02  FILLER REDEFINES ARATARWF.                                       
             03 ARATARWA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARATARWI  PIC X(15).                                             
           02  STRERFBL    COMP  PIC  S9(4).                                    
           02  STRERFBF    PICTURE X.                                           
           02  FILLER REDEFINES STRERFBF.                                       
             03 STRERFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  STRERFBI  PIC X(24).                                             
           02  ASTRDATL    COMP  PIC  S9(4).                                    
           02  ASTRDATF    PICTURE X.                                           
           02  FILLER REDEFINES ASTRDATF.                                       
             03 ASTRDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTRDATI  PIC X(10).                                             
           02  ANAMEUBL    COMP  PIC  S9(4).                                    
           02  ANAMEUBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEUBF.                                       
             03 ANAMEUBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEUBI  PIC X(19).                                             
           02  AUSTBTRL    COMP  PIC  S9(4).                                    
           02  AUSTBTRF    PICTURE X.                                           
           02  FILLER REDEFINES AUSTBTRF.                                       
             03 AUSTBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUSTBTRI  PIC X(14).                                             
           02  APTBTFBL    COMP  PIC  S9(4).                                    
           02  APTBTFBF    PICTURE X.                                           
           02  FILLER REDEFINES APTBTFBF.                                       
             03 APTBTFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTBTFBI  PIC X(24).                                             
           02  APTBTGL    COMP  PIC  S9(4).                                     
           02  APTBTGF    PICTURE X.                                            
           02  FILLER REDEFINES APTBTGF.                                        
             03 APTBTGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APTBTGI  PIC X(13).                                              
           02  ALZFBL    COMP  PIC  S9(4).                                      
           02  ALZFBF    PICTURE X.                                             
           02  FILLER REDEFINES ALZFBF.                                         
             03 ALZFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ALZFBI  PIC X(19).                                               
           02  ALZL    COMP  PIC  S9(4).                                        
           02  ALZF    PICTURE X.                                               
           02  FILLER REDEFINES ALZF.                                           
             03 ALZA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  ALZI  PIC X(5).                                                  
           02  APTSUFBL    COMP  PIC  S9(4).                                    
           02  APTSUFBF    PICTURE X.                                           
           02  FILLER REDEFINES APTSUFBF.                                       
             03 APTSUFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTSUFBI  PIC X(24).                                             
           02  APTSUMML    COMP  PIC  S9(4).                                    
           02  APTSUMMF    PICTURE X.                                           
           02  FILLER REDEFINES APTSUMMF.                                       
             03 APTSUMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTSUMMI  PIC X(13).                                             
           02  AZHLWFBL    COMP  PIC  S9(4).                                    
           02  AZHLWFBF    PICTURE X.                                           
           02  FILLER REDEFINES AZHLWFBF.                                       
             03 AZHLWFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZHLWFBI  PIC X(19).                                             
           02  AZHLWL    COMP  PIC  S9(4).                                      
           02  AZHLWF    PICTURE X.                                             
           02  FILLER REDEFINES AZHLWF.                                         
             03 AZHLWA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZHLWI  PIC X(2).                                                
           02  AZHLTXTL    COMP  PIC  S9(4).                                    
           02  AZHLTXTF    PICTURE X.                                           
           02  FILLER REDEFINES AZHLTXTF.                                       
             03 AZHLTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZHLTXTI  PIC X(11).                                             
           02  ARECHFBL    COMP  PIC  S9(4).                                    
           02  ARECHFBF    PICTURE X.                                           
           02  FILLER REDEFINES ARECHFBF.                                       
             03 ARECHFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARECHFBI  PIC X(24).                                             
           02  ARECHNRL    COMP  PIC  S9(4).                                    
           02  ARECHNRF    PICTURE X.                                           
           02  FILLER REDEFINES ARECHNRF.                                       
             03 ARECHNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARECHNRI  PIC X(12).                                             
           02  ANAMEUSL    COMP  PIC  S9(4).                                    
           02  ANAMEUSF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEUSF.                                       
             03 ANAMEUSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEUSI  PIC X(19).                                             
           02  AUSTSTZL    COMP  PIC  S9(4).                                    
           02  AUSTSTZF    PICTURE X.                                           
           02  FILLER REDEFINES AUSTSTZF.                                       
             03 AUSTSTZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUSTSTZI  PIC X(8).                                              
           02  APTGPROL    COMP  PIC  S9(4).                                    
           02  APTGPROF    PICTURE X.                                           
           02  FILLER REDEFINES APTGPROF.                                       
             03 APTGPROA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTGPROI  PIC X(14).                                             
           02  AGDPSTZL    COMP  PIC  S9(4).                                    
           02  AGDPSTZF    PICTURE X.                                           
           02  FILLER REDEFINES AGDPSTZF.                                       
             03 AGDPSTZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGDPSTZI  PIC X(10).                                             
           02  APTEINHL    COMP  PIC  S9(4).                                    
           02  APTEINHF    PICTURE X.                                           
           02  FILLER REDEFINES APTEINHF.                                       
             03 APTEINHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTEINHI  PIC X(10).                                             
           02  AABRDATL    COMP  PIC  S9(4).                                    
           02  AABRDATF    PICTURE X.                                           
           02  FILLER REDEFINES AABRDATF.                                       
             03 AABRDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRDATI  PIC X(10).                                             
       01  BPA0026O REDEFINES BPA0026I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUNTERH    PICTURE X.                                            
           02  AUNTERO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASCHICHH    PICTURE X.                                           
           02  ASCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APINFBH    PICTURE X.                                            
           02  APINFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPRODSLH    PICTURE X.                                           
           02  EPRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EORDNRH    PICTURE X.                                            
           02  EORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBTTH    PICTURE X.                                           
           02  EFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBMMH    PICTURE X.                                           
           02  EFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBJJH    PICTURE X.                                           
           02  EFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFOLGNRH    PICTURE X.                                           
           02  EFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSTXTH    PICTURE X.                                           
           02  AFCSTXTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  EHISTNRH    PICTURE X.                                           
           02  EHISTNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFBKENNH    PICTURE X.                                           
           02  AFBKENNO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGLKENNH    PICTURE X.                                           
           02  AGLKENNO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROARTH    PICTURE X.                                           
           02  APROARTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADGVH    PICTURE X.                                              
           02  ADGVO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVNRAFBH    PICTURE X.                                           
           02  AVNRAFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVNRAH    PICTURE X.                                             
           02  AVNRAO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABRUTFBH    PICTURE X.                                           
           02  ABRUTFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABRUTTOH    PICTURE X.                                           
           02  ABRUTTOO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMENBH    PICTURE X.                                           
           02  ANAMENBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANETBTRH    PICTURE X.                                           
           02  ANETBTRO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  APPFPTBH    PICTURE X.                                           
           02  APPFPTBO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AAVERMH    PICTURE X.                                            
           02  AAVERMO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  APPFDFBH    PICTURE X.                                           
           02  APPFDFBO  PIC X(25).                                             
           02  FILLER PICTURE X(3).                                             
           02  APPFDATH    PICTURE X.                                           
           02  APPFDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APTGSPH    PICTURE X.                                            
           02  APTGSPO  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGSPSTZH    PICTURE X.                                           
           02  AGSPSTZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGSPDATH    PICTURE X.                                           
           02  AGSPDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARATAFBH    PICTURE X.                                           
           02  ARATAFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARATARWH    PICTURE X.                                           
           02  ARATARWO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  STRERFBH    PICTURE X.                                           
           02  STRERFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTRDATH    PICTURE X.                                           
           02  ASTRDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEUBH    PICTURE X.                                           
           02  ANAMEUBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTBTRH    PICTURE X.                                           
           02  AUSTBTRO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  APTBTFBH    PICTURE X.                                           
           02  APTBTFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  APTBTGH    PICTURE X.                                            
           02  APTBTGO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALZFBH    PICTURE X.                                             
           02  ALZFBO  PIC X(19).                                               
           02  FILLER PICTURE X(3).                                             
           02  ALZH    PICTURE X.                                               
           02  ALZO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  APTSUFBH    PICTURE X.                                           
           02  APTSUFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  APTSUMMH    PICTURE X.                                           
           02  APTSUMMO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZHLWFBH    PICTURE X.                                           
           02  AZHLWFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZHLWH    PICTURE X.                                             
           02  AZHLWO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZHLTXTH    PICTURE X.                                           
           02  AZHLTXTO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARECHFBH    PICTURE X.                                           
           02  ARECHFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARECHNRH    PICTURE X.                                           
           02  ARECHNRO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEUSH    PICTURE X.                                           
           02  ANAMEUSO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTSTZH    PICTURE X.                                           
           02  AUSTSTZO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTGPROH    PICTURE X.                                           
           02  APTGPROO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGDPSTZH    PICTURE X.                                           
           02  AGDPSTZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APTEINHH    PICTURE X.                                           
           02  APTEINHO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRDATH    PICTURE X.                                           
           02  AABRDATO  PIC X(10).                                             
