       01  BPA0066I.                                                            
           02  FILLER PIC X(12).                                                
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRI  PIC X(7).                                                
           02  EZIELSTL    COMP  PIC  S9(4).                                    
           02  EZIELSTF    PICTURE X.                                           
           02  FILLER REDEFINES EZIELSTF.                                       
             03 EZIELSTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZIELSTI  PIC X(2).                                              
           02  EKOJAHRL    COMP  PIC  S9(4).                                    
           02  EKOJAHRF    PICTURE X.                                           
           02  FILLER REDEFINES EKOJAHRF.                                       
             03 EKOJAHRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKOJAHRI  PIC X(4).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EAENVTTL    COMP  PIC  S9(4).                                    
           02  EAENVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EAENVTTF.                                       
             03 EAENVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAENVTTI  PIC X(2).                                              
           02  EAENVMML    COMP  PIC  S9(4).                                    
           02  EAENVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EAENVMMF.                                       
             03 EAENVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAENVMMI  PIC X(2).                                              
           02  EAENVJJL    COMP  PIC  S9(4).                                    
           02  EAENVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EAENVJJF.                                       
             03 EAENVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAENVJJI  PIC X(4).                                              
           02  EAENBTTL    COMP  PIC  S9(4).                                    
           02  EAENBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EAENBTTF.                                       
             03 EAENBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAENBTTI  PIC X(2).                                              
           02  EAENBMML    COMP  PIC  S9(4).                                    
           02  EAENBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EAENBMMF.                                       
             03 EAENBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAENBMMI  PIC X(2).                                              
           02  EAENBJJL    COMP  PIC  S9(4).                                    
           02  EAENBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EAENBJJF.                                       
             03 EAENBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAENBJJI  PIC X(4).                                              
           02  EINFVBML    COMP  PIC  S9(4).                                    
           02  EINFVBMF    PICTURE X.                                           
           02  FILLER REDEFINES EINFVBMF.                                       
             03 EINFVBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EINFVBMI  PIC X(2).                                              
           02  EINFVBJL    COMP  PIC  S9(4).                                    
           02  EINFVBJF    PICTURE X.                                           
           02  FILLER REDEFINES EINFVBJF.                                       
             03 EINFVBJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EINFVBJI  PIC X(4).                                              
           02  EVERZSTL    COMP  PIC  S9(4).                                    
           02  EVERZSTF    PICTURE X.                                           
           02  FILLER REDEFINES EVERZSTF.                                       
             03 EVERZSTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVERZSTI  PIC X(1).                                              
           02  AVZSTBML    COMP  PIC  S9(4).                                    
           02  AVZSTBMF    PICTURE X.                                           
           02  FILLER REDEFINES AVZSTBMF.                                       
             03 AVZSTBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVZSTBMI  PIC X(40).                                             
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(10).                                              
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(1).                                                 
           02  AFCSFB1L    COMP  PIC  S9(4).                                    
           02  AFCSFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AFCSFB1F.                                       
             03 AFCSFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFB1I  PIC X(31).                                             
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(9).                                                
           02  AZIELSTL    COMP  PIC  S9(4).                                    
           02  AZIELSTF    PICTURE X.                                           
           02  FILLER REDEFINES AZIELSTF.                                       
             03 AZIELSTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZIELSTI  PIC X(2).                                              
           02  AKOJAHRL    COMP  PIC  S9(4).                                    
           02  AKOJAHRF    PICTURE X.                                           
           02  FILLER REDEFINES AKOJAHRF.                                       
             03 AKOJAHRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKOJAHRI  PIC X(4).                                              
           02  AAENDATL    COMP  PIC  S9(4).                                    
           02  AAENDATF    PICTURE X.                                           
           02  FILLER REDEFINES AAENDATF.                                       
             03 AAENDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AAENDATI  PIC X(10).                                             
           02  AVARBZSL    COMP  PIC  S9(4).                                    
           02  AVARBZSF    PICTURE X.                                           
           02  FILLER REDEFINES AVARBZSF.                                       
             03 AVARBZSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVARBZSI  PIC X(17).                                             
           02  ALTBVONL    COMP  PIC  S9(4).                                    
           02  ALTBVONF    PICTURE X.                                           
           02  FILLER REDEFINES ALTBVONF.                                       
             03 ALTBVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBVONI  PIC X(8).                                              
           02  ALTBAML    COMP  PIC  S9(4).                                     
           02  ALTBAMF    PICTURE X.                                            
           02  FILLER REDEFINES ALTBAMF.                                        
             03 ALTBAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAMI  PIC X(10).                                              
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AVBNR2L    COMP  PIC  S9(4).                                     
           02  AVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR2F.                                        
             03 AVBNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR2I  PIC X(9).                                               
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(2).                                              
           02  AKORRJ2L    COMP  PIC  S9(4).                                    
           02  AKORRJ2F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ2F.                                       
             03 AKORRJ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ2I  PIC X(4).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(10).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(17).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(8).                                              
           02  ALTBAM2L    COMP  PIC  S9(4).                                    
           02  ALTBAM2F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM2F.                                       
             03 ALTBAM2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM2I  PIC X(10).                                             
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AVBNR3L    COMP  PIC  S9(4).                                     
           02  AVBNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR3F.                                        
             03 AVBNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR3I  PIC X(9).                                               
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(2).                                              
           02  AKORRJ3L    COMP  PIC  S9(4).                                    
           02  AKORRJ3F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ3F.                                       
             03 AKORRJ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ3I  PIC X(4).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(10).                                             
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(17).                                             
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(8).                                              
           02  ALTBAM3L    COMP  PIC  S9(4).                                    
           02  ALTBAM3F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM3F.                                       
             03 ALTBAM3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM3I  PIC X(10).                                             
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AVBNR4L    COMP  PIC  S9(4).                                     
           02  AVBNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR4F.                                        
             03 AVBNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR4I  PIC X(9).                                               
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(2).                                              
           02  AKORRJ4L    COMP  PIC  S9(4).                                    
           02  AKORRJ4F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ4F.                                       
             03 AKORRJ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ4I  PIC X(4).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(10).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(17).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(8).                                              
           02  ALTBAM4L    COMP  PIC  S9(4).                                    
           02  ALTBAM4F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM4F.                                       
             03 ALTBAM4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM4I  PIC X(10).                                             
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AVBNR5L    COMP  PIC  S9(4).                                     
           02  AVBNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR5F.                                        
             03 AVBNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR5I  PIC X(9).                                               
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(2).                                              
           02  AKORRJ5L    COMP  PIC  S9(4).                                    
           02  AKORRJ5F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ5F.                                       
             03 AKORRJ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ5I  PIC X(4).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(17).                                             
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(8).                                              
           02  ALTBAM5L    COMP  PIC  S9(4).                                    
           02  ALTBAM5F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM5F.                                       
             03 ALTBAM5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM5I  PIC X(10).                                             
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AVBNR6L    COMP  PIC  S9(4).                                     
           02  AVBNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR6F.                                        
             03 AVBNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR6I  PIC X(9).                                               
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(2).                                              
           02  AKORRJ6L    COMP  PIC  S9(4).                                    
           02  AKORRJ6F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ6F.                                       
             03 AKORRJ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ6I  PIC X(4).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(10).                                             
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(17).                                             
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(8).                                              
           02  ALTBAM6L    COMP  PIC  S9(4).                                    
           02  ALTBAM6F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM6F.                                       
             03 ALTBAM6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM6I  PIC X(10).                                             
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AVBNR7L    COMP  PIC  S9(4).                                     
           02  AVBNR7F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR7F.                                        
             03 AVBNR7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR7I  PIC X(9).                                               
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(2).                                              
           02  AKORRJ7L    COMP  PIC  S9(4).                                    
           02  AKORRJ7F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ7F.                                       
             03 AKORRJ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ7I  PIC X(4).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(10).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(17).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(8).                                              
           02  ALTBAM7L    COMP  PIC  S9(4).                                    
           02  ALTBAM7F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM7F.                                       
             03 ALTBAM7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM7I  PIC X(10).                                             
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AVBNR8L    COMP  PIC  S9(4).                                     
           02  AVBNR8F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR8F.                                        
             03 AVBNR8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR8I  PIC X(9).                                               
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(2).                                              
           02  AKORRJ8L    COMP  PIC  S9(4).                                    
           02  AKORRJ8F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ8F.                                       
             03 AKORRJ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ8I  PIC X(4).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(10).                                             
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(17).                                             
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(8).                                              
           02  ALTBAM8L    COMP  PIC  S9(4).                                    
           02  ALTBAM8F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM8F.                                       
             03 ALTBAM8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM8I  PIC X(10).                                             
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AVBNR9L    COMP  PIC  S9(4).                                     
           02  AVBNR9F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR9F.                                        
             03 AVBNR9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR9I  PIC X(9).                                               
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(2).                                              
           02  AKORRJ9L    COMP  PIC  S9(4).                                    
           02  AKORRJ9F    PICTURE X.                                           
           02  FILLER REDEFINES AKORRJ9F.                                       
             03 AKORRJ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKORRJ9I  PIC X(4).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(10).                                             
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(17).                                             
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(8).                                              
           02  ALTBAM9L    COMP  PIC  S9(4).                                    
           02  ALTBAM9F    PICTURE X.                                           
           02  FILLER REDEFINES ALTBAM9F.                                       
             03 ALTBAM9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALTBAM9I  PIC X(10).                                             
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  AVBNR92L    COMP  PIC  S9(4).                                    
           02  AVBNR92F    PICTURE X.                                           
           02  FILLER REDEFINES AVBNR92F.                                       
             03 AVBNR92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR92I  PIC X(9).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(2).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(4).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(10).                                             
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(17).                                             
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(8).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(10).                                             
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0066O REDEFINES BPA0066I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVBNRH    PICTURE X.                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EZIELSTH    PICTURE X.                                           
           02  EZIELSTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKOJAHRH    PICTURE X.                                           
           02  EKOJAHRO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAENVTTH    PICTURE X.                                           
           02  EAENVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAENVMMH    PICTURE X.                                           
           02  EAENVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAENVJJH    PICTURE X.                                           
           02  EAENVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAENBTTH    PICTURE X.                                           
           02  EAENBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAENBMMH    PICTURE X.                                           
           02  EAENBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAENBJJH    PICTURE X.                                           
           02  EAENBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EINFVBMH    PICTURE X.                                           
           02  EINFVBMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EINFVBJH    PICTURE X.                                           
           02  EINFVBJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVERZSTH    PICTURE X.                                           
           02  EVERZSTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVZSTBMH    PICTURE X.                                           
           02  AVZSTBMO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSFB1H    PICTURE X.                                           
           02  AFCSFB1O  PIC X(31).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZIELSTH    PICTURE X.                                           
           02  AZIELSTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKOJAHRH    PICTURE X.                                           
           02  AKOJAHRO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAENDATH    PICTURE X.                                           
           02  AAENDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVARBZSH    PICTURE X.                                           
           02  AVARBZSO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALTBVONH    PICTURE X.                                           
           02  ALTBVONO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAMH    PICTURE X.                                            
           02  ALTBAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR2H    PICTURE X.                                            
           02  AVBNR2O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ2H    PICTURE X.                                           
           02  AKORRJ2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM2H    PICTURE X.                                           
           02  ALTBAM2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR3H    PICTURE X.                                            
           02  AVBNR3O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ3H    PICTURE X.                                           
           02  AKORRJ3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM3H    PICTURE X.                                           
           02  ALTBAM3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR4H    PICTURE X.                                            
           02  AVBNR4O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ4H    PICTURE X.                                           
           02  AKORRJ4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM4H    PICTURE X.                                           
           02  ALTBAM4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR5H    PICTURE X.                                            
           02  AVBNR5O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ5H    PICTURE X.                                           
           02  AKORRJ5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM5H    PICTURE X.                                           
           02  ALTBAM5O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR6H    PICTURE X.                                            
           02  AVBNR6O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ6H    PICTURE X.                                           
           02  AKORRJ6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM6H    PICTURE X.                                           
           02  ALTBAM6O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR7H    PICTURE X.                                            
           02  AVBNR7O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ7H    PICTURE X.                                           
           02  AKORRJ7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM7H    PICTURE X.                                           
           02  ALTBAM7O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR8H    PICTURE X.                                            
           02  AVBNR8O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ8H    PICTURE X.                                           
           02  AKORRJ8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM8H    PICTURE X.                                           
           02  ALTBAM8O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR9H    PICTURE X.                                            
           02  AVBNR9O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKORRJ9H    PICTURE X.                                           
           02  AKORRJ9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALTBAM9H    PICTURE X.                                           
           02  ALTBAM9O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNR92H    PICTURE X.                                           
           02  AVBNR92O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
