       01  BPA0051I.                                                            
           02  FILLER PIC X(12).                                                
           02  ASTAPEGL    COMP  PIC  S9(4).                                    
           02  ASTAPEGF    PICTURE X.                                           
           02  FILLER REDEFINES ASTAPEGF.                                       
             03 ASTAPEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTAPEGI  PIC X(1).                                              
           02  ASTAPVWL    COMP  PIC  S9(4).                                    
           02  ASTAPVWF    PICTURE X.                                           
           02  FILLER REDEFINES ASTAPVWF.                                       
             03 ASTAPVWA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTAPVWI  PIC X(1).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EVGESL    COMP  PIC  S9(4).                                      
           02  EVGESF    PICTURE X.                                             
           02  FILLER REDEFINES EVGESF.                                         
             03 EVGESA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVGESI  PIC X(1).                                                
           02  AVGESBML    COMP  PIC  S9(4).                                    
           02  AVGESBMF    PICTURE X.                                           
           02  FILLER REDEFINES AVGESBMF.                                       
             03 AVGESBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVGESBMI  PIC X(4).                                              
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSTXTL    COMP  PIC  S9(4).                                    
           02  AFCSTXTF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSTXTF.                                       
             03 AFCSTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSTXTI  PIC X(17).                                             
           02  AMAABRDL    COMP  PIC  S9(4).                                    
           02  AMAABRDF    PICTURE X.                                           
           02  FILLER REDEFINES AMAABRDF.                                       
             03 AMAABRDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMAABRDI  PIC X(10).                                             
           02  AABRDATL    COMP  PIC  S9(4).                                    
           02  AABRDATF    PICTURE X.                                           
           02  FILLER REDEFINES AABRDATF.                                       
             03 AABRDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRDATI  PIC X(10).                                             
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AZINFOL    COMP  PIC  S9(4).                                     
           02  AZINFOF    PICTURE X.                                            
           02  FILLER REDEFINES AZINFOF.                                        
             03 AZINFOA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZINFOI  PIC X(1).                                               
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBEZL    COMP  PIC  S9(4).                                    
           02  AGESBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AGESBEZF.                                       
             03 AGESBEZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGESBEZI  PIC X(10).                                             
           02  AZSTL    COMP  PIC  S9(4).                                       
           02  AZSTF    PICTURE X.                                              
           02  FILLER REDEFINES AZSTF.                                          
             03 AZSTA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AZSTI  PIC X(10).                                                
           02  APGANZL    COMP  PIC  S9(4).                                     
           02  APGANZF    PICTURE X.                                            
           02  FILLER REDEFINES APGANZF.                                        
             03 APGANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APGANZI  PIC X(5).                                               
           02  AMANANZL    COMP  PIC  S9(4).                                    
           02  AMANANZF    PICTURE X.                                           
           02  FILLER REDEFINES AMANANZF.                                       
             03 AMANANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMANANZI  PIC X(5).                                              
           02  APRBETRL    COMP  PIC  S9(4).                                    
           02  APRBETRF    PICTURE X.                                           
           02  FILLER REDEFINES APRBETRF.                                       
             03 APRBETRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRBETRI  PIC X(15).                                             
           02  AANZUBL    COMP  PIC  S9(4).                                     
           02  AANZUBF    PICTURE X.                                            
           02  FILLER REDEFINES AANZUBF.                                        
             03 AANZUBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AANZUBI  PIC X(7).                                               
           02  ESTAPEGL    COMP  PIC  S9(4).                                    
           02  ESTAPEGF    PICTURE X.                                           
           02  FILLER REDEFINES ESTAPEGF.                                       
             03 ESTAPEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESTAPEGI  PIC X(1).                                              
           02  ESTAPVWL    COMP  PIC  S9(4).                                    
           02  ESTAPVWF    PICTURE X.                                           
           02  FILLER REDEFINES ESTAPVWF.                                       
             03 ESTAPVWA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESTAPVWI  PIC X(1).                                              
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AZINFO2L    COMP  PIC  S9(4).                                    
           02  AZINFO2F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO2F.                                       
             03 AZINFO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO2I  PIC X(1).                                              
           02  AGES2L    COMP  PIC  S9(4).                                      
           02  AGES2F    PICTURE X.                                             
           02  FILLER REDEFINES AGES2F.                                         
             03 AGES2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES2I  PIC X(2).                                                
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(10).                                             
           02  AZST2L    COMP  PIC  S9(4).                                      
           02  AZST2F    PICTURE X.                                             
           02  FILLER REDEFINES AZST2F.                                         
             03 AZST2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST2I  PIC X(10).                                               
           02  APGANZ2L    COMP  PIC  S9(4).                                    
           02  APGANZ2F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ2F.                                       
             03 APGANZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ2I  PIC X(5).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(5).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(15).                                             
           02  AANZUB2L    COMP  PIC  S9(4).                                    
           02  AANZUB2F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB2F.                                       
             03 AANZUB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB2I  PIC X(7).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(1).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(1).                                              
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AZINFO3L    COMP  PIC  S9(4).                                    
           02  AZINFO3F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO3F.                                       
             03 AZINFO3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO3I  PIC X(1).                                              
           02  AGES3L    COMP  PIC  S9(4).                                      
           02  AGES3F    PICTURE X.                                             
           02  FILLER REDEFINES AGES3F.                                         
             03 AGES3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES3I  PIC X(2).                                                
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  AZST3L    COMP  PIC  S9(4).                                      
           02  AZST3F    PICTURE X.                                             
           02  FILLER REDEFINES AZST3F.                                         
             03 AZST3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST3I  PIC X(10).                                               
           02  APGANZ3L    COMP  PIC  S9(4).                                    
           02  APGANZ3F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ3F.                                       
             03 APGANZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ3I  PIC X(5).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(5).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(15).                                             
           02  AANZUB3L    COMP  PIC  S9(4).                                    
           02  AANZUB3F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB3F.                                       
             03 AANZUB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB3I  PIC X(7).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(1).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(1).                                              
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AZINFO4L    COMP  PIC  S9(4).                                    
           02  AZINFO4F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO4F.                                       
             03 AZINFO4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO4I  PIC X(1).                                              
           02  AGES4L    COMP  PIC  S9(4).                                      
           02  AGES4F    PICTURE X.                                             
           02  FILLER REDEFINES AGES4F.                                         
             03 AGES4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES4I  PIC X(2).                                                
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  AZST4L    COMP  PIC  S9(4).                                      
           02  AZST4F    PICTURE X.                                             
           02  FILLER REDEFINES AZST4F.                                         
             03 AZST4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST4I  PIC X(10).                                               
           02  APGANZ4L    COMP  PIC  S9(4).                                    
           02  APGANZ4F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ4F.                                       
             03 APGANZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ4I  PIC X(5).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(5).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(15).                                             
           02  AANZUB4L    COMP  PIC  S9(4).                                    
           02  AANZUB4F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB4F.                                       
             03 AANZUB4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB4I  PIC X(7).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(1).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(1).                                              
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AZINFO5L    COMP  PIC  S9(4).                                    
           02  AZINFO5F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO5F.                                       
             03 AZINFO5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO5I  PIC X(1).                                              
           02  AGES5L    COMP  PIC  S9(4).                                      
           02  AGES5F    PICTURE X.                                             
           02  FILLER REDEFINES AGES5F.                                         
             03 AGES5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES5I  PIC X(2).                                                
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(10).                                             
           02  AZST5L    COMP  PIC  S9(4).                                      
           02  AZST5F    PICTURE X.                                             
           02  FILLER REDEFINES AZST5F.                                         
             03 AZST5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST5I  PIC X(10).                                               
           02  APGANZ5L    COMP  PIC  S9(4).                                    
           02  APGANZ5F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ5F.                                       
             03 APGANZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ5I  PIC X(5).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(5).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(15).                                             
           02  AANZUB5L    COMP  PIC  S9(4).                                    
           02  AANZUB5F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB5F.                                       
             03 AANZUB5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB5I  PIC X(7).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(1).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(1).                                              
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AZINFO6L    COMP  PIC  S9(4).                                    
           02  AZINFO6F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO6F.                                       
             03 AZINFO6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO6I  PIC X(1).                                              
           02  AGES6L    COMP  PIC  S9(4).                                      
           02  AGES6F    PICTURE X.                                             
           02  FILLER REDEFINES AGES6F.                                         
             03 AGES6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES6I  PIC X(2).                                                
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(10).                                             
           02  AZST6L    COMP  PIC  S9(4).                                      
           02  AZST6F    PICTURE X.                                             
           02  FILLER REDEFINES AZST6F.                                         
             03 AZST6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST6I  PIC X(10).                                               
           02  APGANZ6L    COMP  PIC  S9(4).                                    
           02  APGANZ6F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ6F.                                       
             03 APGANZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ6I  PIC X(5).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(5).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(15).                                             
           02  AANZUB6L    COMP  PIC  S9(4).                                    
           02  AANZUB6F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB6F.                                       
             03 AANZUB6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB6I  PIC X(7).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(1).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(1).                                              
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AZINFO7L    COMP  PIC  S9(4).                                    
           02  AZINFO7F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO7F.                                       
             03 AZINFO7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO7I  PIC X(1).                                              
           02  AGES7L    COMP  PIC  S9(4).                                      
           02  AGES7F    PICTURE X.                                             
           02  FILLER REDEFINES AGES7F.                                         
             03 AGES7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES7I  PIC X(2).                                                
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(10).                                             
           02  AZST7L    COMP  PIC  S9(4).                                      
           02  AZST7F    PICTURE X.                                             
           02  FILLER REDEFINES AZST7F.                                         
             03 AZST7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST7I  PIC X(10).                                               
           02  APGANZ7L    COMP  PIC  S9(4).                                    
           02  APGANZ7F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ7F.                                       
             03 APGANZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ7I  PIC X(5).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(5).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(15).                                             
           02  AANZUB7L    COMP  PIC  S9(4).                                    
           02  AANZUB7F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB7F.                                       
             03 AANZUB7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB7I  PIC X(7).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(1).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(1).                                              
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AZINFO8L    COMP  PIC  S9(4).                                    
           02  AZINFO8F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO8F.                                       
             03 AZINFO8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO8I  PIC X(1).                                              
           02  AGES8L    COMP  PIC  S9(4).                                      
           02  AGES8F    PICTURE X.                                             
           02  FILLER REDEFINES AGES8F.                                         
             03 AGES8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES8I  PIC X(2).                                                
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  AZST8L    COMP  PIC  S9(4).                                      
           02  AZST8F    PICTURE X.                                             
           02  FILLER REDEFINES AZST8F.                                         
             03 AZST8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST8I  PIC X(10).                                               
           02  APGANZ8L    COMP  PIC  S9(4).                                    
           02  APGANZ8F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ8F.                                       
             03 APGANZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ8I  PIC X(5).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(5).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(15).                                             
           02  AANZUB8L    COMP  PIC  S9(4).                                    
           02  AANZUB8F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB8F.                                       
             03 AANZUB8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB8I  PIC X(7).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(1).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(1).                                              
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AZINFO9L    COMP  PIC  S9(4).                                    
           02  AZINFO9F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO9F.                                       
             03 AZINFO9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO9I  PIC X(1).                                              
           02  AGES9L    COMP  PIC  S9(4).                                      
           02  AGES9F    PICTURE X.                                             
           02  FILLER REDEFINES AGES9F.                                         
             03 AGES9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES9I  PIC X(2).                                                
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(10).                                             
           02  AZST9L    COMP  PIC  S9(4).                                      
           02  AZST9F    PICTURE X.                                             
           02  FILLER REDEFINES AZST9F.                                         
             03 AZST9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZST9I  PIC X(10).                                               
           02  APGANZ9L    COMP  PIC  S9(4).                                    
           02  APGANZ9F    PICTURE X.                                           
           02  FILLER REDEFINES APGANZ9F.                                       
             03 APGANZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGANZ9I  PIC X(5).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(5).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(15).                                             
           02  AANZUB9L    COMP  PIC  S9(4).                                    
           02  AANZUB9F    PICTURE X.                                           
           02  FILLER REDEFINES AANZUB9F.                                       
             03 AANZUB9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZUB9I  PIC X(7).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(1).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(1).                                              
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(1).                                              
           02  AGES92L    COMP  PIC  S9(4).                                     
           02  AGES92F    PICTURE X.                                            
           02  FILLER REDEFINES AGES92F.                                        
             03 AGES92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGES92I  PIC X(2).                                               
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(10).                                             
           02  AZST92L    COMP  PIC  S9(4).                                     
           02  AZST92F    PICTURE X.                                            
           02  FILLER REDEFINES AZST92F.                                        
             03 AZST92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZST92I  PIC X(10).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(5).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(5).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(15).                                             
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(7).                                              
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(1).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(1).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0051O REDEFINES BPA0051I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTAPEGH    PICTURE X.                                           
           02  ASTAPEGO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTAPVWH    PICTURE X.                                           
           02  ASTAPVWO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVGESH    PICTURE X.                                             
           02  EVGESO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVGESBMH    PICTURE X.                                           
           02  AVGESBMO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSTXTH    PICTURE X.                                           
           02  AFCSTXTO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  AMAABRDH    PICTURE X.                                           
           02  AMAABRDO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRDATH    PICTURE X.                                           
           02  AABRDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFOH    PICTURE X.                                            
           02  AZINFOO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBEZH    PICTURE X.                                           
           02  AGESBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZSTH    PICTURE X.                                              
           02  AZSTO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  APGANZH    PICTURE X.                                            
           02  APGANZO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMANANZH    PICTURE X.                                           
           02  AMANANZO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRBETRH    PICTURE X.                                           
           02  APRBETRO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUBH    PICTURE X.                                            
           02  AANZUBO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTAPEGH    PICTURE X.                                           
           02  ESTAPEGO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTAPVWH    PICTURE X.                                           
           02  ESTAPVWO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO2H    PICTURE X.                                           
           02  AZINFO2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES2H    PICTURE X.                                             
           02  AGES2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST2H    PICTURE X.                                             
           02  AZST2O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ2H    PICTURE X.                                           
           02  APGANZ2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB2H    PICTURE X.                                           
           02  AANZUB2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO3H    PICTURE X.                                           
           02  AZINFO3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES3H    PICTURE X.                                             
           02  AGES3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST3H    PICTURE X.                                             
           02  AZST3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ3H    PICTURE X.                                           
           02  APGANZ3O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB3H    PICTURE X.                                           
           02  AANZUB3O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO4H    PICTURE X.                                           
           02  AZINFO4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES4H    PICTURE X.                                             
           02  AGES4O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST4H    PICTURE X.                                             
           02  AZST4O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ4H    PICTURE X.                                           
           02  APGANZ4O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB4H    PICTURE X.                                           
           02  AANZUB4O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO5H    PICTURE X.                                           
           02  AZINFO5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES5H    PICTURE X.                                             
           02  AGES5O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST5H    PICTURE X.                                             
           02  AZST5O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ5H    PICTURE X.                                           
           02  APGANZ5O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB5H    PICTURE X.                                           
           02  AANZUB5O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO6H    PICTURE X.                                           
           02  AZINFO6O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES6H    PICTURE X.                                             
           02  AGES6O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST6H    PICTURE X.                                             
           02  AZST6O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ6H    PICTURE X.                                           
           02  APGANZ6O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB6H    PICTURE X.                                           
           02  AANZUB6O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO7H    PICTURE X.                                           
           02  AZINFO7O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES7H    PICTURE X.                                             
           02  AGES7O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST7H    PICTURE X.                                             
           02  AZST7O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ7H    PICTURE X.                                           
           02  APGANZ7O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB7H    PICTURE X.                                           
           02  AANZUB7O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO8H    PICTURE X.                                           
           02  AZINFO8O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES8H    PICTURE X.                                             
           02  AGES8O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST8H    PICTURE X.                                             
           02  AZST8O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ8H    PICTURE X.                                           
           02  APGANZ8O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB8H    PICTURE X.                                           
           02  AANZUB8O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO9H    PICTURE X.                                           
           02  AZINFO9O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES9H    PICTURE X.                                             
           02  AGES9O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST9H    PICTURE X.                                             
           02  AZST9O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGANZ9H    PICTURE X.                                           
           02  APGANZ9O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANZUB9H    PICTURE X.                                           
           02  AANZUB9O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES92H    PICTURE X.                                            
           02  AGES92O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZST92H    PICTURE X.                                            
           02  AZST92O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
