       01  BPA0010I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  AVERSL    COMP  PIC  S9(4).                                      
           02  AVERSF    PICTURE X.                                             
           02  FILLER REDEFINES AVERSF.                                         
             03 AVERSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVERSI  PIC X(2).                                                
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  AVSTEXTL    COMP  PIC  S9(4).                                    
           02  AVSTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AVSTEXTF.                                       
             03 AVSTEXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTEXTI  PIC X(40).                                             
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(57).                                             
           02  AFAEVDAL    COMP  PIC  S9(4).                                    
           02  AFAEVDAF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVDAF.                                       
             03 AFAEVDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVDAI  PIC X(10).                                             
           02  AFABFBL    COMP  PIC  S9(4).                                     
           02  AFABFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFABFBF.                                        
             03 AFABFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFABFBI  PIC X(6).                                               
           02  AFAEBDAL    COMP  PIC  S9(4).                                    
           02  AFAEBDAF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBDAF.                                       
             03 AFAEBDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBDAI  PIC X(10).                                             
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AKUNDNLL    COMP  PIC  S9(4).                                    
           02  AKUNDNLF    PICTURE X.                                           
           02  FILLER REDEFINES AKUNDNLF.                                       
             03 AKUNDNLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKUNDNLI  PIC X(45).                                             
           02  AVBEGDAL    COMP  PIC  S9(4).                                    
           02  AVBEGDAF    PICTURE X.                                           
           02  FILLER REDEFINES AVBEGDAF.                                       
             03 AVBEGDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBEGDAI  PIC X(10).                                             
           02  AABREDAL    COMP  PIC  S9(4).                                    
           02  AABREDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABREDAF.                                       
             03 AABREDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREDAI  PIC X(10).                                             
           02  AVENDFBL    COMP  PIC  S9(4).                                    
           02  AVENDFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVENDFBF.                                       
             03 AVENDFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVENDFBI  PIC X(13).                                             
           02  AVENDDAL    COMP  PIC  S9(4).                                    
           02  AVENDDAF    PICTURE X.                                           
           02  FILLER REDEFINES AVENDDAF.                                       
             03 AVENDDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVENDDAI  PIC X(10).                                             
           02  AEINDFBL    COMP  PIC  S9(4).                                    
           02  AEINDFBF    PICTURE X.                                           
           02  FILLER REDEFINES AEINDFBF.                                       
             03 AEINDFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINDFBI  PIC X(16).                                             
           02  AEINLDAL    COMP  PIC  S9(4).                                    
           02  AEINLDAF    PICTURE X.                                           
           02  FILLER REDEFINES AEINLDAF.                                       
             03 AEINLDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINLDAI  PIC X(10).                                             
           02  AZHLWFBL    COMP  PIC  S9(4).                                    
           02  AZHLWFBF    PICTURE X.                                           
           02  FILLER REDEFINES AZHLWFBF.                                       
             03 AZHLWFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZHLWFBI  PIC X(10).                                             
           02  AZAHLWL    COMP  PIC  S9(4).                                     
           02  AZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES AZAHLWF.                                        
             03 AZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZAHLWI  PIC X(2).                                               
           02  AZWTEXTL    COMP  PIC  S9(4).                                    
           02  AZWTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AZWTEXTF.                                       
             03 AZWTEXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZWTEXTI  PIC X(10).                                             
           02  APRODFBL    COMP  PIC  S9(4).                                    
           02  APRODFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRODFBF.                                       
             03 APRODFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODFBI  PIC X(17).                                             
           02  APRODSPL    COMP  PIC  S9(4).                                    
           02  APRODSPF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSPF.                                       
             03 APRODSPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSPI  PIC X(18).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(17).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(18).                                             
           02  AVVNRFBL    COMP  PIC  S9(4).                                    
           02  AVVNRFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVVNRFBF.                                       
             03 AVVNRFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVVNRFBI  PIC X(17).                                             
           02  AVVNRL    COMP  PIC  S9(4).                                      
           02  AVVNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVVNRF.                                         
             03 AVVNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVVNRI  PIC X(18).                                               
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(17).                                             
           02  AVVNR2L    COMP  PIC  S9(4).                                     
           02  AVVNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR2F.                                        
             03 AVVNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR2I  PIC X(18).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(17).                                             
           02  AVVNR3L    COMP  PIC  S9(4).                                     
           02  AVVNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR3F.                                        
             03 AVVNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR3I  PIC X(18).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(17).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(18).                                             
           02  ALUPUIDL    COMP  PIC  S9(4).                                    
           02  ALUPUIDF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPUIDF.                                       
             03 ALUPUIDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPUIDI  PIC X(8).                                              
           02  ALUPDDAL    COMP  PIC  S9(4).                                    
           02  ALUPDDAF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPDDAF.                                       
             03 ALUPDDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPDDAI  PIC X(10).                                             
           02  ALUPDTIL    COMP  PIC  S9(4).                                    
           02  ALUPDTIF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPDTIF.                                       
             03 ALUPDTIA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPDTII  PIC X(10).                                             
       01  BPA0010O REDEFINES BPA0010I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVERSH    PICTURE X.                                             
           02  AVERSO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTEXTH    PICTURE X.                                           
           02  AVSTEXTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(57).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFAEVDAH    PICTURE X.                                           
           02  AFAEVDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFABFBH    PICTURE X.                                            
           02  AFABFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEBDAH    PICTURE X.                                           
           02  AFAEBDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AKUNDNLH    PICTURE X.                                           
           02  AKUNDNLO  PIC X(45).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBEGDAH    PICTURE X.                                           
           02  AVBEGDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABREDAH    PICTURE X.                                           
           02  AABREDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVENDFBH    PICTURE X.                                           
           02  AVENDFBO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVENDDAH    PICTURE X.                                           
           02  AVENDDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINDFBH    PICTURE X.                                           
           02  AEINDFBO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINLDAH    PICTURE X.                                           
           02  AEINLDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZHLWFBH    PICTURE X.                                           
           02  AZHLWFBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZAHLWH    PICTURE X.                                            
           02  AZAHLWO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AZWTEXTH    PICTURE X.                                           
           02  AZWTEXTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRODFBH    PICTURE X.                                           
           02  APRODFBO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRODSPH    PICTURE X.                                           
           02  APRODSPO  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVVNRFBH    PICTURE X.                                           
           02  AVVNRFBO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVVNRH    PICTURE X.                                             
           02  AVVNRO  PIC X(18).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVVNR2H    PICTURE X.                                            
           02  AVVNR2O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVVNR3H    PICTURE X.                                            
           02  AVVNR3O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALUPUIDH    PICTURE X.                                           
           02  ALUPUIDO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALUPDDAH    PICTURE X.                                           
           02  ALUPDDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALUPDTIH    PICTURE X.                                           
           02  ALUPDTIO  PIC X(10).                                             
