       01  BPA0030I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EDTAARTL    COMP  PIC  S9(4).                                    
           02  EDTAARTF    PICTURE X.                                           
           02  FILLER REDEFINES EDTAARTF.                                       
             03 EDTAARTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EDTAARTI  PIC X(3).                                              
           02  ADARTBML    COMP  PIC  S9(4).                                    
           02  ADARTBMF    PICTURE X.                                           
           02  FILLER REDEFINES ADARTBMF.                                       
             03 ADARTBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADARTBMI  PIC X(10).                                             
           02  AFREIGAL    COMP  PIC  S9(4).                                    
           02  AFREIGAF    PICTURE X.                                           
           02  FILLER REDEFINES AFREIGAF.                                       
             03 AFREIGAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFREIGAI  PIC X(1).                                              
           02  EFREIGAL    COMP  PIC  S9(4).                                    
           02  EFREIGAF    PICTURE X.                                           
           02  FILLER REDEFINES EFREIGAF.                                       
             03 EFREIGAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFREIGAI  PIC X(1).                                              
           02  AANZFEHL    COMP  PIC  S9(4).                                    
           02  AANZFEHF    PICTURE X.                                           
           02  FILLER REDEFINES AANZFEHF.                                       
             03 AANZFEHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZFEHI  PIC X(9).                                              
           02  EANZFEHL    COMP  PIC  S9(4).                                    
           02  EANZFEHF    PICTURE X.                                           
           02  FILLER REDEFINES EANZFEHF.                                       
             03 EANZFEHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EANZFEHI  PIC X(9).                                              
           02  APSATZL    COMP  PIC  S9(4).                                     
           02  APSATZF    PICTURE X.                                            
           02  FILLER REDEFINES APSATZF.                                        
             03 APSATZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APSATZI  PIC X(5).                                               
           02  EPSATZL    COMP  PIC  S9(4).                                     
           02  EPSATZF    PICTURE X.                                            
           02  FILLER REDEFINES EPSATZF.                                        
             03 EPSATZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPSATZI  PIC X(5).                                               
       01  BPA0030O REDEFINES BPA0030I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDTAARTH    PICTURE X.                                           
           02  EDTAARTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADARTBMH    PICTURE X.                                           
           02  ADARTBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFREIGAH    PICTURE X.                                           
           02  AFREIGAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFREIGAH    PICTURE X.                                           
           02  EFREIGAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AANZFEHH    PICTURE X.                                           
           02  AANZFEHO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZFEHH    PICTURE X.                                           
           02  EANZFEHO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  APSATZH    PICTURE X.                                            
           02  APSATZO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPSATZH    PICTURE X.                                            
           02  EPSATZO  PIC X(5).                                               
