       01  BPA0049I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(9).                                               
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EUNRL    COMP  PIC  S9(4).                                       
           02  EUNRF    PICTURE X.                                              
           02  FILLER REDEFINES EUNRF.                                          
             03 EUNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EUNRI  PIC X(3).                                                 
           02  ESCHICHL    COMP  PIC  S9(4).                                    
           02  ESCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHICHF.                                       
             03 ESCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESCHICHI  PIC X(3).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EPRODSLL    COMP  PIC  S9(4).                                    
           02  EPRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES EPRODSLF.                                       
             03 EPRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPRODSLI  PIC X(3).                                              
           02  APRODBML    COMP  PIC  S9(4).                                    
           02  APRODBMF    PICTURE X.                                           
           02  FILLER REDEFINES APRODBMF.                                       
             03 APRODBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODBMI  PIC X(10).                                             
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  EFAEBTTL    COMP  PIC  S9(4).                                    
           02  EFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBTTF.                                       
             03 EFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBTTI  PIC X(2).                                              
           02  EFAEBMML    COMP  PIC  S9(4).                                    
           02  EFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBMMF.                                       
             03 EFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBMMI  PIC X(2).                                              
           02  EFAEBJJL    COMP  PIC  S9(4).                                    
           02  EFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBJJF.                                       
             03 EFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBJJI  PIC X(4).                                              
           02  EFOLGNRL    COMP  PIC  S9(4).                                    
           02  EFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EFOLGNRF.                                       
             03 EFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFOLGNRI  PIC X(3).                                              
           02  EABRVMML    COMP  PIC  S9(4).                                    
           02  EABRVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABRVMMF.                                       
             03 EABRVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRVMMI  PIC X(2).                                              
           02  EABRVJJL    COMP  PIC  S9(4).                                    
           02  EABRVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABRVJJF.                                       
             03 EABRVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRVJJI  PIC X(4).                                              
           02  EABRBMML    COMP  PIC  S9(4).                                    
           02  EABRBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABRBMMF.                                       
             03 EABRBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRBMMI  PIC X(2).                                              
           02  EABRBJJL    COMP  PIC  S9(4).                                    
           02  EABRBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABRBJJF.                                       
             03 EABRBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRBJJI  PIC X(4).                                              
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(17).                                             
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  APRFB1L    COMP  PIC  S9(4).                                     
           02  APRFB1F    PICTURE X.                                            
           02  FILLER REDEFINES APRFB1F.                                        
             03 APRFB1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APRFB1I  PIC X(4).                                               
           02  AORDFB1L    COMP  PIC  S9(4).                                    
           02  AORDFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AORDFB1F.                                       
             03 AORDFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDFB1I  PIC X(3).                                              
           02  AFAVFB1L    COMP  PIC  S9(4).                                    
           02  AFAVFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AFAVFB1F.                                       
             03 AFAVFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAVFB1I  PIC X(6).                                              
           02  AGPBFB1L    COMP  PIC  S9(4).                                    
           02  AGPBFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AGPBFB1F.                                       
             03 AGPBFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPBFB1I  PIC X(12).                                             
           02  AVSTFB1L    COMP  PIC  S9(4).                                    
           02  AVSTFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTFB1F.                                       
             03 AVSTFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTFB1I  PIC X(11).                                             
           02  AABRFB1L    COMP  PIC  S9(4).                                    
           02  AABRFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AABRFB1F.                                       
             03 AABRFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRFB1I  PIC X(4).                                              
           02  AEINFB1L    COMP  PIC  S9(4).                                    
           02  AEINFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AEINFB1F.                                       
             03 AEINFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINFB1I  PIC X(13).                                             
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  AZINFOL    COMP  PIC  S9(4).                                     
           02  AZINFOF    PICTURE X.                                            
           02  FILLER REDEFINES AZINFOF.                                        
             03 AZINFOA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZINFOI  PIC X(2).                                               
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  AORDNRL    COMP  PIC  S9(4).                                     
           02  AORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES AORDNRF.                                        
             03 AORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AORDNRI  PIC X(2).                                               
           02  AFAEVONL    COMP  PIC  S9(4).                                    
           02  AFAEVONF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVONF.                                       
             03 AFAEVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVONI  PIC X(10).                                             
           02  AGESBTRL    COMP  PIC  S9(4).                                    
           02  AGESBTRF    PICTURE X.                                           
           02  FILLER REDEFINES AGESBTRF.                                       
             03 AGESBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGESBTRI  PIC X(13).                                             
           02  ANETBTRL    COMP  PIC  S9(4).                                    
           02  ANETBTRF    PICTURE X.                                           
           02  FILLER REDEFINES ANETBTRF.                                       
             03 ANETBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBTRI  PIC X(13).                                             
           02  AUSTSTZL    COMP  PIC  S9(4).                                    
           02  AUSTSTZF    PICTURE X.                                           
           02  FILLER REDEFINES AUSTSTZF.                                       
             03 AUSTSTZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUSTSTZI  PIC X(7).                                              
           02  AUSTBTRL    COMP  PIC  S9(4).                                    
           02  AUSTBTRF    PICTURE X.                                           
           02  FILLER REDEFINES AUSTBTRF.                                       
             03 AUSTBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUSTBTRI  PIC X(13).                                             
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  AZINFO2L    COMP  PIC  S9(4).                                    
           02  AZINFO2F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO2F.                                       
             03 AZINFO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO2I  PIC X(2).                                              
           02  F000060L    COMP  PIC  S9(4).                                    
           02  F000060F    PICTURE X.                                           
           02  FILLER REDEFINES F000060F.                                       
             03 F000060A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000060I  PIC X(3).                                              
           02  AORDNR2L    COMP  PIC  S9(4).                                    
           02  AORDNR2F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR2F.                                       
             03 AORDNR2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR2I  PIC X(2).                                              
           02  F000059L    COMP  PIC  S9(4).                                    
           02  F000059F    PICTURE X.                                           
           02  FILLER REDEFINES F000059F.                                       
             03 F000059A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000059I  PIC X(10).                                             
           02  F000058L    COMP  PIC  S9(4).                                    
           02  F000058F    PICTURE X.                                           
           02  FILLER REDEFINES F000058F.                                       
             03 F000058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000058I  PIC X(13).                                             
           02  F000057L    COMP  PIC  S9(4).                                    
           02  F000057F    PICTURE X.                                           
           02  FILLER REDEFINES F000057F.                                       
             03 F000057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000057I  PIC X(13).                                             
           02  F000056L    COMP  PIC  S9(4).                                    
           02  F000056F    PICTURE X.                                           
           02  FILLER REDEFINES F000056F.                                       
             03 F000056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000056I  PIC X(7).                                              
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(13).                                             
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  AZINFO3L    COMP  PIC  S9(4).                                    
           02  AZINFO3F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO3F.                                       
             03 AZINFO3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO3I  PIC X(2).                                              
           02  F000066L    COMP  PIC  S9(4).                                    
           02  F000066F    PICTURE X.                                           
           02  FILLER REDEFINES F000066F.                                       
             03 F000066A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000066I  PIC X(3).                                              
           02  AORDNR3L    COMP  PIC  S9(4).                                    
           02  AORDNR3F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR3F.                                       
             03 AORDNR3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR3I  PIC X(2).                                              
           02  F000065L    COMP  PIC  S9(4).                                    
           02  F000065F    PICTURE X.                                           
           02  FILLER REDEFINES F000065F.                                       
             03 F000065A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000065I  PIC X(10).                                             
           02  F000064L    COMP  PIC  S9(4).                                    
           02  F000064F    PICTURE X.                                           
           02  FILLER REDEFINES F000064F.                                       
             03 F000064A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000064I  PIC X(13).                                             
           02  F000063L    COMP  PIC  S9(4).                                    
           02  F000063F    PICTURE X.                                           
           02  FILLER REDEFINES F000063F.                                       
             03 F000063A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000063I  PIC X(13).                                             
           02  F000062L    COMP  PIC  S9(4).                                    
           02  F000062F    PICTURE X.                                           
           02  FILLER REDEFINES F000062F.                                       
             03 F000062A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000062I  PIC X(7).                                              
           02  F000061L    COMP  PIC  S9(4).                                    
           02  F000061F    PICTURE X.                                           
           02  FILLER REDEFINES F000061F.                                       
             03 F000061A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000061I  PIC X(13).                                             
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC4I  PIC X(1).                                                 
           02  AZINFO4L    COMP  PIC  S9(4).                                    
           02  AZINFO4F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO4F.                                       
             03 AZINFO4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO4I  PIC X(2).                                              
           02  F000072L    COMP  PIC  S9(4).                                    
           02  F000072F    PICTURE X.                                           
           02  FILLER REDEFINES F000072F.                                       
             03 F000072A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000072I  PIC X(3).                                              
           02  AORDNR4L    COMP  PIC  S9(4).                                    
           02  AORDNR4F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR4F.                                       
             03 AORDNR4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR4I  PIC X(2).                                              
           02  F000071L    COMP  PIC  S9(4).                                    
           02  F000071F    PICTURE X.                                           
           02  FILLER REDEFINES F000071F.                                       
             03 F000071A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000071I  PIC X(10).                                             
           02  F000070L    COMP  PIC  S9(4).                                    
           02  F000070F    PICTURE X.                                           
           02  FILLER REDEFINES F000070F.                                       
             03 F000070A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000070I  PIC X(13).                                             
           02  F000069L    COMP  PIC  S9(4).                                    
           02  F000069F    PICTURE X.                                           
           02  FILLER REDEFINES F000069F.                                       
             03 F000069A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000069I  PIC X(13).                                             
           02  F000068L    COMP  PIC  S9(4).                                    
           02  F000068F    PICTURE X.                                           
           02  FILLER REDEFINES F000068F.                                       
             03 F000068A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000068I  PIC X(7).                                              
           02  F000067L    COMP  PIC  S9(4).                                    
           02  F000067F    PICTURE X.                                           
           02  FILLER REDEFINES F000067F.                                       
             03 F000067A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000067I  PIC X(13).                                             
           02  EFC5L    COMP  PIC  S9(4).                                       
           02  EFC5F    PICTURE X.                                              
           02  FILLER REDEFINES EFC5F.                                          
             03 EFC5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC5I  PIC X(1).                                                 
           02  AZINFO5L    COMP  PIC  S9(4).                                    
           02  AZINFO5F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO5F.                                       
             03 AZINFO5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO5I  PIC X(2).                                              
           02  F000078L    COMP  PIC  S9(4).                                    
           02  F000078F    PICTURE X.                                           
           02  FILLER REDEFINES F000078F.                                       
             03 F000078A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000078I  PIC X(3).                                              
           02  AORDNR5L    COMP  PIC  S9(4).                                    
           02  AORDNR5F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR5F.                                       
             03 AORDNR5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR5I  PIC X(2).                                              
           02  F000077L    COMP  PIC  S9(4).                                    
           02  F000077F    PICTURE X.                                           
           02  FILLER REDEFINES F000077F.                                       
             03 F000077A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000077I  PIC X(10).                                             
           02  F000076L    COMP  PIC  S9(4).                                    
           02  F000076F    PICTURE X.                                           
           02  FILLER REDEFINES F000076F.                                       
             03 F000076A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000076I  PIC X(13).                                             
           02  F000075L    COMP  PIC  S9(4).                                    
           02  F000075F    PICTURE X.                                           
           02  FILLER REDEFINES F000075F.                                       
             03 F000075A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000075I  PIC X(13).                                             
           02  F000074L    COMP  PIC  S9(4).                                    
           02  F000074F    PICTURE X.                                           
           02  FILLER REDEFINES F000074F.                                       
             03 F000074A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000074I  PIC X(7).                                              
           02  F000073L    COMP  PIC  S9(4).                                    
           02  F000073F    PICTURE X.                                           
           02  FILLER REDEFINES F000073F.                                       
             03 F000073A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000073I  PIC X(13).                                             
           02  EFC6L    COMP  PIC  S9(4).                                       
           02  EFC6F    PICTURE X.                                              
           02  FILLER REDEFINES EFC6F.                                          
             03 EFC6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC6I  PIC X(1).                                                 
           02  AZINFO6L    COMP  PIC  S9(4).                                    
           02  AZINFO6F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO6F.                                       
             03 AZINFO6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO6I  PIC X(2).                                              
           02  F000084L    COMP  PIC  S9(4).                                    
           02  F000084F    PICTURE X.                                           
           02  FILLER REDEFINES F000084F.                                       
             03 F000084A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000084I  PIC X(3).                                              
           02  AORDNR6L    COMP  PIC  S9(4).                                    
           02  AORDNR6F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR6F.                                       
             03 AORDNR6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR6I  PIC X(2).                                              
           02  F000083L    COMP  PIC  S9(4).                                    
           02  F000083F    PICTURE X.                                           
           02  FILLER REDEFINES F000083F.                                       
             03 F000083A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000083I  PIC X(10).                                             
           02  F000082L    COMP  PIC  S9(4).                                    
           02  F000082F    PICTURE X.                                           
           02  FILLER REDEFINES F000082F.                                       
             03 F000082A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000082I  PIC X(13).                                             
           02  F000081L    COMP  PIC  S9(4).                                    
           02  F000081F    PICTURE X.                                           
           02  FILLER REDEFINES F000081F.                                       
             03 F000081A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000081I  PIC X(13).                                             
           02  F000080L    COMP  PIC  S9(4).                                    
           02  F000080F    PICTURE X.                                           
           02  FILLER REDEFINES F000080F.                                       
             03 F000080A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000080I  PIC X(7).                                              
           02  F000079L    COMP  PIC  S9(4).                                    
           02  F000079F    PICTURE X.                                           
           02  FILLER REDEFINES F000079F.                                       
             03 F000079A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000079I  PIC X(13).                                             
           02  EFC7L    COMP  PIC  S9(4).                                       
           02  EFC7F    PICTURE X.                                              
           02  FILLER REDEFINES EFC7F.                                          
             03 EFC7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC7I  PIC X(1).                                                 
           02  AZINFO7L    COMP  PIC  S9(4).                                    
           02  AZINFO7F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO7F.                                       
             03 AZINFO7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO7I  PIC X(2).                                              
           02  F000090L    COMP  PIC  S9(4).                                    
           02  F000090F    PICTURE X.                                           
           02  FILLER REDEFINES F000090F.                                       
             03 F000090A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000090I  PIC X(3).                                              
           02  AORDNR7L    COMP  PIC  S9(4).                                    
           02  AORDNR7F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR7F.                                       
             03 AORDNR7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR7I  PIC X(2).                                              
           02  F000089L    COMP  PIC  S9(4).                                    
           02  F000089F    PICTURE X.                                           
           02  FILLER REDEFINES F000089F.                                       
             03 F000089A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000089I  PIC X(10).                                             
           02  F000088L    COMP  PIC  S9(4).                                    
           02  F000088F    PICTURE X.                                           
           02  FILLER REDEFINES F000088F.                                       
             03 F000088A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000088I  PIC X(13).                                             
           02  F000087L    COMP  PIC  S9(4).                                    
           02  F000087F    PICTURE X.                                           
           02  FILLER REDEFINES F000087F.                                       
             03 F000087A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000087I  PIC X(13).                                             
           02  F000086L    COMP  PIC  S9(4).                                    
           02  F000086F    PICTURE X.                                           
           02  FILLER REDEFINES F000086F.                                       
             03 F000086A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000086I  PIC X(7).                                              
           02  F000085L    COMP  PIC  S9(4).                                    
           02  F000085F    PICTURE X.                                           
           02  FILLER REDEFINES F000085F.                                       
             03 F000085A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000085I  PIC X(13).                                             
           02  EFC8L    COMP  PIC  S9(4).                                       
           02  EFC8F    PICTURE X.                                              
           02  FILLER REDEFINES EFC8F.                                          
             03 EFC8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC8I  PIC X(1).                                                 
           02  AZINFO8L    COMP  PIC  S9(4).                                    
           02  AZINFO8F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO8F.                                       
             03 AZINFO8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO8I  PIC X(2).                                              
           02  F000096L    COMP  PIC  S9(4).                                    
           02  F000096F    PICTURE X.                                           
           02  FILLER REDEFINES F000096F.                                       
             03 F000096A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000096I  PIC X(3).                                              
           02  AORDNR8L    COMP  PIC  S9(4).                                    
           02  AORDNR8F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR8F.                                       
             03 AORDNR8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR8I  PIC X(2).                                              
           02  F000095L    COMP  PIC  S9(4).                                    
           02  F000095F    PICTURE X.                                           
           02  FILLER REDEFINES F000095F.                                       
             03 F000095A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000095I  PIC X(10).                                             
           02  F000094L    COMP  PIC  S9(4).                                    
           02  F000094F    PICTURE X.                                           
           02  FILLER REDEFINES F000094F.                                       
             03 F000094A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000094I  PIC X(13).                                             
           02  F000093L    COMP  PIC  S9(4).                                    
           02  F000093F    PICTURE X.                                           
           02  FILLER REDEFINES F000093F.                                       
             03 F000093A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000093I  PIC X(13).                                             
           02  F000092L    COMP  PIC  S9(4).                                    
           02  F000092F    PICTURE X.                                           
           02  FILLER REDEFINES F000092F.                                       
             03 F000092A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000092I  PIC X(7).                                              
           02  F000091L    COMP  PIC  S9(4).                                    
           02  F000091F    PICTURE X.                                           
           02  FILLER REDEFINES F000091F.                                       
             03 F000091A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000091I  PIC X(13).                                             
           02  EFC9L    COMP  PIC  S9(4).                                       
           02  EFC9F    PICTURE X.                                              
           02  FILLER REDEFINES EFC9F.                                          
             03 EFC9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC9I  PIC X(1).                                                 
           02  AZINFO9L    COMP  PIC  S9(4).                                    
           02  AZINFO9F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO9F.                                       
             03 AZINFO9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO9I  PIC X(2).                                              
           02  F000102L    COMP  PIC  S9(4).                                    
           02  F000102F    PICTURE X.                                           
           02  FILLER REDEFINES F000102F.                                       
             03 F000102A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000102I  PIC X(3).                                              
           02  AORDNR9L    COMP  PIC  S9(4).                                    
           02  AORDNR9F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR9F.                                       
             03 AORDNR9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR9I  PIC X(2).                                              
           02  F000101L    COMP  PIC  S9(4).                                    
           02  F000101F    PICTURE X.                                           
           02  FILLER REDEFINES F000101F.                                       
             03 F000101A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000101I  PIC X(10).                                             
           02  F000100L    COMP  PIC  S9(4).                                    
           02  F000100F    PICTURE X.                                           
           02  FILLER REDEFINES F000100F.                                       
             03 F000100A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000100I  PIC X(13).                                             
           02  F000099L    COMP  PIC  S9(4).                                    
           02  F000099F    PICTURE X.                                           
           02  FILLER REDEFINES F000099F.                                       
             03 F000099A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000099I  PIC X(13).                                             
           02  F000098L    COMP  PIC  S9(4).                                    
           02  F000098F    PICTURE X.                                           
           02  FILLER REDEFINES F000098F.                                       
             03 F000098A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000098I  PIC X(7).                                              
           02  F000097L    COMP  PIC  S9(4).                                    
           02  F000097F    PICTURE X.                                           
           02  FILLER REDEFINES F000097F.                                       
             03 F000097A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000097I  PIC X(13).                                             
           02  AEINFB2L    COMP  PIC  S9(4).                                    
           02  AEINFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AEINFB2F.                                       
             03 AEINFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINFB2I  PIC X(6).                                              
           02  AABRFB2L    COMP  PIC  S9(4).                                    
           02  AABRFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AABRFB2F.                                       
             03 AABRFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRFB2I  PIC X(7).                                              
           02  AFAVFB2L    COMP  PIC  S9(4).                                    
           02  AFAVFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AFAVFB2F.                                       
             03 AFAVFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAVFB2I  PIC X(6).                                              
           02  AORDFB2L    COMP  PIC  S9(4).                                    
           02  AORDFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AORDFB2F.                                       
             03 AORDFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDFB2I  PIC X(3).                                              
           02  APRFB2L    COMP  PIC  S9(4).                                     
           02  APRFB2F    PICTURE X.                                            
           02  FILLER REDEFINES APRFB2F.                                        
             03 APRFB2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APRFB2I  PIC X(4).                                               
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0049O REDEFINES BPA0049I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EUNRH    PICTURE X.                                              
           02  EUNRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESCHICHH    PICTURE X.                                           
           02  ESCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRODSLH    PICTURE X.                                           
           02  EPRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODBMH    PICTURE X.                                           
           02  APRODBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBTTH    PICTURE X.                                           
           02  EFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBMMH    PICTURE X.                                           
           02  EFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBJJH    PICTURE X.                                           
           02  EFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFOLGNRH    PICTURE X.                                           
           02  EFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRVMMH    PICTURE X.                                           
           02  EABRVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRVJJH    PICTURE X.                                           
           02  EABRVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRBMMH    PICTURE X.                                           
           02  EABRBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRBJJH    PICTURE X.                                           
           02  EABRBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  APRFB1H    PICTURE X.                                            
           02  APRFB1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AORDFB1H    PICTURE X.                                           
           02  AORDFB1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAVFB1H    PICTURE X.                                           
           02  AFAVFB1O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGPBFB1H    PICTURE X.                                           
           02  AGPBFB1O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTFB1H    PICTURE X.                                           
           02  AVSTFB1O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRFB1H    PICTURE X.                                           
           02  AABRFB1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINFB1H    PICTURE X.                                           
           02  AEINFB1O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AZINFOH    PICTURE X.                                            
           02  AZINFOO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNRH    PICTURE X.                                            
           02  AORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVONH    PICTURE X.                                           
           02  AFAEVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGESBTRH    PICTURE X.                                           
           02  AGESBTRO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANETBTRH    PICTURE X.                                           
           02  ANETBTRO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTSTZH    PICTURE X.                                           
           02  AUSTSTZO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSTBTRH    PICTURE X.                                           
           02  AUSTBTRO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO2H    PICTURE X.                                           
           02  AZINFO2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000060H    PICTURE X.                                           
           02  F000060O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR2H    PICTURE X.                                           
           02  AORDNR2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000059H    PICTURE X.                                           
           02  F000059O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000058H    PICTURE X.                                           
           02  F000058O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000057H    PICTURE X.                                           
           02  F000057O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000056H    PICTURE X.                                           
           02  F000056O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO3H    PICTURE X.                                           
           02  AZINFO3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000066H    PICTURE X.                                           
           02  F000066O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR3H    PICTURE X.                                           
           02  AORDNR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000065H    PICTURE X.                                           
           02  F000065O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000064H    PICTURE X.                                           
           02  F000064O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000063H    PICTURE X.                                           
           02  F000063O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000062H    PICTURE X.                                           
           02  F000062O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000061H    PICTURE X.                                           
           02  F000061O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC4H    PICTURE X.                                              
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO4H    PICTURE X.                                           
           02  AZINFO4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000072H    PICTURE X.                                           
           02  F000072O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR4H    PICTURE X.                                           
           02  AORDNR4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000071H    PICTURE X.                                           
           02  F000071O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000070H    PICTURE X.                                           
           02  F000070O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000069H    PICTURE X.                                           
           02  F000069O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000068H    PICTURE X.                                           
           02  F000068O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000067H    PICTURE X.                                           
           02  F000067O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC5H    PICTURE X.                                              
           02  EFC5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO5H    PICTURE X.                                           
           02  AZINFO5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000078H    PICTURE X.                                           
           02  F000078O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR5H    PICTURE X.                                           
           02  AORDNR5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000077H    PICTURE X.                                           
           02  F000077O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000076H    PICTURE X.                                           
           02  F000076O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000075H    PICTURE X.                                           
           02  F000075O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000074H    PICTURE X.                                           
           02  F000074O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000073H    PICTURE X.                                           
           02  F000073O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC6H    PICTURE X.                                              
           02  EFC6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO6H    PICTURE X.                                           
           02  AZINFO6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000084H    PICTURE X.                                           
           02  F000084O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR6H    PICTURE X.                                           
           02  AORDNR6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000083H    PICTURE X.                                           
           02  F000083O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000082H    PICTURE X.                                           
           02  F000082O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000081H    PICTURE X.                                           
           02  F000081O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000080H    PICTURE X.                                           
           02  F000080O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000079H    PICTURE X.                                           
           02  F000079O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC7H    PICTURE X.                                              
           02  EFC7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO7H    PICTURE X.                                           
           02  AZINFO7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000090H    PICTURE X.                                           
           02  F000090O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR7H    PICTURE X.                                           
           02  AORDNR7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000089H    PICTURE X.                                           
           02  F000089O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000088H    PICTURE X.                                           
           02  F000088O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000087H    PICTURE X.                                           
           02  F000087O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000086H    PICTURE X.                                           
           02  F000086O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000085H    PICTURE X.                                           
           02  F000085O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC8H    PICTURE X.                                              
           02  EFC8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO8H    PICTURE X.                                           
           02  AZINFO8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000096H    PICTURE X.                                           
           02  F000096O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR8H    PICTURE X.                                           
           02  AORDNR8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000095H    PICTURE X.                                           
           02  F000095O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000094H    PICTURE X.                                           
           02  F000094O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000093H    PICTURE X.                                           
           02  F000093O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000092H    PICTURE X.                                           
           02  F000092O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000091H    PICTURE X.                                           
           02  F000091O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC9H    PICTURE X.                                              
           02  EFC9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO9H    PICTURE X.                                           
           02  AZINFO9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000102H    PICTURE X.                                           
           02  F000102O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR9H    PICTURE X.                                           
           02  AORDNR9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000101H    PICTURE X.                                           
           02  F000101O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000100H    PICTURE X.                                           
           02  F000100O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000099H    PICTURE X.                                           
           02  F000099O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000098H    PICTURE X.                                           
           02  F000098O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000097H    PICTURE X.                                           
           02  F000097O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINFB2H    PICTURE X.                                           
           02  AEINFB2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABRFB2H    PICTURE X.                                           
           02  AABRFB2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAVFB2H    PICTURE X.                                           
           02  AFAVFB2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDFB2H    PICTURE X.                                           
           02  AORDFB2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRFB2H    PICTURE X.                                            
           02  APRFB2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
