       01  BPA0023I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EUNRL    COMP  PIC  S9(4).                                       
           02  EUNRF    PICTURE X.                                              
           02  FILLER REDEFINES EUNRF.                                          
             03 EUNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EUNRI  PIC X(3).                                                 
           02  ESCHICHL    COMP  PIC  S9(4).                                    
           02  ESCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHICHF.                                       
             03 ESCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESCHICHI  PIC X(3).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AKENBEZL    COMP  PIC  S9(4).                                    
           02  AKENBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AKENBEZF.                                       
             03 AKENBEZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKENBEZI  PIC X(8).                                              
           02  EGELKENL    COMP  PIC  S9(4).                                    
           02  EGELKENF    PICTURE X.                                           
           02  FILLER REDEFINES EGELKENF.                                       
             03 EGELKENA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGELKENI  PIC X(6).                                              
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  AFABFB1L    COMP  PIC  S9(4).                                    
           02  AFABFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AFABFB1F.                                       
             03 AFABFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFABFB1I  PIC X(6).                                              
           02  AFBUNT1L    COMP  PIC  S9(4).                                    
           02  AFBUNT1F    PICTURE X.                                           
           02  FILLER REDEFINES AFBUNT1F.                                       
             03 AFBUNT1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBUNT1I  PIC X(7).                                              
           02  AFABFB2L    COMP  PIC  S9(4).                                    
           02  AFABFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AFABFB2F.                                       
             03 AFABFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFABFB2I  PIC X(6).                                              
           02  AFBUNT2L    COMP  PIC  S9(4).                                    
           02  AFBUNT2F    PICTURE X.                                           
           02  FILLER REDEFINES AFBUNT2F.                                       
             03 AFBUNT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBUNT2I  PIC X(7).                                              
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AZINFO2L    COMP  PIC  S9(4).                                    
           02  AZINFO2F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO2F.                                       
             03 AZINFO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO2I  PIC X(2).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(10).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(2).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(2).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(4).                                              
           02  AUNRL    COMP  PIC  S9(4).                                       
           02  AUNRF    PICTURE X.                                              
           02  FILLER REDEFINES AUNRF.                                          
             03 AUNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AUNRI  PIC X(3).                                                 
           02  ASCHICHL    COMP  PIC  S9(4).                                    
           02  ASCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ASCHICHF.                                       
             03 ASCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASCHICHI  PIC X(3).                                              
           02  EFOLGNRL    COMP  PIC  S9(4).                                    
           02  EFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EFOLGNRF.                                       
             03 EFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFOLGNRI  PIC X(3).                                              
           02  APGV2L    COMP  PIC  S9(4).                                      
           02  APGV2F    PICTURE X.                                             
           02  FILLER REDEFINES APGV2F.                                         
             03 APGV2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV2I  PIC X(4).                                                
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(13).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(4).                                              
           02  AVSTAT2L    COMP  PIC  S9(4).                                    
           02  AVSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT2F.                                       
             03 AVSTAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT2I  PIC X(4).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(3).                                              
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AZINFO3L    COMP  PIC  S9(4).                                    
           02  AZINFO3F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO3F.                                       
             03 AZINFO3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO3I  PIC X(2).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(2).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(2).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(4).                                              
           02  AUNR2L    COMP  PIC  S9(4).                                      
           02  AUNR2F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR2F.                                         
             03 AUNR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR2I  PIC X(3).                                                
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(3).                                              
           02  APGV3L    COMP  PIC  S9(4).                                      
           02  APGV3F    PICTURE X.                                             
           02  FILLER REDEFINES APGV3F.                                         
             03 APGV3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV3I  PIC X(4).                                                
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(13).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(4).                                              
           02  AVSTAT3L    COMP  PIC  S9(4).                                    
           02  AVSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT3F.                                       
             03 AVSTAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT3I  PIC X(4).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(3).                                              
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AZINFO4L    COMP  PIC  S9(4).                                    
           02  AZINFO4F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO4F.                                       
             03 AZINFO4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO4I  PIC X(2).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(10).                                             
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(2).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(2).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(4).                                              
           02  AUNR3L    COMP  PIC  S9(4).                                      
           02  AUNR3F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR3F.                                         
             03 AUNR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR3I  PIC X(3).                                                
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(3).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(3).                                              
           02  APGV4L    COMP  PIC  S9(4).                                      
           02  APGV4F    PICTURE X.                                             
           02  FILLER REDEFINES APGV4F.                                         
             03 APGV4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV4I  PIC X(4).                                                
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(13).                                             
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(4).                                              
           02  AVSTAT4L    COMP  PIC  S9(4).                                    
           02  AVSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT4F.                                       
             03 AVSTAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT4I  PIC X(4).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(3).                                              
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AZINFO5L    COMP  PIC  S9(4).                                    
           02  AZINFO5F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO5F.                                       
             03 AZINFO5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO5I  PIC X(2).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(2).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(2).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(4).                                              
           02  AUNR4L    COMP  PIC  S9(4).                                      
           02  AUNR4F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR4F.                                         
             03 AUNR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR4I  PIC X(3).                                                
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(3).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(3).                                              
           02  APGV5L    COMP  PIC  S9(4).                                      
           02  APGV5F    PICTURE X.                                             
           02  FILLER REDEFINES APGV5F.                                         
             03 APGV5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV5I  PIC X(4).                                                
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(13).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(4).                                              
           02  AVSTAT5L    COMP  PIC  S9(4).                                    
           02  AVSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT5F.                                       
             03 AVSTAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT5I  PIC X(4).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(3).                                              
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AZINFO6L    COMP  PIC  S9(4).                                    
           02  AZINFO6F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO6F.                                       
             03 AZINFO6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO6I  PIC X(2).                                              
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(10).                                             
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(2).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(2).                                              
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(4).                                              
           02  AUNR5L    COMP  PIC  S9(4).                                      
           02  AUNR5F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR5F.                                         
             03 AUNR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR5I  PIC X(3).                                                
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(3).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(3).                                              
           02  APGV6L    COMP  PIC  S9(4).                                      
           02  APGV6F    PICTURE X.                                             
           02  FILLER REDEFINES APGV6F.                                         
             03 APGV6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV6I  PIC X(4).                                                
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(13).                                             
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(4).                                              
           02  AVSTAT6L    COMP  PIC  S9(4).                                    
           02  AVSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT6F.                                       
             03 AVSTAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT6I  PIC X(4).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(3).                                              
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AZINFO7L    COMP  PIC  S9(4).                                    
           02  AZINFO7F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO7F.                                       
             03 AZINFO7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO7I  PIC X(2).                                              
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(10).                                             
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(2).                                              
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(2).                                              
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(4).                                              
           02  AUNR6L    COMP  PIC  S9(4).                                      
           02  AUNR6F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR6F.                                         
             03 AUNR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR6I  PIC X(3).                                                
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(3).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(3).                                              
           02  APGV7L    COMP  PIC  S9(4).                                      
           02  APGV7F    PICTURE X.                                             
           02  FILLER REDEFINES APGV7F.                                         
             03 APGV7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV7I  PIC X(4).                                                
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(13).                                             
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(4).                                              
           02  AVSTAT7L    COMP  PIC  S9(4).                                    
           02  AVSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT7F.                                       
             03 AVSTAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT7I  PIC X(4).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(3).                                              
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AZINFO8L    COMP  PIC  S9(4).                                    
           02  AZINFO8F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO8F.                                       
             03 AZINFO8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO8I  PIC X(2).                                              
           02  F000060L    COMP  PIC  S9(4).                                    
           02  F000060F    PICTURE X.                                           
           02  FILLER REDEFINES F000060F.                                       
             03 F000060A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000060I  PIC X(10).                                             
           02  F000059L    COMP  PIC  S9(4).                                    
           02  F000059F    PICTURE X.                                           
           02  FILLER REDEFINES F000059F.                                       
             03 F000059A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000059I  PIC X(2).                                              
           02  F000058L    COMP  PIC  S9(4).                                    
           02  F000058F    PICTURE X.                                           
           02  FILLER REDEFINES F000058F.                                       
             03 F000058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000058I  PIC X(2).                                              
           02  F000057L    COMP  PIC  S9(4).                                    
           02  F000057F    PICTURE X.                                           
           02  FILLER REDEFINES F000057F.                                       
             03 F000057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000057I  PIC X(4).                                              
           02  AUNR7L    COMP  PIC  S9(4).                                      
           02  AUNR7F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR7F.                                         
             03 AUNR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR7I  PIC X(3).                                                
           02  F000056L    COMP  PIC  S9(4).                                    
           02  F000056F    PICTURE X.                                           
           02  FILLER REDEFINES F000056F.                                       
             03 F000056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000056I  PIC X(3).                                              
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(3).                                              
           02  APGV8L    COMP  PIC  S9(4).                                      
           02  APGV8F    PICTURE X.                                             
           02  FILLER REDEFINES APGV8F.                                         
             03 APGV8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV8I  PIC X(4).                                                
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(13).                                             
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(4).                                              
           02  AVSTAT8L    COMP  PIC  S9(4).                                    
           02  AVSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT8F.                                       
             03 AVSTAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT8I  PIC X(4).                                              
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(3).                                              
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AZINFO9L    COMP  PIC  S9(4).                                    
           02  AZINFO9F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO9F.                                       
             03 AZINFO9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO9I  PIC X(2).                                              
           02  F000069L    COMP  PIC  S9(4).                                    
           02  F000069F    PICTURE X.                                           
           02  FILLER REDEFINES F000069F.                                       
             03 F000069A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000069I  PIC X(10).                                             
           02  F000068L    COMP  PIC  S9(4).                                    
           02  F000068F    PICTURE X.                                           
           02  FILLER REDEFINES F000068F.                                       
             03 F000068A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000068I  PIC X(2).                                              
           02  F000067L    COMP  PIC  S9(4).                                    
           02  F000067F    PICTURE X.                                           
           02  FILLER REDEFINES F000067F.                                       
             03 F000067A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000067I  PIC X(2).                                              
           02  F000066L    COMP  PIC  S9(4).                                    
           02  F000066F    PICTURE X.                                           
           02  FILLER REDEFINES F000066F.                                       
             03 F000066A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000066I  PIC X(4).                                              
           02  AUNR8L    COMP  PIC  S9(4).                                      
           02  AUNR8F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR8F.                                         
             03 AUNR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR8I  PIC X(3).                                                
           02  F000065L    COMP  PIC  S9(4).                                    
           02  F000065F    PICTURE X.                                           
           02  FILLER REDEFINES F000065F.                                       
             03 F000065A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000065I  PIC X(3).                                              
           02  F000064L    COMP  PIC  S9(4).                                    
           02  F000064F    PICTURE X.                                           
           02  FILLER REDEFINES F000064F.                                       
             03 F000064A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000064I  PIC X(3).                                              
           02  APGV9L    COMP  PIC  S9(4).                                      
           02  APGV9F    PICTURE X.                                             
           02  FILLER REDEFINES APGV9F.                                         
             03 APGV9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV9I  PIC X(4).                                                
           02  F000063L    COMP  PIC  S9(4).                                    
           02  F000063F    PICTURE X.                                           
           02  FILLER REDEFINES F000063F.                                       
             03 F000063A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000063I  PIC X(13).                                             
           02  F000062L    COMP  PIC  S9(4).                                    
           02  F000062F    PICTURE X.                                           
           02  FILLER REDEFINES F000062F.                                       
             03 F000062A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000062I  PIC X(4).                                              
           02  AVSTAT9L    COMP  PIC  S9(4).                                    
           02  AVSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT9F.                                       
             03 AVSTAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT9I  PIC X(4).                                              
           02  F000061L    COMP  PIC  S9(4).                                    
           02  F000061F    PICTURE X.                                           
           02  FILLER REDEFINES F000061F.                                       
             03 F000061A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000061I  PIC X(3).                                              
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  F000080L    COMP  PIC  S9(4).                                    
           02  F000080F    PICTURE X.                                           
           02  FILLER REDEFINES F000080F.                                       
             03 F000080A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000080I  PIC X(2).                                              
           02  F000079L    COMP  PIC  S9(4).                                    
           02  F000079F    PICTURE X.                                           
           02  FILLER REDEFINES F000079F.                                       
             03 F000079A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000079I  PIC X(10).                                             
           02  F000078L    COMP  PIC  S9(4).                                    
           02  F000078F    PICTURE X.                                           
           02  FILLER REDEFINES F000078F.                                       
             03 F000078A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000078I  PIC X(2).                                              
           02  F000077L    COMP  PIC  S9(4).                                    
           02  F000077F    PICTURE X.                                           
           02  FILLER REDEFINES F000077F.                                       
             03 F000077A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000077I  PIC X(2).                                              
           02  F000076L    COMP  PIC  S9(4).                                    
           02  F000076F    PICTURE X.                                           
           02  FILLER REDEFINES F000076F.                                       
             03 F000076A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000076I  PIC X(4).                                              
           02  AUNR9L    COMP  PIC  S9(4).                                      
           02  AUNR9F    PICTURE X.                                             
           02  FILLER REDEFINES AUNR9F.                                         
             03 AUNR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AUNR9I  PIC X(3).                                                
           02  F000075L    COMP  PIC  S9(4).                                    
           02  F000075F    PICTURE X.                                           
           02  FILLER REDEFINES F000075F.                                       
             03 F000075A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000075I  PIC X(3).                                              
           02  F000074L    COMP  PIC  S9(4).                                    
           02  F000074F    PICTURE X.                                           
           02  FILLER REDEFINES F000074F.                                       
             03 F000074A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000074I  PIC X(3).                                              
           02  APGV92L    COMP  PIC  S9(4).                                     
           02  APGV92F    PICTURE X.                                            
           02  FILLER REDEFINES APGV92F.                                        
             03 APGV92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APGV92I  PIC X(4).                                               
           02  F000073L    COMP  PIC  S9(4).                                    
           02  F000073F    PICTURE X.                                           
           02  FILLER REDEFINES F000073F.                                       
             03 F000073A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000073I  PIC X(13).                                             
           02  F000072L    COMP  PIC  S9(4).                                    
           02  F000072F    PICTURE X.                                           
           02  FILLER REDEFINES F000072F.                                       
             03 F000072A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000072I  PIC X(4).                                              
           02  F000071L    COMP  PIC  S9(4).                                    
           02  F000071F    PICTURE X.                                           
           02  FILLER REDEFINES F000071F.                                       
             03 F000071A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000071I  PIC X(4).                                              
           02  F000070L    COMP  PIC  S9(4).                                    
           02  F000070F    PICTURE X.                                           
           02  FILLER REDEFINES F000070F.                                       
             03 F000070A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000070I  PIC X(3).                                              
           02  EFCZ922L    COMP  PIC  S9(4).                                    
           02  EFCZ922F    PICTURE X.                                           
           02  FILLER REDEFINES EFCZ922F.                                       
             03 EFCZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ922I  PIC X(1).                                              
           02  F000091L    COMP  PIC  S9(4).                                    
           02  F000091F    PICTURE X.                                           
           02  FILLER REDEFINES F000091F.                                       
             03 F000091A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000091I  PIC X(2).                                              
           02  F000090L    COMP  PIC  S9(4).                                    
           02  F000090F    PICTURE X.                                           
           02  FILLER REDEFINES F000090F.                                       
             03 F000090A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000090I  PIC X(10).                                             
           02  F000089L    COMP  PIC  S9(4).                                    
           02  F000089F    PICTURE X.                                           
           02  FILLER REDEFINES F000089F.                                       
             03 F000089A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000089I  PIC X(2).                                              
           02  F000088L    COMP  PIC  S9(4).                                    
           02  F000088F    PICTURE X.                                           
           02  FILLER REDEFINES F000088F.                                       
             03 F000088A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000088I  PIC X(2).                                              
           02  F000087L    COMP  PIC  S9(4).                                    
           02  F000087F    PICTURE X.                                           
           02  FILLER REDEFINES F000087F.                                       
             03 F000087A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000087I  PIC X(4).                                              
           02  AUNR92L    COMP  PIC  S9(4).                                     
           02  AUNR92F    PICTURE X.                                            
           02  FILLER REDEFINES AUNR92F.                                        
             03 AUNR92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUNR92I  PIC X(3).                                               
           02  F000086L    COMP  PIC  S9(4).                                    
           02  F000086F    PICTURE X.                                           
           02  FILLER REDEFINES F000086F.                                       
             03 F000086A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000086I  PIC X(3).                                              
           02  F000085L    COMP  PIC  S9(4).                                    
           02  F000085F    PICTURE X.                                           
           02  FILLER REDEFINES F000085F.                                       
             03 F000085A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000085I  PIC X(3).                                              
           02  APGV922L    COMP  PIC  S9(4).                                    
           02  APGV922F    PICTURE X.                                           
           02  FILLER REDEFINES APGV922F.                                       
             03 APGV922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGV922I  PIC X(4).                                              
           02  F000084L    COMP  PIC  S9(4).                                    
           02  F000084F    PICTURE X.                                           
           02  FILLER REDEFINES F000084F.                                       
             03 F000084A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000084I  PIC X(13).                                             
           02  F000083L    COMP  PIC  S9(4).                                    
           02  F000083F    PICTURE X.                                           
           02  FILLER REDEFINES F000083F.                                       
             03 F000083A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000083I  PIC X(4).                                              
           02  F000082L    COMP  PIC  S9(4).                                    
           02  F000082F    PICTURE X.                                           
           02  FILLER REDEFINES F000082F.                                       
             03 F000082A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000082I  PIC X(4).                                              
           02  F000081L    COMP  PIC  S9(4).                                    
           02  F000081F    PICTURE X.                                           
           02  FILLER REDEFINES F000081F.                                       
             03 F000081A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000081I  PIC X(3).                                              
           02  F000104L    COMP  PIC  S9(4).                                    
           02  F000104F    PICTURE X.                                           
           02  FILLER REDEFINES F000104F.                                       
             03 F000104A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000104I  PIC X(1).                                              
           02  F000103L    COMP  PIC  S9(4).                                    
           02  F000103F    PICTURE X.                                           
           02  FILLER REDEFINES F000103F.                                       
             03 F000103A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000103I  PIC X(2).                                              
           02  F000102L    COMP  PIC  S9(4).                                    
           02  F000102F    PICTURE X.                                           
           02  FILLER REDEFINES F000102F.                                       
             03 F000102A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000102I  PIC X(10).                                             
           02  F000101L    COMP  PIC  S9(4).                                    
           02  F000101F    PICTURE X.                                           
           02  FILLER REDEFINES F000101F.                                       
             03 F000101A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000101I  PIC X(2).                                              
           02  F000100L    COMP  PIC  S9(4).                                    
           02  F000100F    PICTURE X.                                           
           02  FILLER REDEFINES F000100F.                                       
             03 F000100A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000100I  PIC X(2).                                              
           02  F000099L    COMP  PIC  S9(4).                                    
           02  F000099F    PICTURE X.                                           
           02  FILLER REDEFINES F000099F.                                       
             03 F000099A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000099I  PIC X(4).                                              
           02  AUNR922L    COMP  PIC  S9(4).                                    
           02  AUNR922F    PICTURE X.                                           
           02  FILLER REDEFINES AUNR922F.                                       
             03 AUNR922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUNR922I  PIC X(3).                                              
           02  F000098L    COMP  PIC  S9(4).                                    
           02  F000098F    PICTURE X.                                           
           02  FILLER REDEFINES F000098F.                                       
             03 F000098A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000098I  PIC X(3).                                              
           02  F000097L    COMP  PIC  S9(4).                                    
           02  F000097F    PICTURE X.                                           
           02  FILLER REDEFINES F000097F.                                       
             03 F000097A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000097I  PIC X(3).                                              
           02  F000096L    COMP  PIC  S9(4).                                    
           02  F000096F    PICTURE X.                                           
           02  FILLER REDEFINES F000096F.                                       
             03 F000096A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000096I  PIC X(4).                                              
           02  F000095L    COMP  PIC  S9(4).                                    
           02  F000095F    PICTURE X.                                           
           02  FILLER REDEFINES F000095F.                                       
             03 F000095A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000095I  PIC X(13).                                             
           02  F000094L    COMP  PIC  S9(4).                                    
           02  F000094F    PICTURE X.                                           
           02  FILLER REDEFINES F000094F.                                       
             03 F000094A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000094I  PIC X(4).                                              
           02  F000093L    COMP  PIC  S9(4).                                    
           02  F000093F    PICTURE X.                                           
           02  FILLER REDEFINES F000093F.                                       
             03 F000093A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000093I  PIC X(4).                                              
           02  F000092L    COMP  PIC  S9(4).                                    
           02  F000092F    PICTURE X.                                           
           02  FILLER REDEFINES F000092F.                                       
             03 F000092A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000092I  PIC X(3).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0023O REDEFINES BPA0023I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EUNRH    PICTURE X.                                              
           02  EUNRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESCHICHH    PICTURE X.                                           
           02  ESCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKENBEZH    PICTURE X.                                           
           02  AKENBEZO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGELKENH    PICTURE X.                                           
           02  EGELKENO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFABFB1H    PICTURE X.                                           
           02  AFABFB1O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFBUNT1H    PICTURE X.                                           
           02  AFBUNT1O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFABFB2H    PICTURE X.                                           
           02  AFABFB2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFBUNT2H    PICTURE X.                                           
           02  AFBUNT2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO2H    PICTURE X.                                           
           02  AZINFO2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNRH    PICTURE X.                                              
           02  AUNRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ASCHICHH    PICTURE X.                                           
           02  ASCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFOLGNRH    PICTURE X.                                           
           02  EFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV2H    PICTURE X.                                             
           02  APGV2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT2H    PICTURE X.                                           
           02  AVSTAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO3H    PICTURE X.                                           
           02  AZINFO3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR2H    PICTURE X.                                             
           02  AUNR2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV3H    PICTURE X.                                             
           02  APGV3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT3H    PICTURE X.                                           
           02  AVSTAT3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO4H    PICTURE X.                                           
           02  AZINFO4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR3H    PICTURE X.                                             
           02  AUNR3O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV4H    PICTURE X.                                             
           02  APGV4O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT4H    PICTURE X.                                           
           02  AVSTAT4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO5H    PICTURE X.                                           
           02  AZINFO5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR4H    PICTURE X.                                             
           02  AUNR4O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV5H    PICTURE X.                                             
           02  APGV5O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT5H    PICTURE X.                                           
           02  AVSTAT5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO6H    PICTURE X.                                           
           02  AZINFO6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR5H    PICTURE X.                                             
           02  AUNR5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV6H    PICTURE X.                                             
           02  APGV6O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT6H    PICTURE X.                                           
           02  AVSTAT6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO7H    PICTURE X.                                           
           02  AZINFO7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR6H    PICTURE X.                                             
           02  AUNR6O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV7H    PICTURE X.                                             
           02  APGV7O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT7H    PICTURE X.                                           
           02  AVSTAT7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO8H    PICTURE X.                                           
           02  AZINFO8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000060H    PICTURE X.                                           
           02  F000060O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000059H    PICTURE X.                                           
           02  F000059O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000058H    PICTURE X.                                           
           02  F000058O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000057H    PICTURE X.                                           
           02  F000057O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR7H    PICTURE X.                                             
           02  AUNR7O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000056H    PICTURE X.                                           
           02  F000056O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV8H    PICTURE X.                                             
           02  APGV8O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT8H    PICTURE X.                                           
           02  AVSTAT8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO9H    PICTURE X.                                           
           02  AZINFO9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000069H    PICTURE X.                                           
           02  F000069O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000068H    PICTURE X.                                           
           02  F000068O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000067H    PICTURE X.                                           
           02  F000067O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000066H    PICTURE X.                                           
           02  F000066O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR8H    PICTURE X.                                             
           02  AUNR8O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000065H    PICTURE X.                                           
           02  F000065O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000064H    PICTURE X.                                           
           02  F000064O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV9H    PICTURE X.                                             
           02  APGV9O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000063H    PICTURE X.                                           
           02  F000063O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000062H    PICTURE X.                                           
           02  F000062O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT9H    PICTURE X.                                           
           02  AVSTAT9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000061H    PICTURE X.                                           
           02  F000061O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000080H    PICTURE X.                                           
           02  F000080O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000079H    PICTURE X.                                           
           02  F000079O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000078H    PICTURE X.                                           
           02  F000078O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000077H    PICTURE X.                                           
           02  F000077O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000076H    PICTURE X.                                           
           02  F000076O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR9H    PICTURE X.                                             
           02  AUNR9O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000075H    PICTURE X.                                           
           02  F000075O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000074H    PICTURE X.                                           
           02  F000074O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV92H    PICTURE X.                                            
           02  APGV92O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000073H    PICTURE X.                                           
           02  F000073O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000072H    PICTURE X.                                           
           02  F000072O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000071H    PICTURE X.                                           
           02  F000071O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000070H    PICTURE X.                                           
           02  F000070O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ922H    PICTURE X.                                           
           02  EFCZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000091H    PICTURE X.                                           
           02  F000091O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000090H    PICTURE X.                                           
           02  F000090O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000089H    PICTURE X.                                           
           02  F000089O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000088H    PICTURE X.                                           
           02  F000088O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000087H    PICTURE X.                                           
           02  F000087O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR92H    PICTURE X.                                            
           02  AUNR92O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000086H    PICTURE X.                                           
           02  F000086O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000085H    PICTURE X.                                           
           02  F000085O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV922H    PICTURE X.                                           
           02  APGV922O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000084H    PICTURE X.                                           
           02  F000084O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000083H    PICTURE X.                                           
           02  F000083O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000082H    PICTURE X.                                           
           02  F000082O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000081H    PICTURE X.                                           
           02  F000081O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000104H    PICTURE X.                                           
           02  F000104O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000103H    PICTURE X.                                           
           02  F000103O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000102H    PICTURE X.                                           
           02  F000102O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000101H    PICTURE X.                                           
           02  F000101O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000100H    PICTURE X.                                           
           02  F000100O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000099H    PICTURE X.                                           
           02  F000099O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUNR922H    PICTURE X.                                           
           02  AUNR922O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000098H    PICTURE X.                                           
           02  F000098O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000097H    PICTURE X.                                           
           02  F000097O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000096H    PICTURE X.                                           
           02  F000096O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000095H    PICTURE X.                                           
           02  F000095O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000094H    PICTURE X.                                           
           02  F000094O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000093H    PICTURE X.                                           
           02  F000093O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000092H    PICTURE X.                                           
           02  F000092O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
