       01  BPA0012I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(1).                                                 
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(1).                                                 
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(1).                                                 
           02  EPINL    COMP  PIC  S9(4).                                       
           02  EPINF    PICTURE X.                                              
           02  FILLER REDEFINES EPINF.                                          
             03 EPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPINI  PIC X(9).                                                 
           02  EPINPZL    COMP  PIC  S9(4).                                     
           02  EPINPZF    PICTURE X.                                            
           02  FILLER REDEFINES EPINPZF.                                        
             03 EPINPZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPINPZI  PIC X(2).                                               
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(30).                                             
           02  AVERSL    COMP  PIC  S9(4).                                      
           02  AVERSF    PICTURE X.                                             
           02  FILLER REDEFINES AVERSF.                                         
             03 AVERSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVERSI  PIC X(3).                                                
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  AVGESBML    COMP  PIC  S9(4).                                    
           02  AVGESBMF    PICTURE X.                                           
           02  FILLER REDEFINES AVGESBMF.                                       
             03 AVGESBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVGESBMI  PIC X(4).                                              
           02  AERSTKZL    COMP  PIC  S9(4).                                    
           02  AERSTKZF    PICTURE X.                                           
           02  FILLER REDEFINES AERSTKZF.                                       
             03 AERSTKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERSTKZI  PIC X(4).                                              
           02  ALUPDDAL    COMP  PIC  S9(4).                                    
           02  ALUPDDAF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPDDAF.                                       
             03 ALUPDDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPDDAI  PIC X(10).                                             
           02  ALUPDUSL    COMP  PIC  S9(4).                                    
           02  ALUPDUSF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPDUSF.                                       
             03 ALUPDUSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPDUSI  PIC X(8).                                              
           02  AVVNR1L    COMP  PIC  S9(4).                                     
           02  AVVNR1F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR1F.                                        
             03 AVVNR1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR1I  PIC X(1).                                               
           02  EVRGES1L    COMP  PIC  S9(4).                                    
           02  EVRGES1F    PICTURE X.                                           
           02  FILLER REDEFINES EVRGES1F.                                       
             03 EVRGES1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVRGES1I  PIC X(2).                                              
           02  EVVNR1L    COMP  PIC  S9(4).                                     
           02  EVVNR1F    PICTURE X.                                            
           02  FILLER REDEFINES EVVNR1F.                                        
             03 EVVNR1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVVNR1I  PIC X(15).                                              
           02  AVVNR2L    COMP  PIC  S9(4).                                     
           02  AVVNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR2F.                                        
             03 AVVNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR2I  PIC X(1).                                               
           02  EVRGES2L    COMP  PIC  S9(4).                                    
           02  EVRGES2F    PICTURE X.                                           
           02  FILLER REDEFINES EVRGES2F.                                       
             03 EVRGES2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVRGES2I  PIC X(2).                                              
           02  EVVNR2L    COMP  PIC  S9(4).                                     
           02  EVVNR2F    PICTURE X.                                            
           02  FILLER REDEFINES EVVNR2F.                                        
             03 EVVNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVVNR2I  PIC X(15).                                              
           02  AVVNR3L    COMP  PIC  S9(4).                                     
           02  AVVNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR3F.                                        
             03 AVVNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR3I  PIC X(1).                                               
           02  EVRGES3L    COMP  PIC  S9(4).                                    
           02  EVRGES3F    PICTURE X.                                           
           02  FILLER REDEFINES EVRGES3F.                                       
             03 EVRGES3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVRGES3I  PIC X(2).                                              
           02  EVVNR3L    COMP  PIC  S9(4).                                     
           02  EVVNR3F    PICTURE X.                                            
           02  FILLER REDEFINES EVVNR3F.                                        
             03 EVVNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVVNR3I  PIC X(15).                                              
           02  AVVNR4L    COMP  PIC  S9(4).                                     
           02  AVVNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR4F.                                        
             03 AVVNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR4I  PIC X(1).                                               
           02  EVRGES4L    COMP  PIC  S9(4).                                    
           02  EVRGES4F    PICTURE X.                                           
           02  FILLER REDEFINES EVRGES4F.                                       
             03 EVRGES4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVRGES4I  PIC X(2).                                              
           02  EVVNR4L    COMP  PIC  S9(4).                                     
           02  EVVNR4F    PICTURE X.                                            
           02  FILLER REDEFINES EVVNR4F.                                        
             03 EVVNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVVNR4I  PIC X(15).                                              
           02  AVVNR5L    COMP  PIC  S9(4).                                     
           02  AVVNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR5F.                                        
             03 AVVNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR5I  PIC X(1).                                               
           02  EVRGES5L    COMP  PIC  S9(4).                                    
           02  EVRGES5F    PICTURE X.                                           
           02  FILLER REDEFINES EVRGES5F.                                       
             03 EVRGES5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVRGES5I  PIC X(2).                                              
           02  EVVNR5L    COMP  PIC  S9(4).                                     
           02  EVVNR5F    PICTURE X.                                            
           02  FILLER REDEFINES EVVNR5F.                                        
             03 EVVNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVVNR5I  PIC X(15).                                              
           02  AVVNR6L    COMP  PIC  S9(4).                                     
           02  AVVNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR6F.                                        
             03 AVVNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR6I  PIC X(1).                                               
           02  EVRGES6L    COMP  PIC  S9(4).                                    
           02  EVRGES6F    PICTURE X.                                           
           02  FILLER REDEFINES EVRGES6F.                                       
             03 EVRGES6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVRGES6I  PIC X(2).                                              
           02  EVVNR6L    COMP  PIC  S9(4).                                     
           02  EVVNR6F    PICTURE X.                                            
           02  FILLER REDEFINES EVVNR6F.                                        
             03 EVVNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVVNR6I  PIC X(15).                                              
           02  AKVNAMEL    COMP  PIC  S9(4).                                    
           02  AKVNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AKVNAMEF.                                       
             03 AKVNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKVNAMEI  PIC X(1).                                              
           02  EKVNAMEL    COMP  PIC  S9(4).                                    
           02  EKVNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES EKVNAMEF.                                       
             03 EKVNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKVNAMEI  PIC X(20).                                             
           02  AKNAMEL    COMP  PIC  S9(4).                                     
           02  AKNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES AKNAMEF.                                        
             03 AKNAMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AKNAMEI  PIC X(1).                                               
           02  EKNAMEL    COMP  PIC  S9(4).                                     
           02  EKNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES EKNAMEF.                                        
             03 EKNAMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKNAMEI  PIC X(25).                                              
           02  AVBL    COMP  PIC  S9(4).                                        
           02  AVBF    PICTURE X.                                               
           02  FILLER REDEFINES AVBF.                                           
             03 AVBA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  AVBI  PIC X(1).                                                  
           02  EVBL    COMP  PIC  S9(4).                                        
           02  EVBF    PICTURE X.                                               
           02  FILLER REDEFINES EVBF.                                           
             03 EVBA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EVBI  PIC X(7).                                                  
           02  EVBPZL    COMP  PIC  S9(4).                                      
           02  EVBPZF    PICTURE X.                                             
           02  FILLER REDEFINES EVBPZF.                                         
             03 EVBPZA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBPZI  PIC X(1).                                                
           02  AZAHLWL    COMP  PIC  S9(4).                                     
           02  AZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES AZAHLWF.                                        
             03 AZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZAHLWI  PIC X(1).                                               
           02  EZAHLWL    COMP  PIC  S9(4).                                     
           02  EZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES EZAHLWF.                                        
             03 EZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLWI  PIC X(2).                                               
           02  AZWBKL    COMP  PIC  S9(4).                                      
           02  AZWBKF    PICTURE X.                                             
           02  FILLER REDEFINES AZWBKF.                                         
             03 AZWBKA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AZWBKI  PIC X(10).                                               
           02  AWAEL    COMP  PIC  S9(4).                                       
           02  AWAEF    PICTURE X.                                              
           02  FILLER REDEFINES AWAEF.                                          
             03 AWAEA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AWAEI  PIC X(1).                                                 
           02  EWAEBKL    COMP  PIC  S9(4).                                     
           02  EWAEBKF    PICTURE X.                                            
           02  FILLER REDEFINES EWAEBKF.                                        
             03 EWAEBKA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EWAEBKI  PIC X(4).                                               
           02  AVBEGDAL    COMP  PIC  S9(4).                                    
           02  AVBEGDAF    PICTURE X.                                           
           02  FILLER REDEFINES AVBEGDAF.                                       
             03 AVBEGDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBEGDAI  PIC X(1).                                              
           02  EVBEGTTL    COMP  PIC  S9(4).                                    
           02  EVBEGTTF    PICTURE X.                                           
           02  FILLER REDEFINES EVBEGTTF.                                       
             03 EVBEGTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBEGTTI  PIC X(2).                                              
           02  EVBEGMML    COMP  PIC  S9(4).                                    
           02  EVBEGMMF    PICTURE X.                                           
           02  FILLER REDEFINES EVBEGMMF.                                       
             03 EVBEGMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBEGMMI  PIC X(2).                                              
           02  EVBEGJJL    COMP  PIC  S9(4).                                    
           02  EVBEGJJF    PICTURE X.                                           
           02  FILLER REDEFINES EVBEGJJF.                                       
             03 EVBEGJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBEGJJI  PIC X(4).                                              
           02  AVABLDAL    COMP  PIC  S9(4).                                    
           02  AVABLDAF    PICTURE X.                                           
           02  FILLER REDEFINES AVABLDAF.                                       
             03 AVABLDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVABLDAI  PIC X(1).                                              
           02  EVABLTTL    COMP  PIC  S9(4).                                    
           02  EVABLTTF    PICTURE X.                                           
           02  FILLER REDEFINES EVABLTTF.                                       
             03 EVABLTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVABLTTI  PIC X(2).                                              
           02  EVABLMML    COMP  PIC  S9(4).                                    
           02  EVABLMMF    PICTURE X.                                           
           02  FILLER REDEFINES EVABLMMF.                                       
             03 EVABLMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVABLMMI  PIC X(2).                                              
           02  EVABLJJL    COMP  PIC  S9(4).                                    
           02  EVABLJJF    PICTURE X.                                           
           02  FILLER REDEFINES EVABLJJF.                                       
             03 EVABLJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVABLJJI  PIC X(4).                                              
           02  AFLEXBL    COMP  PIC  S9(4).                                     
           02  AFLEXBF    PICTURE X.                                            
           02  FILLER REDEFINES AFLEXBF.                                        
             03 AFLEXBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFLEXBI  PIC X(1).                                               
           02  EFLEXBL    COMP  PIC  S9(4).                                     
           02  EFLEXBF    PICTURE X.                                            
           02  FILLER REDEFINES EFLEXBF.                                        
             03 EFLEXBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFLEXBI  PIC X(1).                                               
           02  AFAEVDAL    COMP  PIC  S9(4).                                    
           02  AFAEVDAF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVDAF.                                       
             03 AFAEVDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVDAI  PIC X(1).                                              
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  AFAEBDAL    COMP  PIC  S9(4).                                    
           02  AFAEBDAF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBDAF.                                       
             03 AFAEBDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBDAI  PIC X(1).                                              
           02  EFAEBTTL    COMP  PIC  S9(4).                                    
           02  EFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBTTF.                                       
             03 EFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBTTI  PIC X(2).                                              
           02  EFAEBMML    COMP  PIC  S9(4).                                    
           02  EFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBMMF.                                       
             03 EFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBMMI  PIC X(2).                                              
           02  EFAEBJJL    COMP  PIC  S9(4).                                    
           02  EFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBJJF.                                       
             03 EFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBJJI  PIC X(4).                                              
           02  AFLEXRL    COMP  PIC  S9(4).                                     
           02  AFLEXRF    PICTURE X.                                            
           02  FILLER REDEFINES AFLEXRF.                                        
             03 AFLEXRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFLEXRI  PIC X(1).                                               
           02  EFLEXRL    COMP  PIC  S9(4).                                     
           02  EFLEXRF    PICTURE X.                                            
           02  FILLER REDEFINES EFLEXRF.                                        
             03 EFLEXRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFLEXRI  PIC X(1).                                               
           02  AABREDAL    COMP  PIC  S9(4).                                    
           02  AABREDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABREDAF.                                       
             03 AABREDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREDAI  PIC X(1).                                              
           02  EABRETTL    COMP  PIC  S9(4).                                    
           02  EABRETTF    PICTURE X.                                           
           02  FILLER REDEFINES EABRETTF.                                       
             03 EABRETTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRETTI  PIC X(2).                                              
           02  EABREMML    COMP  PIC  S9(4).                                    
           02  EABREMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABREMMF.                                       
             03 EABREMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABREMMI  PIC X(2).                                              
           02  EABREJJL    COMP  PIC  S9(4).                                    
           02  EABREJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABREJJF.                                       
             03 EABREJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABREJJI  PIC X(4).                                              
           02  AEINLDAL    COMP  PIC  S9(4).                                    
           02  AEINLDAF    PICTURE X.                                           
           02  FILLER REDEFINES AEINLDAF.                                       
             03 AEINLDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINLDAI  PIC X(1).                                              
           02  EEINLTTL    COMP  PIC  S9(4).                                    
           02  EEINLTTF    PICTURE X.                                           
           02  FILLER REDEFINES EEINLTTF.                                       
             03 EEINLTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEINLTTI  PIC X(2).                                              
           02  EEINLMML    COMP  PIC  S9(4).                                    
           02  EEINLMMF    PICTURE X.                                           
           02  FILLER REDEFINES EEINLMMF.                                       
             03 EEINLMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEINLMMI  PIC X(2).                                              
           02  EEINLJJL    COMP  PIC  S9(4).                                    
           02  EEINLJJF    PICTURE X.                                           
           02  FILLER REDEFINES EEINLJJF.                                       
             03 EEINLJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEINLJJI  PIC X(4).                                              
           02  AVORPROL    COMP  PIC  S9(4).                                    
           02  AVORPROF    PICTURE X.                                           
           02  FILLER REDEFINES AVORPROF.                                       
             03 AVORPROA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVORPROI  PIC X(1).                                              
           02  EVORPROL    COMP  PIC  S9(4).                                    
           02  EVORPROF    PICTURE X.                                           
           02  FILLER REDEFINES EVORPROF.                                       
             03 EVORPROA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVORPROI  PIC X(1).                                              
           02  AGPROVBL    COMP  PIC  S9(4).                                    
           02  AGPROVBF    PICTURE X.                                           
           02  FILLER REDEFINES AGPROVBF.                                       
             03 AGPROVBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPROVBI  PIC X(15).                                             
           02  APRODFBL    COMP  PIC  S9(4).                                    
           02  APRODFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRODFBF.                                       
             03 APRODFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODFBI  PIC X(8).                                              
           02  EPRODVL    COMP  PIC  S9(4).                                     
           02  EPRODVF    PICTURE X.                                            
           02  FILLER REDEFINES EPRODVF.                                        
             03 EPRODVA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPRODVI  PIC X(2).                                               
           02  ASTRL    COMP  PIC  S9(4).                                       
           02  ASTRF    PICTURE X.                                              
           02  FILLER REDEFINES ASTRF.                                          
             03 ASTRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ASTRI  PIC X(1).                                                 
           02  APRODBL    COMP  PIC  S9(4).                                     
           02  APRODBF    PICTURE X.                                            
           02  FILLER REDEFINES APRODBF.                                        
             03 APRODBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APRODBI  PIC X(2).                                               
           02  AQSTRL    COMP  PIC  S9(4).                                      
           02  AQSTRF    PICTURE X.                                             
           02  FILLER REDEFINES AQSTRF.                                         
             03 AQSTRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AQSTRI  PIC X(1).                                                
           02  APROGESL    COMP  PIC  S9(4).                                    
           02  APROGESF    PICTURE X.                                           
           02  FILLER REDEFINES APROGESF.                                       
             03 APROGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROGESI  PIC X(2).                                              
           02  AFCZFBL    COMP  PIC  S9(4).                                     
           02  AFCZFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCZFBF.                                        
             03 AFCZFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCZFBI  PIC X(2).                                               
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  APRODL    COMP  PIC  S9(4).                                      
           02  APRODF    PICTURE X.                                             
           02  FILLER REDEFINES APRODF.                                         
             03 APRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APRODI  PIC X(1).                                                
           02  EAMVPGVL    COMP  PIC  S9(4).                                    
           02  EAMVPGVF    PICTURE X.                                           
           02  FILLER REDEFINES EAMVPGVF.                                       
             03 EAMVPGVA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAMVPGVI  PIC X(4).                                              
           02  ETARIFL    COMP  PIC  S9(4).                                     
           02  ETARIFF    PICTURE X.                                            
           02  FILLER REDEFINES ETARIFF.                                        
             03 ETARIFA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ETARIFI  PIC X(13).                                              
           02  EPPFLBL    COMP  PIC  S9(4).                                     
           02  EPPFLBF    PICTURE X.                                            
           02  FILLER REDEFINES EPPFLBF.                                        
             03 EPPFLBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPPFLBI  PIC X(10).                                              
           02  EPROVSL    COMP  PIC  S9(4).                                     
           02  EPROVSF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVSF.                                        
             03 EPROVSA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROVSI  PIC X(7).                                               
           02  EPROVBL    COMP  PIC  S9(4).                                     
           02  EPROVBF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVBF.                                        
             03 EPROVBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROVBI  PIC X(12).                                              
           02  EJNPRAEL    COMP  PIC  S9(4).                                    
           02  EJNPRAEF    PICTURE X.                                           
           02  FILLER REDEFINES EJNPRAEF.                                       
             03 EJNPRAEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EJNPRAEI  PIC X(15).                                             
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  APROD2L    COMP  PIC  S9(4).                                     
           02  APROD2F    PICTURE X.                                            
           02  FILLER REDEFINES APROD2F.                                        
             03 APROD2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD2I  PIC X(1).                                               
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(4).                                              
           02  ETARIF2L    COMP  PIC  S9(4).                                    
           02  ETARIF2F    PICTURE X.                                           
           02  FILLER REDEFINES ETARIF2F.                                       
             03 ETARIF2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ETARIF2I  PIC X(13).                                             
           02  EPPFLB2L    COMP  PIC  S9(4).                                    
           02  EPPFLB2F    PICTURE X.                                           
           02  FILLER REDEFINES EPPFLB2F.                                       
             03 EPPFLB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPPFLB2I  PIC X(10).                                             
           02  EPROVS2L    COMP  PIC  S9(4).                                    
           02  EPROVS2F    PICTURE X.                                           
           02  FILLER REDEFINES EPROVS2F.                                       
             03 EPROVS2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPROVS2I  PIC X(7).                                              
           02  EPROVB2L    COMP  PIC  S9(4).                                    
           02  EPROVB2F    PICTURE X.                                           
           02  FILLER REDEFINES EPROVB2F.                                       
             03 EPROVB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPROVB2I  PIC X(12).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(15).                                             
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  APROD3L    COMP  PIC  S9(4).                                     
           02  APROD3F    PICTURE X.                                            
           02  FILLER REDEFINES APROD3F.                                        
             03 APROD3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD3I  PIC X(1).                                               
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(4).                                              
           02  ETARIF3L    COMP  PIC  S9(4).                                    
           02  ETARIF3F    PICTURE X.                                           
           02  FILLER REDEFINES ETARIF3F.                                       
             03 ETARIF3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ETARIF3I  PIC X(13).                                             
           02  EPPFLB3L    COMP  PIC  S9(4).                                    
           02  EPPFLB3F    PICTURE X.                                           
           02  FILLER REDEFINES EPPFLB3F.                                       
             03 EPPFLB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPPFLB3I  PIC X(10).                                             
           02  EPROVS3L    COMP  PIC  S9(4).                                    
           02  EPROVS3F    PICTURE X.                                           
           02  FILLER REDEFINES EPROVS3F.                                       
             03 EPROVS3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPROVS3I  PIC X(7).                                              
           02  EPROVB3L    COMP  PIC  S9(4).                                    
           02  EPROVB3F    PICTURE X.                                           
           02  FILLER REDEFINES EPROVB3F.                                       
             03 EPROVB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPROVB3I  PIC X(12).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(15).                                             
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0012O REDEFINES BPA0012I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPINH    PICTURE X.                                              
           02  EPINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPINPZH    PICTURE X.                                            
           02  EPINPZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERSH    PICTURE X.                                             
           02  AVERSO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVGESBMH    PICTURE X.                                           
           02  AVGESBMO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AERSTKZH    PICTURE X.                                           
           02  AERSTKZO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALUPDDAH    PICTURE X.                                           
           02  ALUPDDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALUPDUSH    PICTURE X.                                           
           02  ALUPDUSO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR1H    PICTURE X.                                            
           02  AVVNR1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVRGES1H    PICTURE X.                                           
           02  EVRGES1O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVVNR1H    PICTURE X.                                            
           02  EVVNR1O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR2H    PICTURE X.                                            
           02  AVVNR2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVRGES2H    PICTURE X.                                           
           02  EVRGES2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVVNR2H    PICTURE X.                                            
           02  EVVNR2O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR3H    PICTURE X.                                            
           02  AVVNR3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVRGES3H    PICTURE X.                                           
           02  EVRGES3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVVNR3H    PICTURE X.                                            
           02  EVVNR3O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR4H    PICTURE X.                                            
           02  AVVNR4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVRGES4H    PICTURE X.                                           
           02  EVRGES4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVVNR4H    PICTURE X.                                            
           02  EVVNR4O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR5H    PICTURE X.                                            
           02  AVVNR5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVRGES5H    PICTURE X.                                           
           02  EVRGES5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVVNR5H    PICTURE X.                                            
           02  EVVNR5O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR6H    PICTURE X.                                            
           02  AVVNR6O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVRGES6H    PICTURE X.                                           
           02  EVRGES6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVVNR6H    PICTURE X.                                            
           02  EVVNR6O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKVNAMEH    PICTURE X.                                           
           02  AKVNAMEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKVNAMEH    PICTURE X.                                           
           02  EKVNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKNAMEH    PICTURE X.                                            
           02  AKNAMEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKNAMEH    PICTURE X.                                            
           02  EKNAMEO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBH    PICTURE X.                                               
           02  AVBO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  EVBH    PICTURE X.                                               
           02  EVBO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  EVBPZH    PICTURE X.                                             
           02  EVBPZO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZAHLWH    PICTURE X.                                            
           02  AZAHLWO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EZAHLWH    PICTURE X.                                            
           02  EZAHLWO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AZWBKH    PICTURE X.                                             
           02  AZWBKO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  AWAEH    PICTURE X.                                              
           02  AWAEO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EWAEBKH    PICTURE X.                                            
           02  EWAEBKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBEGDAH    PICTURE X.                                           
           02  AVBEGDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBEGTTH    PICTURE X.                                           
           02  EVBEGTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBEGMMH    PICTURE X.                                           
           02  EVBEGMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBEGJJH    PICTURE X.                                           
           02  EVBEGJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVABLDAH    PICTURE X.                                           
           02  AVABLDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVABLTTH    PICTURE X.                                           
           02  EVABLTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVABLMMH    PICTURE X.                                           
           02  EVABLMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVABLJJH    PICTURE X.                                           
           02  EVABLJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFLEXBH    PICTURE X.                                            
           02  AFLEXBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFLEXBH    PICTURE X.                                            
           02  EFLEXBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVDAH    PICTURE X.                                           
           02  AFAEVDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBDAH    PICTURE X.                                           
           02  AFAEBDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBTTH    PICTURE X.                                           
           02  EFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBMMH    PICTURE X.                                           
           02  EFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBJJH    PICTURE X.                                           
           02  EFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFLEXRH    PICTURE X.                                            
           02  AFLEXRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFLEXRH    PICTURE X.                                            
           02  EFLEXRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AABREDAH    PICTURE X.                                           
           02  AABREDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRETTH    PICTURE X.                                           
           02  EABRETTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABREMMH    PICTURE X.                                           
           02  EABREMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABREJJH    PICTURE X.                                           
           02  EABREJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINLDAH    PICTURE X.                                           
           02  AEINLDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEINLTTH    PICTURE X.                                           
           02  EEINLTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEINLMMH    PICTURE X.                                           
           02  EEINLMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEINLJJH    PICTURE X.                                           
           02  EEINLJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVORPROH    PICTURE X.                                           
           02  AVORPROO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVORPROH    PICTURE X.                                           
           02  EVORPROO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGPROVBH    PICTURE X.                                           
           02  AGPROVBO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRODFBH    PICTURE X.                                           
           02  APRODFBO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRODVH    PICTURE X.                                            
           02  EPRODVO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTRH    PICTURE X.                                              
           02  ASTRO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APRODBH    PICTURE X.                                            
           02  APRODBO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AQSTRH    PICTURE X.                                             
           02  AQSTRO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APROGESH    PICTURE X.                                           
           02  APROGESO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZFBH    PICTURE X.                                            
           02  AFCZFBO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APRODH    PICTURE X.                                             
           02  APRODO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAMVPGVH    PICTURE X.                                           
           02  EAMVPGVO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETARIFH    PICTURE X.                                            
           02  ETARIFO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPPFLBH    PICTURE X.                                            
           02  EPPFLBO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPROVSH    PICTURE X.                                            
           02  EPROVSO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROVBH    PICTURE X.                                            
           02  EPROVBO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  EJNPRAEH    PICTURE X.                                           
           02  EJNPRAEO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APROD2H    PICTURE X.                                            
           02  APROD2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETARIF2H    PICTURE X.                                           
           02  ETARIF2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPPFLB2H    PICTURE X.                                           
           02  EPPFLB2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPROVS2H    PICTURE X.                                           
           02  EPROVS2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPROVB2H    PICTURE X.                                           
           02  EPROVB2O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APROD3H    PICTURE X.                                            
           02  APROD3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETARIF3H    PICTURE X.                                           
           02  ETARIF3O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPPFLB3H    PICTURE X.                                           
           02  EPPFLB3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPROVS3H    PICTURE X.                                           
           02  EPROVS3O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPROVB3H    PICTURE X.                                           
           02  EPROVB3O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO PIC X(79).                                              
