       01  BPA0031I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AANZPROL    COMP  PIC  S9(4).                                    
           02  AANZPROF    PICTURE X.                                           
           02  FILLER REDEFINES AANZPROF.                                       
             03 AANZPROA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANZPROI  PIC X(2).                                              
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  ALZFB1L    COMP  PIC  S9(4).                                     
           02  ALZFB1F    PICTURE X.                                            
           02  FILLER REDEFINES ALZFB1F.                                        
             03 ALZFB1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ALZFB1I  PIC X(6).                                               
           02  AABLFB1L    COMP  PIC  S9(4).                                    
           02  AABLFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AABLFB1F.                                       
             03 AABLFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABLFB1I  PIC X(11).                                             
           02  AJNPFB1L    COMP  PIC  S9(4).                                    
           02  AJNPFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AJNPFB1F.                                       
             03 AJNPFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AJNPFB1I  PIC X(15).                                             
           02  AWHRFB1L    COMP  PIC  S9(4).                                    
           02  AWHRFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AWHRFB1F.                                       
             03 AWHRFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWHRFB1I  PIC X(7).                                              
           02  ALZFB2L    COMP  PIC  S9(4).                                     
           02  ALZFB2F    PICTURE X.                                            
           02  FILLER REDEFINES ALZFB2F.                                        
             03 ALZFB2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ALZFB2I  PIC X(6).                                               
           02  AABLFB2L    COMP  PIC  S9(4).                                    
           02  AABLFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AABLFB2F.                                       
             03 AABLFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABLFB2I  PIC X(11).                                             
           02  AJNPFB2L    COMP  PIC  S9(4).                                    
           02  AJNPFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AJNPFB2F.                                       
             03 AJNPFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AJNPFB2I  PIC X(15).                                             
           02  AWHGFB2L    COMP  PIC  S9(4).                                    
           02  AWHGFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AWHGFB2F.                                       
             03 AWHGFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWHGFB2I  PIC X(7).                                              
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  APRODBML    COMP  PIC  S9(4).                                    
           02  APRODBMF    PICTURE X.                                           
           02  FILLER REDEFINES APRODBMF.                                       
             03 APRODBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODBMI  PIC X(10).                                             
           02  AGUELABL    COMP  PIC  S9(4).                                    
           02  AGUELABF    PICTURE X.                                           
           02  FILLER REDEFINES AGUELABF.                                       
             03 AGUELABA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGUELABI  PIC X(10).                                             
           02  ALZL    COMP  PIC  S9(4).                                        
           02  ALZF    PICTURE X.                                               
           02  FILLER REDEFINES ALZF.                                           
             03 ALZA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  ALZI  PIC X(4).                                                  
           02  AABLAUFL    COMP  PIC  S9(4).                                    
           02  AABLAUFF    PICTURE X.                                           
           02  FILLER REDEFINES AABLAUFF.                                       
             03 AABLAUFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABLAUFI  PIC X(10).                                             
           02  AJNETPRL    COMP  PIC  S9(4).                                    
           02  AJNETPRF    PICTURE X.                                           
           02  FILLER REDEFINES AJNETPRF.                                       
             03 AJNETPRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AJNETPRI  PIC X(15).                                             
           02  AWAEHRGL    COMP  PIC  S9(4).                                    
           02  AWAEHRGF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEHRGF.                                       
             03 AWAEHRGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEHRGI  PIC X(4).                                              
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(10).                                             
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  ALZ2L    COMP  PIC  S9(4).                                       
           02  ALZ2F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ2F.                                          
             03 ALZ2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ2I  PIC X(4).                                                 
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(10).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(15).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(4).                                              
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(10).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  ALZ3L    COMP  PIC  S9(4).                                       
           02  ALZ3F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ3F.                                          
             03 ALZ3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ3I  PIC X(4).                                                 
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(10).                                             
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(15).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(4).                                              
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(3).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(10).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  ALZ4L    COMP  PIC  S9(4).                                       
           02  ALZ4F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ4F.                                          
             03 ALZ4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ4I  PIC X(4).                                                 
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(15).                                             
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(4).                                              
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(10).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(10).                                             
           02  ALZ5L    COMP  PIC  S9(4).                                       
           02  ALZ5F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ5F.                                          
             03 ALZ5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ5I  PIC X(4).                                                 
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(10).                                             
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(15).                                             
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(4).                                              
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(3).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(10).                                             
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  ALZ6L    COMP  PIC  S9(4).                                       
           02  ALZ6F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ6F.                                          
             03 ALZ6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ6I  PIC X(4).                                                 
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(10).                                             
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(15).                                             
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(4).                                              
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(3).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  ALZ7L    COMP  PIC  S9(4).                                       
           02  ALZ7F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ7F.                                          
             03 ALZ7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ7I  PIC X(4).                                                 
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(10).                                             
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(15).                                             
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(4).                                              
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(3).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(10).                                             
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(10).                                             
           02  ALZ8L    COMP  PIC  S9(4).                                       
           02  ALZ8F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ8F.                                          
             03 ALZ8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ8I  PIC X(4).                                                 
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(10).                                             
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(15).                                             
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(4).                                              
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(3).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(10).                                             
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(10).                                             
           02  ALZ9L    COMP  PIC  S9(4).                                       
           02  ALZ9F    PICTURE X.                                              
           02  FILLER REDEFINES ALZ9F.                                          
             03 ALZ9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ALZ9I  PIC X(4).                                                 
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(10).                                             
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(15).                                             
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(4).                                              
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(3).                                              
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(10).                                             
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(10).                                             
           02  ALZ92L    COMP  PIC  S9(4).                                      
           02  ALZ92F    PICTURE X.                                             
           02  FILLER REDEFINES ALZ92F.                                         
             03 ALZ92A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ALZ92I  PIC X(4).                                                
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(10).                                             
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(15).                                             
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(4).                                              
           02  EFCZ922L    COMP  PIC  S9(4).                                    
           02  EFCZ922F    PICTURE X.                                           
           02  FILLER REDEFINES EFCZ922F.                                       
             03 EFCZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ922I  PIC X(1).                                              
           02  F000059L    COMP  PIC  S9(4).                                    
           02  F000059F    PICTURE X.                                           
           02  FILLER REDEFINES F000059F.                                       
             03 F000059A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000059I  PIC X(3).                                              
           02  F000058L    COMP  PIC  S9(4).                                    
           02  F000058F    PICTURE X.                                           
           02  FILLER REDEFINES F000058F.                                       
             03 F000058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000058I  PIC X(10).                                             
           02  F000057L    COMP  PIC  S9(4).                                    
           02  F000057F    PICTURE X.                                           
           02  FILLER REDEFINES F000057F.                                       
             03 F000057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000057I  PIC X(10).                                             
           02  ALZ922L    COMP  PIC  S9(4).                                     
           02  ALZ922F    PICTURE X.                                            
           02  FILLER REDEFINES ALZ922F.                                        
             03 ALZ922A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ALZ922I  PIC X(4).                                               
           02  F000056L    COMP  PIC  S9(4).                                    
           02  F000056F    PICTURE X.                                           
           02  FILLER REDEFINES F000056F.                                       
             03 F000056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000056I  PIC X(10).                                             
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(15).                                             
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(4).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0031O REDEFINES BPA0031I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AANZPROH    PICTURE X.                                           
           02  AANZPROO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  ALZFB1H    PICTURE X.                                            
           02  ALZFB1O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AABLFB1H    PICTURE X.                                           
           02  AABLFB1O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  AJNPFB1H    PICTURE X.                                           
           02  AJNPFB1O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWHRFB1H    PICTURE X.                                           
           02  AWHRFB1O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALZFB2H    PICTURE X.                                            
           02  ALZFB2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AABLFB2H    PICTURE X.                                           
           02  AABLFB2O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  AJNPFB2H    PICTURE X.                                           
           02  AJNPFB2O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWHGFB2H    PICTURE X.                                           
           02  AWHGFB2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODBMH    PICTURE X.                                           
           02  APRODBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGUELABH    PICTURE X.                                           
           02  AGUELABO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZH    PICTURE X.                                               
           02  ALZO  PIC X(4).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AABLAUFH    PICTURE X.                                           
           02  AABLAUFO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AJNETPRH    PICTURE X.                                           
           02  AJNETPRO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWAEHRGH    PICTURE X.                                           
           02  AWAEHRGO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ2H    PICTURE X.                                              
           02  ALZ2O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ3H    PICTURE X.                                              
           02  ALZ3O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ4H    PICTURE X.                                              
           02  ALZ4O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ5H    PICTURE X.                                              
           02  ALZ5O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ6H    PICTURE X.                                              
           02  ALZ6O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ7H    PICTURE X.                                              
           02  ALZ7O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ8H    PICTURE X.                                              
           02  ALZ8O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ9H    PICTURE X.                                              
           02  ALZ9O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ92H    PICTURE X.                                             
           02  ALZ92O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ922H    PICTURE X.                                           
           02  EFCZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000059H    PICTURE X.                                           
           02  F000059O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000058H    PICTURE X.                                           
           02  F000058O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000057H    PICTURE X.                                           
           02  F000057O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALZ922H    PICTURE X.                                            
           02  ALZ922O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000056H    PICTURE X.                                           
           02  F000056O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
