       01  BPA0025I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(9).                                               
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EUNRL    COMP  PIC  S9(4).                                       
           02  EUNRF    PICTURE X.                                              
           02  FILLER REDEFINES EUNRF.                                          
             03 EUNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EUNRI  PIC X(3).                                                 
           02  ESCHICHL    COMP  PIC  S9(4).                                    
           02  ESCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHICHF.                                       
             03 ESCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESCHICHI  PIC X(3).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EPRODSLL    COMP  PIC  S9(4).                                    
           02  EPRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES EPRODSLF.                                       
             03 EPRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPRODSLI  PIC X(3).                                              
           02  APRODBML    COMP  PIC  S9(4).                                    
           02  APRODBMF    PICTURE X.                                           
           02  FILLER REDEFINES APRODBMF.                                       
             03 APRODBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODBMI  PIC X(10).                                             
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  EFAEBTTL    COMP  PIC  S9(4).                                    
           02  EFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBTTF.                                       
             03 EFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBTTI  PIC X(2).                                              
           02  EFAEBMML    COMP  PIC  S9(4).                                    
           02  EFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBMMF.                                       
             03 EFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBMMI  PIC X(2).                                              
           02  EFAEBJJL    COMP  PIC  S9(4).                                    
           02  EFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBJJF.                                       
             03 EFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBJJI  PIC X(4).                                              
           02  EFOLGNRL    COMP  PIC  S9(4).                                    
           02  EFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EFOLGNRF.                                       
             03 EFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFOLGNRI  PIC X(3).                                              
           02  EABRVMML    COMP  PIC  S9(4).                                    
           02  EABRVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABRVMMF.                                       
             03 EABRVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRVMMI  PIC X(2).                                              
           02  EABRVJJL    COMP  PIC  S9(4).                                    
           02  EABRVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABRVJJF.                                       
             03 EABRVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRVJJI  PIC X(4).                                              
           02  EABRBMML    COMP  PIC  S9(4).                                    
           02  EABRBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABRBMMF.                                       
             03 EABRBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRBMMI  PIC X(2).                                              
           02  EABRBJJL    COMP  PIC  S9(4).                                    
           02  EABRBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABRBJJF.                                       
             03 EABRBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRBJJI  PIC X(4).                                              
           02  AKENBEZL    COMP  PIC  S9(4).                                    
           02  AKENBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AKENBEZF.                                       
             03 AKENBEZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKENBEZI  PIC X(8).                                              
           02  EGELKENL    COMP  PIC  S9(4).                                    
           02  EGELKENF    PICTURE X.                                           
           02  FILLER REDEFINES EGELKENF.                                       
             03 EGELKENA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGELKENI  PIC X(6).                                              
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(17).                                             
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  APRFB1L    COMP  PIC  S9(4).                                     
           02  APRFB1F    PICTURE X.                                            
           02  FILLER REDEFINES APRFB1F.                                        
             03 APRFB1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APRFB1I  PIC X(4).                                               
           02  AORDFB1L    COMP  PIC  S9(4).                                    
           02  AORDFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AORDFB1F.                                       
             03 AORDFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDFB1I  PIC X(3).                                              
           02  AFAVFB1L    COMP  PIC  S9(4).                                    
           02  AFAVFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AFAVFB1F.                                       
             03 AFAVFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAVFB1I  PIC X(6).                                              
           02  AFABFB1L    COMP  PIC  S9(4).                                    
           02  AFABFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AFABFB1F.                                       
             03 AFABFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFABFB1I  PIC X(10).                                             
           02  AHISFB1L    COMP  PIC  S9(4).                                    
           02  AHISFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AHISFB1F.                                       
             03 AHISFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISFB1I  PIC X(3).                                              
           02  AVSTFB1L    COMP  PIC  S9(4).                                    
           02  AVSTFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTFB1F.                                       
             03 AVSTFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTFB1I  PIC X(5).                                              
           02  AABRFB1L    COMP  PIC  S9(4).                                    
           02  AABRFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AABRFB1F.                                       
             03 AABRFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRFB1I  PIC X(8).                                              
           02  ADBVFB1L    COMP  PIC  S9(4).                                    
           02  ADBVFB1F    PICTURE X.                                           
           02  FILLER REDEFINES ADBVFB1F.                                       
             03 ADBVFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADBVFB1I  PIC X(3).                                              
           02  AGPBFB1L    COMP  PIC  S9(4).                                    
           02  AGPBFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AGPBFB1F.                                       
             03 AGPBFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPBFB1I  PIC X(12).                                             
           02  AEINFB1L    COMP  PIC  S9(4).                                    
           02  AEINFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AEINFB1F.                                       
             03 AEINFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINFB1I  PIC X(6).                                              
           02  APRFB2L    COMP  PIC  S9(4).                                     
           02  APRFB2F    PICTURE X.                                            
           02  FILLER REDEFINES APRFB2F.                                        
             03 APRFB2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APRFB2I  PIC X(4).                                               
           02  AORDFB2L    COMP  PIC  S9(4).                                    
           02  AORDFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AORDFB2F.                                       
             03 AORDFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDFB2I  PIC X(3).                                              
           02  AFAVFB2L    COMP  PIC  S9(4).                                    
           02  AFAVFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AFAVFB2F.                                       
             03 AFAVFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAVFB2I  PIC X(6).                                              
           02  AFABFB2L    COMP  PIC  S9(4).                                    
           02  AFABFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AFABFB2F.                                       
             03 AFABFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFABFB2I  PIC X(10).                                             
           02  AHISFB2L    COMP  PIC  S9(4).                                    
           02  AHISFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AHISFB2F.                                       
             03 AHISFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISFB2I  PIC X(3).                                              
           02  AABRFB2L    COMP  PIC  S9(4).                                    
           02  AABRFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AABRFB2F.                                       
             03 AABRFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRFB2I  PIC X(8).                                              
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  AZINFOL    COMP  PIC  S9(4).                                     
           02  AZINFOF    PICTURE X.                                            
           02  FILLER REDEFINES AZINFOF.                                        
             03 AZINFOA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZINFOI  PIC X(2).                                               
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  AORDNRL    COMP  PIC  S9(4).                                     
           02  AORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES AORDNRF.                                        
             03 AORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AORDNRI  PIC X(2).                                               
           02  AFAEVONL    COMP  PIC  S9(4).                                    
           02  AFAEVONF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVONF.                                       
             03 AFAEVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVONI  PIC X(10).                                             
           02  AFAEBISL    COMP  PIC  S9(4).                                    
           02  AFAEBISF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBISF.                                       
             03 AFAEBISA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBISI  PIC X(10).                                             
           02  AHISTNRL    COMP  PIC  S9(4).                                    
           02  AHISTNRF    PICTURE X.                                           
           02  FILLER REDEFINES AHISTNRF.                                       
             03 AHISTNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISTNRI  PIC X(2).                                              
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  AABRDATL    COMP  PIC  S9(4).                                    
           02  AABRDATF    PICTURE X.                                           
           02  FILLER REDEFINES AABRDATF.                                       
             03 AABRDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRDATI  PIC X(7).                                              
           02  EDGVL    COMP  PIC  S9(4).                                       
           02  EDGVF    PICTURE X.                                              
           02  FILLER REDEFINES EDGVF.                                          
             03 EDGVA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EDGVI  PIC X(5).                                                 
           02  AGPVBTGL    COMP  PIC  S9(4).                                    
           02  AGPVBTGF    PICTURE X.                                           
           02  FILLER REDEFINES AGPVBTGF.                                       
             03 AGPVBTGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPVBTGI  PIC X(12).                                             
           02  AEINHL    COMP  PIC  S9(4).                                      
           02  AEINHF    PICTURE X.                                             
           02  FILLER REDEFINES AEINHF.                                         
             03 AEINHA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AEINHI  PIC X(8).                                                
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  AZINFO2L    COMP  PIC  S9(4).                                    
           02  AZINFO2F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO2F.                                       
             03 AZINFO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO2I  PIC X(2).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  AORDNR2L    COMP  PIC  S9(4).                                    
           02  AORDNR2F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR2F.                                       
             03 AORDNR2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR2I  PIC X(2).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(10).                                             
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(2).                                              
           02  AVSTAT2L    COMP  PIC  S9(4).                                    
           02  AVSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT2F.                                       
             03 AVSTAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT2I  PIC X(4).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(7).                                              
           02  EDGV2L    COMP  PIC  S9(4).                                      
           02  EDGV2F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV2F.                                         
             03 EDGV2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV2I  PIC X(5).                                                
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(12).                                             
           02  AEINH2L    COMP  PIC  S9(4).                                     
           02  AEINH2F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH2F.                                        
             03 AEINH2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH2I  PIC X(8).                                               
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  AZINFO3L    COMP  PIC  S9(4).                                    
           02  AZINFO3F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO3F.                                       
             03 AZINFO3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO3I  PIC X(2).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  AORDNR3L    COMP  PIC  S9(4).                                    
           02  AORDNR3F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR3F.                                       
             03 AORDNR3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR3I  PIC X(2).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(10).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(2).                                              
           02  AVSTAT3L    COMP  PIC  S9(4).                                    
           02  AVSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT3F.                                       
             03 AVSTAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT3I  PIC X(4).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(7).                                              
           02  EDGV3L    COMP  PIC  S9(4).                                      
           02  EDGV3F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV3F.                                         
             03 EDGV3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV3I  PIC X(5).                                                
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(12).                                             
           02  AEINH3L    COMP  PIC  S9(4).                                     
           02  AEINH3F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH3F.                                        
             03 AEINH3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH3I  PIC X(8).                                               
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC4I  PIC X(1).                                                 
           02  AZINFO4L    COMP  PIC  S9(4).                                    
           02  AZINFO4F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO4F.                                       
             03 AZINFO4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO4I  PIC X(2).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(3).                                              
           02  AORDNR4L    COMP  PIC  S9(4).                                    
           02  AORDNR4F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR4F.                                       
             03 AORDNR4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR4I  PIC X(2).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(10).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(2).                                              
           02  AVSTAT4L    COMP  PIC  S9(4).                                    
           02  AVSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT4F.                                       
             03 AVSTAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT4I  PIC X(4).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(7).                                              
           02  EDGV4L    COMP  PIC  S9(4).                                      
           02  EDGV4F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV4F.                                         
             03 EDGV4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV4I  PIC X(5).                                                
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(12).                                             
           02  AEINH4L    COMP  PIC  S9(4).                                     
           02  AEINH4F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH4F.                                        
             03 AEINH4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH4I  PIC X(8).                                               
           02  EFC5L    COMP  PIC  S9(4).                                       
           02  EFC5F    PICTURE X.                                              
           02  FILLER REDEFINES EFC5F.                                          
             03 EFC5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC5I  PIC X(1).                                                 
           02  AZINFO5L    COMP  PIC  S9(4).                                    
           02  AZINFO5F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO5F.                                       
             03 AZINFO5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO5I  PIC X(2).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  AORDNR5L    COMP  PIC  S9(4).                                    
           02  AORDNR5F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR5F.                                       
             03 AORDNR5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR5I  PIC X(2).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(10).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(10).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(2).                                              
           02  AVSTAT5L    COMP  PIC  S9(4).                                    
           02  AVSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT5F.                                       
             03 AVSTAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT5I  PIC X(4).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(7).                                              
           02  EDGV5L    COMP  PIC  S9(4).                                      
           02  EDGV5F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV5F.                                         
             03 EDGV5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV5I  PIC X(5).                                                
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(12).                                             
           02  AEINH5L    COMP  PIC  S9(4).                                     
           02  AEINH5F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH5F.                                        
             03 AEINH5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH5I  PIC X(8).                                               
           02  EFC6L    COMP  PIC  S9(4).                                       
           02  EFC6F    PICTURE X.                                              
           02  FILLER REDEFINES EFC6F.                                          
             03 EFC6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC6I  PIC X(1).                                                 
           02  AZINFO6L    COMP  PIC  S9(4).                                    
           02  AZINFO6F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO6F.                                       
             03 AZINFO6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO6I  PIC X(2).                                              
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(3).                                              
           02  AORDNR6L    COMP  PIC  S9(4).                                    
           02  AORDNR6F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR6F.                                       
             03 AORDNR6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR6I  PIC X(2).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(10).                                             
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(2).                                              
           02  AVSTAT6L    COMP  PIC  S9(4).                                    
           02  AVSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT6F.                                       
             03 AVSTAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT6I  PIC X(4).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(7).                                              
           02  EDGV6L    COMP  PIC  S9(4).                                      
           02  EDGV6F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV6F.                                         
             03 EDGV6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV6I  PIC X(5).                                                
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(12).                                             
           02  AEINH6L    COMP  PIC  S9(4).                                     
           02  AEINH6F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH6F.                                        
             03 AEINH6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH6I  PIC X(8).                                               
           02  EFC7L    COMP  PIC  S9(4).                                       
           02  EFC7F    PICTURE X.                                              
           02  FILLER REDEFINES EFC7F.                                          
             03 EFC7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC7I  PIC X(1).                                                 
           02  AZINFO7L    COMP  PIC  S9(4).                                    
           02  AZINFO7F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO7F.                                       
             03 AZINFO7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO7I  PIC X(2).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(3).                                              
           02  AORDNR7L    COMP  PIC  S9(4).                                    
           02  AORDNR7F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR7F.                                       
             03 AORDNR7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR7I  PIC X(2).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(2).                                              
           02  AVSTAT7L    COMP  PIC  S9(4).                                    
           02  AVSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT7F.                                       
             03 AVSTAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT7I  PIC X(4).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(7).                                              
           02  EDGV7L    COMP  PIC  S9(4).                                      
           02  EDGV7F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV7F.                                         
             03 EDGV7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV7I  PIC X(5).                                                
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(12).                                             
           02  AEINH7L    COMP  PIC  S9(4).                                     
           02  AEINH7F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH7F.                                        
             03 AEINH7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH7I  PIC X(8).                                               
           02  EFC8L    COMP  PIC  S9(4).                                       
           02  EFC8F    PICTURE X.                                              
           02  FILLER REDEFINES EFC8F.                                          
             03 EFC8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC8I  PIC X(1).                                                 
           02  AZINFO8L    COMP  PIC  S9(4).                                    
           02  AZINFO8F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO8F.                                       
             03 AZINFO8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO8I  PIC X(2).                                              
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(3).                                              
           02  AORDNR8L    COMP  PIC  S9(4).                                    
           02  AORDNR8F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR8F.                                       
             03 AORDNR8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR8I  PIC X(2).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(10).                                             
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(10).                                             
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(2).                                              
           02  AVSTAT8L    COMP  PIC  S9(4).                                    
           02  AVSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT8F.                                       
             03 AVSTAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT8I  PIC X(4).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(7).                                              
           02  EDGV8L    COMP  PIC  S9(4).                                      
           02  EDGV8F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV8F.                                         
             03 EDGV8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV8I  PIC X(5).                                                
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(12).                                             
           02  AEINH8L    COMP  PIC  S9(4).                                     
           02  AEINH8F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH8F.                                        
             03 AEINH8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH8I  PIC X(8).                                               
           02  EFC9L    COMP  PIC  S9(4).                                       
           02  EFC9F    PICTURE X.                                              
           02  FILLER REDEFINES EFC9F.                                          
             03 EFC9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC9I  PIC X(1).                                                 
           02  AZINFO9L    COMP  PIC  S9(4).                                    
           02  AZINFO9F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO9F.                                       
             03 AZINFO9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO9I  PIC X(2).                                              
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(3).                                              
           02  AORDNR9L    COMP  PIC  S9(4).                                    
           02  AORDNR9F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR9F.                                       
             03 AORDNR9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR9I  PIC X(2).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(10).                                             
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(10).                                             
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(2).                                              
           02  AVSTAT9L    COMP  PIC  S9(4).                                    
           02  AVSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT9F.                                       
             03 AVSTAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT9I  PIC X(4).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(7).                                              
           02  EDGV9L    COMP  PIC  S9(4).                                      
           02  EDGV9F    PICTURE X.                                             
           02  FILLER REDEFINES EDGV9F.                                         
             03 EDGV9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EDGV9I  PIC X(5).                                                
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(12).                                             
           02  AEINH9L    COMP  PIC  S9(4).                                     
           02  AEINH9F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH9F.                                        
             03 AEINH9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH9I  PIC X(8).                                               
           02  AEINFB2L    COMP  PIC  S9(4).                                    
           02  AEINFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AEINFB2F.                                       
             03 AEINFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINFB2I  PIC X(6).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0025O REDEFINES BPA0025I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EUNRH    PICTURE X.                                              
           02  EUNRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESCHICHH    PICTURE X.                                           
           02  ESCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRODSLH    PICTURE X.                                           
           02  EPRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODBMH    PICTURE X.                                           
           02  APRODBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBTTH    PICTURE X.                                           
           02  EFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBMMH    PICTURE X.                                           
           02  EFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBJJH    PICTURE X.                                           
           02  EFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFOLGNRH    PICTURE X.                                           
           02  EFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRVMMH    PICTURE X.                                           
           02  EABRVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRVJJH    PICTURE X.                                           
           02  EABRVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRBMMH    PICTURE X.                                           
           02  EABRBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRBJJH    PICTURE X.                                           
           02  EABRBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKENBEZH    PICTURE X.                                           
           02  AKENBEZO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGELKENH    PICTURE X.                                           
           02  EGELKENO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  APRFB1H    PICTURE X.                                            
           02  APRFB1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AORDFB1H    PICTURE X.                                           
           02  AORDFB1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAVFB1H    PICTURE X.                                           
           02  AFAVFB1O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFABFB1H    PICTURE X.                                           
           02  AFABFB1O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHISFB1H    PICTURE X.                                           
           02  AHISFB1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTFB1H    PICTURE X.                                           
           02  AVSTFB1O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABRFB1H    PICTURE X.                                           
           02  AABRFB1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBVFB1H    PICTURE X.                                           
           02  ADBVFB1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGPBFB1H    PICTURE X.                                           
           02  AGPBFB1O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINFB1H    PICTURE X.                                           
           02  AEINFB1O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRFB2H    PICTURE X.                                            
           02  APRFB2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AORDFB2H    PICTURE X.                                           
           02  AORDFB2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAVFB2H    PICTURE X.                                           
           02  AFAVFB2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFABFB2H    PICTURE X.                                           
           02  AFABFB2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHISFB2H    PICTURE X.                                           
           02  AHISFB2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABRFB2H    PICTURE X.                                           
           02  AABRFB2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AZINFOH    PICTURE X.                                            
           02  AZINFOO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNRH    PICTURE X.                                            
           02  AORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVONH    PICTURE X.                                           
           02  AFAEVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFAEBISH    PICTURE X.                                           
           02  AFAEBISO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHISTNRH    PICTURE X.                                           
           02  AHISTNRO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AABRDATH    PICTURE X.                                           
           02  AABRDATO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGVH    PICTURE X.                                              
           02  EDGVO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGPVBTGH    PICTURE X.                                           
           02  AGPVBTGO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINHH    PICTURE X.                                             
           02  AEINHO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO2H    PICTURE X.                                           
           02  AZINFO2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR2H    PICTURE X.                                           
           02  AORDNR2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT2H    PICTURE X.                                           
           02  AVSTAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV2H    PICTURE X.                                             
           02  EDGV2O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH2H    PICTURE X.                                            
           02  AEINH2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO3H    PICTURE X.                                           
           02  AZINFO3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR3H    PICTURE X.                                           
           02  AORDNR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT3H    PICTURE X.                                           
           02  AVSTAT3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV3H    PICTURE X.                                             
           02  EDGV3O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH3H    PICTURE X.                                            
           02  AEINH3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC4H    PICTURE X.                                              
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO4H    PICTURE X.                                           
           02  AZINFO4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR4H    PICTURE X.                                           
           02  AORDNR4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT4H    PICTURE X.                                           
           02  AVSTAT4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV4H    PICTURE X.                                             
           02  EDGV4O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH4H    PICTURE X.                                            
           02  AEINH4O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC5H    PICTURE X.                                              
           02  EFC5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO5H    PICTURE X.                                           
           02  AZINFO5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR5H    PICTURE X.                                           
           02  AORDNR5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT5H    PICTURE X.                                           
           02  AVSTAT5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV5H    PICTURE X.                                             
           02  EDGV5O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH5H    PICTURE X.                                            
           02  AEINH5O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC6H    PICTURE X.                                              
           02  EFC6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO6H    PICTURE X.                                           
           02  AZINFO6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR6H    PICTURE X.                                           
           02  AORDNR6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT6H    PICTURE X.                                           
           02  AVSTAT6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV6H    PICTURE X.                                             
           02  EDGV6O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH6H    PICTURE X.                                            
           02  AEINH6O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC7H    PICTURE X.                                              
           02  EFC7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO7H    PICTURE X.                                           
           02  AZINFO7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR7H    PICTURE X.                                           
           02  AORDNR7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT7H    PICTURE X.                                           
           02  AVSTAT7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV7H    PICTURE X.                                             
           02  EDGV7O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH7H    PICTURE X.                                            
           02  AEINH7O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC8H    PICTURE X.                                              
           02  EFC8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO8H    PICTURE X.                                           
           02  AZINFO8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR8H    PICTURE X.                                           
           02  AORDNR8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT8H    PICTURE X.                                           
           02  AVSTAT8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV8H    PICTURE X.                                             
           02  EDGV8O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH8H    PICTURE X.                                            
           02  AEINH8O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC9H    PICTURE X.                                              
           02  EFC9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO9H    PICTURE X.                                           
           02  AZINFO9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR9H    PICTURE X.                                           
           02  AORDNR9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT9H    PICTURE X.                                           
           02  AVSTAT9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDGV9H    PICTURE X.                                             
           02  EDGV9O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINH9H    PICTURE X.                                            
           02  AEINH9O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEINFB2H    PICTURE X.                                           
           02  AEINFB2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
