       01  BPA0024I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  EFAEBTTL    COMP  PIC  S9(4).                                    
           02  EFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBTTF.                                       
             03 EFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBTTI  PIC X(2).                                              
           02  EFAEBMML    COMP  PIC  S9(4).                                    
           02  EFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBMMF.                                       
             03 EFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBMMI  PIC X(2).                                              
           02  EFAEBJJL    COMP  PIC  S9(4).                                    
           02  EFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBJJF.                                       
             03 EFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBJJI  PIC X(4).                                              
           02  EFOLGNRL    COMP  PIC  S9(4).                                    
           02  EFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EFOLGNRF.                                       
             03 EFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFOLGNRI  PIC X(3).                                              
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  APRODFBL    COMP  PIC  S9(4).                                    
           02  APRODFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRODFBF.                                       
             03 APRODFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODFBI  PIC X(7).                                              
           02  AFAEVFBL    COMP  PIC  S9(4).                                    
           02  AFAEVFBF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVFBF.                                       
             03 AFAEVFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVFBI  PIC X(10).                                             
           02  AFEABFBL    COMP  PIC  S9(4).                                    
           02  AFEABFBF    PICTURE X.                                           
           02  FILLER REDEFINES AFEABFBF.                                       
             03 AFEABFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFEABFBI  PIC X(10).                                             
           02  AVSTFBL    COMP  PIC  S9(4).                                     
           02  AVSTFBF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTFBF.                                        
             03 AVSTFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTFBI  PIC X(5).                                               
           02  APGVFBL    COMP  PIC  S9(4).                                     
           02  APGVFBF    PICTURE X.                                            
           02  FILLER REDEFINES APGVFBF.                                        
             03 APGVFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APGVFBI  PIC X(4).                                               
           02  AGPBFB1L    COMP  PIC  S9(4).                                    
           02  AGPBFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AGPBFB1F.                                       
             03 AGPBFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPBFB1I  PIC X(12).                                             
           02  AWHGFB1L    COMP  PIC  S9(4).                                    
           02  AWHGFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AWHGFB1F.                                       
             03 AWHGFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWHGFB1I  PIC X(4).                                              
           02  ADYKZN1L    COMP  PIC  S9(4).                                    
           02  ADYKZN1F    PICTURE X.                                           
           02  FILLER REDEFINES ADYKZN1F.                                       
             03 ADYKZN1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYKZN1I  PIC X(4).                                              
           02  AWHGFB2L    COMP  PIC  S9(4).                                    
           02  AWHGFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AWHGFB2F.                                       
             03 AWHGFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWHGFB2I  PIC X(4).                                              
           02  ADYKZN2L    COMP  PIC  S9(4).                                    
           02  ADYKZN2F    PICTURE X.                                           
           02  FILLER REDEFINES ADYKZN2F.                                       
             03 ADYKZN2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYKZN2I  PIC X(3).                                              
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  APRODBML    COMP  PIC  S9(4).                                    
           02  APRODBMF    PICTURE X.                                           
           02  FILLER REDEFINES APRODBMF.                                       
             03 APRODBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODBMI  PIC X(10).                                             
           02  AFAEVONL    COMP  PIC  S9(4).                                    
           02  AFAEVONF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVONF.                                       
             03 AFAEVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVONI  PIC X(10).                                             
           02  AFAEBISL    COMP  PIC  S9(4).                                    
           02  AFAEBISF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBISF.                                       
             03 AFAEBISA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBISI  PIC X(10).                                             
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  APGVL    COMP  PIC  S9(4).                                       
           02  APGVF    PICTURE X.                                              
           02  FILLER REDEFINES APGVF.                                          
             03 APGVA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APGVI  PIC X(4).                                                 
           02  AGPVBTGL    COMP  PIC  S9(4).                                    
           02  AGPVBTGF    PICTURE X.                                           
           02  FILLER REDEFINES AGPVBTGF.                                       
             03 AGPVBTGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPVBTGI  PIC X(14).                                             
           02  AWAEHRGL    COMP  PIC  S9(4).                                    
           02  AWAEHRGF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEHRGF.                                       
             03 AWAEHRGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEHRGI  PIC X(4).                                              
           02  ADYNKZL    COMP  PIC  S9(4).                                     
           02  ADYNKZF    PICTURE X.                                            
           02  FILLER REDEFINES ADYNKZF.                                        
             03 ADYNKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZI  PIC X(2).                                               
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(10).                                             
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(10).                                             
           02  AVSTAT2L    COMP  PIC  S9(4).                                    
           02  AVSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT2F.                                       
             03 AVSTAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT2I  PIC X(4).                                              
           02  APGV2L    COMP  PIC  S9(4).                                      
           02  APGV2F    PICTURE X.                                             
           02  FILLER REDEFINES APGV2F.                                         
             03 APGV2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV2I  PIC X(4).                                                
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(14).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(4).                                              
           02  ADYNKZ2L    COMP  PIC  S9(4).                                    
           02  ADYNKZ2F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ2F.                                       
             03 ADYNKZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ2I  PIC X(2).                                              
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(10).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(10).                                             
           02  AVSTAT3L    COMP  PIC  S9(4).                                    
           02  AVSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT3F.                                       
             03 AVSTAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT3I  PIC X(4).                                              
           02  APGV3L    COMP  PIC  S9(4).                                      
           02  APGV3F    PICTURE X.                                             
           02  FILLER REDEFINES APGV3F.                                         
             03 APGV3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV3I  PIC X(4).                                                
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(14).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(4).                                              
           02  ADYNKZ3L    COMP  PIC  S9(4).                                    
           02  ADYNKZ3F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ3F.                                       
             03 ADYNKZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ3I  PIC X(2).                                              
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC4I  PIC X(1).                                                 
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(3).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(10).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  AVSTAT4L    COMP  PIC  S9(4).                                    
           02  AVSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT4F.                                       
             03 AVSTAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT4I  PIC X(4).                                              
           02  APGV4L    COMP  PIC  S9(4).                                      
           02  APGV4F    PICTURE X.                                             
           02  FILLER REDEFINES APGV4F.                                         
             03 APGV4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV4I  PIC X(4).                                                
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(14).                                             
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(4).                                              
           02  ADYNKZ4L    COMP  PIC  S9(4).                                    
           02  ADYNKZ4F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ4F.                                       
             03 ADYNKZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ4I  PIC X(2).                                              
           02  EFC5L    COMP  PIC  S9(4).                                       
           02  EFC5F    PICTURE X.                                              
           02  FILLER REDEFINES EFC5F.                                          
             03 EFC5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC5I  PIC X(1).                                                 
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(10).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(10).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(10).                                             
           02  AVSTAT5L    COMP  PIC  S9(4).                                    
           02  AVSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT5F.                                       
             03 AVSTAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT5I  PIC X(4).                                              
           02  APGV5L    COMP  PIC  S9(4).                                      
           02  APGV5F    PICTURE X.                                             
           02  FILLER REDEFINES APGV5F.                                         
             03 APGV5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV5I  PIC X(4).                                                
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(14).                                             
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(4).                                              
           02  ADYNKZ5L    COMP  PIC  S9(4).                                    
           02  ADYNKZ5F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ5F.                                       
             03 ADYNKZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ5I  PIC X(2).                                              
           02  EFC6L    COMP  PIC  S9(4).                                       
           02  EFC6F    PICTURE X.                                              
           02  FILLER REDEFINES EFC6F.                                          
             03 EFC6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC6I  PIC X(1).                                                 
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(3).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(10).                                             
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(10).                                             
           02  AVSTAT6L    COMP  PIC  S9(4).                                    
           02  AVSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT6F.                                       
             03 AVSTAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT6I  PIC X(4).                                              
           02  APGV6L    COMP  PIC  S9(4).                                      
           02  APGV6F    PICTURE X.                                             
           02  FILLER REDEFINES APGV6F.                                         
             03 APGV6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV6I  PIC X(4).                                                
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(14).                                             
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(4).                                              
           02  ADYNKZ6L    COMP  PIC  S9(4).                                    
           02  ADYNKZ6F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ6F.                                       
             03 ADYNKZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ6I  PIC X(2).                                              
           02  EFC7L    COMP  PIC  S9(4).                                       
           02  EFC7F    PICTURE X.                                              
           02  FILLER REDEFINES EFC7F.                                          
             03 EFC7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC7I  PIC X(1).                                                 
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(3).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(10).                                             
           02  AVSTAT7L    COMP  PIC  S9(4).                                    
           02  AVSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT7F.                                       
             03 AVSTAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT7I  PIC X(4).                                              
           02  APGV7L    COMP  PIC  S9(4).                                      
           02  APGV7F    PICTURE X.                                             
           02  FILLER REDEFINES APGV7F.                                         
             03 APGV7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV7I  PIC X(4).                                                
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(14).                                             
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(4).                                              
           02  ADYNKZ7L    COMP  PIC  S9(4).                                    
           02  ADYNKZ7F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ7F.                                       
             03 ADYNKZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ7I  PIC X(2).                                              
           02  EFC8L    COMP  PIC  S9(4).                                       
           02  EFC8F    PICTURE X.                                              
           02  FILLER REDEFINES EFC8F.                                          
             03 EFC8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC8I  PIC X(1).                                                 
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(3).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(10).                                             
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(10).                                             
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(10).                                             
           02  AVSTAT8L    COMP  PIC  S9(4).                                    
           02  AVSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT8F.                                       
             03 AVSTAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT8I  PIC X(4).                                              
           02  APGV8L    COMP  PIC  S9(4).                                      
           02  APGV8F    PICTURE X.                                             
           02  FILLER REDEFINES APGV8F.                                         
             03 APGV8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV8I  PIC X(4).                                                
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(14).                                             
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(4).                                              
           02  ADYNKZ8L    COMP  PIC  S9(4).                                    
           02  ADYNKZ8F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ8F.                                       
             03 ADYNKZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ8I  PIC X(2).                                              
           02  EFC9L    COMP  PIC  S9(4).                                       
           02  EFC9F    PICTURE X.                                              
           02  FILLER REDEFINES EFC9F.                                          
             03 EFC9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC9I  PIC X(1).                                                 
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(3).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(10).                                             
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(10).                                             
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(10).                                             
           02  AVSTAT9L    COMP  PIC  S9(4).                                    
           02  AVSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT9F.                                       
             03 AVSTAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT9I  PIC X(4).                                              
           02  APGV9L    COMP  PIC  S9(4).                                      
           02  APGV9F    PICTURE X.                                             
           02  FILLER REDEFINES APGV9F.                                         
             03 APGV9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APGV9I  PIC X(4).                                                
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(14).                                             
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(4).                                              
           02  ADYNKZ9L    COMP  PIC  S9(4).                                    
           02  ADYNKZ9F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ9F.                                       
             03 ADYNKZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ9I  PIC X(2).                                              
           02  EFC92L    COMP  PIC  S9(4).                                      
           02  EFC92F    PICTURE X.                                             
           02  FILLER REDEFINES EFC92F.                                         
             03 EFC92A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFC92I  PIC X(1).                                                
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(3).                                              
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(10).                                             
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(10).                                             
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(10).                                             
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(4).                                              
           02  APGV92L    COMP  PIC  S9(4).                                     
           02  APGV92F    PICTURE X.                                            
           02  FILLER REDEFINES APGV92F.                                        
             03 APGV92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APGV92I  PIC X(4).                                               
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(14).                                             
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(4).                                              
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(2).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0024O REDEFINES BPA0024I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBTTH    PICTURE X.                                           
           02  EFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBMMH    PICTURE X.                                           
           02  EFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBJJH    PICTURE X.                                           
           02  EFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFOLGNRH    PICTURE X.                                           
           02  EFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  APRODFBH    PICTURE X.                                           
           02  APRODFBO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVFBH    PICTURE X.                                           
           02  AFAEVFBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFEABFBH    PICTURE X.                                           
           02  AFEABFBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTFBH    PICTURE X.                                            
           02  AVSTFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGVFBH    PICTURE X.                                            
           02  APGVFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGPBFB1H    PICTURE X.                                           
           02  AGPBFB1O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWHGFB1H    PICTURE X.                                           
           02  AWHGFB1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYKZN1H    PICTURE X.                                           
           02  ADYKZN1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWHGFB2H    PICTURE X.                                           
           02  AWHGFB2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYKZN2H    PICTURE X.                                           
           02  ADYKZN2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODBMH    PICTURE X.                                           
           02  APRODBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFAEVONH    PICTURE X.                                           
           02  AFAEVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFAEBISH    PICTURE X.                                           
           02  AFAEBISO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  APGVH    PICTURE X.                                              
           02  APGVO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGPVBTGH    PICTURE X.                                           
           02  AGPVBTGO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWAEHRGH    PICTURE X.                                           
           02  AWAEHRGO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZH    PICTURE X.                                            
           02  ADYNKZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT2H    PICTURE X.                                           
           02  AVSTAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV2H    PICTURE X.                                             
           02  APGV2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ2H    PICTURE X.                                           
           02  ADYNKZ2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT3H    PICTURE X.                                           
           02  AVSTAT3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV3H    PICTURE X.                                             
           02  APGV3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ3H    PICTURE X.                                           
           02  ADYNKZ3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC4H    PICTURE X.                                              
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT4H    PICTURE X.                                           
           02  AVSTAT4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV4H    PICTURE X.                                             
           02  APGV4O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ4H    PICTURE X.                                           
           02  ADYNKZ4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC5H    PICTURE X.                                              
           02  EFC5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT5H    PICTURE X.                                           
           02  AVSTAT5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV5H    PICTURE X.                                             
           02  APGV5O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ5H    PICTURE X.                                           
           02  ADYNKZ5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC6H    PICTURE X.                                              
           02  EFC6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT6H    PICTURE X.                                           
           02  AVSTAT6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV6H    PICTURE X.                                             
           02  APGV6O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ6H    PICTURE X.                                           
           02  ADYNKZ6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC7H    PICTURE X.                                              
           02  EFC7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT7H    PICTURE X.                                           
           02  AVSTAT7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV7H    PICTURE X.                                             
           02  APGV7O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ7H    PICTURE X.                                           
           02  ADYNKZ7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC8H    PICTURE X.                                              
           02  EFC8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT8H    PICTURE X.                                           
           02  AVSTAT8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV8H    PICTURE X.                                             
           02  APGV8O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ8H    PICTURE X.                                           
           02  ADYNKZ8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC9H    PICTURE X.                                              
           02  EFC9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT9H    PICTURE X.                                           
           02  AVSTAT9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV9H    PICTURE X.                                             
           02  APGV9O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ9H    PICTURE X.                                           
           02  ADYNKZ9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC92H    PICTURE X.                                             
           02  EFC92O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGV92H    PICTURE X.                                            
           02  APGV92O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
