       01  BPA0043I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(20).                                             
           02  AAVERML    COMP  PIC  S9(4).                                     
           02  AAVERMF    PICTURE X.                                            
           02  FILLER REDEFINES AAVERMF.                                        
             03 AAVERMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AAVERMI  PIC X(7).                                               
           02  AAVMPZL    COMP  PIC  S9(4).                                     
           02  AAVMPZF    PICTURE X.                                            
           02  FILLER REDEFINES AAVMPZF.                                        
             03 AAVMPZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AAVMPZI  PIC X(1).                                               
           02  AFAEVONL    COMP  PIC  S9(4).                                    
           02  AFAEVONF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVONF.                                       
             03 AFAEVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVONI  PIC X(10).                                             
           02  AFAEBISL    COMP  PIC  S9(4).                                    
           02  AFAEBISF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBISF.                                       
             03 AFAEBISA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBISI  PIC X(10).                                             
           02  AVVNRL    COMP  PIC  S9(4).                                      
           02  AVVNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVVNRF.                                         
             03 AVVNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVVNRI  PIC X(15).                                               
           02  AKDBETRL    COMP  PIC  S9(4).                                    
           02  AKDBETRF    PICTURE X.                                           
           02  FILLER REDEFINES AKDBETRF.                                       
             03 AKDBETRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKDBETRI  PIC X(7).                                              
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  ALAUFZL    COMP  PIC  S9(4).                                     
           02  ALAUFZF    PICTURE X.                                            
           02  FILLER REDEFINES ALAUFZF.                                        
             03 ALAUFZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZI  PIC X(3).                                               
           02  AMINLZL    COMP  PIC  S9(4).                                     
           02  AMINLZF    PICTURE X.                                            
           02  FILLER REDEFINES AMINLZF.                                        
             03 AMINLZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZI  PIC X(3).                                               
           02  AJNPEVSL    COMP  PIC  S9(4).                                    
           02  AJNPEVSF    PICTURE X.                                           
           02  FILLER REDEFINES AJNPEVSF.                                       
             03 AJNPEVSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AJNPEVSI  PIC X(13).                                             
           02  AJNPVNRL    COMP  PIC  S9(4).                                    
           02  AJNPVNRF    PICTURE X.                                           
           02  FILLER REDEFINES AJNPVNRF.                                       
             03 AJNPVNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AJNPVNRI  PIC X(13).                                             
           02  AERHJNPL    COMP  PIC  S9(4).                                    
           02  AERHJNPF    PICTURE X.                                           
           02  FILLER REDEFINES AERHJNPF.                                       
             03 AERHJNPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERHJNPI  PIC X(6).                                              
           02  EEEENTL    COMP  PIC  S9(4).                                     
           02  EEEENTF    PICTURE X.                                            
           02  FILLER REDEFINES EEEENTF.                                        
             03 EEEENTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEEENTI  PIC X(2).                                               
           02  AVVNR2L    COMP  PIC  S9(4).                                     
           02  AVVNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR2F.                                        
             03 AVVNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR2I  PIC X(15).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(7).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(3).                                              
           02  ALAUFZ2L    COMP  PIC  S9(4).                                    
           02  ALAUFZ2F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ2F.                                       
             03 ALAUFZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ2I  PIC X(3).                                              
           02  AMINLZ2L    COMP  PIC  S9(4).                                    
           02  AMINLZ2F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ2F.                                       
             03 AMINLZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ2I  PIC X(3).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(13).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(13).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(6).                                              
           02  EEEENT2L    COMP  PIC  S9(4).                                    
           02  EEEENT2F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT2F.                                       
             03 EEEENT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT2I  PIC X(2).                                              
           02  AVVNR3L    COMP  PIC  S9(4).                                     
           02  AVVNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR3F.                                        
             03 AVVNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR3I  PIC X(15).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(7).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(3).                                              
           02  ALAUFZ3L    COMP  PIC  S9(4).                                    
           02  ALAUFZ3F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ3F.                                       
             03 ALAUFZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ3I  PIC X(3).                                              
           02  AMINLZ3L    COMP  PIC  S9(4).                                    
           02  AMINLZ3F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ3F.                                       
             03 AMINLZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ3I  PIC X(3).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(13).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(13).                                             
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(6).                                              
           02  EEEENT3L    COMP  PIC  S9(4).                                    
           02  EEEENT3F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT3F.                                       
             03 EEEENT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT3I  PIC X(2).                                              
           02  AVVNR4L    COMP  PIC  S9(4).                                     
           02  AVVNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR4F.                                        
             03 AVVNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR4I  PIC X(15).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(7).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(3).                                              
           02  ALAUFZ4L    COMP  PIC  S9(4).                                    
           02  ALAUFZ4F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ4F.                                       
             03 ALAUFZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ4I  PIC X(3).                                              
           02  AMINLZ4L    COMP  PIC  S9(4).                                    
           02  AMINLZ4F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ4F.                                       
             03 AMINLZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ4I  PIC X(3).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(13).                                             
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(13).                                             
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(6).                                              
           02  EEEENT4L    COMP  PIC  S9(4).                                    
           02  EEEENT4F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT4F.                                       
             03 EEEENT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT4I  PIC X(2).                                              
           02  AVVNR5L    COMP  PIC  S9(4).                                     
           02  AVVNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR5F.                                        
             03 AVVNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR5I  PIC X(15).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(7).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(3).                                              
           02  ALAUFZ5L    COMP  PIC  S9(4).                                    
           02  ALAUFZ5F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ5F.                                       
             03 ALAUFZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ5I  PIC X(3).                                              
           02  AMINLZ5L    COMP  PIC  S9(4).                                    
           02  AMINLZ5F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ5F.                                       
             03 AMINLZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ5I  PIC X(3).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(13).                                             
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(13).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(6).                                              
           02  EEEENT5L    COMP  PIC  S9(4).                                    
           02  EEEENT5F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT5F.                                       
             03 EEEENT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT5I  PIC X(2).                                              
           02  AVVNR6L    COMP  PIC  S9(4).                                     
           02  AVVNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR6F.                                        
             03 AVVNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR6I  PIC X(15).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(7).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  ALAUFZ6L    COMP  PIC  S9(4).                                    
           02  ALAUFZ6F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ6F.                                       
             03 ALAUFZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ6I  PIC X(3).                                              
           02  AMINLZ6L    COMP  PIC  S9(4).                                    
           02  AMINLZ6F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ6F.                                       
             03 AMINLZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ6I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(13).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(13).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(6).                                              
           02  EEEENT6L    COMP  PIC  S9(4).                                    
           02  EEEENT6F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT6F.                                       
             03 EEEENT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT6I  PIC X(2).                                              
           02  AVVNR7L    COMP  PIC  S9(4).                                     
           02  AVVNR7F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR7F.                                        
             03 AVVNR7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR7I  PIC X(15).                                              
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(7).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(3).                                              
           02  ALAUFZ7L    COMP  PIC  S9(4).                                    
           02  ALAUFZ7F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ7F.                                       
             03 ALAUFZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ7I  PIC X(3).                                              
           02  AMINLZ7L    COMP  PIC  S9(4).                                    
           02  AMINLZ7F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ7F.                                       
             03 AMINLZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ7I  PIC X(3).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(13).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(13).                                             
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(6).                                              
           02  EEEENT7L    COMP  PIC  S9(4).                                    
           02  EEEENT7F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT7F.                                       
             03 EEEENT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT7I  PIC X(2).                                              
           02  AVVNR8L    COMP  PIC  S9(4).                                     
           02  AVVNR8F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR8F.                                        
             03 AVVNR8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR8I  PIC X(15).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(7).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(3).                                              
           02  ALAUFZ8L    COMP  PIC  S9(4).                                    
           02  ALAUFZ8F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ8F.                                       
             03 ALAUFZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ8I  PIC X(3).                                              
           02  AMINLZ8L    COMP  PIC  S9(4).                                    
           02  AMINLZ8F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ8F.                                       
             03 AMINLZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ8I  PIC X(3).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(13).                                             
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(13).                                             
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(6).                                              
           02  EEEENT8L    COMP  PIC  S9(4).                                    
           02  EEEENT8F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT8F.                                       
             03 EEEENT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT8I  PIC X(2).                                              
           02  AVVNR9L    COMP  PIC  S9(4).                                     
           02  AVVNR9F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR9F.                                        
             03 AVVNR9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR9I  PIC X(15).                                              
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(7).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(3).                                              
           02  ALAUFZ9L    COMP  PIC  S9(4).                                    
           02  ALAUFZ9F    PICTURE X.                                           
           02  FILLER REDEFINES ALAUFZ9F.                                       
             03 ALAUFZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALAUFZ9I  PIC X(3).                                              
           02  AMINLZ9L    COMP  PIC  S9(4).                                    
           02  AMINLZ9F    PICTURE X.                                           
           02  FILLER REDEFINES AMINLZ9F.                                       
             03 AMINLZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMINLZ9I  PIC X(3).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(13).                                             
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(13).                                             
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(6).                                              
           02  EEEENT9L    COMP  PIC  S9(4).                                    
           02  EEEENT9F    PICTURE X.                                           
           02  FILLER REDEFINES EEEENT9F.                                       
             03 EEEENT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EEEENT9I  PIC X(2).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0043O REDEFINES BPA0043I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AAVERMH    PICTURE X.                                            
           02  AAVERMO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAVMPZH    PICTURE X.                                            
           02  AAVMPZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVONH    PICTURE X.                                           
           02  AFAEVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFAEBISH    PICTURE X.                                           
           02  AFAEBISO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVVNRH    PICTURE X.                                             
           02  AVVNRO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKDBETRH    PICTURE X.                                           
           02  AKDBETRO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZH    PICTURE X.                                            
           02  ALAUFZO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMINLZH    PICTURE X.                                            
           02  AMINLZO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AJNPEVSH    PICTURE X.                                           
           02  AJNPEVSO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AJNPVNRH    PICTURE X.                                           
           02  AJNPVNRO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERHJNPH    PICTURE X.                                           
           02  AERHJNPO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENTH    PICTURE X.                                            
           02  EEEENTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVVNR2H    PICTURE X.                                            
           02  AVVNR2O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ2H    PICTURE X.                                           
           02  ALAUFZ2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ2H    PICTURE X.                                           
           02  AMINLZ2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT2H    PICTURE X.                                           
           02  EEEENT2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR3H    PICTURE X.                                            
           02  AVVNR3O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ3H    PICTURE X.                                           
           02  ALAUFZ3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ3H    PICTURE X.                                           
           02  AMINLZ3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT3H    PICTURE X.                                           
           02  EEEENT3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR4H    PICTURE X.                                            
           02  AVVNR4O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ4H    PICTURE X.                                           
           02  ALAUFZ4O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ4H    PICTURE X.                                           
           02  AMINLZ4O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT4H    PICTURE X.                                           
           02  EEEENT4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR5H    PICTURE X.                                            
           02  AVVNR5O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ5H    PICTURE X.                                           
           02  ALAUFZ5O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ5H    PICTURE X.                                           
           02  AMINLZ5O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT5H    PICTURE X.                                           
           02  EEEENT5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR6H    PICTURE X.                                            
           02  AVVNR6O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ6H    PICTURE X.                                           
           02  ALAUFZ6O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ6H    PICTURE X.                                           
           02  AMINLZ6O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT6H    PICTURE X.                                           
           02  EEEENT6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR7H    PICTURE X.                                            
           02  AVVNR7O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ7H    PICTURE X.                                           
           02  ALAUFZ7O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ7H    PICTURE X.                                           
           02  AMINLZ7O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT7H    PICTURE X.                                           
           02  EEEENT7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR8H    PICTURE X.                                            
           02  AVVNR8O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ8H    PICTURE X.                                           
           02  ALAUFZ8O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ8H    PICTURE X.                                           
           02  AMINLZ8O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT8H    PICTURE X.                                           
           02  EEEENT8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR9H    PICTURE X.                                            
           02  AVVNR9O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALAUFZ9H    PICTURE X.                                           
           02  ALAUFZ9O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINLZ9H    PICTURE X.                                           
           02  AMINLZ9O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEEENT9H    PICTURE X.                                           
           02  EEEENT9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
