       01  BPA0038I.                                                            
           02  FILLER PIC X(12).                                                
           02  EPARTL    COMP  PIC  S9(4).                                      
           02  EPARTF    PICTURE X.                                             
           02  FILLER REDEFINES EPARTF.                                         
             03 EPARTA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EPARTI  PIC X(3).                                                
           02  APARTBML    COMP  PIC  S9(4).                                    
           02  APARTBMF    PICTURE X.                                           
           02  FILLER REDEFINES APARTBMF.                                       
             03 APARTBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APARTBMI  PIC X(10).                                             
           02  EPOBJL    COMP  PIC  S9(4).                                      
           02  EPOBJF    PICTURE X.                                             
           02  FILLER REDEFINES EPOBJF.                                         
             03 EPOBJA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EPOBJI  PIC X(3).                                                
           02  APOBJBML    COMP  PIC  S9(4).                                    
           02  APOBJBMF    PICTURE X.                                           
           02  FILLER REDEFINES APOBJBMF.                                       
             03 APOBJBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APOBJBMI  PIC X(10).                                             
           02  ADOPPELL    COMP  PIC  S9(4).                                    
           02  ADOPPELF    PICTURE X.                                           
           02  FILLER REDEFINES ADOPPELF.                                       
             03 ADOPPELA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADOPPELI  PIC X(1).                                              
           02  EPAUSL    COMP  PIC  S9(4).                                      
           02  EPAUSF    PICTURE X.                                             
           02  FILLER REDEFINES EPAUSF.                                         
             03 EPAUSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EPAUSI  PIC X(3).                                                
           02  APAUSBML    COMP  PIC  S9(4).                                    
           02  APAUSBMF    PICTURE X.                                           
           02  FILLER REDEFINES APAUSBMF.                                       
             03 APAUSBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APAUSBMI  PIC X(10).                                             
           02  EAERTTL    COMP  PIC  S9(4).                                     
           02  EAERTTF    PICTURE X.                                            
           02  FILLER REDEFINES EAERTTF.                                        
             03 EAERTTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAERTTI  PIC X(2).                                               
           02  EAERMML    COMP  PIC  S9(4).                                     
           02  EAERMMF    PICTURE X.                                            
           02  FILLER REDEFINES EAERMMF.                                        
             03 EAERMMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAERMMI  PIC X(2).                                               
           02  EAERJJL    COMP  PIC  S9(4).                                     
           02  EAERJJF    PICTURE X.                                            
           02  FILLER REDEFINES EAERJJF.                                        
             03 EAERJJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAERJJI  PIC X(4).                                               
           02  EBERTTL    COMP  PIC  S9(4).                                     
           02  EBERTTF    PICTURE X.                                            
           02  FILLER REDEFINES EBERTTF.                                        
             03 EBERTTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBERTTI  PIC X(2).                                               
           02  EBERMML    COMP  PIC  S9(4).                                     
           02  EBERMMF    PICTURE X.                                            
           02  FILLER REDEFINES EBERMMF.                                        
             03 EBERMMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBERMMI  PIC X(2).                                               
           02  EBERJJL    COMP  PIC  S9(4).                                     
           02  EBERJJF    PICTURE X.                                            
           02  FILLER REDEFINES EBERJJF.                                        
             03 EBERJJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBERJJI  PIC X(4).                                               
           02  AMODTXTL    COMP  PIC  S9(4).                                    
           02  AMODTXTF    PICTURE X.                                           
           02  FILLER REDEFINES AMODTXTF.                                       
             03 AMODTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMODTXTI  PIC X(79).                                             
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  APOBJBKL    COMP  PIC  S9(4).                                    
           02  APOBJBKF    PICTURE X.                                           
           02  FILLER REDEFINES APOBJBKF.                                       
             03 APOBJBKA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APOBJBKI  PIC X(4).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(4).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(4).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(4).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(4).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(4).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(4).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(4).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(4).                                              
           02  APAUSL    COMP  PIC  S9(4).                                      
           02  APAUSF    PICTURE X.                                             
           02  FILLER REDEFINES APAUSF.                                         
             03 APAUSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APAUSI  PIC X(3).                                                
           02  APAUS2L    COMP  PIC  S9(4).                                     
           02  APAUS2F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS2F.                                        
             03 APAUS2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS2I  PIC X(3).                                               
           02  APAUS3L    COMP  PIC  S9(4).                                     
           02  APAUS3F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS3F.                                        
             03 APAUS3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS3I  PIC X(3).                                               
           02  APAUS4L    COMP  PIC  S9(4).                                     
           02  APAUS4F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS4F.                                        
             03 APAUS4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS4I  PIC X(3).                                               
           02  APAUS5L    COMP  PIC  S9(4).                                     
           02  APAUS5F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS5F.                                        
             03 APAUS5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS5I  PIC X(3).                                               
           02  APAUS6L    COMP  PIC  S9(4).                                     
           02  APAUS6F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS6F.                                        
             03 APAUS6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS6I  PIC X(3).                                               
           02  APAUS7L    COMP  PIC  S9(4).                                     
           02  APAUS7F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS7F.                                        
             03 APAUS7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS7I  PIC X(3).                                               
           02  APAUS8L    COMP  PIC  S9(4).                                     
           02  APAUS8F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS8F.                                        
             03 APAUS8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS8I  PIC X(3).                                               
           02  APAUS9L    COMP  PIC  S9(4).                                     
           02  APAUS9F    PICTURE X.                                            
           02  FILLER REDEFINES APAUS9F.                                        
             03 APAUS9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APAUS9I  PIC X(3).                                               
           02  APAUTBML    COMP  PIC  S9(4).                                    
           02  APAUTBMF    PICTURE X.                                           
           02  FILLER REDEFINES APAUTBMF.                                       
             03 APAUTBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APAUTBMI  PIC X(10).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(10).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(10).                                             
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(10).                                             
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(10).                                             
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  AERDATL    COMP  PIC  S9(4).                                     
           02  AERDATF    PICTURE X.                                            
           02  FILLER REDEFINES AERDATF.                                        
             03 AERDATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AERDATI  PIC X(10).                                              
           02  AERDAT2L    COMP  PIC  S9(4).                                    
           02  AERDAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT2F.                                       
             03 AERDAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT2I  PIC X(10).                                             
           02  AERDAT3L    COMP  PIC  S9(4).                                    
           02  AERDAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT3F.                                       
             03 AERDAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT3I  PIC X(10).                                             
           02  AERDAT4L    COMP  PIC  S9(4).                                    
           02  AERDAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT4F.                                       
             03 AERDAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT4I  PIC X(10).                                             
           02  AERDAT5L    COMP  PIC  S9(4).                                    
           02  AERDAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT5F.                                       
             03 AERDAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT5I  PIC X(10).                                             
           02  AERDAT6L    COMP  PIC  S9(4).                                    
           02  AERDAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT6F.                                       
             03 AERDAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT6I  PIC X(10).                                             
           02  AERDAT7L    COMP  PIC  S9(4).                                    
           02  AERDAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT7F.                                       
             03 AERDAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT7I  PIC X(10).                                             
           02  AERDAT8L    COMP  PIC  S9(4).                                    
           02  AERDAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT8F.                                       
             03 AERDAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT8I  PIC X(10).                                             
           02  AERDAT9L    COMP  PIC  S9(4).                                    
           02  AERDAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AERDAT9F.                                       
             03 AERDAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERDAT9I  PIC X(10).                                             
           02  APARTBLL    COMP  PIC  S9(4).                                    
           02  APARTBLF    PICTURE X.                                           
           02  FILLER REDEFINES APARTBLF.                                       
             03 APARTBLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APARTBLI  PIC X(40).                                             
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(40).                                             
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(40).                                             
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(40).                                             
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(40).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(40).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(40).                                             
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(40).                                             
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(40).                                             
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0038O REDEFINES BPA0038I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPARTH    PICTURE X.                                             
           02  EPARTO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  APARTBMH    PICTURE X.                                           
           02  APARTBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPOBJH    PICTURE X.                                             
           02  EPOBJO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  APOBJBMH    PICTURE X.                                           
           02  APOBJBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADOPPELH    PICTURE X.                                           
           02  ADOPPELO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPAUSH    PICTURE X.                                             
           02  EPAUSO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  APAUSBMH    PICTURE X.                                           
           02  APAUSBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EAERTTH    PICTURE X.                                            
           02  EAERTTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAERMMH    PICTURE X.                                            
           02  EAERMMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAERJJH    PICTURE X.                                            
           02  EAERJJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBERTTH    PICTURE X.                                            
           02  EBERTTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBERMMH    PICTURE X.                                            
           02  EBERMMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBERJJH    PICTURE X.                                            
           02  EBERJJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMODTXTH    PICTURE X.                                           
           02  AMODTXTO  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APOBJBKH    PICTURE X.                                           
           02  APOBJBKO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APAUSH    PICTURE X.                                             
           02  APAUSO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  APAUS2H    PICTURE X.                                            
           02  APAUS2O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS3H    PICTURE X.                                            
           02  APAUS3O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS4H    PICTURE X.                                            
           02  APAUS4O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS5H    PICTURE X.                                            
           02  APAUS5O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS6H    PICTURE X.                                            
           02  APAUS6O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS7H    PICTURE X.                                            
           02  APAUS7O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS8H    PICTURE X.                                            
           02  APAUS8O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUS9H    PICTURE X.                                            
           02  APAUS9O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  APAUTBMH    PICTURE X.                                           
           02  APAUTBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDATH    PICTURE X.                                            
           02  AERDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AERDAT2H    PICTURE X.                                           
           02  AERDAT2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT3H    PICTURE X.                                           
           02  AERDAT3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT4H    PICTURE X.                                           
           02  AERDAT4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT5H    PICTURE X.                                           
           02  AERDAT5O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT6H    PICTURE X.                                           
           02  AERDAT6O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT7H    PICTURE X.                                           
           02  AERDAT7O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT8H    PICTURE X.                                           
           02  AERDAT8O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERDAT9H    PICTURE X.                                           
           02  AERDAT9O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APARTBLH    PICTURE X.                                           
           02  APARTBLO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
