       01  BPA0013I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  ESDATTTL    COMP  PIC  S9(4).                                    
           02  ESDATTTF    PICTURE X.                                           
           02  FILLER REDEFINES ESDATTTF.                                       
             03 ESDATTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESDATTTI  PIC X(2).                                              
           02  ESDATMML    COMP  PIC  S9(4).                                    
           02  ESDATMMF    PICTURE X.                                           
           02  FILLER REDEFINES ESDATMMF.                                       
             03 ESDATMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESDATMMI  PIC X(2).                                              
           02  ESDATJJL    COMP  PIC  S9(4).                                    
           02  ESDATJJF    PICTURE X.                                           
           02  FILLER REDEFINES ESDATJJF.                                       
             03 ESDATJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESDATJJI  PIC XXXX.                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(30).                                             
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  EGABTT2L    COMP  PIC  S9(4).                                    
           02  EGABTT2F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT2F.                                       
             03 EGABTT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT2I  PIC X(2).                                              
           02  EGABMM2L    COMP  PIC  S9(4).                                    
           02  EGABMM2F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM2F.                                       
             03 EGABMM2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM2I  PIC X(2).                                              
           02  EGABJJ2L    COMP  PIC  S9(4).                                    
           02  EGABJJ2F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ2F.                                       
             03 EGABJJ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ2I  PIC X(4).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(2).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(2).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(4).                                              
           02  AVGESL    COMP  PIC  S9(4).                                      
           02  AVGESF    PICTURE X.                                             
           02  FILLER REDEFINES AVGESF.                                         
             03 AVGESA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVGESI  PIC X(9).                                                
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(30).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  EGABTT3L    COMP  PIC  S9(4).                                    
           02  EGABTT3F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT3F.                                       
             03 EGABTT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT3I  PIC X(2).                                              
           02  EGABMM3L    COMP  PIC  S9(4).                                    
           02  EGABMM3F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM3F.                                       
             03 EGABMM3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM3I  PIC X(2).                                              
           02  EGABJJ3L    COMP  PIC  S9(4).                                    
           02  EGABJJ3F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ3F.                                       
             03 EGABJJ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ3I  PIC X(4).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(2).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(2).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(4).                                              
           02  AVGES2L    COMP  PIC  S9(4).                                     
           02  AVGES2F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES2F.                                        
             03 AVGES2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES2I  PIC X(9).                                               
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(3).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(30).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  EGABTT4L    COMP  PIC  S9(4).                                    
           02  EGABTT4F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT4F.                                       
             03 EGABTT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT4I  PIC X(2).                                              
           02  EGABMM4L    COMP  PIC  S9(4).                                    
           02  EGABMM4F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM4F.                                       
             03 EGABMM4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM4I  PIC X(2).                                              
           02  EGABJJ4L    COMP  PIC  S9(4).                                    
           02  EGABJJ4F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ4F.                                       
             03 EGABJJ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ4I  PIC X(4).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(2).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(2).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(4).                                              
           02  AVGES3L    COMP  PIC  S9(4).                                     
           02  AVGES3F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES3F.                                        
             03 AVGES3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES3I  PIC X(9).                                               
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(30).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(10).                                             
           02  EGABTT5L    COMP  PIC  S9(4).                                    
           02  EGABTT5F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT5F.                                       
             03 EGABTT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT5I  PIC X(2).                                              
           02  EGABMM5L    COMP  PIC  S9(4).                                    
           02  EGABMM5F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM5F.                                       
             03 EGABMM5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM5I  PIC X(2).                                              
           02  EGABJJ5L    COMP  PIC  S9(4).                                    
           02  EGABJJ5F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ5F.                                       
             03 EGABJJ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ5I  PIC X(4).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(2).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(2).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(4).                                              
           02  AVGES4L    COMP  PIC  S9(4).                                     
           02  AVGES4F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES4F.                                        
             03 AVGES4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES4I  PIC X(9).                                               
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(3).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(30).                                             
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  EGABTT6L    COMP  PIC  S9(4).                                    
           02  EGABTT6F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT6F.                                       
             03 EGABTT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT6I  PIC X(2).                                              
           02  EGABMM6L    COMP  PIC  S9(4).                                    
           02  EGABMM6F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM6F.                                       
             03 EGABMM6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM6I  PIC X(2).                                              
           02  EGABJJ6L    COMP  PIC  S9(4).                                    
           02  EGABJJ6F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ6F.                                       
             03 EGABJJ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ6I  PIC X(4).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(2).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(2).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(4).                                              
           02  AVGES5L    COMP  PIC  S9(4).                                     
           02  AVGES5F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES5F.                                        
             03 AVGES5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES5I  PIC X(9).                                               
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(3).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(30).                                             
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  EGABTT7L    COMP  PIC  S9(4).                                    
           02  EGABTT7F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT7F.                                       
             03 EGABTT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT7I  PIC X(2).                                              
           02  EGABMM7L    COMP  PIC  S9(4).                                    
           02  EGABMM7F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM7F.                                       
             03 EGABMM7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM7I  PIC X(2).                                              
           02  EGABJJ7L    COMP  PIC  S9(4).                                    
           02  EGABJJ7F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ7F.                                       
             03 EGABJJ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ7I  PIC X(4).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(2).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(2).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(4).                                              
           02  AVGES6L    COMP  PIC  S9(4).                                     
           02  AVGES6F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES6F.                                        
             03 AVGES6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES6I  PIC X(9).                                               
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(3).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(30).                                             
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(10).                                             
           02  EGABTT8L    COMP  PIC  S9(4).                                    
           02  EGABTT8F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT8F.                                       
             03 EGABTT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT8I  PIC X(2).                                              
           02  EGABMM8L    COMP  PIC  S9(4).                                    
           02  EGABMM8F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM8F.                                       
             03 EGABMM8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM8I  PIC X(2).                                              
           02  EGABJJ8L    COMP  PIC  S9(4).                                    
           02  EGABJJ8F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ8F.                                       
             03 EGABJJ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ8I  PIC X(4).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(2).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(2).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(4).                                              
           02  AVGES7L    COMP  PIC  S9(4).                                     
           02  AVGES7F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES7F.                                        
             03 AVGES7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES7I  PIC X(9).                                               
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(3).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(30).                                             
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(10).                                             
           02  EGABTT9L    COMP  PIC  S9(4).                                    
           02  EGABTT9F    PICTURE X.                                           
           02  FILLER REDEFINES EGABTT9F.                                       
             03 EGABTT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABTT9I  PIC X(2).                                              
           02  EGABMM9L    COMP  PIC  S9(4).                                    
           02  EGABMM9F    PICTURE X.                                           
           02  FILLER REDEFINES EGABMM9F.                                       
             03 EGABMM9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABMM9I  PIC X(2).                                              
           02  EGABJJ9L    COMP  PIC  S9(4).                                    
           02  EGABJJ9F    PICTURE X.                                           
           02  FILLER REDEFINES EGABJJ9F.                                       
             03 EGABJJ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGABJJ9I  PIC X(4).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(2).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(2).                                              
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(4).                                              
           02  AVGES8L    COMP  PIC  S9(4).                                     
           02  AVGES8F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES8F.                                        
             03 AVGES8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES8I  PIC X(9).                                               
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(3).                                              
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(30).                                             
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(10).                                             
           02  F000116L    COMP  PIC  S9(4).                                    
           02  F000116F    PICTURE X.                                           
           02  FILLER REDEFINES F000116F.                                       
             03 F000116A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000116I  PIC X(2).                                              
           02  F000115L    COMP  PIC  S9(4).                                    
           02  F000115F    PICTURE X.                                           
           02  FILLER REDEFINES F000115F.                                       
             03 F000115A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000115I  PIC X(2).                                              
           02  F000114L    COMP  PIC  S9(4).                                    
           02  F000114F    PICTURE X.                                           
           02  FILLER REDEFINES F000114F.                                       
             03 F000114A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000114I  PIC X(4).                                              
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(2).                                              
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(2).                                              
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(4).                                              
           02  AVGES9L    COMP  PIC  S9(4).                                     
           02  AVGES9F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES9F.                                        
             03 AVGES9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES9I  PIC X(9).                                               
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  F000059L    COMP  PIC  S9(4).                                    
           02  F000059F    PICTURE X.                                           
           02  FILLER REDEFINES F000059F.                                       
             03 F000059A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000059I  PIC X(3).                                              
           02  F000058L    COMP  PIC  S9(4).                                    
           02  F000058F    PICTURE X.                                           
           02  FILLER REDEFINES F000058F.                                       
             03 F000058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000058I  PIC X(30).                                             
           02  F000057L    COMP  PIC  S9(4).                                    
           02  F000057F    PICTURE X.                                           
           02  FILLER REDEFINES F000057F.                                       
             03 F000057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000057I  PIC X(10).                                             
           02  F000119L    COMP  PIC  S9(4).                                    
           02  F000119F    PICTURE X.                                           
           02  FILLER REDEFINES F000119F.                                       
             03 F000119A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000119I  PIC X(2).                                              
           02  F000118L    COMP  PIC  S9(4).                                    
           02  F000118F    PICTURE X.                                           
           02  FILLER REDEFINES F000118F.                                       
             03 F000118A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000118I  PIC X(2).                                              
           02  F000117L    COMP  PIC  S9(4).                                    
           02  F000117F    PICTURE X.                                           
           02  FILLER REDEFINES F000117F.                                       
             03 F000117A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000117I  PIC X(4).                                              
           02  F000056L    COMP  PIC  S9(4).                                    
           02  F000056F    PICTURE X.                                           
           02  FILLER REDEFINES F000056F.                                       
             03 F000056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000056I  PIC X(2).                                              
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(2).                                              
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(4).                                              
           02  AVGES92L    COMP  PIC  S9(4).                                    
           02  AVGES92F    PICTURE X.                                           
           02  FILLER REDEFINES AVGES92F.                                       
             03 AVGES92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVGES92I  PIC X(9).                                              
           02  EFCZ922L    COMP  PIC  S9(4).                                    
           02  EFCZ922F    PICTURE X.                                           
           02  FILLER REDEFINES EFCZ922F.                                       
             03 EFCZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ922I  PIC X(1).                                              
           02  F000129L    COMP  PIC  S9(4).                                    
           02  F000129F    PICTURE X.                                           
           02  FILLER REDEFINES F000129F.                                       
             03 F000129A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000129I  PIC X(3).                                              
           02  F000128L    COMP  PIC  S9(4).                                    
           02  F000128F    PICTURE X.                                           
           02  FILLER REDEFINES F000128F.                                       
             03 F000128A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000128I  PIC X(30).                                             
           02  F000127L    COMP  PIC  S9(4).                                    
           02  F000127F    PICTURE X.                                           
           02  FILLER REDEFINES F000127F.                                       
             03 F000127A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000127I  PIC X(10).                                             
           02  F000126L    COMP  PIC  S9(4).                                    
           02  F000126F    PICTURE X.                                           
           02  FILLER REDEFINES F000126F.                                       
             03 F000126A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000126I  PIC X(2).                                              
           02  F000125L    COMP  PIC  S9(4).                                    
           02  F000125F    PICTURE X.                                           
           02  FILLER REDEFINES F000125F.                                       
             03 F000125A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000125I  PIC X(2).                                              
           02  F000124L    COMP  PIC  S9(4).                                    
           02  F000124F    PICTURE X.                                           
           02  FILLER REDEFINES F000124F.                                       
             03 F000124A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000124I  PIC X(4).                                              
           02  F000123L    COMP  PIC  S9(4).                                    
           02  F000123F    PICTURE X.                                           
           02  FILLER REDEFINES F000123F.                                       
             03 F000123A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000123I  PIC X(2).                                              
           02  F000122L    COMP  PIC  S9(4).                                    
           02  F000122F    PICTURE X.                                           
           02  FILLER REDEFINES F000122F.                                       
             03 F000122A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000122I  PIC X(2).                                              
           02  F000121L    COMP  PIC  S9(4).                                    
           02  F000121F    PICTURE X.                                           
           02  FILLER REDEFINES F000121F.                                       
             03 F000121A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000121I  PIC X(4).                                              
           02  F000120L    COMP  PIC  S9(4).                                    
           02  F000120F    PICTURE X.                                           
           02  FILLER REDEFINES F000120F.                                       
             03 F000120A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000120I  PIC X(9).                                              
           02  F000140L    COMP  PIC  S9(4).                                    
           02  F000140F    PICTURE X.                                           
           02  FILLER REDEFINES F000140F.                                       
             03 F000140A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000140I  PIC X(1).                                              
           02  F000139L    COMP  PIC  S9(4).                                    
           02  F000139F    PICTURE X.                                           
           02  FILLER REDEFINES F000139F.                                       
             03 F000139A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000139I  PIC X(3).                                              
           02  F000138L    COMP  PIC  S9(4).                                    
           02  F000138F    PICTURE X.                                           
           02  FILLER REDEFINES F000138F.                                       
             03 F000138A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000138I  PIC X(30).                                             
           02  F000137L    COMP  PIC  S9(4).                                    
           02  F000137F    PICTURE X.                                           
           02  FILLER REDEFINES F000137F.                                       
             03 F000137A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000137I  PIC X(10).                                             
           02  F000136L    COMP  PIC  S9(4).                                    
           02  F000136F    PICTURE X.                                           
           02  FILLER REDEFINES F000136F.                                       
             03 F000136A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000136I  PIC X(2).                                              
           02  F000135L    COMP  PIC  S9(4).                                    
           02  F000135F    PICTURE X.                                           
           02  FILLER REDEFINES F000135F.                                       
             03 F000135A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000135I  PIC X(2).                                              
           02  F000134L    COMP  PIC  S9(4).                                    
           02  F000134F    PICTURE X.                                           
           02  FILLER REDEFINES F000134F.                                       
             03 F000134A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000134I  PIC X(4).                                              
           02  F000133L    COMP  PIC  S9(4).                                    
           02  F000133F    PICTURE X.                                           
           02  FILLER REDEFINES F000133F.                                       
             03 F000133A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000133I  PIC X(2).                                              
           02  F000132L    COMP  PIC  S9(4).                                    
           02  F000132F    PICTURE X.                                           
           02  FILLER REDEFINES F000132F.                                       
             03 F000132A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000132I  PIC X(2).                                              
           02  F000131L    COMP  PIC  S9(4).                                    
           02  F000131F    PICTURE X.                                           
           02  FILLER REDEFINES F000131F.                                       
             03 F000131A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000131I  PIC X(4).                                              
           02  F000130L    COMP  PIC  S9(4).                                    
           02  F000130F    PICTURE X.                                           
           02  FILLER REDEFINES F000130F.                                       
             03 F000130A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000130I  PIC X(9).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(78).                                              
       01  BPA0013O REDEFINES BPA0013I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESDATTTH    PICTURE X.                                           
           02  ESDATTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESDATMMH    PICTURE X.                                           
           02  ESDATMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESDATJJH    PICTURE X.                                           
           02  ESDATJJO PIC XXXX.                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT2H    PICTURE X.                                           
           02  EGABTT2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM2H    PICTURE X.                                           
           02  EGABMM2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ2H    PICTURE X.                                           
           02  EGABJJ2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGESH    PICTURE X.                                             
           02  AVGESO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT3H    PICTURE X.                                           
           02  EGABTT3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM3H    PICTURE X.                                           
           02  EGABMM3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ3H    PICTURE X.                                           
           02  EGABJJ3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES2H    PICTURE X.                                            
           02  AVGES2O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT4H    PICTURE X.                                           
           02  EGABTT4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM4H    PICTURE X.                                           
           02  EGABMM4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ4H    PICTURE X.                                           
           02  EGABJJ4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES3H    PICTURE X.                                            
           02  AVGES3O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT5H    PICTURE X.                                           
           02  EGABTT5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM5H    PICTURE X.                                           
           02  EGABMM5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ5H    PICTURE X.                                           
           02  EGABJJ5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES4H    PICTURE X.                                            
           02  AVGES4O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT6H    PICTURE X.                                           
           02  EGABTT6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM6H    PICTURE X.                                           
           02  EGABMM6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ6H    PICTURE X.                                           
           02  EGABJJ6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES5H    PICTURE X.                                            
           02  AVGES5O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT7H    PICTURE X.                                           
           02  EGABTT7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM7H    PICTURE X.                                           
           02  EGABMM7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ7H    PICTURE X.                                           
           02  EGABJJ7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES6H    PICTURE X.                                            
           02  AVGES6O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT8H    PICTURE X.                                           
           02  EGABTT8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM8H    PICTURE X.                                           
           02  EGABMM8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ8H    PICTURE X.                                           
           02  EGABJJ8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES7H    PICTURE X.                                            
           02  AVGES7O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGABTT9H    PICTURE X.                                           
           02  EGABTT9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABMM9H    PICTURE X.                                           
           02  EGABMM9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGABJJ9H    PICTURE X.                                           
           02  EGABJJ9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES8H    PICTURE X.                                            
           02  AVGES8O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000116H    PICTURE X.                                           
           02  F000116O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000115H    PICTURE X.                                           
           02  F000115O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000114H    PICTURE X.                                           
           02  F000114O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES9H    PICTURE X.                                            
           02  AVGES9O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000059H    PICTURE X.                                           
           02  F000059O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000058H    PICTURE X.                                           
           02  F000058O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000057H    PICTURE X.                                           
           02  F000057O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000119H    PICTURE X.                                           
           02  F000119O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000118H    PICTURE X.                                           
           02  F000118O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000117H    PICTURE X.                                           
           02  F000117O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000056H    PICTURE X.                                           
           02  F000056O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGES92H    PICTURE X.                                           
           02  AVGES92O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ922H    PICTURE X.                                           
           02  EFCZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000129H    PICTURE X.                                           
           02  F000129O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000128H    PICTURE X.                                           
           02  F000128O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000127H    PICTURE X.                                           
           02  F000127O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000126H    PICTURE X.                                           
           02  F000126O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000125H    PICTURE X.                                           
           02  F000125O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000124H    PICTURE X.                                           
           02  F000124O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000123H    PICTURE X.                                           
           02  F000123O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000122H    PICTURE X.                                           
           02  F000122O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000121H    PICTURE X.                                           
           02  F000121O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000120H    PICTURE X.                                           
           02  F000120O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000140H    PICTURE X.                                           
           02  F000140O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000139H    PICTURE X.                                           
           02  F000139O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000138H    PICTURE X.                                           
           02  F000138O  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000137H    PICTURE X.                                           
           02  F000137O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000136H    PICTURE X.                                           
           02  F000136O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000135H    PICTURE X.                                           
           02  F000135O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000134H    PICTURE X.                                           
           02  F000134O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000133H    PICTURE X.                                           
           02  F000133O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000132H    PICTURE X.                                           
           02  F000132O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000131H    PICTURE X.                                           
           02  F000131O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000130H    PICTURE X.                                           
           02  F000130O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(78).                                              
