       01  BPA0046I.                                                            
           02  FILLER PIC X(12).                                                
           02  EUMBVTTL    COMP  PIC  S9(4).                                    
           02  EUMBVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EUMBVTTF.                                       
             03 EUMBVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMBVTTI  PIC X(2).                                              
           02  EUMBVMML    COMP  PIC  S9(4).                                    
           02  EUMBVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EUMBVMMF.                                       
             03 EUMBVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMBVMMI  PIC X(2).                                              
           02  EUMBVJJL    COMP  PIC  S9(4).                                    
           02  EUMBVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EUMBVJJF.                                       
             03 EUMBVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMBVJJI  PIC X(4).                                              
           02  EUMBBTTL    COMP  PIC  S9(4).                                    
           02  EUMBBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EUMBBTTF.                                       
             03 EUMBBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMBBTTI  PIC X(2).                                              
           02  EUMBBMML    COMP  PIC  S9(4).                                    
           02  EUMBBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EUMBBMMF.                                       
             03 EUMBBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMBBMMI  PIC X(2).                                              
           02  EUMBBJJL    COMP  PIC  S9(4).                                    
           02  EUMBBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EUMBBJJF.                                       
             03 EUMBBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMBBJJI  PIC X(4).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVGESL    COMP  PIC  S9(4).                                      
           02  EVGESF    PICTURE X.                                             
           02  FILLER REDEFINES EVGESF.                                         
             03 EVGESA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVGESI  PIC X(1).                                                
           02  AVGESBML    COMP  PIC  S9(4).                                    
           02  AVGESBMF    PICTURE X.                                           
           02  FILLER REDEFINES AVGESBMF.                                       
             03 AVGESBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVGESBMI  PIC X(4).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EBGRUNDL    COMP  PIC  S9(4).                                    
           02  EBGRUNDF    PICTURE X.                                           
           02  FILLER REDEFINES EBGRUNDF.                                       
             03 EBGRUNDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBGRUNDI  PIC X(2).                                              
           02  ABGRUBML    COMP  PIC  S9(4).                                    
           02  ABGRUBMF    PICTURE X.                                           
           02  FILLER REDEFINES ABGRUBMF.                                       
             03 ABGRUBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABGRUBMI  PIC X(10).                                             
           02  AKENNGL    COMP  PIC  S9(4).                                     
           02  AKENNGF    PICTURE X.                                            
           02  FILLER REDEFINES AKENNGF.                                        
             03 AKENNGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AKENNGI  PIC X(17).                                              
           02  EKENNGL    COMP  PIC  S9(4).                                     
           02  EKENNGF    PICTURE X.                                            
           02  FILLER REDEFINES EKENNGF.                                        
             03 EKENNGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKENNGI  PIC X(8).                                               
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AZINFOL    COMP  PIC  S9(4).                                     
           02  AZINFOF    PICTURE X.                                            
           02  FILLER REDEFINES AZINFOF.                                        
             03 AZINFOA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZINFOI  PIC X(2).                                               
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  AUMBDATL    COMP  PIC  S9(4).                                    
           02  AUMBDATF    PICTURE X.                                           
           02  FILLER REDEFINES AUMBDATF.                                       
             03 AUMBDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUMBDATI  PIC X(10).                                             
           02  ABGRUNDL    COMP  PIC  S9(4).                                    
           02  ABGRUNDF    PICTURE X.                                           
           02  FILLER REDEFINES ABGRUNDF.                                       
             03 ABGRUNDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABGRUNDI  PIC X(2).                                              
           02  APRODL    COMP  PIC  S9(4).                                      
           02  APRODF    PICTURE X.                                             
           02  FILLER REDEFINES APRODF.                                         
             03 APRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APRODI  PIC X(6).                                                
           02  AFAEVONL    COMP  PIC  S9(4).                                    
           02  AFAEVONF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVONF.                                       
             03 AFAEVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVONI  PIC X(10).                                             
           02  AHISTNRL    COMP  PIC  S9(4).                                    
           02  AHISTNRF    PICTURE X.                                           
           02  FILLER REDEFINES AHISTNRF.                                       
             03 AHISTNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISTNRI  PIC X(3).                                              
           02  AGPVBTGL    COMP  PIC  S9(4).                                    
           02  AGPVBTGF    PICTURE X.                                           
           02  FILLER REDEFINES AGPVBTGF.                                       
             03 AGPVBTGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGPVBTGI  PIC X(11).                                             
           02  ADGVL    COMP  PIC  S9(4).                                       
           02  ADGVF    PICTURE X.                                              
           02  FILLER REDEFINES ADGVF.                                          
             03 ADGVA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADGVI  PIC X(2).                                                 
           02  ADIFFKZL    COMP  PIC  S9(4).                                    
           02  ADIFFKZF    PICTURE X.                                           
           02  FILLER REDEFINES ADIFFKZF.                                       
             03 ADIFFKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADIFFKZI  PIC X(1).                                              
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AZINFO2L    COMP  PIC  S9(4).                                    
           02  AZINFO2F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO2F.                                       
             03 AZINFO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO2I  PIC X(2).                                              
           02  AGES2L    COMP  PIC  S9(4).                                      
           02  AGES2F    PICTURE X.                                             
           02  FILLER REDEFINES AGES2F.                                         
             03 AGES2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES2I  PIC X(2).                                                
           02  AVNR2L    COMP  PIC  S9(4).                                      
           02  AVNR2F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR2F.                                         
             03 AVNR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR2I  PIC X(15).                                               
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(10).                                             
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(2).                                              
           02  APROD2L    COMP  PIC  S9(4).                                     
           02  APROD2F    PICTURE X.                                            
           02  FILLER REDEFINES APROD2F.                                        
             03 APROD2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD2I  PIC X(6).                                               
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(3).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(11).                                             
           02  ADGV2L    COMP  PIC  S9(4).                                      
           02  ADGV2F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV2F.                                         
             03 ADGV2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV2I  PIC X(2).                                                
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(1).                                              
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AZINFO3L    COMP  PIC  S9(4).                                    
           02  AZINFO3F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO3F.                                       
             03 AZINFO3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO3I  PIC X(2).                                              
           02  AGES3L    COMP  PIC  S9(4).                                      
           02  AGES3F    PICTURE X.                                             
           02  FILLER REDEFINES AGES3F.                                         
             03 AGES3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES3I  PIC X(2).                                                
           02  AVNR3L    COMP  PIC  S9(4).                                      
           02  AVNR3F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR3F.                                         
             03 AVNR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR3I  PIC X(15).                                               
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(10).                                             
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(2).                                              
           02  APROD3L    COMP  PIC  S9(4).                                     
           02  APROD3F    PICTURE X.                                            
           02  FILLER REDEFINES APROD3F.                                        
             03 APROD3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD3I  PIC X(6).                                               
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(3).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(11).                                             
           02  ADGV3L    COMP  PIC  S9(4).                                      
           02  ADGV3F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV3F.                                         
             03 ADGV3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV3I  PIC X(2).                                                
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(1).                                              
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AZINFO4L    COMP  PIC  S9(4).                                    
           02  AZINFO4F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO4F.                                       
             03 AZINFO4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO4I  PIC X(2).                                              
           02  AGES4L    COMP  PIC  S9(4).                                      
           02  AGES4F    PICTURE X.                                             
           02  FILLER REDEFINES AGES4F.                                         
             03 AGES4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES4I  PIC X(2).                                                
           02  AVNR4L    COMP  PIC  S9(4).                                      
           02  AVNR4F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR4F.                                         
             03 AVNR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR4I  PIC X(15).                                               
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(10).                                             
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(2).                                              
           02  APROD4L    COMP  PIC  S9(4).                                     
           02  APROD4F    PICTURE X.                                            
           02  FILLER REDEFINES APROD4F.                                        
             03 APROD4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD4I  PIC X(6).                                               
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(3).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(11).                                             
           02  ADGV4L    COMP  PIC  S9(4).                                      
           02  ADGV4F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV4F.                                         
             03 ADGV4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV4I  PIC X(2).                                                
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(1).                                              
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AZINFO5L    COMP  PIC  S9(4).                                    
           02  AZINFO5F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO5F.                                       
             03 AZINFO5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO5I  PIC X(2).                                              
           02  AGES5L    COMP  PIC  S9(4).                                      
           02  AGES5F    PICTURE X.                                             
           02  FILLER REDEFINES AGES5F.                                         
             03 AGES5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES5I  PIC X(2).                                                
           02  AVNR5L    COMP  PIC  S9(4).                                      
           02  AVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR5F.                                         
             03 AVNR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR5I  PIC X(15).                                               
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(10).                                             
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(2).                                              
           02  APROD5L    COMP  PIC  S9(4).                                     
           02  APROD5F    PICTURE X.                                            
           02  FILLER REDEFINES APROD5F.                                        
             03 APROD5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD5I  PIC X(6).                                               
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(10).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(3).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(11).                                             
           02  ADGV5L    COMP  PIC  S9(4).                                      
           02  ADGV5F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV5F.                                         
             03 ADGV5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV5I  PIC X(2).                                                
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(1).                                              
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AZINFO6L    COMP  PIC  S9(4).                                    
           02  AZINFO6F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO6F.                                       
             03 AZINFO6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO6I  PIC X(2).                                              
           02  AGES6L    COMP  PIC  S9(4).                                      
           02  AGES6F    PICTURE X.                                             
           02  FILLER REDEFINES AGES6F.                                         
             03 AGES6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES6I  PIC X(2).                                                
           02  AVNR6L    COMP  PIC  S9(4).                                      
           02  AVNR6F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR6F.                                         
             03 AVNR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR6I  PIC X(15).                                               
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(10).                                             
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(2).                                              
           02  APROD6L    COMP  PIC  S9(4).                                     
           02  APROD6F    PICTURE X.                                            
           02  FILLER REDEFINES APROD6F.                                        
             03 APROD6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD6I  PIC X(6).                                               
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(3).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(11).                                             
           02  ADGV6L    COMP  PIC  S9(4).                                      
           02  ADGV6F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV6F.                                         
             03 ADGV6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV6I  PIC X(2).                                                
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(1).                                              
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AZINFO7L    COMP  PIC  S9(4).                                    
           02  AZINFO7F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO7F.                                       
             03 AZINFO7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO7I  PIC X(2).                                              
           02  AGES7L    COMP  PIC  S9(4).                                      
           02  AGES7F    PICTURE X.                                             
           02  FILLER REDEFINES AGES7F.                                         
             03 AGES7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES7I  PIC X(2).                                                
           02  AVNR7L    COMP  PIC  S9(4).                                      
           02  AVNR7F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR7F.                                         
             03 AVNR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR7I  PIC X(15).                                               
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(10).                                             
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(2).                                              
           02  APROD7L    COMP  PIC  S9(4).                                     
           02  APROD7F    PICTURE X.                                            
           02  FILLER REDEFINES APROD7F.                                        
             03 APROD7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD7I  PIC X(6).                                               
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(10).                                             
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(3).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(11).                                             
           02  ADGV7L    COMP  PIC  S9(4).                                      
           02  ADGV7F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV7F.                                         
             03 ADGV7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV7I  PIC X(2).                                                
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(1).                                              
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AZINFO8L    COMP  PIC  S9(4).                                    
           02  AZINFO8F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO8F.                                       
             03 AZINFO8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO8I  PIC X(2).                                              
           02  AGES8L    COMP  PIC  S9(4).                                      
           02  AGES8F    PICTURE X.                                             
           02  FILLER REDEFINES AGES8F.                                         
             03 AGES8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES8I  PIC X(2).                                                
           02  AVNR8L    COMP  PIC  S9(4).                                      
           02  AVNR8F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR8F.                                         
             03 AVNR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR8I  PIC X(15).                                               
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(10).                                             
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(2).                                              
           02  APROD8L    COMP  PIC  S9(4).                                     
           02  APROD8F    PICTURE X.                                            
           02  FILLER REDEFINES APROD8F.                                        
             03 APROD8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD8I  PIC X(6).                                               
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(10).                                             
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(3).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(11).                                             
           02  ADGV8L    COMP  PIC  S9(4).                                      
           02  ADGV8F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV8F.                                         
             03 ADGV8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV8I  PIC X(2).                                                
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(1).                                              
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AZINFO9L    COMP  PIC  S9(4).                                    
           02  AZINFO9F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO9F.                                       
             03 AZINFO9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO9I  PIC X(2).                                              
           02  AGES9L    COMP  PIC  S9(4).                                      
           02  AGES9F    PICTURE X.                                             
           02  FILLER REDEFINES AGES9F.                                         
             03 AGES9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AGES9I  PIC X(2).                                                
           02  AVNR9L    COMP  PIC  S9(4).                                      
           02  AVNR9F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR9F.                                         
             03 AVNR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR9I  PIC X(15).                                               
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(10).                                             
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(2).                                              
           02  APROD9L    COMP  PIC  S9(4).                                     
           02  APROD9F    PICTURE X.                                            
           02  FILLER REDEFINES APROD9F.                                        
             03 APROD9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROD9I  PIC X(6).                                               
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(10).                                             
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(3).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(11).                                             
           02  ADGV9L    COMP  PIC  S9(4).                                      
           02  ADGV9F    PICTURE X.                                             
           02  FILLER REDEFINES ADGV9F.                                         
             03 ADGV9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADGV9I  PIC X(2).                                                
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(1).                                              
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(2).                                              
           02  AGES92L    COMP  PIC  S9(4).                                     
           02  AGES92F    PICTURE X.                                            
           02  FILLER REDEFINES AGES92F.                                        
             03 AGES92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGES92I  PIC X(2).                                               
           02  AVNR92L    COMP  PIC  S9(4).                                     
           02  AVNR92F    PICTURE X.                                            
           02  FILLER REDEFINES AVNR92F.                                        
             03 AVNR92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVNR92I  PIC X(15).                                              
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(10).                                             
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(2).                                              
           02  APROD92L    COMP  PIC  S9(4).                                    
           02  APROD92F    PICTURE X.                                           
           02  FILLER REDEFINES APROD92F.                                       
             03 APROD92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROD92I  PIC X(6).                                              
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(10).                                             
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(3).                                              
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(11).                                             
           02  ADGV92L    COMP  PIC  S9(4).                                     
           02  ADGV92F    PICTURE X.                                            
           02  FILLER REDEFINES ADGV92F.                                        
             03 ADGV92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADGV92I  PIC X(2).                                               
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(1).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0046O REDEFINES BPA0046I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EUMBVTTH    PICTURE X.                                           
           02  EUMBVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMBVMMH    PICTURE X.                                           
           02  EUMBVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMBVJJH    PICTURE X.                                           
           02  EUMBVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMBBTTH    PICTURE X.                                           
           02  EUMBBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMBBMMH    PICTURE X.                                           
           02  EUMBBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMBBJJH    PICTURE X.                                           
           02  EUMBBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVGESH    PICTURE X.                                             
           02  EVGESO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVGESBMH    PICTURE X.                                           
           02  AVGESBMO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBGRUNDH    PICTURE X.                                           
           02  EBGRUNDO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABGRUBMH    PICTURE X.                                           
           02  ABGRUBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKENNGH    PICTURE X.                                            
           02  AKENNGO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKENNGH    PICTURE X.                                            
           02  EKENNGO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFOH    PICTURE X.                                            
           02  AZINFOO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUMBDATH    PICTURE X.                                           
           02  AUMBDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABGRUNDH    PICTURE X.                                           
           02  ABGRUNDO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODH    PICTURE X.                                             
           02  APRODO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFAEVONH    PICTURE X.                                           
           02  AFAEVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHISTNRH    PICTURE X.                                           
           02  AHISTNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGPVBTGH    PICTURE X.                                           
           02  AGPVBTGO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGVH    PICTURE X.                                              
           02  ADGVO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ADIFFKZH    PICTURE X.                                           
           02  ADIFFKZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO2H    PICTURE X.                                           
           02  AZINFO2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES2H    PICTURE X.                                             
           02  AGES2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR2H    PICTURE X.                                             
           02  AVNR2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD2H    PICTURE X.                                            
           02  APROD2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV2H    PICTURE X.                                             
           02  ADGV2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO3H    PICTURE X.                                           
           02  AZINFO3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES3H    PICTURE X.                                             
           02  AGES3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR3H    PICTURE X.                                             
           02  AVNR3O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD3H    PICTURE X.                                            
           02  APROD3O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV3H    PICTURE X.                                             
           02  ADGV3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO4H    PICTURE X.                                           
           02  AZINFO4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES4H    PICTURE X.                                             
           02  AGES4O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR4H    PICTURE X.                                             
           02  AVNR4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD4H    PICTURE X.                                            
           02  APROD4O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV4H    PICTURE X.                                             
           02  ADGV4O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO5H    PICTURE X.                                           
           02  AZINFO5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES5H    PICTURE X.                                             
           02  AGES5O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR5H    PICTURE X.                                             
           02  AVNR5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD5H    PICTURE X.                                            
           02  APROD5O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV5H    PICTURE X.                                             
           02  ADGV5O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO6H    PICTURE X.                                           
           02  AZINFO6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES6H    PICTURE X.                                             
           02  AGES6O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR6H    PICTURE X.                                             
           02  AVNR6O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD6H    PICTURE X.                                            
           02  APROD6O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV6H    PICTURE X.                                             
           02  ADGV6O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO7H    PICTURE X.                                           
           02  AZINFO7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES7H    PICTURE X.                                             
           02  AGES7O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR7H    PICTURE X.                                             
           02  AVNR7O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD7H    PICTURE X.                                            
           02  APROD7O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV7H    PICTURE X.                                             
           02  ADGV7O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO8H    PICTURE X.                                           
           02  AZINFO8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES8H    PICTURE X.                                             
           02  AGES8O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR8H    PICTURE X.                                             
           02  AVNR8O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD8H    PICTURE X.                                            
           02  APROD8O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV8H    PICTURE X.                                             
           02  ADGV8O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZINFO9H    PICTURE X.                                           
           02  AZINFO9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES9H    PICTURE X.                                             
           02  AGES9O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR9H    PICTURE X.                                             
           02  AVNR9O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD9H    PICTURE X.                                            
           02  APROD9O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV9H    PICTURE X.                                             
           02  ADGV9O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGES92H    PICTURE X.                                            
           02  AGES92O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVNR92H    PICTURE X.                                            
           02  AVNR92O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROD92H    PICTURE X.                                           
           02  APROD92O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADGV92H    PICTURE X.                                            
           02  ADGV92O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
