       01  BPA0062I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESFBL    COMP  PIC  S9(4).                                     
           02  AGESFBF    PICTURE X.                                            
           02  FILLER REDEFINES AGESFBF.                                        
             03 AGESFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESFBI  PIC X(4).                                               
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EWAEBKL    COMP  PIC  S9(4).                                     
           02  EWAEBKF    PICTURE X.                                            
           02  FILLER REDEFINES EWAEBKF.                                        
             03 EWAEBKA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EWAEBKI  PIC X(3).                                               
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(30).                                             
           02  AVERSL    COMP  PIC  S9(4).                                      
           02  AVERSF    PICTURE X.                                             
           02  FILLER REDEFINES AVERSF.                                         
             03 AVERSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVERSI  PIC X(3).                                                
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  AVGESBML    COMP  PIC  S9(4).                                    
           02  AVGESBMF    PICTURE X.                                           
           02  FILLER REDEFINES AVGESBMF.                                       
             03 AVGESBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVGESBMI  PIC X(4).                                              
           02  AERKZFBL    COMP  PIC  S9(4).                                    
           02  AERKZFBF    PICTURE X.                                           
           02  FILLER REDEFINES AERKZFBF.                                       
             03 AERKZFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERKZFBI  PIC X(8).                                              
           02  AERSTKZL    COMP  PIC  S9(4).                                    
           02  AERSTKZF    PICTURE X.                                           
           02  FILLER REDEFINES AERSTKZF.                                       
             03 AERSTKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERSTKZI  PIC X(1).                                              
           02  ALUPDDAL    COMP  PIC  S9(4).                                    
           02  ALUPDDAF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPDDAF.                                       
             03 ALUPDDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPDDAI  PIC X(10).                                             
           02  ALUPDUSL    COMP  PIC  S9(4).                                    
           02  ALUPDUSF    PICTURE X.                                           
           02  FILLER REDEFINES ALUPDUSF.                                       
             03 ALUPDUSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ALUPDUSI  PIC X(8).                                              
           02  EKNAMEL    COMP  PIC  S9(4).                                     
           02  EKNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES EKNAMEF.                                        
             03 EKNAMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKNAMEI  PIC X(25).                                              
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  EKVNAMEL    COMP  PIC  S9(4).                                    
           02  EKVNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES EKVNAMEF.                                       
             03 EKVNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKVNAMEI  PIC X(20).                                             
           02  AABRETTL    COMP  PIC  S9(4).                                    
           02  AABRETTF    PICTURE X.                                           
           02  FILLER REDEFINES AABRETTF.                                       
             03 AABRETTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRETTI  PIC X(2).                                              
           02  AABREMML    COMP  PIC  S9(4).                                    
           02  AABREMMF    PICTURE X.                                           
           02  FILLER REDEFINES AABREMMF.                                       
             03 AABREMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREMMI  PIC X(2).                                              
           02  AABREJJL    COMP  PIC  S9(4).                                    
           02  AABREJJF    PICTURE X.                                           
           02  FILLER REDEFINES AABREJJF.                                       
             03 AABREJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREJJI  PIC X(4).                                              
           02  EAVERML    COMP  PIC  S9(4).                                     
           02  EAVERMF    PICTURE X.                                            
           02  FILLER REDEFINES EAVERMF.                                        
             03 EAVERMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAVERMI  PIC X(7).                                               
           02  EAVERMPL    COMP  PIC  S9(4).                                    
           02  EAVERMPF    PICTURE X.                                           
           02  FILLER REDEFINES EAVERMPF.                                       
             03 EAVERMPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EAVERMPI  PIC X(1).                                              
           02  EVBEGTTL    COMP  PIC  S9(4).                                    
           02  EVBEGTTF    PICTURE X.                                           
           02  FILLER REDEFINES EVBEGTTF.                                       
             03 EVBEGTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBEGTTI  PIC X(2).                                              
           02  EVBEGMML    COMP  PIC  S9(4).                                    
           02  EVBEGMMF    PICTURE X.                                           
           02  FILLER REDEFINES EVBEGMMF.                                       
             03 EVBEGMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBEGMMI  PIC X(2).                                              
           02  EVBEGJJL    COMP  PIC  S9(4).                                    
           02  EVBEGJJF    PICTURE X.                                           
           02  FILLER REDEFINES EVBEGJJF.                                       
             03 EVBEGJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBEGJJI  PIC X(4).                                              
           02  AZHLWFBL    COMP  PIC  S9(4).                                    
           02  AZHLWFBF    PICTURE X.                                           
           02  FILLER REDEFINES AZHLWFBF.                                       
             03 AZHLWFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZHLWFBI  PIC X(13).                                             
           02  EZHLWL    COMP  PIC  S9(4).                                      
           02  EZHLWF    PICTURE X.                                             
           02  FILLER REDEFINES EZHLWF.                                         
             03 EZHLWA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EZHLWI  PIC X(2).                                                
           02  AZHLTXTL    COMP  PIC  S9(4).                                    
           02  AZHLTXTF    PICTURE X.                                           
           02  FILLER REDEFINES AZHLTXTF.                                       
             03 AZHLTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZHLTXTI  PIC X(10).                                             
           02  EGESBTRL    COMP  PIC  S9(4).                                    
           02  EGESBTRF    PICTURE X.                                           
           02  FILLER REDEFINES EGESBTRF.                                       
             03 EGESBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGESBTRI  PIC X(15).                                             
           02  EUMSATZL    COMP  PIC  S9(4).                                    
           02  EUMSATZF    PICTURE X.                                           
           02  FILLER REDEFINES EUMSATZF.                                       
             03 EUMSATZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMSATZI  PIC X(7).                                              
           02  EUMSBTRL    COMP  PIC  S9(4).                                    
           02  EUMSBTRF    PICTURE X.                                           
           02  FILLER REDEFINES EUMSBTRF.                                       
             03 EUMSBTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUMSBTRI  PIC X(15).                                             
           02  ARECHFBL    COMP  PIC  S9(4).                                    
           02  ARECHFBF    PICTURE X.                                           
           02  FILLER REDEFINES ARECHFBF.                                       
             03 ARECHFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARECHFBI  PIC X(20).                                             
           02  ERECHNRL    COMP  PIC  S9(4).                                    
           02  ERECHNRF    PICTURE X.                                           
           02  FILLER REDEFINES ERECHNRF.                                       
             03 ERECHNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ERECHNRI  PIC X(12).                                             
           02  EPGVL    COMP  PIC  S9(4).                                       
           02  EPGVF    PICTURE X.                                              
           02  FILLER REDEFINES EPGVF.                                          
             03 EPGVA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPGVI  PIC X(4).                                                 
           02  EPRODL    COMP  PIC  S9(4).                                      
           02  EPRODF    PICTURE X.                                             
           02  FILLER REDEFINES EPRODF.                                         
             03 EPRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EPRODI  PIC X(3).                                                
           02  EPGTARIL    COMP  PIC  S9(4).                                    
           02  EPGTARIF    PICTURE X.                                           
           02  FILLER REDEFINES EPGTARIF.                                       
             03 EPGTARIA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPGTARII  PIC X(15).                                             
           02  EPPFLSUL    COMP  PIC  S9(4).                                    
           02  EPPFLSUF    PICTURE X.                                           
           02  FILLER REDEFINES EPPFLSUF.                                       
             03 EPPFLSUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPPFLSUI  PIC X(15).                                             
           02  EPROVSL    COMP  PIC  S9(4).                                     
           02  EPROVSF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVSF.                                        
             03 EPROVSA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROVSI  PIC X(9).                                               
           02  EPROVBL    COMP  PIC  S9(4).                                     
           02  EPROVBF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVBF.                                        
             03 EPROVBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROVBI  PIC X(13).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0062O REDEFINES BPA0062I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESFBH    PICTURE X.                                            
           02  AGESFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EWAEBKH    PICTURE X.                                            
           02  EWAEBKO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERSH    PICTURE X.                                             
           02  AVERSO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVGESBMH    PICTURE X.                                           
           02  AVGESBMO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AERKZFBH    PICTURE X.                                           
           02  AERKZFBO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AERSTKZH    PICTURE X.                                           
           02  AERSTKZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ALUPDDAH    PICTURE X.                                           
           02  ALUPDDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALUPDUSH    PICTURE X.                                           
           02  ALUPDUSO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKNAMEH    PICTURE X.                                            
           02  EKNAMEO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKVNAMEH    PICTURE X.                                           
           02  EKVNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRETTH    PICTURE X.                                           
           02  AABRETTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABREMMH    PICTURE X.                                           
           02  AABREMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABREJJH    PICTURE X.                                           
           02  AABREJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAVERMH    PICTURE X.                                            
           02  EAVERMO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAVERMPH    PICTURE X.                                           
           02  EAVERMPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBEGTTH    PICTURE X.                                           
           02  EVBEGTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBEGMMH    PICTURE X.                                           
           02  EVBEGMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBEGJJH    PICTURE X.                                           
           02  EVBEGJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZHLWFBH    PICTURE X.                                           
           02  AZHLWFBO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EZHLWH    PICTURE X.                                             
           02  EZHLWO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZHLTXTH    PICTURE X.                                           
           02  AZHLTXTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EGESBTRH    PICTURE X.                                           
           02  EGESBTRO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  EUMSATZH    PICTURE X.                                           
           02  EUMSATZO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMSBTRH    PICTURE X.                                           
           02  EUMSBTRO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARECHFBH    PICTURE X.                                           
           02  ARECHFBO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ERECHNRH    PICTURE X.                                           
           02  ERECHNRO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPGVH    PICTURE X.                                              
           02  EPGVO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPRODH    PICTURE X.                                             
           02  EPRODO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPGTARIH    PICTURE X.                                           
           02  EPGTARIO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPPFLSUH    PICTURE X.                                           
           02  EPPFLSUO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPROVSH    PICTURE X.                                            
           02  EPROVSO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROVBH    PICTURE X.                                            
           02  EPROVBO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO PIC X(79).                                              
