       01  BPA0007I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  ADTAARTL    COMP  PIC  S9(4).                                    
           02  ADTAARTF    PICTURE X.                                           
           02  FILLER REDEFINES ADTAARTF.                                       
             03 ADTAARTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADTAARTI  PIC X(3).                                              
           02  ADARTBML    COMP  PIC  S9(4).                                    
           02  ADARTBMF    PICTURE X.                                           
           02  FILLER REDEFINES ADARTBMF.                                       
             03 ADARTBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADARTBMI  PIC X(10).                                             
           02  AUEBDATL    COMP  PIC  S9(4).                                    
           02  AUEBDATF    PICTURE X.                                           
           02  FILLER REDEFINES AUEBDATF.                                       
             03 AUEBDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUEBDATI  PIC X(10).                                             
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(51).                                             
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  AVSBEZL    COMP  PIC  S9(4).                                     
           02  AVSBEZF    PICTURE X.                                            
           02  FILLER REDEFINES AVSBEZF.                                        
             03 AVSBEZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSBEZI  PIC X(3).                                               
           02  AWAEGUTL    COMP  PIC  S9(4).                                    
           02  AWAEGUTF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEGUTF.                                       
             03 AWAEGUTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEGUTI  PIC X(4).                                              
           02  AWAEBELL    COMP  PIC  S9(4).                                    
           02  AWAEBELF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEBELF.                                       
             03 AWAEBELA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEBELI  PIC X(4).                                              
           02  AWAEPOZL    COMP  PIC  S9(4).                                    
           02  AWAEPOZF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEPOZF.                                       
             03 AWAEPOZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEPOZI  PIC X(4).                                              
           02  AWAEDIFL    COMP  PIC  S9(4).                                    
           02  AWAEDIFF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEDIFF.                                       
             03 AWAEDIFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEDIFI  PIC X(4).                                              
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  ASANZBWL    COMP  PIC  S9(4).                                    
           02  ASANZBWF    PICTURE X.                                           
           02  FILLER REDEFINES ASANZBWF.                                       
             03 ASANZBWA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASANZBWI  PIC X(9).                                              
           02  ASGUTL    COMP  PIC  S9(4).                                      
           02  ASGUTF    PICTURE X.                                             
           02  FILLER REDEFINES ASGUTF.                                         
             03 ASGUTA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ASGUTI  PIC X(13).                                               
           02  ASBELASL    COMP  PIC  S9(4).                                    
           02  ASBELASF    PICTURE X.                                           
           02  FILLER REDEFINES ASBELASF.                                       
             03 ASBELASA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASBELASI  PIC X(13).                                             
           02  ASPBOZL    COMP  PIC  S9(4).                                     
           02  ASPBOZF    PICTURE X.                                            
           02  FILLER REDEFINES ASPBOZF.                                        
             03 ASPBOZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZI  PIC X(13).                                              
           02  ADIFFL    COMP  PIC  S9(4).                                      
           02  ADIFFF    PICTURE X.                                             
           02  FILLER REDEFINES ADIFFF.                                         
             03 ADIFFA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIFFI  PIC X(13).                                               
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AVSTAT2L    COMP  PIC  S9(4).                                    
           02  AVSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT2F.                                       
             03 AVSTAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT2I  PIC X(4).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(9).                                              
           02  ASGUT2L    COMP  PIC  S9(4).                                     
           02  ASGUT2F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT2F.                                        
             03 ASGUT2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT2I  PIC X(13).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(13).                                             
           02  ASPBOZ2L    COMP  PIC  S9(4).                                    
           02  ASPBOZ2F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ2F.                                       
             03 ASPBOZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ2I  PIC X(13).                                             
           02  ADIFF2L    COMP  PIC  S9(4).                                     
           02  ADIFF2F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF2F.                                        
             03 ADIFF2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF2I  PIC X(13).                                              
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AVSTAT3L    COMP  PIC  S9(4).                                    
           02  AVSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT3F.                                       
             03 AVSTAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT3I  PIC X(4).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(9).                                              
           02  ASGUT3L    COMP  PIC  S9(4).                                     
           02  ASGUT3F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT3F.                                        
             03 ASGUT3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT3I  PIC X(13).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(13).                                             
           02  ASPBOZ3L    COMP  PIC  S9(4).                                    
           02  ASPBOZ3F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ3F.                                       
             03 ASPBOZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ3I  PIC X(13).                                             
           02  ADIFF3L    COMP  PIC  S9(4).                                     
           02  ADIFF3F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF3F.                                        
             03 ADIFF3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF3I  PIC X(13).                                              
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AVSTAT4L    COMP  PIC  S9(4).                                    
           02  AVSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT4F.                                       
             03 AVSTAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT4I  PIC X(4).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(9).                                              
           02  ASGUT4L    COMP  PIC  S9(4).                                     
           02  ASGUT4F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT4F.                                        
             03 ASGUT4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT4I  PIC X(13).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(13).                                             
           02  ASPBOZ4L    COMP  PIC  S9(4).                                    
           02  ASPBOZ4F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ4F.                                       
             03 ASPBOZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ4I  PIC X(13).                                             
           02  ADIFF4L    COMP  PIC  S9(4).                                     
           02  ADIFF4F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF4F.                                        
             03 ADIFF4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF4I  PIC X(13).                                              
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AVSTAT5L    COMP  PIC  S9(4).                                    
           02  AVSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT5F.                                       
             03 AVSTAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT5I  PIC X(4).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(9).                                              
           02  ASGUT5L    COMP  PIC  S9(4).                                     
           02  ASGUT5F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT5F.                                        
             03 ASGUT5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT5I  PIC X(13).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(13).                                             
           02  ASPBOZ5L    COMP  PIC  S9(4).                                    
           02  ASPBOZ5F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ5F.                                       
             03 ASPBOZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ5I  PIC X(13).                                             
           02  ADIFF5L    COMP  PIC  S9(4).                                     
           02  ADIFF5F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF5F.                                        
             03 ADIFF5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF5I  PIC X(13).                                              
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AVSTAT6L    COMP  PIC  S9(4).                                    
           02  AVSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT6F.                                       
             03 AVSTAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT6I  PIC X(4).                                              
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(9).                                              
           02  ASGUT6L    COMP  PIC  S9(4).                                     
           02  ASGUT6F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT6F.                                        
             03 ASGUT6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT6I  PIC X(13).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(13).                                             
           02  ASPBOZ6L    COMP  PIC  S9(4).                                    
           02  ASPBOZ6F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ6F.                                       
             03 ASPBOZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ6I  PIC X(13).                                             
           02  ADIFF6L    COMP  PIC  S9(4).                                     
           02  ADIFF6F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF6F.                                        
             03 ADIFF6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF6I  PIC X(13).                                              
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AVSTAT7L    COMP  PIC  S9(4).                                    
           02  AVSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT7F.                                       
             03 AVSTAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT7I  PIC X(4).                                              
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(9).                                              
           02  ASGUT7L    COMP  PIC  S9(4).                                     
           02  ASGUT7F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT7F.                                        
             03 ASGUT7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT7I  PIC X(13).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(13).                                             
           02  ASPBOZ7L    COMP  PIC  S9(4).                                    
           02  ASPBOZ7F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ7F.                                       
             03 ASPBOZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ7I  PIC X(13).                                             
           02  ADIFF7L    COMP  PIC  S9(4).                                     
           02  ADIFF7F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF7F.                                        
             03 ADIFF7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF7I  PIC X(13).                                              
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AVSTAT8L    COMP  PIC  S9(4).                                    
           02  AVSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT8F.                                       
             03 AVSTAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT8I  PIC X(4).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(9).                                              
           02  ASGUT8L    COMP  PIC  S9(4).                                     
           02  ASGUT8F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT8F.                                        
             03 ASGUT8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT8I  PIC X(13).                                              
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(13).                                             
           02  ASPBOZ8L    COMP  PIC  S9(4).                                    
           02  ASPBOZ8F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ8F.                                       
             03 ASPBOZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ8I  PIC X(13).                                             
           02  ADIFF8L    COMP  PIC  S9(4).                                     
           02  ADIFF8F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF8F.                                        
             03 ADIFF8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF8I  PIC X(13).                                              
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AVSTAT9L    COMP  PIC  S9(4).                                    
           02  AVSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT9F.                                       
             03 AVSTAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT9I  PIC X(4).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(9).                                              
           02  ASGUT9L    COMP  PIC  S9(4).                                     
           02  ASGUT9F    PICTURE X.                                            
           02  FILLER REDEFINES ASGUT9F.                                        
             03 ASGUT9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASGUT9I  PIC X(13).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(13).                                             
           02  ASPBOZ9L    COMP  PIC  S9(4).                                    
           02  ASPBOZ9F    PICTURE X.                                           
           02  FILLER REDEFINES ASPBOZ9F.                                       
             03 ASPBOZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPBOZ9I  PIC X(13).                                             
           02  ADIFF9L    COMP  PIC  S9(4).                                     
           02  ADIFF9F    PICTURE X.                                            
           02  FILLER REDEFINES ADIFF9F.                                        
             03 ADIFF9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIFF9I  PIC X(13).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0007O REDEFINES BPA0007I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADTAARTH    PICTURE X.                                           
           02  ADTAARTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADARTBMH    PICTURE X.                                           
           02  ADARTBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUEBDATH    PICTURE X.                                           
           02  AUEBDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(51).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSBEZH    PICTURE X.                                            
           02  AVSBEZO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AWAEGUTH    PICTURE X.                                           
           02  AWAEGUTO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWAEBELH    PICTURE X.                                           
           02  AWAEBELO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWAEPOZH    PICTURE X.                                           
           02  AWAEPOZO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWAEDIFH    PICTURE X.                                           
           02  AWAEDIFO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASANZBWH    PICTURE X.                                           
           02  ASANZBWO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUTH    PICTURE X.                                             
           02  ASGUTO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASBELASH    PICTURE X.                                           
           02  ASBELASO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZH    PICTURE X.                                            
           02  ASPBOZO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADIFFH    PICTURE X.                                             
           02  ADIFFO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT2H    PICTURE X.                                           
           02  AVSTAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT2H    PICTURE X.                                            
           02  ASGUT2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ2H    PICTURE X.                                           
           02  ASPBOZ2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF2H    PICTURE X.                                            
           02  ADIFF2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT3H    PICTURE X.                                           
           02  AVSTAT3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT3H    PICTURE X.                                            
           02  ASGUT3O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ3H    PICTURE X.                                           
           02  ASPBOZ3O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF3H    PICTURE X.                                            
           02  ADIFF3O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT4H    PICTURE X.                                           
           02  AVSTAT4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT4H    PICTURE X.                                            
           02  ASGUT4O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ4H    PICTURE X.                                           
           02  ASPBOZ4O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF4H    PICTURE X.                                            
           02  ADIFF4O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT5H    PICTURE X.                                           
           02  AVSTAT5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT5H    PICTURE X.                                            
           02  ASGUT5O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ5H    PICTURE X.                                           
           02  ASPBOZ5O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF5H    PICTURE X.                                            
           02  ADIFF5O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT6H    PICTURE X.                                           
           02  AVSTAT6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT6H    PICTURE X.                                            
           02  ASGUT6O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ6H    PICTURE X.                                           
           02  ASPBOZ6O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF6H    PICTURE X.                                            
           02  ADIFF6O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT7H    PICTURE X.                                           
           02  AVSTAT7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT7H    PICTURE X.                                            
           02  ASGUT7O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ7H    PICTURE X.                                           
           02  ASPBOZ7O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF7H    PICTURE X.                                            
           02  ADIFF7O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT8H    PICTURE X.                                           
           02  AVSTAT8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT8H    PICTURE X.                                            
           02  ASGUT8O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ8H    PICTURE X.                                           
           02  ASPBOZ8O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF8H    PICTURE X.                                            
           02  ADIFF8O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT9H    PICTURE X.                                           
           02  AVSTAT9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASGUT9H    PICTURE X.                                            
           02  ASGUT9O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPBOZ9H    PICTURE X.                                           
           02  ASPBOZ9O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADIFF9H    PICTURE X.                                            
           02  ADIFF9O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
