       01  BPA0017I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  AVERSL    COMP  PIC  S9(4).                                      
           02  AVERSF    PICTURE X.                                             
           02  FILLER REDEFINES AVERSF.                                         
             03 AVERSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVERSI  PIC X(3).                                                
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AVNR2L    COMP  PIC  S9(4).                                      
           02  AVNR2F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR2F.                                         
             03 AVNR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR2I  PIC X(15).                                               
           02  APIN2L    COMP  PIC  S9(4).                                      
           02  APIN2F    PICTURE X.                                             
           02  FILLER REDEFINES APIN2F.                                         
             03 APIN2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN2I  PIC X(9).                                                
           02  AVERS2L    COMP  PIC  S9(4).                                     
           02  AVERS2F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS2F.                                        
             03 AVERS2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS2I  PIC X(3).                                               
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AVNR3L    COMP  PIC  S9(4).                                      
           02  AVNR3F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR3F.                                         
             03 AVNR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR3I  PIC X(15).                                               
           02  APIN3L    COMP  PIC  S9(4).                                      
           02  APIN3F    PICTURE X.                                             
           02  FILLER REDEFINES APIN3F.                                         
             03 APIN3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN3I  PIC X(9).                                                
           02  AVERS3L    COMP  PIC  S9(4).                                     
           02  AVERS3F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS3F.                                        
             03 AVERS3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS3I  PIC X(3).                                               
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AVNR4L    COMP  PIC  S9(4).                                      
           02  AVNR4F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR4F.                                         
             03 AVNR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR4I  PIC X(15).                                               
           02  APIN4L    COMP  PIC  S9(4).                                      
           02  APIN4F    PICTURE X.                                             
           02  FILLER REDEFINES APIN4F.                                         
             03 APIN4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN4I  PIC X(9).                                                
           02  AVERS4L    COMP  PIC  S9(4).                                     
           02  AVERS4F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS4F.                                        
             03 AVERS4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS4I  PIC X(3).                                               
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AVNR5L    COMP  PIC  S9(4).                                      
           02  AVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR5F.                                         
             03 AVNR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR5I  PIC X(15).                                               
           02  APIN5L    COMP  PIC  S9(4).                                      
           02  APIN5F    PICTURE X.                                             
           02  FILLER REDEFINES APIN5F.                                         
             03 APIN5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN5I  PIC X(9).                                                
           02  AVERS5L    COMP  PIC  S9(4).                                     
           02  AVERS5F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS5F.                                        
             03 AVERS5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS5I  PIC X(3).                                               
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AVNR6L    COMP  PIC  S9(4).                                      
           02  AVNR6F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR6F.                                         
             03 AVNR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR6I  PIC X(15).                                               
           02  APIN6L    COMP  PIC  S9(4).                                      
           02  APIN6F    PICTURE X.                                             
           02  FILLER REDEFINES APIN6F.                                         
             03 APIN6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN6I  PIC X(9).                                                
           02  AVERS6L    COMP  PIC  S9(4).                                     
           02  AVERS6F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS6F.                                        
             03 AVERS6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS6I  PIC X(3).                                               
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AVNR7L    COMP  PIC  S9(4).                                      
           02  AVNR7F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR7F.                                         
             03 AVNR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR7I  PIC X(15).                                               
           02  APIN7L    COMP  PIC  S9(4).                                      
           02  APIN7F    PICTURE X.                                             
           02  FILLER REDEFINES APIN7F.                                         
             03 APIN7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN7I  PIC X(9).                                                
           02  AVERS7L    COMP  PIC  S9(4).                                     
           02  AVERS7F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS7F.                                        
             03 AVERS7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS7I  PIC X(3).                                               
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AVNR8L    COMP  PIC  S9(4).                                      
           02  AVNR8F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR8F.                                         
             03 AVNR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR8I  PIC X(15).                                               
           02  APIN8L    COMP  PIC  S9(4).                                      
           02  APIN8F    PICTURE X.                                             
           02  FILLER REDEFINES APIN8F.                                         
             03 APIN8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN8I  PIC X(9).                                                
           02  AVERS8L    COMP  PIC  S9(4).                                     
           02  AVERS8F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS8F.                                        
             03 AVERS8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS8I  PIC X(3).                                               
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AVNR9L    COMP  PIC  S9(4).                                      
           02  AVNR9F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR9F.                                         
             03 AVNR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR9I  PIC X(15).                                               
           02  APIN9L    COMP  PIC  S9(4).                                      
           02  APIN9F    PICTURE X.                                             
           02  FILLER REDEFINES APIN9F.                                         
             03 APIN9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN9I  PIC X(9).                                                
           02  AVERS9L    COMP  PIC  S9(4).                                     
           02  AVERS9F    PICTURE X.                                            
           02  FILLER REDEFINES AVERS9F.                                        
             03 AVERS9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERS9I  PIC X(3).                                               
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  AVNR92L    COMP  PIC  S9(4).                                     
           02  AVNR92F    PICTURE X.                                            
           02  FILLER REDEFINES AVNR92F.                                        
             03 AVNR92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVNR92I  PIC X(15).                                              
           02  APIN92L    COMP  PIC  S9(4).                                     
           02  APIN92F    PICTURE X.                                            
           02  FILLER REDEFINES APIN92F.                                        
             03 APIN92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APIN92I  PIC X(9).                                               
           02  AVERS92L    COMP  PIC  S9(4).                                    
           02  AVERS92F    PICTURE X.                                           
           02  FILLER REDEFINES AVERS92F.                                       
             03 AVERS92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVERS92I  PIC X(3).                                              
           02  EFCZ922L    COMP  PIC  S9(4).                                    
           02  EFCZ922F    PICTURE X.                                           
           02  FILLER REDEFINES EFCZ922F.                                       
             03 EFCZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ922I  PIC X(1).                                              
           02  AVNR922L    COMP  PIC  S9(4).                                    
           02  AVNR922F    PICTURE X.                                           
           02  FILLER REDEFINES AVNR922F.                                       
             03 AVNR922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVNR922I  PIC X(15).                                             
           02  APIN922L    COMP  PIC  S9(4).                                    
           02  APIN922F    PICTURE X.                                           
           02  FILLER REDEFINES APIN922F.                                       
             03 APIN922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APIN922I  PIC X(9).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(3).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(1).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(15).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(9).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(3).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(1).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(15).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(9).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0017O REDEFINES BPA0017I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVERSH    PICTURE X.                                             
           02  AVERSO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR2H    PICTURE X.                                             
           02  AVNR2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN2H    PICTURE X.                                             
           02  APIN2O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS2H    PICTURE X.                                            
           02  AVERS2O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR3H    PICTURE X.                                             
           02  AVNR3O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN3H    PICTURE X.                                             
           02  APIN3O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS3H    PICTURE X.                                            
           02  AVERS3O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR4H    PICTURE X.                                             
           02  AVNR4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN4H    PICTURE X.                                             
           02  APIN4O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS4H    PICTURE X.                                            
           02  AVERS4O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR5H    PICTURE X.                                             
           02  AVNR5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN5H    PICTURE X.                                             
           02  APIN5O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS5H    PICTURE X.                                            
           02  AVERS5O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR6H    PICTURE X.                                             
           02  AVNR6O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN6H    PICTURE X.                                             
           02  APIN6O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS6H    PICTURE X.                                            
           02  AVERS6O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR7H    PICTURE X.                                             
           02  AVNR7O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN7H    PICTURE X.                                             
           02  APIN7O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS7H    PICTURE X.                                            
           02  AVERS7O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR8H    PICTURE X.                                             
           02  AVNR8O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN8H    PICTURE X.                                             
           02  APIN8O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS8H    PICTURE X.                                            
           02  AVERS8O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR9H    PICTURE X.                                             
           02  AVNR9O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN9H    PICTURE X.                                             
           02  APIN9O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVERS9H    PICTURE X.                                            
           02  AVERS9O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVNR92H    PICTURE X.                                            
           02  AVNR92O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  APIN92H    PICTURE X.                                            
           02  APIN92O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVERS92H    PICTURE X.                                           
           02  AVERS92O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ922H    PICTURE X.                                           
           02  EFCZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNR922H    PICTURE X.                                           
           02  AVNR922O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APIN922H    PICTURE X.                                           
           02  APIN922O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
