       01  BPA0022I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(20).                                             
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  AWAEBETL    COMP  PIC  S9(4).                                    
           02  AWAEBETF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEBETF.                                       
             03 AWAEBETA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEBETI  PIC X(3).                                              
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  AORDNRL    COMP  PIC  S9(4).                                     
           02  AORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES AORDNRF.                                        
             03 AORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AORDNRI  PIC X(2).                                               
           02  APTARTL    COMP  PIC  S9(4).                                     
           02  APTARTF    PICTURE X.                                            
           02  FILLER REDEFINES APTARTF.                                        
             03 APTARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APTARTI  PIC X(4).                                               
           02  AGESVNRL    COMP  PIC  S9(4).                                    
           02  AGESVNRF    PICTURE X.                                           
           02  FILLER REDEFINES AGESVNRF.                                       
             03 AGESVNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGESVNRI  PIC X(2).                                              
           02  AVVNRL    COMP  PIC  S9(4).                                      
           02  AVVNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVVNRF.                                         
             03 AVVNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVVNRI  PIC X(15).                                               
           02  APFLBEGL    COMP  PIC  S9(4).                                    
           02  APFLBEGF    PICTURE X.                                           
           02  FILLER REDEFINES APFLBEGF.                                       
             03 APFLBEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APFLBEGI  PIC X(10).                                             
           02  AKDBETRL    COMP  PIC  S9(4).                                    
           02  AKDBETRF    PICTURE X.                                           
           02  FILLER REDEFINES AKDBETRF.                                       
             03 AKDBETRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKDBETRI  PIC X(7).                                              
           02  ABEWBTGL    COMP  PIC  S9(4).                                    
           02  ABEWBTGF    PICTURE X.                                           
           02  FILLER REDEFINES ABEWBTGF.                                       
             03 ABEWBTGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABEWBTGI  PIC X(14).                                             
           02  AEEENTL    COMP  PIC  S9(4).                                     
           02  AEEENTF    PICTURE X.                                            
           02  FILLER REDEFINES AEEENTF.                                        
             03 AEEENTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEEENTI  PIC X(2).                                               
           02  APESKZL    COMP  PIC  S9(4).                                     
           02  APESKZF    PICTURE X.                                            
           02  FILLER REDEFINES APESKZF.                                        
             03 APESKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APESKZI  PIC X(1).                                               
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(3).                                              
           02  AORDNR2L    COMP  PIC  S9(4).                                    
           02  AORDNR2F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR2F.                                       
             03 AORDNR2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR2I  PIC X(2).                                              
           02  APTART2L    COMP  PIC  S9(4).                                    
           02  APTART2F    PICTURE X.                                           
           02  FILLER REDEFINES APTART2F.                                       
             03 APTART2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART2I  PIC X(4).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(2).                                              
           02  AVVNR2L    COMP  PIC  S9(4).                                     
           02  AVVNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR2F.                                        
             03 AVVNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR2I  PIC X(15).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(10).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(7).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(14).                                             
           02  AEEENT2L    COMP  PIC  S9(4).                                    
           02  AEEENT2F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT2F.                                       
             03 AEEENT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT2I  PIC X(2).                                              
           02  APESKZ2L    COMP  PIC  S9(4).                                    
           02  APESKZ2F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ2F.                                       
             03 APESKZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ2I  PIC X(1).                                              
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(3).                                              
           02  AORDNR3L    COMP  PIC  S9(4).                                    
           02  AORDNR3F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR3F.                                       
             03 AORDNR3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR3I  PIC X(2).                                              
           02  APTART3L    COMP  PIC  S9(4).                                    
           02  APTART3F    PICTURE X.                                           
           02  FILLER REDEFINES APTART3F.                                       
             03 APTART3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART3I  PIC X(4).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(2).                                              
           02  AVVNR3L    COMP  PIC  S9(4).                                     
           02  AVVNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR3F.                                        
             03 AVVNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR3I  PIC X(15).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(10).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(7).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(14).                                             
           02  AEEENT3L    COMP  PIC  S9(4).                                    
           02  AEEENT3F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT3F.                                       
             03 AEEENT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT3I  PIC X(2).                                              
           02  APESKZ3L    COMP  PIC  S9(4).                                    
           02  APESKZ3F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ3F.                                       
             03 APESKZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ3I  PIC X(1).                                              
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(3).                                              
           02  AORDNR4L    COMP  PIC  S9(4).                                    
           02  AORDNR4F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR4F.                                       
             03 AORDNR4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR4I  PIC X(2).                                              
           02  APTART4L    COMP  PIC  S9(4).                                    
           02  APTART4F    PICTURE X.                                           
           02  FILLER REDEFINES APTART4F.                                       
             03 APTART4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART4I  PIC X(4).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(2).                                              
           02  AVVNR4L    COMP  PIC  S9(4).                                     
           02  AVVNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR4F.                                        
             03 AVVNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR4I  PIC X(15).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(10).                                             
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(7).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(14).                                             
           02  AEEENT4L    COMP  PIC  S9(4).                                    
           02  AEEENT4F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT4F.                                       
             03 AEEENT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT4I  PIC X(2).                                              
           02  APESKZ4L    COMP  PIC  S9(4).                                    
           02  APESKZ4F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ4F.                                       
             03 APESKZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ4I  PIC X(1).                                              
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(3).                                              
           02  AORDNR5L    COMP  PIC  S9(4).                                    
           02  AORDNR5F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR5F.                                       
             03 AORDNR5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR5I  PIC X(2).                                              
           02  APTART5L    COMP  PIC  S9(4).                                    
           02  APTART5F    PICTURE X.                                           
           02  FILLER REDEFINES APTART5F.                                       
             03 APTART5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART5I  PIC X(4).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(2).                                              
           02  AVVNR5L    COMP  PIC  S9(4).                                     
           02  AVVNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR5F.                                        
             03 AVVNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR5I  PIC X(15).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(10).                                             
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(7).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(14).                                             
           02  AEEENT5L    COMP  PIC  S9(4).                                    
           02  AEEENT5F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT5F.                                       
             03 AEEENT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT5I  PIC X(2).                                              
           02  APESKZ5L    COMP  PIC  S9(4).                                    
           02  APESKZ5F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ5F.                                       
             03 APESKZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ5I  PIC X(1).                                              
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(3).                                              
           02  AORDNR6L    COMP  PIC  S9(4).                                    
           02  AORDNR6F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR6F.                                       
             03 AORDNR6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR6I  PIC X(2).                                              
           02  APTART6L    COMP  PIC  S9(4).                                    
           02  APTART6F    PICTURE X.                                           
           02  FILLER REDEFINES APTART6F.                                       
             03 APTART6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART6I  PIC X(4).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(2).                                              
           02  AVVNR6L    COMP  PIC  S9(4).                                     
           02  AVVNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR6F.                                        
             03 AVVNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR6I  PIC X(15).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(10).                                             
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(7).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(14).                                             
           02  AEEENT6L    COMP  PIC  S9(4).                                    
           02  AEEENT6F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT6F.                                       
             03 AEEENT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT6I  PIC X(2).                                              
           02  APESKZ6L    COMP  PIC  S9(4).                                    
           02  APESKZ6F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ6F.                                       
             03 APESKZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ6I  PIC X(1).                                              
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(3).                                              
           02  AORDNR7L    COMP  PIC  S9(4).                                    
           02  AORDNR7F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR7F.                                       
             03 AORDNR7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR7I  PIC X(2).                                              
           02  APTART7L    COMP  PIC  S9(4).                                    
           02  APTART7F    PICTURE X.                                           
           02  FILLER REDEFINES APTART7F.                                       
             03 APTART7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART7I  PIC X(4).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(2).                                              
           02  AVVNR7L    COMP  PIC  S9(4).                                     
           02  AVVNR7F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR7F.                                        
             03 AVVNR7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR7I  PIC X(15).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(10).                                             
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(7).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(14).                                             
           02  AEEENT7L    COMP  PIC  S9(4).                                    
           02  AEEENT7F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT7F.                                       
             03 AEEENT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT7I  PIC X(2).                                              
           02  APESKZ7L    COMP  PIC  S9(4).                                    
           02  APESKZ7F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ7F.                                       
             03 APESKZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ7I  PIC X(1).                                              
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(3).                                              
           02  AORDNR8L    COMP  PIC  S9(4).                                    
           02  AORDNR8F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR8F.                                       
             03 AORDNR8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR8I  PIC X(2).                                              
           02  APTART8L    COMP  PIC  S9(4).                                    
           02  APTART8F    PICTURE X.                                           
           02  FILLER REDEFINES APTART8F.                                       
             03 APTART8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART8I  PIC X(4).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(2).                                              
           02  AVVNR8L    COMP  PIC  S9(4).                                     
           02  AVVNR8F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR8F.                                        
             03 AVVNR8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR8I  PIC X(15).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(10).                                             
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(7).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(14).                                             
           02  AEEENT8L    COMP  PIC  S9(4).                                    
           02  AEEENT8F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT8F.                                       
             03 AEEENT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT8I  PIC X(2).                                              
           02  APESKZ8L    COMP  PIC  S9(4).                                    
           02  APESKZ8F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ8F.                                       
             03 APESKZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ8I  PIC X(1).                                              
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(3).                                              
           02  AORDNR9L    COMP  PIC  S9(4).                                    
           02  AORDNR9F    PICTURE X.                                           
           02  FILLER REDEFINES AORDNR9F.                                       
             03 AORDNR9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AORDNR9I  PIC X(2).                                              
           02  APTART9L    COMP  PIC  S9(4).                                    
           02  APTART9F    PICTURE X.                                           
           02  FILLER REDEFINES APTART9F.                                       
             03 APTART9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APTART9I  PIC X(4).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(2).                                              
           02  AVVNR9L    COMP  PIC  S9(4).                                     
           02  AVVNR9F    PICTURE X.                                            
           02  FILLER REDEFINES AVVNR9F.                                        
             03 AVVNR9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR9I  PIC X(15).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(10).                                             
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(7).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(14).                                             
           02  AEEENT9L    COMP  PIC  S9(4).                                    
           02  AEEENT9F    PICTURE X.                                           
           02  FILLER REDEFINES AEEENT9F.                                       
             03 AEEENT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEEENT9I  PIC X(2).                                              
           02  APESKZ9L    COMP  PIC  S9(4).                                    
           02  APESKZ9F    PICTURE X.                                           
           02  FILLER REDEFINES APESKZ9F.                                       
             03 APESKZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APESKZ9I  PIC X(1).                                              
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(3).                                              
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(2).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(4).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(2).                                              
           02  AVVNR92L    COMP  PIC  S9(4).                                    
           02  AVVNR92F    PICTURE X.                                           
           02  FILLER REDEFINES AVVNR92F.                                       
             03 AVVNR92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVVNR92I  PIC X(15).                                             
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(10).                                             
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(7).                                              
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(14).                                             
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(2).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(1).                                              
           02  EFCZ922L    COMP  PIC  S9(4).                                    
           02  EFCZ922F    PICTURE X.                                           
           02  FILLER REDEFINES EFCZ922F.                                       
             03 EFCZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ922I  PIC X(1).                                              
           02  F000058L    COMP  PIC  S9(4).                                    
           02  F000058F    PICTURE X.                                           
           02  FILLER REDEFINES F000058F.                                       
             03 F000058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000058I  PIC X(3).                                              
           02  F000057L    COMP  PIC  S9(4).                                    
           02  F000057F    PICTURE X.                                           
           02  FILLER REDEFINES F000057F.                                       
             03 F000057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000057I  PIC X(2).                                              
           02  F000056L    COMP  PIC  S9(4).                                    
           02  F000056F    PICTURE X.                                           
           02  FILLER REDEFINES F000056F.                                       
             03 F000056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000056I  PIC X(4).                                              
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(2).                                              
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(15).                                             
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(10).                                             
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(7).                                              
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(14).                                             
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(2).                                              
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(1).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0022O REDEFINES BPA0022I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AWAEBETH    PICTURE X.                                           
           02  AWAEBETO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNRH    PICTURE X.                                            
           02  AORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  APTARTH    PICTURE X.                                            
           02  APTARTO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGESVNRH    PICTURE X.                                           
           02  AGESVNRO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNRH    PICTURE X.                                             
           02  AVVNRO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APFLBEGH    PICTURE X.                                           
           02  APFLBEGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKDBETRH    PICTURE X.                                           
           02  AKDBETRO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABEWBTGH    PICTURE X.                                           
           02  ABEWBTGO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENTH    PICTURE X.                                            
           02  AEEENTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  APESKZH    PICTURE X.                                            
           02  APESKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR2H    PICTURE X.                                           
           02  AORDNR2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART2H    PICTURE X.                                           
           02  APTART2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR2H    PICTURE X.                                            
           02  AVVNR2O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT2H    PICTURE X.                                           
           02  AEEENT2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ2H    PICTURE X.                                           
           02  APESKZ2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR3H    PICTURE X.                                           
           02  AORDNR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART3H    PICTURE X.                                           
           02  APTART3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR3H    PICTURE X.                                            
           02  AVVNR3O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT3H    PICTURE X.                                           
           02  AEEENT3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ3H    PICTURE X.                                           
           02  APESKZ3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR4H    PICTURE X.                                           
           02  AORDNR4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART4H    PICTURE X.                                           
           02  APTART4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR4H    PICTURE X.                                            
           02  AVVNR4O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT4H    PICTURE X.                                           
           02  AEEENT4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ4H    PICTURE X.                                           
           02  APESKZ4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR5H    PICTURE X.                                           
           02  AORDNR5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART5H    PICTURE X.                                           
           02  APTART5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR5H    PICTURE X.                                            
           02  AVVNR5O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT5H    PICTURE X.                                           
           02  AEEENT5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ5H    PICTURE X.                                           
           02  APESKZ5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR6H    PICTURE X.                                           
           02  AORDNR6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART6H    PICTURE X.                                           
           02  APTART6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR6H    PICTURE X.                                            
           02  AVVNR6O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT6H    PICTURE X.                                           
           02  AEEENT6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ6H    PICTURE X.                                           
           02  APESKZ6O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR7H    PICTURE X.                                           
           02  AORDNR7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART7H    PICTURE X.                                           
           02  APTART7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR7H    PICTURE X.                                            
           02  AVVNR7O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT7H    PICTURE X.                                           
           02  AEEENT7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ7H    PICTURE X.                                           
           02  APESKZ7O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR8H    PICTURE X.                                           
           02  AORDNR8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART8H    PICTURE X.                                           
           02  APTART8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR8H    PICTURE X.                                            
           02  AVVNR8O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT8H    PICTURE X.                                           
           02  AEEENT8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ8H    PICTURE X.                                           
           02  APESKZ8O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNR9H    PICTURE X.                                           
           02  AORDNR9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APTART9H    PICTURE X.                                           
           02  APTART9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR9H    PICTURE X.                                            
           02  AVVNR9O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEEENT9H    PICTURE X.                                           
           02  AEEENT9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APESKZ9H    PICTURE X.                                           
           02  APESKZ9O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVNR92H    PICTURE X.                                           
           02  AVVNR92O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ922H    PICTURE X.                                           
           02  EFCZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000058H    PICTURE X.                                           
           02  F000058O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000057H    PICTURE X.                                           
           02  F000057O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000056H    PICTURE X.                                           
           02  F000056O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
