       01  BPA0058I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(4).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(4).                                              
           02  AABRVDAL    COMP  PIC  S9(4).                                    
           02  AABRVDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABRVDAF.                                       
             03 AABRVDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRVDAI  PIC X(10).                                             
           02  AABRBDAL    COMP  PIC  S9(4).                                    
           02  AABRBDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABRBDAF.                                       
             03 AABRBDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRBDAI  PIC X(10).                                             
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(4).                                               
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(14).                                             
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  AWAEBELL    COMP  PIC  S9(4).                                    
           02  AWAEBELF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEBELF.                                       
             03 AWAEBELA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEBELI  PIC X(4).                                              
           02  EFCZ1L    COMP  PIC  S9(4).                                      
           02  EFCZ1F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ1F.                                         
             03 EFCZ1A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ1I  PIC X(1).                                                
           02  ANTZ1L    COMP  PIC  S9(4).                                      
           02  ANTZ1F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ1F.                                         
             03 ANTZ1A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ1I  PIC X(1).                                                
           02  AVNR1L    COMP  PIC  S9(4).                                      
           02  AVNR1F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR1F.                                         
             03 AVNR1A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR1I  PIC X(15).                                               
           02  AVSTAT1L    COMP  PIC  S9(4).                                    
           02  AVSTAT1F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT1F.                                       
             03 AVSTAT1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT1I  PIC X(4).                                              
           02  APRODS1L    COMP  PIC  S9(4).                                    
           02  APRODS1F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS1F.                                       
             03 APRODS1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS1I  PIC X(3).                                              
           02  ANETBT1L    COMP  PIC  S9(4).                                    
           02  ANETBT1F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT1F.                                       
             03 ANETBT1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT1I  PIC X(13).                                             
           02  AUSTB1L    COMP  PIC  S9(4).                                     
           02  AUSTB1F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB1F.                                        
             03 AUSTB1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB1I  PIC X(13).                                              
           02  AFAEVD1L    COMP  PIC  S9(4).                                    
           02  AFAEVD1F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD1F.                                       
             03 AFAEVD1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD1I  PIC X(10).                                             
           02  AABRED1L    COMP  PIC  S9(4).                                    
           02  AABRED1F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED1F.                                       
             03 AABRED1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED1I  PIC X(10).                                             
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  ANTZ2L    COMP  PIC  S9(4).                                      
           02  ANTZ2F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ2F.                                         
             03 ANTZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ2I  PIC X(1).                                                
           02  AVNR2L    COMP  PIC  S9(4).                                      
           02  AVNR2F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR2F.                                         
             03 AVNR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR2I  PIC X(15).                                               
           02  AVSTAT2L    COMP  PIC  S9(4).                                    
           02  AVSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT2F.                                       
             03 AVSTAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT2I  PIC X(4).                                              
           02  APRODS2L    COMP  PIC  S9(4).                                    
           02  APRODS2F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS2F.                                       
             03 APRODS2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS2I  PIC X(3).                                              
           02  ANETBT2L    COMP  PIC  S9(4).                                    
           02  ANETBT2F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT2F.                                       
             03 ANETBT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT2I  PIC X(13).                                             
           02  AUSTB2L    COMP  PIC  S9(4).                                     
           02  AUSTB2F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB2F.                                        
             03 AUSTB2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB2I  PIC X(13).                                              
           02  AFAEVD2L    COMP  PIC  S9(4).                                    
           02  AFAEVD2F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD2F.                                       
             03 AFAEVD2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD2I  PIC X(10).                                             
           02  AABRED2L    COMP  PIC  S9(4).                                    
           02  AABRED2F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED2F.                                       
             03 AABRED2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED2I  PIC X(10).                                             
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  ANTZ3L    COMP  PIC  S9(4).                                      
           02  ANTZ3F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ3F.                                         
             03 ANTZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ3I  PIC X(1).                                                
           02  AVNR3L    COMP  PIC  S9(4).                                      
           02  AVNR3F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR3F.                                         
             03 AVNR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR3I  PIC X(15).                                               
           02  AVSTAT3L    COMP  PIC  S9(4).                                    
           02  AVSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT3F.                                       
             03 AVSTAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT3I  PIC X(4).                                              
           02  APRODS3L    COMP  PIC  S9(4).                                    
           02  APRODS3F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS3F.                                       
             03 APRODS3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS3I  PIC X(3).                                              
           02  ANETBT3L    COMP  PIC  S9(4).                                    
           02  ANETBT3F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT3F.                                       
             03 ANETBT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT3I  PIC X(13).                                             
           02  AUSTB3L    COMP  PIC  S9(4).                                     
           02  AUSTB3F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB3F.                                        
             03 AUSTB3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB3I  PIC X(13).                                              
           02  AFAEVD3L    COMP  PIC  S9(4).                                    
           02  AFAEVD3F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD3F.                                       
             03 AFAEVD3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD3I  PIC X(10).                                             
           02  AABRED3L    COMP  PIC  S9(4).                                    
           02  AABRED3F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED3F.                                       
             03 AABRED3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED3I  PIC X(10).                                             
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  ANTZ4L    COMP  PIC  S9(4).                                      
           02  ANTZ4F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ4F.                                         
             03 ANTZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ4I  PIC X(1).                                                
           02  AVNR4L    COMP  PIC  S9(4).                                      
           02  AVNR4F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR4F.                                         
             03 AVNR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR4I  PIC X(15).                                               
           02  AVSTAT4L    COMP  PIC  S9(4).                                    
           02  AVSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT4F.                                       
             03 AVSTAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT4I  PIC X(4).                                              
           02  APRODS4L    COMP  PIC  S9(4).                                    
           02  APRODS4F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS4F.                                       
             03 APRODS4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS4I  PIC X(3).                                              
           02  ANETBT4L    COMP  PIC  S9(4).                                    
           02  ANETBT4F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT4F.                                       
             03 ANETBT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT4I  PIC X(13).                                             
           02  AUSTB4L    COMP  PIC  S9(4).                                     
           02  AUSTB4F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB4F.                                        
             03 AUSTB4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB4I  PIC X(13).                                              
           02  AFAEVD4L    COMP  PIC  S9(4).                                    
           02  AFAEVD4F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD4F.                                       
             03 AFAEVD4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD4I  PIC X(10).                                             
           02  AABRED4L    COMP  PIC  S9(4).                                    
           02  AABRED4F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED4F.                                       
             03 AABRED4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED4I  PIC X(10).                                             
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  ANTZ5L    COMP  PIC  S9(4).                                      
           02  ANTZ5F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ5F.                                         
             03 ANTZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ5I  PIC X(1).                                                
           02  AVNR5L    COMP  PIC  S9(4).                                      
           02  AVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR5F.                                         
             03 AVNR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR5I  PIC X(15).                                               
           02  AVSTAT5L    COMP  PIC  S9(4).                                    
           02  AVSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT5F.                                       
             03 AVSTAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT5I  PIC X(4).                                              
           02  APRODS5L    COMP  PIC  S9(4).                                    
           02  APRODS5F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS5F.                                       
             03 APRODS5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS5I  PIC X(3).                                              
           02  ANETBT5L    COMP  PIC  S9(4).                                    
           02  ANETBT5F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT5F.                                       
             03 ANETBT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT5I  PIC X(13).                                             
           02  AUSTB5L    COMP  PIC  S9(4).                                     
           02  AUSTB5F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB5F.                                        
             03 AUSTB5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB5I  PIC X(13).                                              
           02  AFAEVD5L    COMP  PIC  S9(4).                                    
           02  AFAEVD5F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD5F.                                       
             03 AFAEVD5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD5I  PIC X(10).                                             
           02  AABRED5L    COMP  PIC  S9(4).                                    
           02  AABRED5F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED5F.                                       
             03 AABRED5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED5I  PIC X(10).                                             
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  ANTZ6L    COMP  PIC  S9(4).                                      
           02  ANTZ6F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ6F.                                         
             03 ANTZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ6I  PIC X(1).                                                
           02  AVNR6L    COMP  PIC  S9(4).                                      
           02  AVNR6F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR6F.                                         
             03 AVNR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR6I  PIC X(15).                                               
           02  AVSTAT6L    COMP  PIC  S9(4).                                    
           02  AVSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT6F.                                       
             03 AVSTAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT6I  PIC X(4).                                              
           02  APRODS6L    COMP  PIC  S9(4).                                    
           02  APRODS6F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS6F.                                       
             03 APRODS6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS6I  PIC X(3).                                              
           02  ANETBT6L    COMP  PIC  S9(4).                                    
           02  ANETBT6F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT6F.                                       
             03 ANETBT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT6I  PIC X(13).                                             
           02  AUSTB6L    COMP  PIC  S9(4).                                     
           02  AUSTB6F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB6F.                                        
             03 AUSTB6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB6I  PIC X(13).                                              
           02  AFAEVD6L    COMP  PIC  S9(4).                                    
           02  AFAEVD6F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD6F.                                       
             03 AFAEVD6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD6I  PIC X(10).                                             
           02  AABRED6L    COMP  PIC  S9(4).                                    
           02  AABRED6F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED6F.                                       
             03 AABRED6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED6I  PIC X(10).                                             
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  ANTZ7L    COMP  PIC  S9(4).                                      
           02  ANTZ7F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ7F.                                         
             03 ANTZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ7I  PIC X(1).                                                
           02  AVNR7L    COMP  PIC  S9(4).                                      
           02  AVNR7F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR7F.                                         
             03 AVNR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR7I  PIC X(15).                                               
           02  AVSTAT7L    COMP  PIC  S9(4).                                    
           02  AVSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT7F.                                       
             03 AVSTAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT7I  PIC X(4).                                              
           02  APRODS7L    COMP  PIC  S9(4).                                    
           02  APRODS7F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS7F.                                       
             03 APRODS7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS7I  PIC X(3).                                              
           02  ANETBT7L    COMP  PIC  S9(4).                                    
           02  ANETBT7F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT7F.                                       
             03 ANETBT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT7I  PIC X(13).                                             
           02  AUSTB7L    COMP  PIC  S9(4).                                     
           02  AUSTB7F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB7F.                                        
             03 AUSTB7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB7I  PIC X(13).                                              
           02  AFAEVD7L    COMP  PIC  S9(4).                                    
           02  AFAEVD7F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD7F.                                       
             03 AFAEVD7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD7I  PIC X(10).                                             
           02  AABRED7L    COMP  PIC  S9(4).                                    
           02  AABRED7F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED7F.                                       
             03 AABRED7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED7I  PIC X(10).                                             
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  ANTZ8L    COMP  PIC  S9(4).                                      
           02  ANTZ8F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ8F.                                         
             03 ANTZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ8I  PIC X(1).                                                
           02  AVNR8L    COMP  PIC  S9(4).                                      
           02  AVNR8F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR8F.                                         
             03 AVNR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR8I  PIC X(15).                                               
           02  AVSTAT8L    COMP  PIC  S9(4).                                    
           02  AVSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT8F.                                       
             03 AVSTAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT8I  PIC X(4).                                              
           02  APRODS8L    COMP  PIC  S9(4).                                    
           02  APRODS8F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS8F.                                       
             03 APRODS8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS8I  PIC X(3).                                              
           02  ANETBT8L    COMP  PIC  S9(4).                                    
           02  ANETBT8F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT8F.                                       
             03 ANETBT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT8I  PIC X(13).                                             
           02  AUSTB8L    COMP  PIC  S9(4).                                     
           02  AUSTB8F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB8F.                                        
             03 AUSTB8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB8I  PIC X(13).                                              
           02  AFAEVD8L    COMP  PIC  S9(4).                                    
           02  AFAEVD8F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD8F.                                       
             03 AFAEVD8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD8I  PIC X(10).                                             
           02  AABRED8L    COMP  PIC  S9(4).                                    
           02  AABRED8F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED8F.                                       
             03 AABRED8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED8I  PIC X(10).                                             
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  ANTZ9L    COMP  PIC  S9(4).                                      
           02  ANTZ9F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ9F.                                         
             03 ANTZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ9I  PIC X(1).                                                
           02  AVNR9L    COMP  PIC  S9(4).                                      
           02  AVNR9F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR9F.                                         
             03 AVNR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR9I  PIC X(15).                                               
           02  AVSTAT9L    COMP  PIC  S9(4).                                    
           02  AVSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT9F.                                       
             03 AVSTAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT9I  PIC X(4).                                              
           02  APRODS9L    COMP  PIC  S9(4).                                    
           02  APRODS9F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS9F.                                       
             03 APRODS9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS9I  PIC X(3).                                              
           02  ANETBT9L    COMP  PIC  S9(4).                                    
           02  ANETBT9F    PICTURE X.                                           
           02  FILLER REDEFINES ANETBT9F.                                       
             03 ANETBT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBT9I  PIC X(13).                                             
           02  AUSTB9L    COMP  PIC  S9(4).                                     
           02  AUSTB9F    PICTURE X.                                            
           02  FILLER REDEFINES AUSTB9F.                                        
             03 AUSTB9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTB9I  PIC X(13).                                              
           02  AFAEVD9L    COMP  PIC  S9(4).                                    
           02  AFAEVD9F    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVD9F.                                       
             03 AFAEVD9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVD9I  PIC X(10).                                             
           02  AABRED9L    COMP  PIC  S9(4).                                    
           02  AABRED9F    PICTURE X.                                           
           02  FILLER REDEFINES AABRED9F.                                       
             03 AABRED9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRED9I  PIC X(10).                                             
           02  EFCZAL    COMP  PIC  S9(4).                                      
           02  EFCZAF    PICTURE X.                                             
           02  FILLER REDEFINES EFCZAF.                                         
             03 EFCZAA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZAI  PIC X(1).                                                
           02  ANTZAL    COMP  PIC  S9(4).                                      
           02  ANTZAF    PICTURE X.                                             
           02  FILLER REDEFINES ANTZAF.                                         
             03 ANTZAA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZAI  PIC X(1).                                                
           02  AVNRAL    COMP  PIC  S9(4).                                      
           02  AVNRAF    PICTURE X.                                             
           02  FILLER REDEFINES AVNRAF.                                         
             03 AVNRAA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNRAI  PIC X(15).                                               
           02  AVSTATAL    COMP  PIC  S9(4).                                    
           02  AVSTATAF    PICTURE X.                                           
           02  FILLER REDEFINES AVSTATAF.                                       
             03 AVSTATAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATAI  PIC X(4).                                              
           02  APRODSAL    COMP  PIC  S9(4).                                    
           02  APRODSAF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSAF.                                       
             03 APRODSAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSAI  PIC X(3).                                              
           02  ANETBTAL    COMP  PIC  S9(4).                                    
           02  ANETBTAF    PICTURE X.                                           
           02  FILLER REDEFINES ANETBTAF.                                       
             03 ANETBTAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBTAI  PIC X(13).                                             
           02  AUSTBAL    COMP  PIC  S9(4).                                     
           02  AUSTBAF    PICTURE X.                                            
           02  FILLER REDEFINES AUSTBAF.                                        
             03 AUSTBAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTBAI  PIC X(13).                                              
           02  AFAEVDAL    COMP  PIC  S9(4).                                    
           02  AFAEVDAF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVDAF.                                       
             03 AFAEVDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVDAI  PIC X(10).                                             
           02  AABREDAL    COMP  PIC  S9(4).                                    
           02  AABREDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABREDAF.                                       
             03 AABREDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREDAI  PIC X(10).                                             
           02  EFCZBL    COMP  PIC  S9(4).                                      
           02  EFCZBF    PICTURE X.                                             
           02  FILLER REDEFINES EFCZBF.                                         
             03 EFCZBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZBI  PIC X(1).                                                
           02  ANTZBL    COMP  PIC  S9(4).                                      
           02  ANTZBF    PICTURE X.                                             
           02  FILLER REDEFINES ANTZBF.                                         
             03 ANTZBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZBI  PIC X(1).                                                
           02  AVNRBL    COMP  PIC  S9(4).                                      
           02  AVNRBF    PICTURE X.                                             
           02  FILLER REDEFINES AVNRBF.                                         
             03 AVNRBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNRBI  PIC X(15).                                               
           02  AVSTATBL    COMP  PIC  S9(4).                                    
           02  AVSTATBF    PICTURE X.                                           
           02  FILLER REDEFINES AVSTATBF.                                       
             03 AVSTATBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATBI  PIC X(4).                                              
           02  APRODSBL    COMP  PIC  S9(4).                                    
           02  APRODSBF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSBF.                                       
             03 APRODSBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSBI  PIC X(3).                                              
           02  ANETBTBL    COMP  PIC  S9(4).                                    
           02  ANETBTBF    PICTURE X.                                           
           02  FILLER REDEFINES ANETBTBF.                                       
             03 ANETBTBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANETBTBI  PIC X(13).                                             
           02  AUSTBBL    COMP  PIC  S9(4).                                     
           02  AUSTBBF    PICTURE X.                                            
           02  FILLER REDEFINES AUSTBBF.                                        
             03 AUSTBBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUSTBBI  PIC X(13).                                              
           02  AFAEVDBL    COMP  PIC  S9(4).                                    
           02  AFAEVDBF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVDBF.                                       
             03 AFAEVDBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVDBI  PIC X(10).                                             
           02  AABREDBL    COMP  PIC  S9(4).                                    
           02  AABREDBF    PICTURE X.                                           
           02  FILLER REDEFINES AABREDBF.                                       
             03 AABREDBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREDBI  PIC X(10).                                             
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0058O REDEFINES BPA0058I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABRVDAH    PICTURE X.                                           
           02  AABRVDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRBDAH    PICTURE X.                                           
           02  AABRBDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AWAEBELH    PICTURE X.                                           
           02  AWAEBELO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZ1H    PICTURE X.                                             
           02  EFCZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ1H    PICTURE X.                                             
           02  ANTZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR1H    PICTURE X.                                             
           02  AVNR1O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT1H    PICTURE X.                                           
           02  AVSTAT1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS1H    PICTURE X.                                           
           02  APRODS1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT1H    PICTURE X.                                           
           02  ANETBT1O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB1H    PICTURE X.                                            
           02  AUSTB1O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD1H    PICTURE X.                                           
           02  AFAEVD1O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED1H    PICTURE X.                                           
           02  AABRED1O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ2H    PICTURE X.                                             
           02  ANTZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR2H    PICTURE X.                                             
           02  AVNR2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT2H    PICTURE X.                                           
           02  AVSTAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS2H    PICTURE X.                                           
           02  APRODS2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT2H    PICTURE X.                                           
           02  ANETBT2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB2H    PICTURE X.                                            
           02  AUSTB2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD2H    PICTURE X.                                           
           02  AFAEVD2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED2H    PICTURE X.                                           
           02  AABRED2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ3H    PICTURE X.                                             
           02  ANTZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR3H    PICTURE X.                                             
           02  AVNR3O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT3H    PICTURE X.                                           
           02  AVSTAT3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS3H    PICTURE X.                                           
           02  APRODS3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT3H    PICTURE X.                                           
           02  ANETBT3O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB3H    PICTURE X.                                            
           02  AUSTB3O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD3H    PICTURE X.                                           
           02  AFAEVD3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED3H    PICTURE X.                                           
           02  AABRED3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ4H    PICTURE X.                                             
           02  ANTZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR4H    PICTURE X.                                             
           02  AVNR4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT4H    PICTURE X.                                           
           02  AVSTAT4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS4H    PICTURE X.                                           
           02  APRODS4O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT4H    PICTURE X.                                           
           02  ANETBT4O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB4H    PICTURE X.                                            
           02  AUSTB4O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD4H    PICTURE X.                                           
           02  AFAEVD4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED4H    PICTURE X.                                           
           02  AABRED4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ5H    PICTURE X.                                             
           02  ANTZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR5H    PICTURE X.                                             
           02  AVNR5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT5H    PICTURE X.                                           
           02  AVSTAT5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS5H    PICTURE X.                                           
           02  APRODS5O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT5H    PICTURE X.                                           
           02  ANETBT5O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB5H    PICTURE X.                                            
           02  AUSTB5O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD5H    PICTURE X.                                           
           02  AFAEVD5O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED5H    PICTURE X.                                           
           02  AABRED5O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ6H    PICTURE X.                                             
           02  ANTZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR6H    PICTURE X.                                             
           02  AVNR6O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT6H    PICTURE X.                                           
           02  AVSTAT6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS6H    PICTURE X.                                           
           02  APRODS6O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT6H    PICTURE X.                                           
           02  ANETBT6O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB6H    PICTURE X.                                            
           02  AUSTB6O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD6H    PICTURE X.                                           
           02  AFAEVD6O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED6H    PICTURE X.                                           
           02  AABRED6O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ7H    PICTURE X.                                             
           02  ANTZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR7H    PICTURE X.                                             
           02  AVNR7O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT7H    PICTURE X.                                           
           02  AVSTAT7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS7H    PICTURE X.                                           
           02  APRODS7O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT7H    PICTURE X.                                           
           02  ANETBT7O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB7H    PICTURE X.                                            
           02  AUSTB7O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD7H    PICTURE X.                                           
           02  AFAEVD7O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED7H    PICTURE X.                                           
           02  AABRED7O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ8H    PICTURE X.                                             
           02  ANTZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR8H    PICTURE X.                                             
           02  AVNR8O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT8H    PICTURE X.                                           
           02  AVSTAT8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS8H    PICTURE X.                                           
           02  APRODS8O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT8H    PICTURE X.                                           
           02  ANETBT8O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB8H    PICTURE X.                                            
           02  AUSTB8O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD8H    PICTURE X.                                           
           02  AFAEVD8O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED8H    PICTURE X.                                           
           02  AABRED8O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ9H    PICTURE X.                                             
           02  ANTZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR9H    PICTURE X.                                             
           02  AVNR9O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT9H    PICTURE X.                                           
           02  AVSTAT9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS9H    PICTURE X.                                           
           02  APRODS9O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBT9H    PICTURE X.                                           
           02  ANETBT9O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTB9H    PICTURE X.                                            
           02  AUSTB9O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVD9H    PICTURE X.                                           
           02  AFAEVD9O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRED9H    PICTURE X.                                           
           02  AABRED9O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZAH    PICTURE X.                                             
           02  EFCZAO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZAH    PICTURE X.                                             
           02  ANTZAO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNRAH    PICTURE X.                                             
           02  AVNRAO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTATAH    PICTURE X.                                           
           02  AVSTATAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODSAH    PICTURE X.                                           
           02  APRODSAO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBTAH    PICTURE X.                                           
           02  ANETBTAO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTBAH    PICTURE X.                                            
           02  AUSTBAO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVDAH    PICTURE X.                                           
           02  AFAEVDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABREDAH    PICTURE X.                                           
           02  AABREDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZBH    PICTURE X.                                             
           02  EFCZBO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZBH    PICTURE X.                                             
           02  ANTZBO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNRBH    PICTURE X.                                             
           02  AVNRBO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTATBH    PICTURE X.                                           
           02  AVSTATBO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODSBH    PICTURE X.                                           
           02  APRODSBO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANETBTBH    PICTURE X.                                           
           02  ANETBTBO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSTBBH    PICTURE X.                                            
           02  AUSTBBO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVDBH    PICTURE X.                                           
           02  AFAEVDBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABREDBH    PICTURE X.                                           
           02  AABREDBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
