      *   Micro Focus Enterprise Developer for Eclipse  5.0.00256
      *   Micro Focus BMS Screen Painter (ver BMSIDE_5-0-01)
      *   MapSet Name   BPA0054
      *   Date Created  01/12/2022
      *   Time Created  07:36:35

      *  Input Data For Map BPA0054
         01 BPA0054I.
            03 FILLER                         PIC X(12).
            03 AGESFBL                        PIC S9(4) COMP.
            03 AGESFBF                        PIC X.
            03 FILLER REDEFINES AGESFBF.
               05 AGESFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESFBI                        PIC X(4).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER REDEFINES EGESF.
               05 EGESA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER REDEFINES AGESBMF.
               05 AGESBMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER REDEFINES EVNRF.
               05 EVNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 APINFBL                        PIC S9(4) COMP.
            03 APINFBF                        PIC X.
            03 FILLER REDEFINES APINFBF.
               05 APINFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 APINFBI                        PIC X(4).
            03 EPINL                          PIC S9(4) COMP.
            03 EPINF                          PIC X.
            03 FILLER REDEFINES EPINF.
               05 EPINA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPINI                          PIC X(9).
            03 EPINPZL                        PIC S9(4) COMP.
            03 EPINPZF                        PIC X.
            03 FILLER REDEFINES EPINPZF.
               05 EPINPZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPINPZI                        PIC X(2).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER REDEFINES AFCSFBF.
               05 AFCSFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER REDEFINES EFCSF.
               05 EFCSA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER REDEFINES AFCSANZF.
               05 AFCSANZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(30).
            03 AVERSL                         PIC S9(4) COMP.
            03 AVERSF                         PIC X.
            03 FILLER REDEFINES AVERSF.
               05 AVERSA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSI                         PIC X(3).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER REDEFINES AVSTATF.
               05 AVSTATA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVGESBML                       PIC S9(4) COMP.
            03 AVGESBMF                       PIC X.
            03 FILLER REDEFINES AVGESBMF.
               05 AVGESBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESBMI                       PIC X(4).
            03 AERKZFBL                       PIC S9(4) COMP.
            03 AERKZFBF                       PIC X.
            03 FILLER REDEFINES AERKZFBF.
               05 AERKZFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AERKZFBI                       PIC X(8).
            03 AERSTKZL                       PIC S9(4) COMP.
            03 AERSTKZF                       PIC X.
            03 FILLER REDEFINES AERSTKZF.
               05 AERSTKZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AERSTKZI                       PIC X(1).
            03 ALUPDDAL                       PIC S9(4) COMP.
            03 ALUPDDAF                       PIC X.
            03 FILLER REDEFINES ALUPDDAF.
               05 ALUPDDAA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDDAI                       PIC X(10).
            03 ALUPDUSL                       PIC S9(4) COMP.
            03 ALUPDUSF                       PIC X.
            03 FILLER REDEFINES ALUPDUSF.
               05 ALUPDUSA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDUSI                       PIC X(8).
            03 ATNRTXTL                       PIC S9(4) COMP.
            03 ATNRTXTF                       PIC X.
            03 FILLER REDEFINES ATNRTXTF.
               05 ATNRTXTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ATNRTXTI                       PIC X(9).
            03 ETNRL                          PIC S9(4) COMP.
            03 ETNRF                          PIC X.
            03 FILLER REDEFINES ETNRF.
               05 ETNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 ETNRI                          PIC X(10).
            03 EKNAMEL                        PIC S9(4) COMP.
            03 EKNAMEF                        PIC X.
            03 FILLER REDEFINES EKNAMEF.
               05 EKNAMEA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKNAMEI                        PIC X(25).
            03 EFAEVTTL                       PIC S9(4) COMP.
            03 EFAEVTTF                       PIC X.
            03 FILLER REDEFINES EFAEVTTF.
               05 EFAEVTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVTTI                       PIC X(2).
            03 EFAEVMML                       PIC S9(4) COMP.
            03 EFAEVMMF                       PIC X.
            03 FILLER REDEFINES EFAEVMMF.
               05 EFAEVMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVMMI                       PIC X(2).
            03 EFAEVJJL                       PIC S9(4) COMP.
            03 EFAEVJJF                       PIC X.
            03 FILLER REDEFINES EFAEVJJF.
               05 EFAEVJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVJJI                       PIC X(4).
            03 EKVNAMEL                       PIC S9(4) COMP.
            03 EKVNAMEF                       PIC X.
            03 FILLER REDEFINES EKVNAMEF.
               05 EKVNAMEA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKVNAMEI                       PIC X(20).
            03 AFAEBFBL                       PIC S9(4) COMP.
            03 AFAEBFBF                       PIC X.
            03 FILLER REDEFINES AFAEBFBF.
               05 AFAEBFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBFBI                       PIC X(11).
            03 EFAEBTTL                       PIC S9(4) COMP.
            03 EFAEBTTF                       PIC X.
            03 FILLER REDEFINES EFAEBTTF.
               05 EFAEBTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBTTI                       PIC X(2).
            03 EFAEBMML                       PIC S9(4) COMP.
            03 EFAEBMMF                       PIC X.
            03 FILLER REDEFINES EFAEBMMF.
               05 EFAEBMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBMMI                       PIC X(2).
            03 EFAEBJJL                       PIC S9(4) COMP.
            03 EFAEBJJF                       PIC X.
            03 FILLER REDEFINES EFAEBJJF.
               05 EFAEBJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBJJI                       PIC X(4).
            03 EAVERML                        PIC S9(4) COMP.
            03 EAVERMF                        PIC X.
            03 FILLER REDEFINES EAVERMF.
               05 EAVERMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMI                        PIC X(7).
            03 EAVERMPL                       PIC S9(4) COMP.
            03 EAVERMPF                       PIC X.
            03 FILLER REDEFINES EAVERMPF.
               05 EAVERMPA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMPI                       PIC X(1).
            03 AABRETTL                       PIC S9(4) COMP.
            03 AABRETTF                       PIC X.
            03 FILLER REDEFINES AABRETTF.
               05 AABRETTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRETTI                       PIC X(2).
            03 AABREMML                       PIC S9(4) COMP.
            03 AABREMMF                       PIC X.
            03 FILLER REDEFINES AABREMMF.
               05 AABREMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREMMI                       PIC X(2).
            03 AABREJJL                       PIC S9(4) COMP.
            03 AABREJJF                       PIC X.
            03 FILLER REDEFINES AABREJJF.
               05 AABREJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREJJI                       PIC X(4).
            03 AVBEGFBL                       PIC S9(4) COMP.
            03 AVBEGFBF                       PIC X.
            03 FILLER REDEFINES AVBEGFBF.
               05 AVBEGFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVBEGFBI                       PIC X(15).
            03 EVBEGTTL                       PIC S9(4) COMP.
            03 EVBEGTTF                       PIC X.
            03 FILLER REDEFINES EVBEGTTF.
               05 EVBEGTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGTTI                       PIC X(2).
            03 EVBEGMML                       PIC S9(4) COMP.
            03 EVBEGMMF                       PIC X.
            03 FILLER REDEFINES EVBEGMMF.
               05 EVBEGMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGMMI                       PIC X(2).
            03 EVBEGJJL                       PIC S9(4) COMP.
            03 EVBEGJJF                       PIC X.
            03 FILLER REDEFINES EVBEGJJF.
               05 EVBEGJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGJJI                       PIC X(4).
            03 AVENDTXL                       PIC S9(4) COMP.
            03 AVENDTXF                       PIC X.
            03 FILLER REDEFINES AVENDTXF.
               05 AVENDTXA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVENDTXI                       PIC X(15).
            03 EVENDTTL                       PIC S9(4) COMP.
            03 EVENDTTF                       PIC X.
            03 FILLER REDEFINES EVENDTTF.
               05 EVENDTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDTTI                       PIC X(2).
            03 EVENDMML                       PIC S9(4) COMP.
            03 EVENDMMF                       PIC X.
            03 FILLER REDEFINES EVENDMMF.
               05 EVENDMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDMMI                       PIC X(2).
            03 EVENDJJL                       PIC S9(4) COMP.
            03 EVENDJJF                       PIC X.
            03 FILLER REDEFINES EVENDJJF.
               05 EVENDJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDJJI                       PIC X(4).
            03 EWAEBKL                        PIC S9(4) COMP.
            03 EWAEBKF                        PIC X.
            03 FILLER REDEFINES EWAEBKF.
               05 EWAEBKA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EWAEBKI                        PIC X(4).
            03 AHFKZFL                        PIC S9(4) COMP.
            03 AHFKZFF                        PIC X.
            03 FILLER REDEFINES AHFKZFF.
               05 AHFKZFA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AHFKZFI                        PIC X(8).
            03 EHAFTKZL                       PIC S9(4) COMP.
            03 EHAFTKZF                       PIC X.
            03 FILLER REDEFINES EHAFTKZF.
               05 EHAFTKZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHAFTKZI                       PIC X(2).
            03 AZHLWFBL                       PIC S9(4) COMP.
            03 AZHLWFBF                       PIC X.
            03 FILLER REDEFINES AZHLWFBF.
               05 AZHLWFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLWFBI                       PIC X(13).
            03 EZHLWL                         PIC S9(4) COMP.
            03 EZHLWF                         PIC X.
            03 FILLER REDEFINES EZHLWF.
               05 EZHLWA                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZHLWI                         PIC X(2).
            03 AZHLTXTL                       PIC S9(4) COMP.
            03 AZHLTXTF                       PIC X.
            03 FILLER REDEFINES AZHLTXTF.
               05 AZHLTXTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLTXTI                       PIC X(10).
            03 APFLSTXL                       PIC S9(4) COMP.
            03 APFLSTXF                       PIC X.
            03 FILLER REDEFINES APFLSTXF.
               05 APFLSTXA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APFLSTXI                       PIC X(19).
            03 EBPFLSUL                       PIC S9(4) COMP.
            03 EBPFLSUF                       PIC X.
            03 FILLER REDEFINES EBPFLSUF.
               05 EBPFLSUA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EBPFLSUI                       PIC X(13).
            03 AEDATFBL                       PIC S9(4) COMP.
            03 AEDATFBF                       PIC X.
            03 FILLER REDEFINES AEDATFBF.
               05 AEDATFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEDATFBI                       PIC X(25).
            03 EEDATTTL                       PIC S9(4) COMP.
            03 EEDATTTF                       PIC X.
            03 FILLER REDEFINES EEDATTTF.
               05 EEDATTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EEDATTTI                       PIC X(2).
            03 EEDATMML                       PIC S9(4) COMP.
            03 EEDATMMF                       PIC X.
            03 FILLER REDEFINES EEDATMMF.
               05 EEDATMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EEDATMMI                       PIC X(2).
            03 EEDATJJL                       PIC S9(4) COMP.
            03 EEDATJJF                       PIC X.
            03 FILLER REDEFINES EEDATJJF.
               05 EEDATJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EEDATJJI                       PIC X(4).
            03 AGPROVBL                       PIC S9(4) COMP.
            03 AGPROVBF                       PIC X.
            03 FILLER REDEFINES AGPROVBF.
               05 AGPROVBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGPROVBI                       PIC X(13).
            03 ASPKZFBL                       PIC S9(4) COMP.
            03 ASPKZFBF                       PIC X.
            03 FILLER REDEFINES ASPKZFBF.
               05 ASPKZFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASPKZFBI                       PIC X(21).
            03 ESPLIKZL                       PIC S9(4) COMP.
            03 ESPLIKZF                       PIC X.
            03 FILLER REDEFINES ESPLIKZF.
               05 ESPLIKZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESPLIKZI                       PIC X(1).
            03 AVERPFBL                       PIC S9(4) COMP.
            03 AVERPFBF                       PIC X.
            03 FILLER REDEFINES AVERPFBF.
               05 AVERPFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERPFBI                       PIC X(19).
            03 EVERSPNL                       PIC S9(4) COMP.
            03 EVERSPNF                       PIC X.
            03 FILLER REDEFINES EVERSPNF.
               05 EVERSPNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVERSPNI                       PIC X(2).
            03 AFBLZTXL                       PIC S9(4) COMP.
            03 AFBLZTXF                       PIC X.
            03 FILLER REDEFINES AFBLZTXF.
               05 AFBLZTXA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBLZTXI                       PIC X(18).
            03 ELFZEITL                       PIC S9(4) COMP.
            03 ELFZEITF                       PIC X.
            03 FILLER REDEFINES ELFZEITF.
               05 ELFZEITA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELFZEITI                       PIC X(4).
            03 APGVFBL                        PIC S9(4) COMP.
            03 APGVFBF                        PIC X.
            03 FILLER REDEFINES APGVFBF.
               05 APGVFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGVFBI                        PIC X(4).
            03 AKZFBL                         PIC S9(4) COMP.
            03 AKZFBF                         PIC X.
            03 FILLER REDEFINES AKZFBF.
               05 AKZFBA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AKZFBI                         PIC X(2).
            03 ASUBETXL                       PIC S9(4) COMP.
            03 ASUBETXF                       PIC X.
            03 FILLER REDEFINES ASUBETXF.
               05 ASUBETXA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASUBETXI                       PIC X(7).
            03 EPGVL                          PIC S9(4) COMP.
            03 EPGVF                          PIC X.
            03 FILLER REDEFINES EPGVF.
               05 EPGVA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPGVI                          PIC X(4).
            03 APGPGVL                        PIC S9(4) COMP.
            03 APGPGVF                        PIC X.
            03 FILLER REDEFINES APGPGVF.
               05 APGPGVA                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGPGVI                        PIC X(4).
            03 APGVKZL                        PIC S9(4) COMP.
            03 APGVKZF                        PIC X.
            03 FILLER REDEFINES APGVKZF.
               05 APGVKZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGVKZI                        PIC X(1).
            03 EPRODL                         PIC S9(4) COMP.
            03 EPRODF                         PIC X.
            03 FILLER REDEFINES EPRODF.
               05 EPRODA                         PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODI                         PIC X(3).
            03 EPGTARIL                       PIC S9(4) COMP.
            03 EPGTARIF                       PIC X.
            03 FILLER REDEFINES EPGTARIF.
               05 EPGTARIA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPGTARII                       PIC X(15).
            03 EPPFLSUL                       PIC S9(4) COMP.
            03 EPPFLSUF                       PIC X.
            03 FILLER REDEFINES EPPFLSUF.
               05 EPPFLSUA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPPFLSUI                       PIC X(14).
            03 EPROVSL                        PIC S9(4) COMP.
            03 EPROVSF                        PIC X.
            03 FILLER REDEFINES EPROVSF.
               05 EPROVSA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVSI                        PIC X(9).
            03 EPROVBL                        PIC S9(4) COMP.
            03 EPROVBF                        PIC X.
            03 FILLER REDEFINES EPROVBF.
               05 EPROVBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVBI                        PIC X(15).
            03 AFCZANZL                       PIC S9(4) COMP.
            03 AFCZANZF                       PIC X.
            03 FILLER REDEFINES AFCZANZF.
               05 AFCZANZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZANZI                       PIC X(79).

      *  Output Data For Map BPA0054
         01 BPA0054O REDEFINES BPA0054I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 AGESFBH                        PIC X.
            03 AGESFBO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(3).
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(3).
            03 APINFBH                        PIC X.
            03 APINFBO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 EPINH                          PIC X.
            03 EPINO                          PIC X(9).
            03 FILLER                         PIC X(3).
            03 EPINPZH                        PIC X.
            03 EPINPZO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(30).
            03 FILLER                         PIC X(3).
            03 AVERSH                         PIC X.
            03 AVERSO                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVGESBMH                       PIC X.
            03 AVGESBMO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AERKZFBH                       PIC X.
            03 AERKZFBO                       PIC X(8).
            03 FILLER                         PIC X(3).
            03 AERSTKZH                       PIC X.
            03 AERSTKZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 ALUPDDAH                       PIC X.
            03 ALUPDDAO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ALUPDUSH                       PIC X.
            03 ALUPDUSO                       PIC X(8).
            03 FILLER                         PIC X(3).
            03 ATNRTXTH                       PIC X.
            03 ATNRTXTO                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 ETNRH                          PIC X.
            03 ETNRO                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 EKNAMEH                        PIC X.
            03 EKNAMEO                        PIC X(25).
            03 FILLER                         PIC X(3).
            03 EFAEVTTH                       PIC X.
            03 EFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EFAEVMMH                       PIC X.
            03 EFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EFAEVJJH                       PIC X.
            03 EFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 EKVNAMEH                       PIC X.
            03 EKVNAMEO                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 AFAEBFBH                       PIC X.
            03 AFAEBFBO                       PIC X(11).
            03 FILLER                         PIC X(3).
            03 EFAEBTTH                       PIC X.
            03 EFAEBTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EFAEBMMH                       PIC X.
            03 EFAEBMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EFAEBJJH                       PIC X.
            03 EFAEBJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 EAVERMH                        PIC X.
            03 EAVERMO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 EAVERMPH                       PIC X.
            03 EAVERMPO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 AABRETTH                       PIC X.
            03 AABRETTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AABREMMH                       PIC X.
            03 AABREMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AABREJJH                       PIC X.
            03 AABREJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVBEGFBH                       PIC X.
            03 AVBEGFBO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 EVBEGTTH                       PIC X.
            03 EVBEGTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EVBEGMMH                       PIC X.
            03 EVBEGMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EVBEGJJH                       PIC X.
            03 EVBEGJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVENDTXH                       PIC X.
            03 AVENDTXO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 EVENDTTH                       PIC X.
            03 EVENDTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EVENDMMH                       PIC X.
            03 EVENDMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EVENDJJH                       PIC X.
            03 EVENDJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 EWAEBKH                        PIC X.
            03 EWAEBKO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 AHFKZFH                        PIC X.
            03 AHFKZFO                        PIC X(8).
            03 FILLER                         PIC X(3).
            03 EHAFTKZH                       PIC X.
            03 EHAFTKZO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AZHLWFBH                       PIC X.
            03 AZHLWFBO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 EZHLWH                         PIC X.
            03 EZHLWO                         PIC X(2).
            03 FILLER                         PIC X(3).
            03 AZHLTXTH                       PIC X.
            03 AZHLTXTO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 APFLSTXH                       PIC X.
            03 APFLSTXO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 EBPFLSUH                       PIC X.
            03 EBPFLSUO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 AEDATFBH                       PIC X.
            03 AEDATFBO                       PIC X(25).
            03 FILLER                         PIC X(3).
            03 EEDATTTH                       PIC X.
            03 EEDATTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EEDATMMH                       PIC X.
            03 EEDATMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EEDATJJH                       PIC X.
            03 EEDATJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AGPROVBH                       PIC X.
            03 AGPROVBO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 ASPKZFBH                       PIC X.
            03 ASPKZFBO                       PIC X(21).
            03 FILLER                         PIC X(3).
            03 ESPLIKZH                       PIC X.
            03 ESPLIKZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 AVERPFBH                       PIC X.
            03 AVERPFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 EVERSPNH                       PIC X.
            03 EVERSPNO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFBLZTXH                       PIC X.
            03 AFBLZTXO                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 ELFZEITH                       PIC X.
            03 ELFZEITO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 APGVFBH                        PIC X.
            03 APGVFBO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 AKZFBH                         PIC X.
            03 AKZFBO                         PIC X(2).
            03 FILLER                         PIC X(3).
            03 ASUBETXH                       PIC X.
            03 ASUBETXO                       PIC X(7).
            03 FILLER                         PIC X(3).
            03 EPGVH                          PIC X.
            03 EPGVO                          PIC X(4).
            03 FILLER                         PIC X(3).
            03 APGPGVH                        PIC X.
            03 APGPGVO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 APGVKZH                        PIC X.
            03 APGVKZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EPRODH                         PIC X.
            03 EPRODO                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EPGTARIH                       PIC X.
            03 EPGTARIO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 EPPFLSUH                       PIC X.
            03 EPPFLSUO                       PIC X(14).
            03 FILLER                         PIC X(3).
            03 EPROVSH                        PIC X.
            03 EPROVSO                        PIC X(9).
            03 FILLER                         PIC X(3).
            03 EPROVBH                        PIC X.
            03 EPROVBO                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 AFCZANZH                       PIC X.
            03 AFCZANZO                       PIC X(79).

