       01  BPA0020I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  EPINL    COMP  PIC  S9(4).                                       
           02  EPINF    PICTURE X.                                              
           02  FILLER REDEFINES EPINF.                                          
             03 EPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPINI  PIC X(9).                                                 
           02  APINPRZL    COMP  PIC  S9(4).                                    
           02  APINPRZF    PICTURE X.                                           
           02  FILLER REDEFINES APINPRZF.                                       
             03 APINPRZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APINPRZI  PIC X(2).                                              
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRI  PIC X(7).                                                
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(4).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(4).                                              
           02  ENAMEL    COMP  PIC  S9(4).                                      
           02  ENAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ENAMEF.                                         
             03 ENAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ENAMEI  PIC X(25).                                               
           02  EVNAMEL    COMP  PIC  S9(4).                                     
           02  EVNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES EVNAMEF.                                        
             03 EVNAMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVNAMEI  PIC X(20).                                              
           02  EPRODSLL    COMP  PIC  S9(4).                                    
           02  EPRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES EPRODSLF.                                       
             03 EPRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPRODSLI  PIC X(3).                                              
           02  EVONTTL    COMP  PIC  S9(4).                                     
           02  EVONTTF    PICTURE X.                                            
           02  FILLER REDEFINES EVONTTF.                                        
             03 EVONTTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVONTTI  PIC X(2).                                               
           02  EVONMML    COMP  PIC  S9(4).                                     
           02  EVONMMF    PICTURE X.                                            
           02  FILLER REDEFINES EVONMMF.                                        
             03 EVONMMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVONMMI  PIC X(2).                                               
           02  EVONJJL    COMP  PIC  S9(4).                                     
           02  EVONJJF    PICTURE X.                                            
           02  FILLER REDEFINES EVONJJF.                                        
             03 EVONJJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVONJJI  PIC X(4).                                               
           02  EBISTTL    COMP  PIC  S9(4).                                     
           02  EBISTTF    PICTURE X.                                            
           02  FILLER REDEFINES EBISTTF.                                        
             03 EBISTTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBISTTI  PIC X(2).                                               
           02  EBISMML    COMP  PIC  S9(4).                                     
           02  EBISMMF    PICTURE X.                                            
           02  FILLER REDEFINES EBISMMF.                                        
             03 EBISMMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBISMMI  PIC X(2).                                               
           02  EBISJJL    COMP  PIC  S9(4).                                     
           02  EBISJJF    PICTURE X.                                            
           02  FILLER REDEFINES EBISJJF.                                        
             03 EBISJJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBISJJI  PIC X(4).                                               
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(18).                                               
           02  AKDBETRL    COMP  PIC  S9(4).                                    
           02  AKDBETRF    PICTURE X.                                           
           02  FILLER REDEFINES AKDBETRF.                                       
             03 AKDBETRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKDBETRI  PIC X(7).                                              
           02  APRODS1L    COMP  PIC  S9(4).                                    
           02  APRODS1F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS1F.                                       
             03 APRODS1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS1I  PIC X(3).                                              
           02  APRODS2L    COMP  PIC  S9(4).                                    
           02  APRODS2F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS2F.                                       
             03 APRODS2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS2I  PIC X(3).                                              
           02  APRODS3L    COMP  PIC  S9(4).                                    
           02  APRODS3F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS3F.                                       
             03 APRODS3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS3I  PIC X(3).                                              
           02  APLUSL    COMP  PIC  S9(4).                                      
           02  APLUSF    PICTURE X.                                             
           02  FILLER REDEFINES APLUSF.                                         
             03 APLUSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLUSI  PIC X(1).                                                
           02  AVBEGDAL    COMP  PIC  S9(4).                                    
           02  AVBEGDAF    PICTURE X.                                           
           02  FILLER REDEFINES AVBEGDAF.                                       
             03 AVBEGDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBEGDAI  PIC X(10).                                             
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AVNR2L    COMP  PIC  S9(4).                                      
           02  AVNR2F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR2F.                                         
             03 AVNR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR2I  PIC X(15).                                               
           02  APIN2L    COMP  PIC  S9(4).                                      
           02  APIN2F    PICTURE X.                                             
           02  FILLER REDEFINES APIN2F.                                         
             03 APIN2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN2I  PIC X(9).                                                
           02  ANAME2L    COMP  PIC  S9(4).                                     
           02  ANAME2F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME2F.                                        
             03 ANAME2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME2I  PIC X(18).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(7).                                              
           02  APRODS6L    COMP  PIC  S9(4).                                    
           02  APRODS6F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS6F.                                       
             03 APRODS6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS6I  PIC X(3).                                              
           02  APRODS5L    COMP  PIC  S9(4).                                    
           02  APRODS5F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS5F.                                       
             03 APRODS5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS5I  PIC X(3).                                              
           02  APRODS4L    COMP  PIC  S9(4).                                    
           02  APRODS4F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS4F.                                       
             03 APRODS4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS4I  PIC X(3).                                              
           02  APLUS2L    COMP  PIC  S9(4).                                     
           02  APLUS2F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS2F.                                        
             03 APLUS2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS2I  PIC X(1).                                               
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(10).                                             
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AVNR3L    COMP  PIC  S9(4).                                      
           02  AVNR3F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR3F.                                         
             03 AVNR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR3I  PIC X(15).                                               
           02  APIN3L    COMP  PIC  S9(4).                                      
           02  APIN3F    PICTURE X.                                             
           02  FILLER REDEFINES APIN3F.                                         
             03 APIN3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN3I  PIC X(9).                                                
           02  ANAME3L    COMP  PIC  S9(4).                                     
           02  ANAME3F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME3F.                                        
             03 ANAME3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME3I  PIC X(18).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(7).                                              
           02  APRODS9L    COMP  PIC  S9(4).                                    
           02  APRODS9F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS9F.                                       
             03 APRODS9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS9I  PIC X(3).                                              
           02  APRODS8L    COMP  PIC  S9(4).                                    
           02  APRODS8F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS8F.                                       
             03 APRODS8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS8I  PIC X(3).                                              
           02  APRODS7L    COMP  PIC  S9(4).                                    
           02  APRODS7F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS7F.                                       
             03 APRODS7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS7I  PIC X(3).                                              
           02  APLUS3L    COMP  PIC  S9(4).                                     
           02  APLUS3F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS3F.                                        
             03 APLUS3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS3I  PIC X(1).                                               
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(10).                                             
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AVNR4L    COMP  PIC  S9(4).                                      
           02  AVNR4F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR4F.                                         
             03 AVNR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR4I  PIC X(15).                                               
           02  APIN4L    COMP  PIC  S9(4).                                      
           02  APIN4F    PICTURE X.                                             
           02  FILLER REDEFINES APIN4F.                                         
             03 APIN4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN4I  PIC X(9).                                                
           02  ANAME4L    COMP  PIC  S9(4).                                     
           02  ANAME4F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME4F.                                        
             03 ANAME4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME4I  PIC X(18).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(7).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(3).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(3).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  APLUS4L    COMP  PIC  S9(4).                                     
           02  APLUS4F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS4F.                                        
             03 APLUS4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS4I  PIC X(1).                                               
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(10).                                             
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AVNR5L    COMP  PIC  S9(4).                                      
           02  AVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR5F.                                         
             03 AVNR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR5I  PIC X(15).                                               
           02  APIN5L    COMP  PIC  S9(4).                                      
           02  APIN5F    PICTURE X.                                             
           02  FILLER REDEFINES APIN5F.                                         
             03 APIN5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN5I  PIC X(9).                                                
           02  ANAME5L    COMP  PIC  S9(4).                                     
           02  ANAME5F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME5F.                                        
             03 ANAME5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME5I  PIC X(18).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(7).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(3).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(3).                                              
           02  APLUS5L    COMP  PIC  S9(4).                                     
           02  APLUS5F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS5F.                                        
             03 APLUS5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS5I  PIC X(1).                                               
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AVNR6L    COMP  PIC  S9(4).                                      
           02  AVNR6F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR6F.                                         
             03 AVNR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR6I  PIC X(15).                                               
           02  APIN6L    COMP  PIC  S9(4).                                      
           02  APIN6F    PICTURE X.                                             
           02  FILLER REDEFINES APIN6F.                                         
             03 APIN6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN6I  PIC X(9).                                                
           02  ANAME6L    COMP  PIC  S9(4).                                     
           02  ANAME6F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME6F.                                        
             03 ANAME6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME6I  PIC X(18).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(7).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(3).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(3).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(3).                                              
           02  APLUS6L    COMP  PIC  S9(4).                                     
           02  APLUS6F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS6F.                                        
             03 APLUS6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS6I  PIC X(1).                                               
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AVNR7L    COMP  PIC  S9(4).                                      
           02  AVNR7F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR7F.                                         
             03 AVNR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR7I  PIC X(15).                                               
           02  APIN7L    COMP  PIC  S9(4).                                      
           02  APIN7F    PICTURE X.                                             
           02  FILLER REDEFINES APIN7F.                                         
             03 APIN7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN7I  PIC X(9).                                                
           02  ANAME7L    COMP  PIC  S9(4).                                     
           02  ANAME7F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME7F.                                        
             03 ANAME7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME7I  PIC X(18).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(7).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(3).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(3).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(3).                                              
           02  APLUS7L    COMP  PIC  S9(4).                                     
           02  APLUS7F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS7F.                                        
             03 APLUS7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS7I  PIC X(1).                                               
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(10).                                             
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AVNR8L    COMP  PIC  S9(4).                                      
           02  AVNR8F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR8F.                                         
             03 AVNR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR8I  PIC X(15).                                               
           02  APIN8L    COMP  PIC  S9(4).                                      
           02  APIN8F    PICTURE X.                                             
           02  FILLER REDEFINES APIN8F.                                         
             03 APIN8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN8I  PIC X(9).                                                
           02  ANAME8L    COMP  PIC  S9(4).                                     
           02  ANAME8F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME8F.                                        
             03 ANAME8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME8I  PIC X(18).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(7).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(3).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(3).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(3).                                              
           02  APLUS8L    COMP  PIC  S9(4).                                     
           02  APLUS8F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS8F.                                        
             03 APLUS8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS8I  PIC X(1).                                               
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(10).                                             
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AVNR9L    COMP  PIC  S9(4).                                      
           02  AVNR9F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR9F.                                         
             03 AVNR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR9I  PIC X(15).                                               
           02  APIN9L    COMP  PIC  S9(4).                                      
           02  APIN9F    PICTURE X.                                             
           02  FILLER REDEFINES APIN9F.                                         
             03 APIN9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APIN9I  PIC X(9).                                                
           02  ANAME9L    COMP  PIC  S9(4).                                     
           02  ANAME9F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME9F.                                        
             03 ANAME9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANAME9I  PIC X(18).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(7).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(3).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(3).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(3).                                              
           02  APLUS9L    COMP  PIC  S9(4).                                     
           02  APLUS9F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS9F.                                        
             03 APLUS9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS9I  PIC X(1).                                               
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(10).                                             
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  AVNR92L    COMP  PIC  S9(4).                                     
           02  AVNR92F    PICTURE X.                                            
           02  FILLER REDEFINES AVNR92F.                                        
             03 AVNR92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVNR92I  PIC X(15).                                              
           02  APIN92L    COMP  PIC  S9(4).                                     
           02  APIN92F    PICTURE X.                                            
           02  FILLER REDEFINES APIN92F.                                        
             03 APIN92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APIN92I  PIC X(9).                                               
           02  ANAME92L    COMP  PIC  S9(4).                                    
           02  ANAME92F    PICTURE X.                                           
           02  FILLER REDEFINES ANAME92F.                                       
             03 ANAME92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAME92I  PIC X(18).                                             
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(7).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(3).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(3).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(3).                                              
           02  APLUS92L    COMP  PIC  S9(4).                                    
           02  APLUS92F    PICTURE X.                                           
           02  FILLER REDEFINES APLUS92F.                                       
             03 APLUS92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APLUS92I  PIC X(1).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0020O REDEFINES BPA0020I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPINH    PICTURE X.                                              
           02  EPINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APINPRZH    PICTURE X.                                           
           02  APINPRZO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBNRH    PICTURE X.                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENAMEH    PICTURE X.                                             
           02  ENAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVNAMEH    PICTURE X.                                            
           02  EVNAMEO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRODSLH    PICTURE X.                                           
           02  EPRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVONTTH    PICTURE X.                                            
           02  EVONTTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONMMH    PICTURE X.                                            
           02  EVONMMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJJH    PICTURE X.                                            
           02  EVONJJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBISTTH    PICTURE X.                                            
           02  EBISTTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBISMMH    PICTURE X.                                            
           02  EBISMMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBISJJH    PICTURE X.                                            
           02  EBISJJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(18).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKDBETRH    PICTURE X.                                           
           02  AKDBETRO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS1H    PICTURE X.                                           
           02  APRODS1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS2H    PICTURE X.                                           
           02  APRODS2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS3H    PICTURE X.                                           
           02  APRODS3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUSH    PICTURE X.                                             
           02  APLUSO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBEGDAH    PICTURE X.                                           
           02  AVBEGDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR2H    PICTURE X.                                             
           02  AVNR2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN2H    PICTURE X.                                             
           02  APIN2O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME2H    PICTURE X.                                            
           02  ANAME2O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS6H    PICTURE X.                                           
           02  APRODS6O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS5H    PICTURE X.                                           
           02  APRODS5O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS4H    PICTURE X.                                           
           02  APRODS4O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS2H    PICTURE X.                                            
           02  APLUS2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR3H    PICTURE X.                                             
           02  AVNR3O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN3H    PICTURE X.                                             
           02  APIN3O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME3H    PICTURE X.                                            
           02  ANAME3O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS9H    PICTURE X.                                           
           02  APRODS9O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS8H    PICTURE X.                                           
           02  APRODS8O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS7H    PICTURE X.                                           
           02  APRODS7O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS3H    PICTURE X.                                            
           02  APLUS3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR4H    PICTURE X.                                             
           02  AVNR4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN4H    PICTURE X.                                             
           02  APIN4O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME4H    PICTURE X.                                            
           02  ANAME4O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS4H    PICTURE X.                                            
           02  APLUS4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR5H    PICTURE X.                                             
           02  AVNR5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN5H    PICTURE X.                                             
           02  APIN5O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME5H    PICTURE X.                                            
           02  ANAME5O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS5H    PICTURE X.                                            
           02  APLUS5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR6H    PICTURE X.                                             
           02  AVNR6O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN6H    PICTURE X.                                             
           02  APIN6O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME6H    PICTURE X.                                            
           02  ANAME6O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS6H    PICTURE X.                                            
           02  APLUS6O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR7H    PICTURE X.                                             
           02  AVNR7O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN7H    PICTURE X.                                             
           02  APIN7O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME7H    PICTURE X.                                            
           02  ANAME7O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS7H    PICTURE X.                                            
           02  APLUS7O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR8H    PICTURE X.                                             
           02  AVNR8O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN8H    PICTURE X.                                             
           02  APIN8O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME8H    PICTURE X.                                            
           02  ANAME8O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS8H    PICTURE X.                                            
           02  APLUS8O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR9H    PICTURE X.                                             
           02  AVNR9O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  APIN9H    PICTURE X.                                             
           02  APIN9O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAME9H    PICTURE X.                                            
           02  ANAME9O  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS9H    PICTURE X.                                            
           02  APLUS9O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVNR92H    PICTURE X.                                            
           02  AVNR92O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  APIN92H    PICTURE X.                                            
           02  APIN92O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANAME92H    PICTURE X.                                           
           02  ANAME92O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS92H    PICTURE X.                                           
           02  APLUS92O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
