       01  BRW0003I.                                                            
           02  FILLER PIC X(12).                                                
           02  BRW301L    COMP  PIC  S9(4).                                     
           02  BRW301F    PICTURE X.                                            
           02  FILLER REDEFINES BRW301F.                                        
             03 BRW301A    PICTURE X.                                           
           02  BRW301I  PIC X(5).                                               
           02  BRW302L    COMP  PIC  S9(4).                                     
           02  BRW302F    PICTURE X.                                            
           02  FILLER REDEFINES BRW302F.                                        
             03 BRW302A    PICTURE X.                                           
           02  BRW302I  PIC X(2).                                               
           02  BRW303L    COMP  PIC  S9(4).                                     
           02  BRW303F    PICTURE X.                                            
           02  FILLER REDEFINES BRW303F.                                        
             03 BRW303A    PICTURE X.                                           
           02  BRW303I  PIC X(8).                                               
           02  BRW304L    COMP  PIC  S9(4).                                     
           02  BRW304F    PICTURE X.                                            
           02  FILLER REDEFINES BRW304F.                                        
             03 BRW304A    PICTURE X.                                           
           02  BRW304I  PIC X(8).                                               
           02  BRW305L    COMP  PIC  S9(4).                                     
           02  BRW305F    PICTURE X.                                            
           02  FILLER REDEFINES BRW305F.                                        
             03 BRW305A    PICTURE X.                                           
           02  BRW305I  PIC X(4).                                               
           02  BRW306L    COMP  PIC  S9(4).                                     
           02  BRW306F    PICTURE X.                                            
           02  FILLER REDEFINES BRW306F.                                        
             03 BRW306A    PICTURE X.                                           
           02  BRW306I  PIC X(11).                                              
           02  BRW307L    COMP  PIC  S9(4).                                     
           02  BRW307F    PICTURE X.                                            
           02  FILLER REDEFINES BRW307F.                                        
             03 BRW307A    PICTURE X.                                           
           02  BRW307I  PIC X(1).                                               
           02  BRW308L    COMP  PIC  S9(4).                                     
           02  BRW308F    PICTURE X.                                            
           02  FILLER REDEFINES BRW308F.                                        
             03 BRW308A    PICTURE X.                                           
           02  BRW308I  PIC X(1).                                               
           02  BRW309L    COMP  PIC  S9(4).                                     
           02  BRW309F    PICTURE X.                                            
           02  FILLER REDEFINES BRW309F.                                        
             03 BRW309A    PICTURE X.                                           
           02  BRW309I  PIC X(1).                                               
           02  BRW310L    COMP  PIC  S9(4).                                     
           02  BRW310F    PICTURE X.                                            
           02  FILLER REDEFINES BRW310F.                                        
             03 BRW310A    PICTURE X.                                           
           02  BRW310I  PIC X(6).                                               
           02  BRW311L    COMP  PIC  S9(4).                                     
           02  BRW311F    PICTURE X.                                            
           02  FILLER REDEFINES BRW311F.                                        
             03 BRW311A    PICTURE X.                                           
           02  BRW311I  PIC X(28).                                              
           02  BRW312L    COMP  PIC  S9(4).                                     
           02  BRW312F    PICTURE X.                                            
           02  FILLER REDEFINES BRW312F.                                        
             03 BRW312A    PICTURE X.                                           
           02  BRW312I  PIC X(6).                                               
           02  BRW313L    COMP  PIC  S9(4).                                     
           02  BRW313F    PICTURE X.                                            
           02  FILLER REDEFINES BRW313F.                                        
             03 BRW313A    PICTURE X.                                           
           02  BRW313I  PIC X(6).                                               
           02  BRW314L    COMP  PIC  S9(4).                                     
           02  BRW314F    PICTURE X.                                            
           02  FILLER REDEFINES BRW314F.                                        
             03 BRW314A    PICTURE X.                                           
           02  BRW314I  PIC X(10).                                              
           02  BRW315L    COMP  PIC  S9(4).                                     
           02  BRW315F    PICTURE X.                                            
           02  FILLER REDEFINES BRW315F.                                        
             03 BRW315A    PICTURE X.                                           
           02  BRW315I  PIC X(1).                                               
           02  BRW316L    COMP  PIC  S9(4).                                     
           02  BRW316F    PICTURE X.                                            
           02  FILLER REDEFINES BRW316F.                                        
             03 BRW316A    PICTURE X.                                           
           02  BRW316I  PIC X(3).                                               
           02  BRW317L    COMP  PIC  S9(4).                                     
           02  BRW317F    PICTURE X.                                            
           02  FILLER REDEFINES BRW317F.                                        
             03 BRW317A    PICTURE X.                                           
           02  BRW317I  PIC 9V99.                                               
           02  BRW318L    COMP  PIC  S9(4).                                     
           02  BRW318F    PICTURE X.                                            
           02  FILLER REDEFINES BRW318F.                                        
             03 BRW318A    PICTURE X.                                           
           02  BRW318I  PIC X(1).                                               
           02  BRW3MSGL    COMP  PIC  S9(4).                                    
           02  BRW3MSGF    PICTURE X.                                           
           02  FILLER REDEFINES BRW3MSGF.                                       
             03 BRW3MSGA    PICTURE X.                                          
           02  BRW3MSGI  PIC X(78).                                             
       01  BRW0003O REDEFINES BRW0003I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  BRW301O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW302O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW303O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW304O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW305O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW306O  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  BRW307O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW308O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW309O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW310O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW311O  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  BRW312O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW313O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW314O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  BRW315O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW316O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW317O PIC 9V99.                                                
           02  FILLER PICTURE X(3).                                             
           02  BRW318O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BRW3MSGO  PIC X(78).                                             
