       01  BSL0001I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTL    COMP  PIC  S9(4).                                        
           02  ESTF    PICTURE X.                                               
           02  FILLER REDEFINES ESTF.                                           
             03 ESTA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  ESTI  PIC X(7).                                                  
           02  ESTPL    COMP  PIC  S9(4).                                       
           02  ESTPF    PICTURE X.                                              
           02  FILLER REDEFINES ESTPF.                                          
             03 ESTPA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ESTPI  PIC X(1).                                                 
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AINFOZLI  PIC X(65).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(20).                                               
           02  AVORNAML    COMP  PIC  S9(4).                                    
           02  AVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVORNAMF.                                       
             03 AVORNAMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVORNAMI  PIC X(15).                                             
           02  ABTRNAML    COMP  PIC  S9(4).                                    
           02  ABTRNAMF    PICTURE X.                                           
           02  FILLER REDEFINES ABTRNAMF.                                       
             03 ABTRNAMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABTRNAMI  PIC X(16).                                             
           02  EQUARTL    COMP  PIC  S9(4).                                     
           02  EQUARTF    PICTURE X.                                            
           02  FILLER REDEFINES EQUARTF.                                        
             03 EQUARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EQUARTI  PIC X(4).                                               
           02  AKOPFL    COMP  PIC  S9(4).                                      
           02  AKOPFF    PICTURE X.                                             
           02  FILLER REDEFINES AKOPFF.                                         
             03 AKOPFA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AKOPFI  PIC X(40).                                               
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  AMONATL    COMP  PIC  S9(4).                                     
           02  AMONATF    PICTURE X.                                            
           02  FILLER REDEFINES AMONATF.                                        
             03 AMONATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AMONATI  PIC X(7).                                               
           02  ABOZALTL    COMP  PIC  S9(4).                                    
           02  ABOZALTF    PICTURE X.                                           
           02  FILLER REDEFINES ABOZALTF.                                       
             03 ABOZALTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABOZALTI  PIC X(8).                                              
           02  AWBALTL    COMP  PIC  S9(4).                                     
           02  AWBALTF    PICTURE X.                                            
           02  FILLER REDEFINES AWBALTF.                                        
             03 AWBALTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AWBALTI  PIC X(3).                                               
           02  ABESCHRL    COMP  PIC  S9(4).                                    
           02  ABESCHRF    PICTURE X.                                           
           02  FILLER REDEFINES ABESCHRF.                                       
             03 ABESCHRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCHRI  PIC X(1).                                              
           02  EBOZNEUL    COMP  PIC  S9(4).                                    
           02  EBOZNEUF    PICTURE X.                                           
           02  FILLER REDEFINES EBOZNEUF.                                       
             03 EBOZNEUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBOZNEUI  PIC X(7).                                              
           02  AWBNEUL    COMP  PIC  S9(4).                                     
           02  AWBNEUF    PICTURE X.                                            
           02  FILLER REDEFINES AWBNEUF.                                        
             03 AWBNEUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AWBNEUI  PIC X(3).                                               
           02  EANSPRGL    COMP  PIC  S9(4).                                    
           02  EANSPRGF    PICTURE X.                                           
           02  FILLER REDEFINES EANSPRGF.                                       
             03 EANSPRGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EANSPRGI  PIC X(1).                                              
           02  AANSPRSL    COMP  PIC  S9(4).                                    
           02  AANSPRSF    PICTURE X.                                           
           02  FILLER REDEFINES AANSPRSF.                                       
             03 AANSPRSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANSPRSI  PIC X(10).                                             
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  AMONAT2L    COMP  PIC  S9(4).                                    
           02  AMONAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT2F.                                       
             03 AMONAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT2I  PIC X(7).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(8).                                              
           02  AWBALT2L    COMP  PIC  S9(4).                                    
           02  AWBALT2F    PICTURE X.                                           
           02  FILLER REDEFINES AWBALT2F.                                       
             03 AWBALT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWBALT2I  PIC X(3).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(1).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(7).                                              
           02  AWBNEU2L    COMP  PIC  S9(4).                                    
           02  AWBNEU2F    PICTURE X.                                           
           02  FILLER REDEFINES AWBNEU2F.                                       
             03 AWBNEU2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWBNEU2I  PIC X(3).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(1).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(10).                                             
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  AMONAT3L    COMP  PIC  S9(4).                                    
           02  AMONAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT3F.                                       
             03 AMONAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT3I  PIC X(7).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(8).                                              
           02  AWBALT3L    COMP  PIC  S9(4).                                    
           02  AWBALT3F    PICTURE X.                                           
           02  FILLER REDEFINES AWBALT3F.                                       
             03 AWBALT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWBALT3I  PIC X(3).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(1).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(7).                                              
           02  AWBNEU3L    COMP  PIC  S9(4).                                    
           02  AWBNEU3F    PICTURE X.                                           
           02  FILLER REDEFINES AWBNEU3F.                                       
             03 AWBNEU3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWBNEU3I  PIC X(3).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(1).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(10).                                             
           02  AKOPF2L    COMP  PIC  S9(4).                                     
           02  AKOPF2F    PICTURE X.                                            
           02  FILLER REDEFINES AKOPF2F.                                        
             03 AKOPF2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AKOPF2I  PIC X(40).                                              
           02  EFCPL    COMP  PIC  S9(4).                                       
           02  EFCPF    PICTURE X.                                              
           02  FILLER REDEFINES EFCPF.                                          
             03 EFCPA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCPI  PIC X(1).                                                 
           02  AMONATPL    COMP  PIC  S9(4).                                    
           02  AMONATPF    PICTURE X.                                           
           02  FILLER REDEFINES AMONATPF.                                       
             03 AMONATPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONATPI  PIC X(7).                                              
           02  ABOZALPL    COMP  PIC  S9(4).                                    
           02  ABOZALPF    PICTURE X.                                           
           02  FILLER REDEFINES ABOZALPF.                                       
             03 ABOZALPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABOZALPI  PIC X(8).                                              
           02  AWBALTPL    COMP  PIC  S9(4).                                    
           02  AWBALTPF    PICTURE X.                                           
           02  FILLER REDEFINES AWBALTPF.                                       
             03 AWBALTPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWBALTPI  PIC X(3).                                              
           02  ABESCHPL    COMP  PIC  S9(4).                                    
           02  ABESCHPF    PICTURE X.                                           
           02  FILLER REDEFINES ABESCHPF.                                       
             03 ABESCHPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCHPI  PIC X(1).                                              
           02  EBOZNEPL    COMP  PIC  S9(4).                                    
           02  EBOZNEPF    PICTURE X.                                           
           02  FILLER REDEFINES EBOZNEPF.                                       
             03 EBOZNEPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBOZNEPI  PIC X(7).                                              
           02  AWBNEUPL    COMP  PIC  S9(4).                                    
           02  AWBNEUPF    PICTURE X.                                           
           02  FILLER REDEFINES AWBNEUPF.                                       
             03 AWBNEUPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWBNEUPI  PIC X(3).                                              
           02  EANSPGPL    COMP  PIC  S9(4).                                    
           02  EANSPGPF    PICTURE X.                                           
           02  FILLER REDEFINES EANSPGPF.                                       
             03 EANSPGPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EANSPGPI  PIC X(1).                                              
           02  AANSPSPL    COMP  PIC  S9(4).                                    
           02  AANSPSPF    PICTURE X.                                           
           02  FILLER REDEFINES AANSPSPF.                                       
             03 AANSPSPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANSPSPI  PIC X(10).                                             
           02  EFCP2L    COMP  PIC  S9(4).                                      
           02  EFCP2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCP2F.                                         
             03 EFCP2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCP2I  PIC X(1).                                                
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(7).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(8).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(3).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(1).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(7).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(3).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(1).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(10).                                             
           02  EFCP3L    COMP  PIC  S9(4).                                      
           02  EFCP3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCP3F.                                         
             03 EFCP3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCP3I  PIC X(1).                                                
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(7).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(8).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(1).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(7).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(3).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(1).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(10).                                             
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(76).                                              
       01  BSL0001O REDEFINES BSL0001I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTH    PICTURE X.                                               
           02  ESTO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ESTPH    PICTURE X.                                              
           02  ESTPO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLH    PICTURE X.                                           
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORNAMH    PICTURE X.                                           
           02  AVORNAMO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABTRNAMH    PICTURE X.                                           
           02  ABTRNAMO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  EQUARTH    PICTURE X.                                            
           02  EQUARTO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKOPFH    PICTURE X.                                             
           02  AKOPFO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AMONATH    PICTURE X.                                            
           02  AMONATO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABOZALTH    PICTURE X.                                           
           02  ABOZALTO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBALTH    PICTURE X.                                            
           02  AWBALTO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABESCHRH    PICTURE X.                                           
           02  ABESCHRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBOZNEUH    PICTURE X.                                           
           02  EBOZNEUO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBNEUH    PICTURE X.                                            
           02  AWBNEUO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EANSPRGH    PICTURE X.                                           
           02  EANSPRGO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AANSPRSH    PICTURE X.                                           
           02  AANSPRSO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AMONAT2H    PICTURE X.                                           
           02  AMONAT2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBALT2H    PICTURE X.                                           
           02  AWBALT2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBNEU2H    PICTURE X.                                           
           02  AWBNEU2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AMONAT3H    PICTURE X.                                           
           02  AMONAT3O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBALT3H    PICTURE X.                                           
           02  AWBALT3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBNEU3H    PICTURE X.                                           
           02  AWBNEU3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKOPF2H    PICTURE X.                                            
           02  AKOPF2O  PIC X(40).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCPH    PICTURE X.                                              
           02  EFCPO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AMONATPH    PICTURE X.                                           
           02  AMONATPO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABOZALPH    PICTURE X.                                           
           02  ABOZALPO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBALTPH    PICTURE X.                                           
           02  AWBALTPO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCHPH    PICTURE X.                                           
           02  ABESCHPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBOZNEPH    PICTURE X.                                           
           02  EBOZNEPO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBNEUPH    PICTURE X.                                           
           02  AWBNEUPO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANSPGPH    PICTURE X.                                           
           02  EANSPGPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AANSPSPH    PICTURE X.                                           
           02  AANSPSPO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCP2H    PICTURE X.                                             
           02  EFCP2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCP3H    PICTURE X.                                             
           02  EFCP3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(76).                                              
