       01  BSL0015I.                                                            
           02  FILLER PIC X(12).                                                
           02  ADIRNRL    COMP  PIC  S9(4).                                     
           02  ADIRNRF    PICTURE X.                                            
           02  FILLER REDEFINES ADIRNRF.                                        
             03 ADIRNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIRNRI  PIC X(3).                                               
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AMSBEZL    COMP  PIC  S9(4).                                     
           02  AMSBEZF    PICTURE X.                                            
           02  FILLER REDEFINES AMSBEZF.                                        
             03 AMSBEZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AMSBEZI  PIC X(4).                                               
           02  AVBPBEZL    COMP  PIC  S9(4).                                    
           02  AVBPBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AVBPBEZF.                                       
             03 AVBPBEZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBPBEZI  PIC X(2).                                              
           02  ELETMONL    COMP  PIC  S9(4).                                    
           02  ELETMONF    PICTURE X.                                           
           02  FILLER REDEFINES ELETMONF.                                       
             03 ELETMONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ELETMONI  PIC X(3).                                              
           02  EMONVONL    COMP  PIC  S9(4).                                    
           02  EMONVONF    PICTURE X.                                           
           02  FILLER REDEFINES EMONVONF.                                       
             03 EMONVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EMONVONI  PIC X(4).                                              
           02  EMONBISL    COMP  PIC  S9(4).                                    
           02  EMONBISF    PICTURE X.                                           
           02  FILLER REDEFINES EMONBISF.                                       
             03 EMONBISA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EMONBISI  PIC X(4).                                              
           02  AVBNAMEL    COMP  PIC  S9(4).                                    
           02  AVBNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAMEF.                                       
             03 AVBNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNAMEI  PIC X(31).                                             
           02  AADMCLL    COMP  PIC  S9(4).                                     
           02  AADMCLF    PICTURE X.                                            
           02  FILLER REDEFINES AADMCLF.                                        
             03 AADMCLA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AADMCLI  PIC X(1).                                               
           02  AKAPCLL    COMP  PIC  S9(4).                                     
           02  AKAPCLF    PICTURE X.                                            
           02  FILLER REDEFINES AKAPCLF.                                        
             03 AKAPCLA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AKAPCLI  PIC X(1).                                               
           02  AELICLL    COMP  PIC  S9(4).                                     
           02  AELICLF    PICTURE X.                                            
           02  FILLER REDEFINES AELICLF.                                        
             03 AELICLA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AELICLI  PIC X(1).                                               
           02  ASTSTATL    COMP  PIC  S9(4).                                    
           02  ASTSTATF    PICTURE X.                                           
           02  FILLER REDEFINES ASTSTATF.                                       
             03 ASTSTATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTSTATI  PIC X(2).                                              
           02  AKOPFL    COMP  PIC  S9(4).                                      
           02  AKOPFF    PICTURE X.                                             
           02  FILLER REDEFINES AKOPFF.                                         
             03 AKOPFA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AKOPFI  PIC X(75).                                               
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  ETAGL    COMP  PIC  S9(4).                                       
           02  ETAGF    PICTURE X.                                              
           02  FILLER REDEFINES ETAGF.                                          
             03 ETAGA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ETAGI  PIC X(3).                                                 
           02  AMONATL    COMP  PIC  S9(4).                                     
           02  AMONATF    PICTURE X.                                            
           02  FILLER REDEFINES AMONATF.                                        
             03 AMONATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AMONATI  PIC X(5).                                               
           02  AECBALTL    COMP  PIC  S9(4).                                    
           02  AECBALTF    PICTURE X.                                           
           02  FILLER REDEFINES AECBALTF.                                       
             03 AECBALTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AECBALTI  PIC X(9).                                              
           02  EECBNEUL    COMP  PIC  S9(4).                                    
           02  EECBNEUF    PICTURE X.                                           
           02  FILLER REDEFINES EECBNEUF.                                       
             03 EECBNEUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EECBNEUI  PIC X(9).                                              
           02  AECBPFAL    COMP  PIC  S9(4).                                    
           02  AECBPFAF    PICTURE X.                                           
           02  FILLER REDEFINES AECBPFAF.                                       
             03 AECBPFAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AECBPFAI  PIC X(9).                                              
           02  EECBPFNL    COMP  PIC  S9(4).                                    
           02  EECBPFNF    PICTURE X.                                           
           02  FILLER REDEFINES EECBPFNF.                                       
             03 EECBPFNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EECBPFNI  PIC X(9).                                              
           02  ABESCHL    COMP  PIC  S9(4).                                     
           02  ABESCHF    PICTURE X.                                            
           02  FILLER REDEFINES ABESCHF.                                        
             03 ABESCHA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ABESCHI  PIC X(1).                                               
           02  EANSPRGL    COMP  PIC  S9(4).                                    
           02  EANSPRGF    PICTURE X.                                           
           02  FILLER REDEFINES EANSPRGF.                                       
             03 EANSPRGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EANSPRGI  PIC X(1).                                              
           02  AANSPRSL    COMP  PIC  S9(4).                                    
           02  AANSPRSF    PICTURE X.                                           
           02  FILLER REDEFINES AANSPRSF.                                       
             03 AANSPRSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AANSPRSI  PIC X(10).                                             
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  ETAG2L    COMP  PIC  S9(4).                                      
           02  ETAG2F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG2F.                                         
             03 ETAG2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG2I  PIC X(3).                                                
           02  AMONAT2L    COMP  PIC  S9(4).                                    
           02  AMONAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT2F.                                       
             03 AMONAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT2I  PIC X(5).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(9).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(9).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(9).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(9).                                              
           02  ABESCH2L    COMP  PIC  S9(4).                                    
           02  ABESCH2F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH2F.                                       
             03 ABESCH2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH2I  PIC X(1).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(1).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(10).                                             
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  ETAG3L    COMP  PIC  S9(4).                                      
           02  ETAG3F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG3F.                                         
             03 ETAG3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG3I  PIC X(3).                                                
           02  AMONAT3L    COMP  PIC  S9(4).                                    
           02  AMONAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT3F.                                       
             03 AMONAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT3I  PIC X(5).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(9).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(9).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(9).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(9).                                              
           02  ABESCH3L    COMP  PIC  S9(4).                                    
           02  ABESCH3F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH3F.                                       
             03 ABESCH3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH3I  PIC X(1).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(1).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(10).                                             
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC4I  PIC X(1).                                                 
           02  ETAG4L    COMP  PIC  S9(4).                                      
           02  ETAG4F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG4F.                                         
             03 ETAG4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG4I  PIC X(3).                                                
           02  AMONAT4L    COMP  PIC  S9(4).                                    
           02  AMONAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT4F.                                       
             03 AMONAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT4I  PIC X(5).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(9).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(9).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(9).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(9).                                              
           02  ABESCH4L    COMP  PIC  S9(4).                                    
           02  ABESCH4F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH4F.                                       
             03 ABESCH4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH4I  PIC X(1).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(1).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(10).                                             
           02  EFC5L    COMP  PIC  S9(4).                                       
           02  EFC5F    PICTURE X.                                              
           02  FILLER REDEFINES EFC5F.                                          
             03 EFC5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC5I  PIC X(1).                                                 
           02  ETAG5L    COMP  PIC  S9(4).                                      
           02  ETAG5F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG5F.                                         
             03 ETAG5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG5I  PIC X(3).                                                
           02  AMONAT5L    COMP  PIC  S9(4).                                    
           02  AMONAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT5F.                                       
             03 AMONAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT5I  PIC X(5).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(9).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(9).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(9).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(9).                                              
           02  ABESCH5L    COMP  PIC  S9(4).                                    
           02  ABESCH5F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH5F.                                       
             03 ABESCH5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH5I  PIC X(1).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(1).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(10).                                             
           02  EFC6L    COMP  PIC  S9(4).                                       
           02  EFC6F    PICTURE X.                                              
           02  FILLER REDEFINES EFC6F.                                          
             03 EFC6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC6I  PIC X(1).                                                 
           02  ETAG6L    COMP  PIC  S9(4).                                      
           02  ETAG6F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG6F.                                         
             03 ETAG6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG6I  PIC X(3).                                                
           02  AMONAT6L    COMP  PIC  S9(4).                                    
           02  AMONAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT6F.                                       
             03 AMONAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT6I  PIC X(5).                                              
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(9).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(9).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(9).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(9).                                              
           02  ABESCH6L    COMP  PIC  S9(4).                                    
           02  ABESCH6F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH6F.                                       
             03 ABESCH6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH6I  PIC X(1).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(1).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(10).                                             
           02  EFC7L    COMP  PIC  S9(4).                                       
           02  EFC7F    PICTURE X.                                              
           02  FILLER REDEFINES EFC7F.                                          
             03 EFC7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC7I  PIC X(1).                                                 
           02  ETAG7L    COMP  PIC  S9(4).                                      
           02  ETAG7F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG7F.                                         
             03 ETAG7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG7I  PIC X(3).                                                
           02  AMONAT7L    COMP  PIC  S9(4).                                    
           02  AMONAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT7F.                                       
             03 AMONAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT7I  PIC X(5).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(9).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(9).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(9).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(9).                                              
           02  ABESCH7L    COMP  PIC  S9(4).                                    
           02  ABESCH7F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH7F.                                       
             03 ABESCH7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH7I  PIC X(1).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(1).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(10).                                             
           02  EFC8L    COMP  PIC  S9(4).                                       
           02  EFC8F    PICTURE X.                                              
           02  FILLER REDEFINES EFC8F.                                          
             03 EFC8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC8I  PIC X(1).                                                 
           02  ETAG8L    COMP  PIC  S9(4).                                      
           02  ETAG8F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG8F.                                         
             03 ETAG8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG8I  PIC X(3).                                                
           02  AMONAT8L    COMP  PIC  S9(4).                                    
           02  AMONAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT8F.                                       
             03 AMONAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT8I  PIC X(5).                                              
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(9).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(9).                                              
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(9).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(9).                                              
           02  ABESCH8L    COMP  PIC  S9(4).                                    
           02  ABESCH8F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH8F.                                       
             03 ABESCH8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH8I  PIC X(1).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(1).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(10).                                             
           02  EFC9L    COMP  PIC  S9(4).                                       
           02  EFC9F    PICTURE X.                                              
           02  FILLER REDEFINES EFC9F.                                          
             03 EFC9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC9I  PIC X(1).                                                 
           02  ETAG9L    COMP  PIC  S9(4).                                      
           02  ETAG9F    PICTURE X.                                             
           02  FILLER REDEFINES ETAG9F.                                         
             03 ETAG9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETAG9I  PIC X(3).                                                
           02  AMONAT9L    COMP  PIC  S9(4).                                    
           02  AMONAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AMONAT9F.                                       
             03 AMONAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMONAT9I  PIC X(5).                                              
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(9).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(9).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(9).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(9).                                              
           02  ABESCH9L    COMP  PIC  S9(4).                                    
           02  ABESCH9F    PICTURE X.                                           
           02  FILLER REDEFINES ABESCH9F.                                       
             03 ABESCH9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABESCH9I  PIC X(1).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(1).                                              
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(10).                                             
           02  EFC92L    COMP  PIC  S9(4).                                      
           02  EFC92F    PICTURE X.                                             
           02  FILLER REDEFINES EFC92F.                                         
             03 EFC92A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFC92I  PIC X(1).                                                
           02  ETAG92L    COMP  PIC  S9(4).                                     
           02  ETAG92F    PICTURE X.                                            
           02  FILLER REDEFINES ETAG92F.                                        
             03 ETAG92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ETAG92I  PIC X(3).                                               
           02  F000055L    COMP  PIC  S9(4).                                    
           02  F000055F    PICTURE X.                                           
           02  FILLER REDEFINES F000055F.                                       
             03 F000055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000055I  PIC X(5).                                              
           02  F000054L    COMP  PIC  S9(4).                                    
           02  F000054F    PICTURE X.                                           
           02  FILLER REDEFINES F000054F.                                       
             03 F000054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000054I  PIC X(9).                                              
           02  F000053L    COMP  PIC  S9(4).                                    
           02  F000053F    PICTURE X.                                           
           02  FILLER REDEFINES F000053F.                                       
             03 F000053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000053I  PIC X(9).                                              
           02  F000052L    COMP  PIC  S9(4).                                    
           02  F000052F    PICTURE X.                                           
           02  FILLER REDEFINES F000052F.                                       
             03 F000052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000052I  PIC X(9).                                              
           02  F000051L    COMP  PIC  S9(4).                                    
           02  F000051F    PICTURE X.                                           
           02  FILLER REDEFINES F000051F.                                       
             03 F000051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000051I  PIC X(9).                                              
           02  F000050L    COMP  PIC  S9(4).                                    
           02  F000050F    PICTURE X.                                           
           02  FILLER REDEFINES F000050F.                                       
             03 F000050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000050I  PIC X(1).                                              
           02  F000049L    COMP  PIC  S9(4).                                    
           02  F000049F    PICTURE X.                                           
           02  FILLER REDEFINES F000049F.                                       
             03 F000049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000049I  PIC X(1).                                              
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(10).                                             
           02  EFC922L    COMP  PIC  S9(4).                                     
           02  EFC922F    PICTURE X.                                            
           02  FILLER REDEFINES EFC922F.                                        
             03 EFC922A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFC922I  PIC X(1).                                               
           02  ETAG922L    COMP  PIC  S9(4).                                    
           02  ETAG922F    PICTURE X.                                           
           02  FILLER REDEFINES ETAG922F.                                       
             03 ETAG922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ETAG922I  PIC X(3).                                              
           02  F000063L    COMP  PIC  S9(4).                                    
           02  F000063F    PICTURE X.                                           
           02  FILLER REDEFINES F000063F.                                       
             03 F000063A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000063I  PIC X(5).                                              
           02  F000062L    COMP  PIC  S9(4).                                    
           02  F000062F    PICTURE X.                                           
           02  FILLER REDEFINES F000062F.                                       
             03 F000062A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000062I  PIC X(9).                                              
           02  F000061L    COMP  PIC  S9(4).                                    
           02  F000061F    PICTURE X.                                           
           02  FILLER REDEFINES F000061F.                                       
             03 F000061A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000061I  PIC X(9).                                              
           02  F000060L    COMP  PIC  S9(4).                                    
           02  F000060F    PICTURE X.                                           
           02  FILLER REDEFINES F000060F.                                       
             03 F000060A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000060I  PIC X(9).                                              
           02  F000059L    COMP  PIC  S9(4).                                    
           02  F000059F    PICTURE X.                                           
           02  FILLER REDEFINES F000059F.                                       
             03 F000059A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000059I  PIC X(9).                                              
           02  F000058L    COMP  PIC  S9(4).                                    
           02  F000058F    PICTURE X.                                           
           02  FILLER REDEFINES F000058F.                                       
             03 F000058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000058I  PIC X(1).                                              
           02  F000057L    COMP  PIC  S9(4).                                    
           02  F000057F    PICTURE X.                                           
           02  FILLER REDEFINES F000057F.                                       
             03 F000057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000057I  PIC X(1).                                              
           02  F000056L    COMP  PIC  S9(4).                                    
           02  F000056F    PICTURE X.                                           
           02  FILLER REDEFINES F000056F.                                       
             03 F000056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000056I  PIC X(10).                                             
           02  EFC9222L    COMP  PIC  S9(4).                                    
           02  EFC9222F    PICTURE X.                                           
           02  FILLER REDEFINES EFC9222F.                                       
             03 EFC9222A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFC9222I  PIC X(1).                                              
           02  F000072L    COMP  PIC  S9(4).                                    
           02  F000072F    PICTURE X.                                           
           02  FILLER REDEFINES F000072F.                                       
             03 F000072A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000072I  PIC X(3).                                              
           02  F000071L    COMP  PIC  S9(4).                                    
           02  F000071F    PICTURE X.                                           
           02  FILLER REDEFINES F000071F.                                       
             03 F000071A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000071I  PIC X(5).                                              
           02  F000070L    COMP  PIC  S9(4).                                    
           02  F000070F    PICTURE X.                                           
           02  FILLER REDEFINES F000070F.                                       
             03 F000070A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000070I  PIC X(9).                                              
           02  F000069L    COMP  PIC  S9(4).                                    
           02  F000069F    PICTURE X.                                           
           02  FILLER REDEFINES F000069F.                                       
             03 F000069A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000069I  PIC X(9).                                              
           02  F000068L    COMP  PIC  S9(4).                                    
           02  F000068F    PICTURE X.                                           
           02  FILLER REDEFINES F000068F.                                       
             03 F000068A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000068I  PIC X(9).                                              
           02  F000067L    COMP  PIC  S9(4).                                    
           02  F000067F    PICTURE X.                                           
           02  FILLER REDEFINES F000067F.                                       
             03 F000067A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000067I  PIC X(9).                                              
           02  F000066L    COMP  PIC  S9(4).                                    
           02  F000066F    PICTURE X.                                           
           02  FILLER REDEFINES F000066F.                                       
             03 F000066A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000066I  PIC X(1).                                              
           02  F000065L    COMP  PIC  S9(4).                                    
           02  F000065F    PICTURE X.                                           
           02  FILLER REDEFINES F000065F.                                       
             03 F000065A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000065I  PIC X(1).                                              
           02  F000064L    COMP  PIC  S9(4).                                    
           02  F000064F    PICTURE X.                                           
           02  FILLER REDEFINES F000064F.                                       
             03 F000064A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000064I  PIC X(10).                                             
           02  ASUMECBL    COMP  PIC  S9(4).                                    
           02  ASUMECBF    PICTURE X.                                           
           02  FILLER REDEFINES ASUMECBF.                                       
             03 ASUMECBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASUMECBI  PIC X(9).                                              
           02  ASUMMPFL    COMP  PIC  S9(4).                                    
           02  ASUMMPFF    PICTURE X.                                           
           02  FILLER REDEFINES ASUMMPFF.                                       
             03 ASUMMPFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASUMMPFI  PIC X(9).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(76).                                              
       01  BSL0015O REDEFINES BSL0015I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ADIRNRH    PICTURE X.                                            
           02  ADIRNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTNRH    PICTURE X.                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZH    PICTURE X.                                            
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMSBEZH    PICTURE X.                                            
           02  AMSBEZO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBPBEZH    PICTURE X.                                           
           02  AVBPBEZO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ELETMONH    PICTURE X.                                           
           02  ELETMONO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMONVONH    PICTURE X.                                           
           02  EMONVONO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMONBISH    PICTURE X.                                           
           02  EMONBISO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNAMEH    PICTURE X.                                           
           02  AVBNAMEO  PIC X(31).                                             
           02  FILLER PICTURE X(3).                                             
           02  AADMCLH    PICTURE X.                                            
           02  AADMCLO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKAPCLH    PICTURE X.                                            
           02  AKAPCLO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AELICLH    PICTURE X.                                            
           02  AELICLO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTSTATH    PICTURE X.                                           
           02  ASTSTATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKOPFH    PICTURE X.                                             
           02  AKOPFO  PIC X(75).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ETAGH    PICTURE X.                                              
           02  ETAGO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AMONATH    PICTURE X.                                            
           02  AMONATO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  AECBALTH    PICTURE X.                                           
           02  AECBALTO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EECBNEUH    PICTURE X.                                           
           02  EECBNEUO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  AECBPFAH    PICTURE X.                                           
           02  AECBPFAO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EECBPFNH    PICTURE X.                                           
           02  EECBPFNO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCHH    PICTURE X.                                            
           02  ABESCHO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EANSPRGH    PICTURE X.                                           
           02  EANSPRGO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AANSPRSH    PICTURE X.                                           
           02  AANSPRSO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG2H    PICTURE X.                                             
           02  ETAG2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT2H    PICTURE X.                                           
           02  AMONAT2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH2H    PICTURE X.                                           
           02  ABESCH2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG3H    PICTURE X.                                             
           02  ETAG3O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT3H    PICTURE X.                                           
           02  AMONAT3O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH3H    PICTURE X.                                           
           02  ABESCH3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC4H    PICTURE X.                                              
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG4H    PICTURE X.                                             
           02  ETAG4O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT4H    PICTURE X.                                           
           02  AMONAT4O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH4H    PICTURE X.                                           
           02  ABESCH4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC5H    PICTURE X.                                              
           02  EFC5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG5H    PICTURE X.                                             
           02  ETAG5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT5H    PICTURE X.                                           
           02  AMONAT5O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH5H    PICTURE X.                                           
           02  ABESCH5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC6H    PICTURE X.                                              
           02  EFC6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG6H    PICTURE X.                                             
           02  ETAG6O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT6H    PICTURE X.                                           
           02  AMONAT6O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH6H    PICTURE X.                                           
           02  ABESCH6O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC7H    PICTURE X.                                              
           02  EFC7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG7H    PICTURE X.                                             
           02  ETAG7O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT7H    PICTURE X.                                           
           02  AMONAT7O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH7H    PICTURE X.                                           
           02  ABESCH7O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC8H    PICTURE X.                                              
           02  EFC8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG8H    PICTURE X.                                             
           02  ETAG8O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT8H    PICTURE X.                                           
           02  AMONAT8O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH8H    PICTURE X.                                           
           02  ABESCH8O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC9H    PICTURE X.                                              
           02  EFC9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETAG9H    PICTURE X.                                             
           02  ETAG9O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AMONAT9H    PICTURE X.                                           
           02  AMONAT9O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABESCH9H    PICTURE X.                                           
           02  ABESCH9O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC92H    PICTURE X.                                             
           02  EFC92O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ETAG92H    PICTURE X.                                            
           02  ETAG92O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000055H    PICTURE X.                                           
           02  F000055O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000054H    PICTURE X.                                           
           02  F000054O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000053H    PICTURE X.                                           
           02  F000053O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000052H    PICTURE X.                                           
           02  F000052O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000051H    PICTURE X.                                           
           02  F000051O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000050H    PICTURE X.                                           
           02  F000050O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000049H    PICTURE X.                                           
           02  F000049O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC922H    PICTURE X.                                            
           02  EFC922O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ETAG922H    PICTURE X.                                           
           02  ETAG922O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000063H    PICTURE X.                                           
           02  F000063O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000062H    PICTURE X.                                           
           02  F000062O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000061H    PICTURE X.                                           
           02  F000061O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000060H    PICTURE X.                                           
           02  F000060O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000059H    PICTURE X.                                           
           02  F000059O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000058H    PICTURE X.                                           
           02  F000058O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000057H    PICTURE X.                                           
           02  F000057O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000056H    PICTURE X.                                           
           02  F000056O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC9222H    PICTURE X.                                           
           02  EFC9222O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000072H    PICTURE X.                                           
           02  F000072O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000071H    PICTURE X.                                           
           02  F000071O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000070H    PICTURE X.                                           
           02  F000070O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000069H    PICTURE X.                                           
           02  F000069O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000068H    PICTURE X.                                           
           02  F000068O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000067H    PICTURE X.                                           
           02  F000067O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000066H    PICTURE X.                                           
           02  F000066O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000065H    PICTURE X.                                           
           02  F000065O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000064H    PICTURE X.                                           
           02  F000064O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASUMECBH    PICTURE X.                                           
           02  ASUMECBO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASUMMPFH    PICTURE X.                                           
           02  ASUMMPFO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(76).                                              
