       01  BVB0013I.                                                            
           02  FILLER PIC X(12).                                                
           02  ASTNRL    COMP  PIC  S9(4).                                      
           02  ASTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ASTNRF.                                         
             03 ASTNRA    PICTURE X.                                            
           02  ASTNRI  PIC X(7).                                                
           02  ASTPRZL    COMP  PIC  S9(4).                                     
           02  ASTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ASTPRZF.                                        
             03 ASTPRZA    PICTURE X.                                           
           02  ASTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  AEDNRL    COMP  PIC  S9(4).                                      
           02  AEDNRF    PICTURE X.                                             
           02  FILLER REDEFINES AEDNRF.                                         
             03 AEDNRA    PICTURE X.                                            
           02  AEDNRI  PIC X(7).                                                
           02  AEDPRZL    COMP  PIC  S9(4).                                     
           02  AEDPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AEDPRZF.                                        
             03 AEDPRZA    PICTURE X.                                           
           02  AEDPRZI  PIC X(1).                                               
           02  AEDNAMEL    COMP  PIC  S9(4).                                    
           02  AEDNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AEDNAMEF.                                       
             03 AEDNAMEA    PICTURE X.                                          
           02  AEDNAMEI  PIC X(1).                                              
           02  EEDNAMEL    COMP  PIC  S9(4).                                    
           02  EEDNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES EEDNAMEF.                                       
             03 EEDNAMEA    PICTURE X.                                          
           02  EEDNAMEI  PIC X(40).                                             
           02  ADATABTL    COMP  PIC  S9(4).                                    
           02  ADATABTF    PICTURE X.                                           
           02  FILLER REDEFINES ADATABTF.                                       
             03 ADATABTA    PICTURE X.                                          
           02  ADATABTI  PIC X(2).                                              
           02  ADATABML    COMP  PIC  S9(4).                                    
           02  ADATABMF    PICTURE X.                                           
           02  FILLER REDEFINES ADATABMF.                                       
             03 ADATABMA    PICTURE X.                                          
           02  ADATABMI  PIC X(2).                                              
           02  ADATABJL    COMP  PIC  S9(4).                                    
           02  ADATABJF    PICTURE X.                                           
           02  FILLER REDEFINES ADATABJF.                                       
             03 ADATABJA    PICTURE X.                                          
           02  ADATABJI  PIC X(4).                                              
           02  AGEZUVBL    COMP  PIC  S9(4).                                    
           02  AGEZUVBF    PICTURE X.                                           
           02  FILLER REDEFINES AGEZUVBF.                                       
             03 AGEZUVBA    PICTURE X.                                          
           02  AGEZUVBI  PIC X(7).                                              
           02  AGEZUPRL    COMP  PIC  S9(4).                                    
           02  AGEZUPRF    PICTURE X.                                           
           02  FILLER REDEFINES AGEZUPRF.                                       
             03 AGEZUPRA    PICTURE X.                                          
           02  AGEZUPRI  PIC X(1).                                              
           02  AGEZUNAL    COMP  PIC  S9(4).                                    
           02  AGEZUNAF    PICTURE X.                                           
           02  FILLER REDEFINES AGEZUNAF.                                       
             03 AGEZUNAA    PICTURE X.                                          
           02  AGEZUNAI  PIC X(40).                                             
           02  AEDGENL    COMP  PIC  S9(4).                                     
           02  AEDGENF    PICTURE X.                                            
           02  FILLER REDEFINES AEDGENF.                                        
             03 AEDGENA    PICTURE X.                                           
           02  AEDGENI  PIC X(1).                                               
           02  AEDZWL    COMP  PIC  S9(4).                                      
           02  AEDZWF    PICTURE X.                                             
           02  FILLER REDEFINES AEDZWF.                                         
             03 AEDZWA    PICTURE X.                                            
           02  AEDZWI  PIC X(7).                                                
           02  AZWVOMTL    COMP  PIC  S9(4).                                    
           02  AZWVOMTF    PICTURE X.                                           
           02  FILLER REDEFINES AZWVOMTF.                                       
             03 AZWVOMTA    PICTURE X.                                          
           02  AZWVOMTI  PIC X(2).                                              
           02  AZWVOMML    COMP  PIC  S9(4).                                    
           02  AZWVOMMF    PICTURE X.                                           
           02  FILLER REDEFINES AZWVOMMF.                                       
             03 AZWVOMMA    PICTURE X.                                          
           02  AZWVOMMI  PIC X(2).                                              
           02  AZWVOMJL    COMP  PIC  S9(4).                                    
           02  AZWVOMJF    PICTURE X.                                           
           02  FILLER REDEFINES AZWVOMJF.                                       
             03 AZWVOMJA    PICTURE X.                                          
           02  AZWVOMJI  PIC X(4).                                              
           02  ARCKSTZL    COMP  PIC  S9(4).                                    
           02  ARCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKSTZF.                                       
             03 ARCKSTZA    PICTURE X.                                          
           02  ARCKSTZI  PIC X(1).                                              
           02  ERCKSTZL    COMP  PIC  S9(4).                                    
           02  ERCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ERCKSTZF.                                       
             03 ERCKSTZA    PICTURE X.                                          
           02  ERCKSTZI  PIC X(6).                                              
           02  AEDPROVL    COMP  PIC  S9(4).                                    
           02  AEDPROVF    PICTURE X.                                           
           02  FILLER REDEFINES AEDPROVF.                                       
             03 AEDPROVA    PICTURE X.                                          
           02  AEDPROVI  PIC X(1).                                              
           02  EEDPROVL    COMP  PIC  S9(4).                                    
           02  EEDPROVF    PICTURE X.                                           
           02  FILLER REDEFINES EEDPROVF.                                       
             03 EEDPROVA    PICTURE X.                                          
           02  EEDPROVI  PIC X(6).                                              
           02  ASPERREL    COMP  PIC  S9(4).                                    
           02  ASPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ASPERREF.                                       
             03 ASPERREA    PICTURE X.                                          
           02  ASPERREI  PIC X(1).                                              
           02  ESPERREL    COMP  PIC  S9(4).                                    
           02  ESPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ESPERREF.                                       
             03 ESPERREA    PICTURE X.                                          
           02  ESPERREI  PIC X(1).                                              
           02  AIBANL    COMP  PIC  S9(4).                                      
           02  AIBANF    PICTURE X.                                             
           02  FILLER REDEFINES AIBANF.                                         
             03 AIBANA    PICTURE X.                                            
           02  AIBANI  PIC X(1).                                                
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  EIBANI  PIC X(22).                                               
           02  AKTONRL    COMP  PIC  S9(4).                                     
           02  AKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES AKTONRF.                                        
             03 AKTONRA    PICTURE X.                                           
           02  AKTONRI  PIC X(1).                                               
           02  EKTONRL    COMP  PIC  S9(4).                                     
           02  EKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES EKTONRF.                                        
             03 EKTONRA    PICTURE X.                                           
           02  EKTONRI  PIC X(20).                                              
           02  ABLZL    COMP  PIC  S9(4).                                       
           02  ABLZF    PICTURE X.                                              
           02  FILLER REDEFINES ABLZF.                                          
             03 ABLZA    PICTURE X.                                             
           02  ABLZI  PIC X(1).                                                 
           02  EBLZL    COMP  PIC  S9(4).                                       
           02  EBLZF    PICTURE X.                                              
           02  FILLER REDEFINES EBLZF.                                          
             03 EBLZA    PICTURE X.                                             
           02  EBLZI  PIC X(8).                                                 
           02  ABANKL    COMP  PIC  S9(4).                                      
           02  ABANKF    PICTURE X.                                             
           02  FILLER REDEFINES ABANKF.                                         
             03 ABANKA    PICTURE X.                                            
           02  ABANKI  PIC X(1).                                                
           02  EBANKL    COMP  PIC  S9(4).                                      
           02  EBANKF    PICTURE X.                                             
           02  FILLER REDEFINES EBANKF.                                         
             03 EBANKA    PICTURE X.                                            
           02  EBANKI  PIC X(40).                                               
           02  ABVINHL    COMP  PIC  S9(4).                                     
           02  ABVINHF    PICTURE X.                                            
           02  FILLER REDEFINES ABVINHF.                                        
             03 ABVINHA    PICTURE X.                                           
           02  ABVINHI  PIC X(1).                                               
           02  EBVINHL    COMP  PIC  S9(4).                                     
           02  EBVINHF    PICTURE X.                                            
           02  FILLER REDEFINES EBVINHF.                                        
             03 EBVINHA    PICTURE X.                                           
           02  EBVINHI  PIC X(40).                                              
       01  BVB0013O REDEFINES BVB0013I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEDNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AEDPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEDNAMEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEDNAMEO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADATABTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATABMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATABJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEZUVBO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEZUPRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEZUNAO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEDGENO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEDZWO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZWVOMTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZWVOMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZWVOMJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKSTZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERCKSTZO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEDPROVO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEDPROVO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIBANO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EIBANO  PIC X(22).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKTONRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKTONRO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABLZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBLZO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ABANKO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBANKO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABVINHO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBVINHO  PIC X(40).                                              
