       01  BVB0023I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AMATYPL    COMP  PIC  S9(4).                                     
           02  AMATYPF    PICTURE X.                                            
           02  FILLER REDEFINES AMATYPF.                                        
             03 AMATYPA    PICTURE X.                                           
           02  AMATYPI  PIC X(2).                                               
           02  AMSNRL    COMP  PIC  S9(4).                                      
           02  AMSNRF    PICTURE X.                                             
           02  FILLER REDEFINES AMSNRF.                                         
             03 AMSNRA    PICTURE X.                                            
           02  AMSNRI  PIC X(4).                                                
           02  ABETRNRL    COMP  PIC  S9(4).                                    
           02  ABETRNRF    PICTURE X.                                           
           02  FILLER REDEFINES ABETRNRF.                                       
             03 ABETRNRA    PICTURE X.                                          
           02  ABETRNRI  PIC X(7).                                              
           02  ABETPRZL    COMP  PIC  S9(4).                                    
           02  ABETPRZF    PICTURE X.                                           
           02  FILLER REDEFINES ABETPRZF.                                       
             03 ABETPRZA    PICTURE X.                                          
           02  ABETPRZI  PIC X(1).                                              
           02  ADIRNRL    COMP  PIC  S9(4).                                     
           02  ADIRNRF    PICTURE X.                                            
           02  FILLER REDEFINES ADIRNRF.                                        
             03 ADIRNRA    PICTURE X.                                           
           02  ADIRNRI  PIC X(3).                                               
           02  EAUSWL    COMP  PIC  S9(4).                                      
           02  EAUSWF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSWF.                                         
             03 EAUSWA    PICTURE X.                                            
           02  EAUSWI  PIC X(1).                                                
           02  EEDNRL    COMP  PIC  S9(4).                                      
           02  EEDNRF    PICTURE X.                                             
           02  FILLER REDEFINES EEDNRF.                                         
             03 EEDNRA    PICTURE X.                                            
           02  EEDNRI  PIC X(7).                                                
           02  EEDPRZL    COMP  PIC  S9(4).                                     
           02  EEDPRZF    PICTURE X.                                            
           02  FILLER REDEFINES EEDPRZF.                                        
             03 EEDPRZA    PICTURE X.                                           
           02  EEDPRZI  PIC X(1).                                               
           02  EEDBESL    COMP  PIC  S9(4).                                     
           02  EEDBESF    PICTURE X.                                            
           02  FILLER REDEFINES EEDBESF.                                        
             03 EEDBESA    PICTURE X.                                           
           02  EEDBESI  PIC X(7).                                               
           02  EEDBEPRL    COMP  PIC  S9(4).                                    
           02  EEDBEPRF    PICTURE X.                                           
           02  FILLER REDEFINES EEDBEPRF.                                       
             03 EEDBEPRA    PICTURE X.                                          
           02  EEDBEPRI  PIC X(1).                                              
           02  EAUSDL    COMP  PIC  S9(4).                                      
           02  EAUSDF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSDF.                                         
             03 EAUSDA    PICTURE X.                                            
           02  EAUSDI  PIC X(7).                                                
           02  EAUSDPRL    COMP  PIC  S9(4).                                    
           02  EAUSDPRF    PICTURE X.                                           
           02  FILLER REDEFINES EAUSDPRF.                                       
             03 EAUSDPRA    PICTURE X.                                          
           02  EAUSDPRI  PIC X(1).                                              
           02  EUMZVBL    COMP  PIC  S9(4).                                     
           02  EUMZVBF    PICTURE X.                                            
           02  FILLER REDEFINES EUMZVBF.                                        
             03 EUMZVBA    PICTURE X.                                           
           02  EUMZVBI  PIC X(7).                                               
           02  EUMVBPRL    COMP  PIC  S9(4).                                    
           02  EUMVBPRF    PICTURE X.                                           
           02  FILLER REDEFINES EUMVBPRF.                                       
             03 EUMVBPRA    PICTURE X.                                          
           02  EUMVBPRI  PIC X(1).                                              
           02  AEDNRL    COMP  PIC  S9(4).                                      
           02  AEDNRF    PICTURE X.                                             
           02  FILLER REDEFINES AEDNRF.                                         
             03 AEDNRA    PICTURE X.                                            
           02  AEDNRI  PIC X(7).                                                
           02  AEDPRZL    COMP  PIC  S9(4).                                     
           02  AEDPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AEDPRZF.                                        
             03 AEDPRZA    PICTURE X.                                           
           02  AEDPRZI  PIC X(1).                                               
           02  AEDNAMEL    COMP  PIC  S9(4).                                    
           02  AEDNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AEDNAMEF.                                       
             03 AEDNAMEA    PICTURE X.                                          
           02  AEDNAMEI  PIC X(1).                                              
           02  EEDNAMEL    COMP  PIC  S9(4).                                    
           02  EEDNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES EEDNAMEF.                                       
             03 EEDNAMEA    PICTURE X.                                          
           02  EEDNAMEI  PIC X(40).                                             
           02  ADATABTL    COMP  PIC  S9(4).                                    
           02  ADATABTF    PICTURE X.                                           
           02  FILLER REDEFINES ADATABTF.                                       
             03 ADATABTA    PICTURE X.                                          
           02  ADATABTI  PIC X(2).                                              
           02  ADATABML    COMP  PIC  S9(4).                                    
           02  ADATABMF    PICTURE X.                                           
           02  FILLER REDEFINES ADATABMF.                                       
             03 ADATABMA    PICTURE X.                                          
           02  ADATABMI  PIC X(2).                                              
           02  ADATABJL    COMP  PIC  S9(4).                                    
           02  ADATABJF    PICTURE X.                                           
           02  FILLER REDEFINES ADATABJF.                                       
             03 ADATABJA    PICTURE X.                                          
           02  ADATABJI  PIC X(4).                                              
           02  AGEZUVBL    COMP  PIC  S9(4).                                    
           02  AGEZUVBF    PICTURE X.                                           
           02  FILLER REDEFINES AGEZUVBF.                                       
             03 AGEZUVBA    PICTURE X.                                          
           02  AGEZUVBI  PIC X(7).                                              
           02  AGEZUPRL    COMP  PIC  S9(4).                                    
           02  AGEZUPRF    PICTURE X.                                           
           02  FILLER REDEFINES AGEZUPRF.                                       
             03 AGEZUPRA    PICTURE X.                                          
           02  AGEZUPRI  PIC X(1).                                              
           02  AGEZUNAL    COMP  PIC  S9(4).                                    
           02  AGEZUNAF    PICTURE X.                                           
           02  FILLER REDEFINES AGEZUNAF.                                       
             03 AGEZUNAA    PICTURE X.                                          
           02  AGEZUNAI  PIC X(40).                                             
           02  AEDGENL    COMP  PIC  S9(4).                                     
           02  AEDGENF    PICTURE X.                                            
           02  FILLER REDEFINES AEDGENF.                                        
             03 AEDGENA    PICTURE X.                                           
           02  AEDGENI  PIC X(1).                                               
           02  EEDGENL    COMP  PIC  S9(4).                                     
           02  EEDGENF    PICTURE X.                                            
           02  FILLER REDEFINES EEDGENF.                                        
             03 EEDGENA    PICTURE X.                                           
           02  EEDGENI  PIC X(1).                                               
           02  AEDZWL    COMP  PIC  S9(4).                                      
           02  AEDZWF    PICTURE X.                                             
           02  FILLER REDEFINES AEDZWF.                                         
             03 AEDZWA    PICTURE X.                                            
           02  AEDZWI  PIC X(1).                                                
           02  EEDZWL    COMP  PIC  S9(4).                                      
           02  EEDZWF    PICTURE X.                                             
           02  FILLER REDEFINES EEDZWF.                                         
             03 EEDZWA    PICTURE X.                                            
           02  EEDZWI  PIC X(7).                                                
           02  AZWVOML    COMP  PIC  S9(4).                                     
           02  AZWVOMF    PICTURE X.                                            
           02  FILLER REDEFINES AZWVOMF.                                        
             03 AZWVOMA    PICTURE X.                                           
           02  AZWVOMI  PIC X(1).                                               
           02  EZWVOMTL    COMP  PIC  S9(4).                                    
           02  EZWVOMTF    PICTURE X.                                           
           02  FILLER REDEFINES EZWVOMTF.                                       
             03 EZWVOMTA    PICTURE X.                                          
           02  EZWVOMTI  PIC X(2).                                              
           02  EZWVOMML    COMP  PIC  S9(4).                                    
           02  EZWVOMMF    PICTURE X.                                           
           02  FILLER REDEFINES EZWVOMMF.                                       
             03 EZWVOMMA    PICTURE X.                                          
           02  EZWVOMMI  PIC X(2).                                              
           02  EZWVOMJL    COMP  PIC  S9(4).                                    
           02  EZWVOMJF    PICTURE X.                                           
           02  FILLER REDEFINES EZWVOMJF.                                       
             03 EZWVOMJA    PICTURE X.                                          
           02  EZWVOMJI  PIC X(4).                                              
           02  ARCKSTZL    COMP  PIC  S9(4).                                    
           02  ARCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKSTZF.                                       
             03 ARCKSTZA    PICTURE X.                                          
           02  ARCKSTZI  PIC X(1).                                              
           02  ERCKSTZL    COMP  PIC  S9(4).                                    
           02  ERCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ERCKSTZF.                                       
             03 ERCKSTZA    PICTURE X.                                          
           02  ERCKSTZI  PIC X(6).                                              
           02  AEDPROVL    COMP  PIC  S9(4).                                    
           02  AEDPROVF    PICTURE X.                                           
           02  FILLER REDEFINES AEDPROVF.                                       
             03 AEDPROVA    PICTURE X.                                          
           02  AEDPROVI  PIC X(1).                                              
           02  EEDPROVL    COMP  PIC  S9(4).                                    
           02  EEDPROVF    PICTURE X.                                           
           02  FILLER REDEFINES EEDPROVF.                                       
             03 EEDPROVA    PICTURE X.                                          
           02  EEDPROVI  PIC X(6).                                              
           02  ASPERREL    COMP  PIC  S9(4).                                    
           02  ASPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ASPERREF.                                       
             03 ASPERREA    PICTURE X.                                          
           02  ASPERREI  PIC X(1).                                              
           02  ESPERREL    COMP  PIC  S9(4).                                    
           02  ESPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ESPERREF.                                       
             03 ESPERREA    PICTURE X.                                          
           02  ESPERREI  PIC X(1).                                              
           02  AIBANL    COMP  PIC  S9(4).                                      
           02  AIBANF    PICTURE X.                                             
           02  FILLER REDEFINES AIBANF.                                         
             03 AIBANA    PICTURE X.                                            
           02  AIBANI  PIC X(1).                                                
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  EIBANI  PIC X(22).                                               
           02  AKTONRL    COMP  PIC  S9(4).                                     
           02  AKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES AKTONRF.                                        
             03 AKTONRA    PICTURE X.                                           
           02  AKTONRI  PIC X(1).                                               
           02  EKTONRL    COMP  PIC  S9(4).                                     
           02  EKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES EKTONRF.                                        
             03 EKTONRA    PICTURE X.                                           
           02  EKTONRI  PIC X(20).                                              
           02  ABLZL    COMP  PIC  S9(4).                                       
           02  ABLZF    PICTURE X.                                              
           02  FILLER REDEFINES ABLZF.                                          
             03 ABLZA    PICTURE X.                                             
           02  ABLZI  PIC X(1).                                                 
           02  EBLZL    COMP  PIC  S9(4).                                       
           02  EBLZF    PICTURE X.                                              
           02  FILLER REDEFINES EBLZF.                                          
             03 EBLZA    PICTURE X.                                             
           02  EBLZI  PIC X(8).                                                 
           02  ABANKL    COMP  PIC  S9(4).                                      
           02  ABANKF    PICTURE X.                                             
           02  FILLER REDEFINES ABANKF.                                         
             03 ABANKA    PICTURE X.                                            
           02  ABANKI  PIC X(1).                                                
           02  EBANKL    COMP  PIC  S9(4).                                      
           02  EBANKF    PICTURE X.                                             
           02  FILLER REDEFINES EBANKF.                                         
             03 EBANKA    PICTURE X.                                            
           02  EBANKI  PIC X(40).                                               
           02  ABVINHL    COMP  PIC  S9(4).                                     
           02  ABVINHF    PICTURE X.                                            
           02  FILLER REDEFINES ABVINHF.                                        
             03 ABVINHA    PICTURE X.                                           
           02  ABVINHI  PIC X(1).                                               
           02  EBVINHL    COMP  PIC  S9(4).                                     
           02  EBVINHF    PICTURE X.                                            
           02  FILLER REDEFINES EBVINHF.                                        
             03 EBVINHA    PICTURE X.                                           
           02  EBVINHI  PIC X(40).                                              
       01  BVB0023O REDEFINES BVB0023I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMATYPO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMSNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  ABETRNRO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABETPRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADIRNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUSWO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EEDNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EEDPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEDBESO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEDBEPRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUSDO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAUSDPRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUMZVBO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EUMVBPRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEDNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AEDPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEDNAMEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEDNAMEO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADATABTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATABMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATABJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEZUVBO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEZUPRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEZUNAO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEDGENO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEDGENO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEDZWO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EEDZWO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZWVOMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EZWVOMTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWVOMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZWVOMJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKSTZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERCKSTZO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEDPROVO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEDPROVO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIBANO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EIBANO  PIC X(22).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKTONRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKTONRO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABLZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBLZO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ABANKO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBANKO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABVINHO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBVINHO  PIC X(40).                                              
