      *   Micro Focus Enterprise Developer for Eclipse  5.0.00256
      *   Micro Focus BMS Screen Painter (ver BMSIDE_5-0-01)
      *   MapSet Name   BVB0008
      *   Date Created  11/29/2021
      *   Time Created  09:06:40

      *  Input Data For Map BVB0008
         01 BVB0008I.
            03 FILLER                         PIC X(12).
            03 ESTNRL                         PIC S9(4) COMP.
            03 ESTNRF                         PIC X.
            03 FILLER REDEFINES ESTNRF.
               05 ESTNRA                         PIC X.
            03 ESTNRI                         PIC X(7).
            03 ESTPRZL                        PIC S9(4) COMP.
            03 ESTPRZF                        PIC X.
            03 FILLER REDEFINES ESTPRZF.
               05 ESTPRZA                        PIC X.
            03 ESTPRZI                        PIC X(1).
            03 AINFOZLL                       PIC S9(4) COMP.
            03 AINFOZLF                       PIC X.
            03 FILLER REDEFINES AINFOZLF.
               05 AINFOZLA                       PIC X.
            03 AINFOZLI                       PIC X(65).
            03 ANAMEL                         PIC S9(4) COMP.
            03 ANAMEF                         PIC X.
            03 FILLER REDEFINES ANAMEF.
               05 ANAMEA                         PIC X.
            03 ANAMEI                         PIC X(20).
            03 AVORNAML                       PIC S9(4) COMP.
            03 AVORNAMF                       PIC X.
            03 FILLER REDEFINES AVORNAMF.
               05 AVORNAMA                       PIC X.
            03 AVORNAMI                       PIC X(15).
            03 ABTRNAML                       PIC S9(4) COMP.
            03 ABTRNAMF                       PIC X.
            03 FILLER REDEFINES ABTRNAMF.
               05 ABTRNAMA                       PIC X.
            03 ABTRNAMI                       PIC X(16).
            03 ASTZVL                         PIC S9(4) COMP.
            03 ASTZVF                         PIC X.
            03 FILLER REDEFINES ASTZVF.
               05 ASTZVA                         PIC X.
            03 ASTZVI                         PIC X(1).
            03 EAZVL                          PIC S9(4) COMP.
            03 EAZVF                          PIC X.
            03 FILLER REDEFINES EAZVF.
               05 EAZVA                          PIC X.
            03 EAZVI                          PIC X(1).
            03 ASTLUPDL                       PIC S9(4) COMP.
            03 ASTLUPDF                       PIC X.
            03 FILLER REDEFINES ASTLUPDF.
               05 ASTLUPDA                       PIC X.
            03 ASTLUPDI                       PIC X(1).
            03 EALUPDTL                       PIC S9(4) COMP.
            03 EALUPDTF                       PIC X.
            03 FILLER REDEFINES EALUPDTF.
               05 EALUPDTA                       PIC X.
            03 EALUPDTI                       PIC X(2).
            03 EALUPDML                       PIC S9(4) COMP.
            03 EALUPDMF                       PIC X.
            03 FILLER REDEFINES EALUPDMF.
               05 EALUPDMA                       PIC X.
            03 EALUPDMI                       PIC X(2).
            03 EALUPDJL                       PIC S9(4) COMP.
            03 EALUPDJF                       PIC X.
            03 FILLER REDEFINES EALUPDJF.
               05 EALUPDJA                       PIC X.
            03 EALUPDJI                       PIC X(4).
            03 ASTABL                         PIC S9(4) COMP.
            03 ASTABF                         PIC X.
            03 FILLER REDEFINES ASTABF.
               05 ASTABA                         PIC X.
            03 ASTABI                         PIC X(1).
            03 EAABTTL                        PIC S9(4) COMP.
            03 EAABTTF                        PIC X.
            03 FILLER REDEFINES EAABTTF.
               05 EAABTTA                        PIC X.
            03 EAABTTI                        PIC X(2).
            03 EAABMML                        PIC S9(4) COMP.
            03 EAABMMF                        PIC X.
            03 FILLER REDEFINES EAABMMF.
               05 EAABMMA                        PIC X.
            03 EAABMMI                        PIC X(2).
            03 EAABJJL                        PIC S9(4) COMP.
            03 EAABJJF                        PIC X.
            03 FILLER REDEFINES EAABJJF.
               05 EAABJJA                        PIC X.
            03 EAABJJI                        PIC X(4).
            03 ASTBISL                        PIC S9(4) COMP.
            03 ASTBISF                        PIC X.
            03 FILLER REDEFINES ASTBISF.
               05 ASTBISA                        PIC X.
            03 ASTBISI                        PIC X(1).
            03 EABISTTL                       PIC S9(4) COMP.
            03 EABISTTF                       PIC X.
            03 FILLER REDEFINES EABISTTF.
               05 EABISTTA                       PIC X.
            03 EABISTTI                       PIC X(2).
            03 EABISMML                       PIC S9(4) COMP.
            03 EABISMMF                       PIC X.
            03 FILLER REDEFINES EABISMMF.
               05 EABISMMA                       PIC X.
            03 EABISMMI                       PIC X(2).
            03 EABISJJL                       PIC S9(4) COMP.
            03 EABISJJF                       PIC X.
            03 FILLER REDEFINES EABISJJF.
               05 EABISJJA                       PIC X.
            03 EABISJJI                       PIC X(4).
            03 ASTRUEL                        PIC S9(4) COMP.
            03 ASTRUEF                        PIC X.
            03 FILLER REDEFINES ASTRUEF.
               05 ASTRUEA                        PIC X.
            03 ASTRUEI                        PIC X(1).
            03 EARUEL                         PIC S9(4) COMP.
            03 EARUEF                         PIC X.
            03 FILLER REDEFINES EARUEF.
               05 EARUEA                         PIC X.
            03 EARUEI                         PIC X(1).
            03 ASTVABL                        PIC S9(4) COMP.
            03 ASTVABF                        PIC X.
            03 FILLER REDEFINES ASTVABF.
               05 ASTVABA                        PIC X.
            03 ASTVABI                        PIC X(1).
            03 EAVABL                         PIC S9(4) COMP.
            03 EAVABF                         PIC X.
            03 FILLER REDEFINES EAVABF.
               05 EAVABA                         PIC X.
            03 EAVABI                         PIC X(7).
            03 ASTVVNL                        PIC S9(4) COMP.
            03 ASTVVNF                        PIC X.
            03 FILLER REDEFINES ASTVVNF.
               05 ASTVVNA                        PIC X.
            03 ASTVVNI                        PIC X(1).
            03 EAVVNL                         PIC S9(4) COMP.
            03 EAVVNF                         PIC X.
            03 FILLER REDEFINES EAVVNF.
               05 EAVVNA                         PIC X.
            03 EAVVNI                         PIC X(10).
            03 ASTZSUML                       PIC S9(4) COMP.
            03 ASTZSUMF                       PIC X.
            03 FILLER REDEFINES ASTZSUMF.
               05 ASTZSUMA                       PIC X.
            03 ASTZSUMI                       PIC X(1).
            03 EAZSUMML                       PIC S9(4) COMP.
            03 EAZSUMMF                       PIC X.
            03 FILLER REDEFINES EAZSUMMF.
               05 EAZSUMMA                       PIC X.
            03 EAZSUMMI                       PIC X(6).
            03 ASTDANTL                       PIC S9(4) COMP.
            03 ASTDANTF                       PIC X.
            03 FILLER REDEFINES ASTDANTF.
               05 ASTDANTA                       PIC X.
            03 ASTDANTI                       PIC X(1).
            03 EADANTL                        PIC S9(4) COMP.
            03 EADANTF                        PIC X.
            03 FILLER REDEFINES EADANTF.
               05 EADANTA                        PIC X.
            03 EADANTI                        PIC X(6).
            03 VOLLML                         PIC S9(4) COMP.
            03 VOLLMF                         PIC X.
            03 FILLER REDEFINES VOLLMF.
               05 VOLLMA                         PIC X.
            03 VOLLMI                         PIC X(10).
            03 POVOLLML                       PIC S9(4) COMP.
            03 POVOLLMF                       PIC X.
            03 FILLER REDEFINES POVOLLMF.
               05 POVOLLMA                       PIC X.
            03 POVOLLMI                       PIC X(10).
            03 ASTCABL                        PIC S9(4) COMP.
            03 ASTCABF                        PIC X.
            03 FILLER REDEFINES ASTCABF.
               05 ASTCABA                        PIC X.
            03 ASTCABI                        PIC X(1).
            03 EACABL                         PIC S9(4) COMP.
            03 EACABF                         PIC X.
            03 FILLER REDEFINES EACABF.
               05 EACABA                         PIC X.
            03 EACABI                         PIC X(7).
            03 ASTCVNL                        PIC S9(4) COMP.
            03 ASTCVNF                        PIC X.
            03 FILLER REDEFINES ASTCVNF.
               05 ASTCVNA                        PIC X.
            03 ASTCVNI                        PIC X(1).
            03 EACVNL                         PIC S9(4) COMP.
            03 EACVNF                         PIC X.
            03 FILLER REDEFINES EACVNF.
               05 EACVNA                         PIC X.
            03 EACVNI                         PIC X(10).
            03 ASTCBETL                       PIC S9(4) COMP.
            03 ASTCBETF                       PIC X.
            03 FILLER REDEFINES ASTCBETF.
               05 ASTCBETA                       PIC X.
            03 ASTCBETI                       PIC X(1).
            03 EACBETL                        PIC S9(4) COMP.
            03 EACBETF                        PIC X.
            03 FILLER REDEFINES EACBETF.
               05 EACBETA                        PIC X.
            03 EACBETI                        PIC X(5).
            03 ASTCBEIL                       PIC S9(4) COMP.
            03 ASTCBEIF                       PIC X.
            03 FILLER REDEFINES ASTCBEIF.
               05 ASTCBEIA                       PIC X.
            03 ASTCBEII                       PIC X(1).
            03 EACBEIL                        PIC S9(4) COMP.
            03 EACBEIF                        PIC X.
            03 FILLER REDEFINES EACBEIF.
               05 EACBEIA                        PIC X.
            03 EACBEII                        PIC X(5).

      *  Output Data For Map BVB0008
         01 BVB0008O REDEFINES BVB0008I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 ESTNRO                         PIC X(7).
            03 FILLER                         PIC X(3).
            03 ESTPRZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 AINFOZLO                       PIC X(65).
            03 FILLER                         PIC X(3).
            03 ANAMEO                         PIC X(20).
            03 FILLER                         PIC X(3).
            03 AVORNAMO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ABTRNAMO                       PIC X(16).
            03 FILLER                         PIC X(3).
            03 ASTZVO                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 EAZVO                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ASTLUPDO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 EALUPDTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EALUPDMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EALUPDJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 ASTABO                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 EAABTTO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 EAABMMO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 EAABJJO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 ASTBISO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EABISTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EABISMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 EABISJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 ASTRUEO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EARUEO                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ASTVABO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EAVABO                         PIC X(7).
            03 FILLER                         PIC X(3).
            03 ASTVVNO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EAVVNO                         PIC X(10).
            03 FILLER                         PIC X(3).
            03 ASTZSUMO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 EAZSUMMO                       PIC X(6).
            03 FILLER                         PIC X(3).
            03 ASTDANTO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 EADANTO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 VOLLMO                         PIC X(10).
            03 FILLER                         PIC X(3).
            03 POVOLLMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ASTCABO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EACABO                         PIC X(7).
            03 FILLER                         PIC X(3).
            03 ASTCVNO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 EACVNO                         PIC X(10).
            03 FILLER                         PIC X(3).
            03 ASTCBETO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 EACBETO                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 ASTCBEIO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 EACBEIO                        PIC X(5).

