       01  BVB0024I.                                                            
           02  FILLER PIC X(12).                                                
           02  ASTNRL    COMP  PIC  S9(4).                                      
           02  ASTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ASTNRF.                                         
             03 ASTNRA    PICTURE X.                                            
           02  ASTNRI  PIC X(7).                                                
           02  ASTPRZL    COMP  PIC  S9(4).                                     
           02  ASTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ASTPRZF.                                        
             03 ASTPRZA    PICTURE X.                                           
           02  ASTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ABVVONL    COMP  PIC  S9(4).                                     
           02  ABVVONF    PICTURE X.                                            
           02  FILLER REDEFINES ABVVONF.                                        
             03 ABVVONA    PICTURE X.                                           
           02  ABVVONI  PIC X(1).                                               
           02  EBVVONTL    COMP  PIC  S9(4).                                    
           02  EBVVONTF    PICTURE X.                                           
           02  FILLER REDEFINES EBVVONTF.                                       
             03 EBVVONTA    PICTURE X.                                          
           02  EBVVONTI  PIC X(2).                                              
           02  EBVVONML    COMP  PIC  S9(4).                                    
           02  EBVVONMF    PICTURE X.                                           
           02  FILLER REDEFINES EBVVONMF.                                       
             03 EBVVONMA    PICTURE X.                                          
           02  EBVVONMI  PIC X(2).                                              
           02  EBVVONJL    COMP  PIC  S9(4).                                    
           02  EBVVONJF    PICTURE X.                                           
           02  FILLER REDEFINES EBVVONJF.                                       
             03 EBVVONJA    PICTURE X.                                          
           02  EBVVONJI  PIC X(4).                                              
           02  ASPERREL    COMP  PIC  S9(4).                                    
           02  ASPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ASPERREF.                                       
             03 ASPERREA    PICTURE X.                                          
           02  ASPERREI  PIC X(1).                                              
           02  ESPERREL    COMP  PIC  S9(4).                                    
           02  ESPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ESPERREF.                                       
             03 ESPERREA    PICTURE X.                                          
           02  ESPERREI  PIC X(1).                                              
           02  ABVSCHL    COMP  PIC  S9(4).                                     
           02  ABVSCHF    PICTURE X.                                            
           02  FILLER REDEFINES ABVSCHF.                                        
             03 ABVSCHA    PICTURE X.                                           
           02  ABVSCHI  PIC X(24).                                              
           02  AIBANL    COMP  PIC  S9(4).                                      
           02  AIBANF    PICTURE X.                                             
           02  FILLER REDEFINES AIBANF.                                         
             03 AIBANA    PICTURE X.                                            
           02  AIBANI  PIC X(1).                                                
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  EIBANI  PIC X(22).                                               
           02  ABICL    COMP  PIC  S9(4).                                       
           02  ABICF    PICTURE X.                                              
           02  FILLER REDEFINES ABICF.                                          
             03 ABICA    PICTURE X.                                             
           02  ABICI  PIC X(12).                                                
           02  ABLZL    COMP  PIC  S9(4).                                       
           02  ABLZF    PICTURE X.                                              
           02  FILLER REDEFINES ABLZF.                                          
             03 ABLZA    PICTURE X.                                             
           02  ABLZI  PIC X(1).                                                 
           02  EBLZL    COMP  PIC  S9(4).                                       
           02  EBLZF    PICTURE X.                                              
           02  FILLER REDEFINES EBLZF.                                          
             03 EBLZA    PICTURE X.                                             
           02  EBLZI  PIC X(8).                                                 
           02  ABANKL    COMP  PIC  S9(4).                                      
           02  ABANKF    PICTURE X.                                             
           02  FILLER REDEFINES ABANKF.                                         
             03 ABANKA    PICTURE X.                                            
           02  ABANKI  PIC X(1).                                                
           02  EBANKL    COMP  PIC  S9(4).                                      
           02  EBANKF    PICTURE X.                                             
           02  FILLER REDEFINES EBANKF.                                         
             03 EBANKA    PICTURE X.                                            
           02  EBANKI  PIC X(40).                                               
           02  AKTONRL    COMP  PIC  S9(4).                                     
           02  AKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES AKTONRF.                                        
             03 AKTONRA    PICTURE X.                                           
           02  AKTONRI  PIC X(1).                                               
           02  EKTONRL    COMP  PIC  S9(4).                                     
           02  EKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES EKTONRF.                                        
             03 EKTONRA    PICTURE X.                                           
           02  EKTONRI  PIC X(20).                                              
           02  ABVINHL    COMP  PIC  S9(4).                                     
           02  ABVINHF    PICTURE X.                                            
           02  FILLER REDEFINES ABVINHF.                                        
             03 ABVINHA    PICTURE X.                                           
           02  ABVINHI  PIC X(1).                                               
           02  EBVINHL    COMP  PIC  S9(4).                                     
           02  EBVINHF    PICTURE X.                                            
           02  FILLER REDEFINES EBVINHF.                                        
             03 EBVINHA    PICTURE X.                                           
           02  EBVINHI  PIC X(40).                                              
           02  ARCKSTZL    COMP  PIC  S9(4).                                    
           02  ARCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKSTZF.                                       
             03 ARCKSTZA    PICTURE X.                                          
           02  ARCKSTZI  PIC X(1).                                              
           02  ERCKSTZL    COMP  PIC  S9(4).                                    
           02  ERCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ERCKSTZF.                                       
             03 ERCKSTZA    PICTURE X.                                          
           02  ERCKSTZI  PIC X(6).                                              
           02  ARCKDTL    COMP  PIC  S9(4).                                     
           02  ARCKDTF    PICTURE X.                                            
           02  FILLER REDEFINES ARCKDTF.                                        
             03 ARCKDTA    PICTURE X.                                           
           02  ARCKDTI  PIC X(1).                                               
           02  ERCKDTL    COMP  PIC  S9(4).                                     
           02  ERCKDTF    PICTURE X.                                            
           02  FILLER REDEFINES ERCKDTF.                                        
             03 ERCKDTA    PICTURE X.                                           
           02  ERCKDTI  PIC X(2).                                               
           02  ERCKDML    COMP  PIC  S9(4).                                     
           02  ERCKDMF    PICTURE X.                                            
           02  FILLER REDEFINES ERCKDMF.                                        
             03 ERCKDMA    PICTURE X.                                           
           02  ERCKDMI  PIC X(2).                                               
           02  ERCKDJL    COMP  PIC  S9(4).                                     
           02  ERCKDJF    PICTURE X.                                            
           02  FILLER REDEFINES ERCKDJF.                                        
             03 ERCKDJA    PICTURE X.                                           
           02  ERCKDJI  PIC X(4).                                               
           02  AAUTELL    COMP  PIC  S9(4).                                     
           02  AAUTELF    PICTURE X.                                            
           02  FILLER REDEFINES AAUTELF.                                        
             03 AAUTELA    PICTURE X.                                           
           02  AAUTELI  PIC X(1).                                               
           02  EAUTELL    COMP  PIC  S9(4).                                     
           02  EAUTELF    PICTURE X.                                            
           02  FILLER REDEFINES EAUTELF.                                        
             03 EAUTELA    PICTURE X.                                           
           02  EAUTELI  PIC X(26).                                              
           02  ANOTTYPL    COMP  PIC  S9(4).                                    
           02  ANOTTYPF    PICTURE X.                                           
           02  FILLER REDEFINES ANOTTYPF.                                       
             03 ANOTTYPA    PICTURE X.                                          
           02  ANOTTYPI  PIC X(1).                                              
           02  ENOTTYPL    COMP  PIC  S9(4).                                    
           02  ENOTTYPF    PICTURE X.                                           
           02  FILLER REDEFINES ENOTTYPF.                                       
             03 ENOTTYPA    PICTURE X.                                          
           02  ENOTTYPI  PIC X(1).                                              
           02  ATLTEXTL    COMP  PIC  S9(4).                                    
           02  ATLTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES ATLTEXTF.                                       
             03 ATLTEXTA    PICTURE X.                                          
           02  ATLTEXTI  PIC X(1).                                              
           02  ETLTEXTL    COMP  PIC  S9(4).                                    
           02  ETLTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES ETLTEXTF.                                       
             03 ETLTEXTA    PICTURE X.                                          
           02  ETLTEXTI  PIC X(26).                                             
           02  ATSTSOZL    COMP  PIC  S9(4).                                    
           02  ATSTSOZF    PICTURE X.                                           
           02  FILLER REDEFINES ATSTSOZF.                                       
             03 ATSTSOZA    PICTURE X.                                          
           02  ATSTSOZI  PIC X(16).                                             
           02  ASNRL    COMP  PIC  S9(4).                                       
           02  ASNRF    PICTURE X.                                              
           02  FILLER REDEFINES ASNRF.                                          
             03 ASNRA    PICTURE X.                                             
           02  ASNRI  PIC X(1).                                                 
           02  ESNRL    COMP  PIC  S9(4).                                       
           02  ESNRF    PICTURE X.                                              
           02  FILLER REDEFINES ESNRF.                                          
             03 ESNRA    PICTURE X.                                             
           02  ESNRI  PIC X(13).                                                
           02  AANWEL    COMP  PIC  S9(4).                                      
           02  AANWEF    PICTURE X.                                             
           02  FILLER REDEFINES AANWEF.                                         
             03 AANWEA    PICTURE X.                                            
           02  AANWEI  PIC X(1).                                                
           02  EANWEL    COMP  PIC  S9(4).                                      
           02  EANWEF    PICTURE X.                                             
           02  FILLER REDEFINES EANWEF.                                         
             03 EANWEA    PICTURE X.                                            
           02  EANWEI  PIC X(7).                                                
           02  EASTPRZL    COMP  PIC  S9(4).                                    
           02  EASTPRZF    PICTURE X.                                           
           02  FILLER REDEFINES EASTPRZF.                                       
             03 EASTPRZA    PICTURE X.                                          
           02  EASTPRZI  PIC X(1).                                              
           02  AHRNRTL    COMP  PIC  S9(4).                                     
           02  AHRNRTF    PICTURE X.                                            
           02  FILLER REDEFINES AHRNRTF.                                        
             03 AHRNRTA    PICTURE X.                                           
           02  AHRNRTI  PIC X(16).                                              
           02  AHRNRL    COMP  PIC  S9(4).                                      
           02  AHRNRF    PICTURE X.                                             
           02  FILLER REDEFINES AHRNRF.                                         
             03 AHRNRA    PICTURE X.                                            
           02  AHRNRI  PIC X(1).                                                
           02  EHRNRL    COMP  PIC  S9(4).                                      
           02  EHRNRF    PICTURE X.                                             
           02  FILLER REDEFINES EHRNRF.                                         
             03 EHRNRA    PICTURE X.                                            
           02  EHRNRI  PIC X(8).                                                
           02  AHRORTTL    COMP  PIC  S9(4).                                    
           02  AHRORTTF    PICTURE X.                                           
           02  FILLER REDEFINES AHRORTTF.                                       
             03 AHRORTTA    PICTURE X.                                          
           02  AHRORTTI  PIC X(12).                                             
           02  AHRORTL    COMP  PIC  S9(4).                                     
           02  AHRORTF    PICTURE X.                                            
           02  FILLER REDEFINES AHRORTF.                                        
             03 AHRORTA    PICTURE X.                                           
           02  AHRORTI  PIC X(1).                                               
           02  EHRORTL    COMP  PIC  S9(4).                                     
           02  EHRORTF    PICTURE X.                                            
           02  FILLER REDEFINES EHRORTF.                                        
             03 EHRORTA    PICTURE X.                                           
           02  EHRORTI  PIC X(36).                                              
           02  AAMNRTL    COMP  PIC  S9(4).                                     
           02  AAMNRTF    PICTURE X.                                            
           02  FILLER REDEFINES AAMNRTF.                                        
             03 AAMNRTA    PICTURE X.                                           
           02  AAMNRTI  PIC X(16).                                              
           02  AAMAGNRL    COMP  PIC  S9(4).                                    
           02  AAMAGNRF    PICTURE X.                                           
           02  FILLER REDEFINES AAMAGNRF.                                       
             03 AAMAGNRA    PICTURE X.                                          
           02  AAMAGNRI  PIC X(1).                                              
           02  EAMAGNRL    COMP  PIC  S9(4).                                    
           02  EAMAGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EAMAGNRF.                                       
             03 EAMAGNRA    PICTURE X.                                          
           02  EAMAGNRI  PIC X(8).                                              
           02  AAMAGZUL    COMP  PIC  S9(4).                                    
           02  AAMAGZUF    PICTURE X.                                           
           02  FILLER REDEFINES AAMAGZUF.                                       
             03 AAMAGZUA    PICTURE X.                                          
           02  AAMAGZUI  PIC X(2).                                              
           02  AAMDATTL    COMP  PIC  S9(4).                                    
           02  AAMDATTF    PICTURE X.                                           
           02  FILLER REDEFINES AAMDATTF.                                       
             03 AAMDATTA    PICTURE X.                                          
           02  AAMDATTI  PIC X(9).                                              
           02  AAMEINTL    COMP  PIC  S9(4).                                    
           02  AAMEINTF    PICTURE X.                                           
           02  FILLER REDEFINES AAMEINTF.                                       
             03 AAMEINTA    PICTURE X.                                          
           02  AAMEINTI  PIC X(1).                                              
           02  EAMEINTL    COMP  PIC  S9(4).                                    
           02  EAMEINTF    PICTURE X.                                           
           02  FILLER REDEFINES EAMEINTF.                                       
             03 EAMEINTA    PICTURE X.                                          
           02  EAMEINTI  PIC X(2).                                              
           02  EAMEINML    COMP  PIC  S9(4).                                    
           02  EAMEINMF    PICTURE X.                                           
           02  FILLER REDEFINES EAMEINMF.                                       
             03 EAMEINMA    PICTURE X.                                          
           02  EAMEINMI  PIC X(2).                                              
           02  EAMEINJL    COMP  PIC  S9(4).                                    
           02  EAMEINJF    PICTURE X.                                           
           02  FILLER REDEFINES EAMEINJF.                                       
             03 EAMEINJA    PICTURE X.                                          
           02  EAMEINJI  PIC X(4).                                              
           02  ATDVAGVL    COMP  PIC  S9(4).                                    
           02  ATDVAGVF    PICTURE X.                                           
           02  FILLER REDEFINES ATDVAGVF.                                       
             03 ATDVAGVA    PICTURE X.                                          
           02  ATDVAGVI  PIC X(11).                                             
           02  ADVAGVTL    COMP  PIC  S9(4).                                    
           02  ADVAGVTF    PICTURE X.                                           
           02  FILLER REDEFINES ADVAGVTF.                                       
             03 ADVAGVTA    PICTURE X.                                          
           02  ADVAGVTI  PIC X(1).                                              
           02  EDVAGVTL    COMP  PIC  S9(4).                                    
           02  EDVAGVTF    PICTURE X.                                           
           02  FILLER REDEFINES EDVAGVTF.                                       
             03 EDVAGVTA    PICTURE X.                                          
           02  EDVAGVTI  PIC X(2).                                              
           02  EDVAGVML    COMP  PIC  S9(4).                                    
           02  EDVAGVMF    PICTURE X.                                           
           02  FILLER REDEFINES EDVAGVMF.                                       
             03 EDVAGVMA    PICTURE X.                                          
           02  EDVAGVMI  PIC X(2).                                              
           02  EDVAGVJL    COMP  PIC  S9(4).                                    
           02  EDVAGVJF    PICTURE X.                                           
           02  FILLER REDEFINES EDVAGVJF.                                       
             03 EDVAGVJA    PICTURE X.                                          
           02  EDVAGVJI  PIC X(4).                                              
           02  ATBRANL    COMP  PIC  S9(4).                                     
           02  ATBRANF    PICTURE X.                                            
           02  FILLER REDEFINES ATBRANF.                                        
             03 ATBRANA    PICTURE X.                                           
           02  ATBRANI  PIC X(16).                                              
           02  ABRANCHL    COMP  PIC  S9(4).                                    
           02  ABRANCHF    PICTURE X.                                           
           02  FILLER REDEFINES ABRANCHF.                                       
             03 ABRANCHA    PICTURE X.                                          
           02  ABRANCHI  PIC X(1).                                              
           02  EBRANCHL    COMP  PIC  S9(4).                                    
           02  EBRANCHF    PICTURE X.                                           
           02  FILLER REDEFINES EBRANCHF.                                       
             03 EBRANCHA    PICTURE X.                                          
           02  EBRANCHI  PIC X(2).                                              
           02  ATUNTL    COMP  PIC  S9(4).                                      
           02  ATUNTF    PICTURE X.                                             
           02  FILLER REDEFINES ATUNTF.                                         
             03 ATUNTA    PICTURE X.                                            
           02  ATUNTI  PIC X(17).                                               
           02  AUNTERNL    COMP  PIC  S9(4).                                    
           02  AUNTERNF    PICTURE X.                                           
           02  FILLER REDEFINES AUNTERNF.                                       
             03 AUNTERNA    PICTURE X.                                          
           02  AUNTERNI  PIC X(1).                                              
           02  EUNTERNL    COMP  PIC  S9(4).                                    
           02  EUNTERNF    PICTURE X.                                           
           02  FILLER REDEFINES EUNTERNF.                                       
             03 EUNTERNA    PICTURE X.                                          
           02  EUNTERNI  PIC X(2).                                              
           02  ATKUNDEL    COMP  PIC  S9(4).                                    
           02  ATKUNDEF    PICTURE X.                                           
           02  FILLER REDEFINES ATKUNDEF.                                       
             03 ATKUNDEA    PICTURE X.                                          
           02  ATKUNDEI  PIC X(6).                                              
           02  AKUNDEL    COMP  PIC  S9(4).                                     
           02  AKUNDEF    PICTURE X.                                            
           02  FILLER REDEFINES AKUNDEF.                                        
             03 AKUNDEA    PICTURE X.                                           
           02  AKUNDEI  PIC X(1).                                               
           02  EKUNDEL    COMP  PIC  S9(4).                                     
           02  EKUNDEF    PICTURE X.                                            
           02  FILLER REDEFINES EKUNDEF.                                        
             03 EKUNDEA    PICTURE X.                                           
           02  EKUNDEI  PIC X(1).                                               
           02  EBESCHRL    COMP  PIC  S9(4).                                    
           02  EBESCHRF    PICTURE X.                                           
           02  FILLER REDEFINES EBESCHRF.                                       
             03 EBESCHRA    PICTURE X.                                          
           02  EBESCHRI  PIC X(1).                                              
           02  ATYPL    COMP  PIC  S9(4).                                       
           02  ATYPF    PICTURE X.                                              
           02  FILLER REDEFINES ATYPF.                                          
             03 ATYPA    PICTURE X.                                             
           02  ATYPI  PIC X(1).                                                 
           02  ETYPL    COMP  PIC  S9(4).                                       
           02  ETYPF    PICTURE X.                                              
           02  FILLER REDEFINES ETYPF.                                          
             03 ETYPA    PICTURE X.                                             
           02  ETYPI  PIC X(1).                                                 
       01  BVB0024O REDEFINES BVB0024I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABVVONO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBVVONTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBVVONMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBVVONJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABVSCHO  PIC X(24).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIBANO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EIBANO  PIC X(22).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABICO  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ABLZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBLZO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ABANKO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBANKO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKTONRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKTONRO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABVINHO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBVINHO  PIC X(40).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKSTZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERCKSTZO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKDTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERCKDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERCKDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERCKDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAUTELO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUTELO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANOTTYPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENOTTYPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATLTEXTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETLTEXTO  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATSTSOZO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASNRO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESNRO  PIC X(13).                                                
           02  FILLER PICTURE X(3).                                             
           02  AANWEO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EANWEO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EASTPRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHRNRTO  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHRNRO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EHRNRO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AHRORTTO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHRORTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EHRORTO  PIC X(36).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAMNRTO  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAMAGNRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAMAGNRO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAMAGZUO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAMDATTO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAMEINTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAMEINTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAMEINMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAMEINJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATDVAGVO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADVAGVTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDVAGVTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDVAGVMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDVAGVJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATBRANO  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABRANCHO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBRANCHO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATUNTO  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUNTERNO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EUNTERNO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATKUNDEO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKUNDEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKUNDEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBESCHRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATYPO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ETYPO  PIC X(1).                                                 
