       01  BVB0030I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(33).                                               
           02  ASTATL    COMP  PIC  S9(4).                                      
           02  ASTATF    PICTURE X.                                             
           02  FILLER REDEFINES ASTATF.                                         
             03 ASTATA    PICTURE X.                                            
           02  ASTATI  PIC X(1).                                                
           02  EKNRL    COMP  PIC  S9(4).                                       
           02  EKNRF    PICTURE X.                                              
           02  FILLER REDEFINES EKNRF.                                          
             03 EKNRA    PICTURE X.                                             
           02  EKNRI  PIC X(2).                                                 
           02  ASONDERL    COMP  PIC  S9(4).                                    
           02  ASONDERF    PICTURE X.                                           
           02  FILLER REDEFINES ASONDERF.                                       
             03 ASONDERA    PICTURE X.                                          
           02  ASONDERI  PIC X(60).                                             
           02  AWAEHRL    COMP  PIC  S9(4).                                     
           02  AWAEHRF    PICTURE X.                                            
           02  FILLER REDEFINES AWAEHRF.                                        
             03 AWAEHRA    PICTURE X.                                           
           02  AWAEHRI  PIC X(4).                                               
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1DATL    COMP  PIC  S9(4).                                      
           02  E1DATF    PICTURE X.                                             
           02  FILLER REDEFINES E1DATF.                                         
             03 E1DATA    PICTURE X.                                            
           02  E1DATI  PIC X(2).                                                
           02  E1DAML    COMP  PIC  S9(4).                                      
           02  E1DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E1DAMF.                                         
             03 E1DAMA    PICTURE X.                                            
           02  E1DAMI  PIC X(2).                                                
           02  E1DAJL    COMP  PIC  S9(4).                                      
           02  E1DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E1DAJF.                                         
             03 E1DAJA    PICTURE X.                                            
           02  E1DAJI  PIC X(4).                                                
           02  E1BETRL    COMP  PIC  S9(4).                                     
           02  E1BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E1BETRF.                                        
             03 E1BETRA    PICTURE X.                                           
           02  E1BETRI  PIC X(13).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2DATL    COMP  PIC  S9(4).                                      
           02  E2DATF    PICTURE X.                                             
           02  FILLER REDEFINES E2DATF.                                         
             03 E2DATA    PICTURE X.                                            
           02  E2DATI  PIC X(2).                                                
           02  E2DAML    COMP  PIC  S9(4).                                      
           02  E2DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E2DAMF.                                         
             03 E2DAMA    PICTURE X.                                            
           02  E2DAMI  PIC X(2).                                                
           02  E2DAJL    COMP  PIC  S9(4).                                      
           02  E2DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E2DAJF.                                         
             03 E2DAJA    PICTURE X.                                            
           02  E2DAJI  PIC X(4).                                                
           02  E2BETRL    COMP  PIC  S9(4).                                     
           02  E2BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E2BETRF.                                        
             03 E2BETRA    PICTURE X.                                           
           02  E2BETRI  PIC X(13).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3DATL    COMP  PIC  S9(4).                                      
           02  E3DATF    PICTURE X.                                             
           02  FILLER REDEFINES E3DATF.                                         
             03 E3DATA    PICTURE X.                                            
           02  E3DATI  PIC X(2).                                                
           02  E3DAML    COMP  PIC  S9(4).                                      
           02  E3DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E3DAMF.                                         
             03 E3DAMA    PICTURE X.                                            
           02  E3DAMI  PIC X(2).                                                
           02  E3DAJL    COMP  PIC  S9(4).                                      
           02  E3DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E3DAJF.                                         
             03 E3DAJA    PICTURE X.                                            
           02  E3DAJI  PIC X(4).                                                
           02  E3BETRL    COMP  PIC  S9(4).                                     
           02  E3BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E3BETRF.                                        
             03 E3BETRA    PICTURE X.                                           
           02  E3BETRI  PIC X(13).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4DATL    COMP  PIC  S9(4).                                      
           02  E4DATF    PICTURE X.                                             
           02  FILLER REDEFINES E4DATF.                                         
             03 E4DATA    PICTURE X.                                            
           02  E4DATI  PIC X(2).                                                
           02  E4DAML    COMP  PIC  S9(4).                                      
           02  E4DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E4DAMF.                                         
             03 E4DAMA    PICTURE X.                                            
           02  E4DAMI  PIC X(2).                                                
           02  E4DAJL    COMP  PIC  S9(4).                                      
           02  E4DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E4DAJF.                                         
             03 E4DAJA    PICTURE X.                                            
           02  E4DAJI  PIC X(4).                                                
           02  E4BETRL    COMP  PIC  S9(4).                                     
           02  E4BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E4BETRF.                                        
             03 E4BETRA    PICTURE X.                                           
           02  E4BETRI  PIC X(13).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5DATL    COMP  PIC  S9(4).                                      
           02  E5DATF    PICTURE X.                                             
           02  FILLER REDEFINES E5DATF.                                         
             03 E5DATA    PICTURE X.                                            
           02  E5DATI  PIC X(2).                                                
           02  E5DAML    COMP  PIC  S9(4).                                      
           02  E5DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E5DAMF.                                         
             03 E5DAMA    PICTURE X.                                            
           02  E5DAMI  PIC X(2).                                                
           02  E5DAJL    COMP  PIC  S9(4).                                      
           02  E5DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E5DAJF.                                         
             03 E5DAJA    PICTURE X.                                            
           02  E5DAJI  PIC X(4).                                                
           02  E5BETRL    COMP  PIC  S9(4).                                     
           02  E5BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E5BETRF.                                        
             03 E5BETRA    PICTURE X.                                           
           02  E5BETRI  PIC X(13).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6DATL    COMP  PIC  S9(4).                                      
           02  E6DATF    PICTURE X.                                             
           02  FILLER REDEFINES E6DATF.                                         
             03 E6DATA    PICTURE X.                                            
           02  E6DATI  PIC X(2).                                                
           02  E6DAML    COMP  PIC  S9(4).                                      
           02  E6DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E6DAMF.                                         
             03 E6DAMA    PICTURE X.                                            
           02  E6DAMI  PIC X(2).                                                
           02  E6DAJL    COMP  PIC  S9(4).                                      
           02  E6DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E6DAJF.                                         
             03 E6DAJA    PICTURE X.                                            
           02  E6DAJI  PIC X(4).                                                
           02  E6BETRL    COMP  PIC  S9(4).                                     
           02  E6BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E6BETRF.                                        
             03 E6BETRA    PICTURE X.                                           
           02  E6BETRI  PIC X(13).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7DATL    COMP  PIC  S9(4).                                      
           02  E7DATF    PICTURE X.                                             
           02  FILLER REDEFINES E7DATF.                                         
             03 E7DATA    PICTURE X.                                            
           02  E7DATI  PIC X(2).                                                
           02  E7DAML    COMP  PIC  S9(4).                                      
           02  E7DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E7DAMF.                                         
             03 E7DAMA    PICTURE X.                                            
           02  E7DAMI  PIC X(2).                                                
           02  E7DAJL    COMP  PIC  S9(4).                                      
           02  E7DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E7DAJF.                                         
             03 E7DAJA    PICTURE X.                                            
           02  E7DAJI  PIC X(4).                                                
           02  E7BETRL    COMP  PIC  S9(4).                                     
           02  E7BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E7BETRF.                                        
             03 E7BETRA    PICTURE X.                                           
           02  E7BETRI  PIC X(13).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8DATL    COMP  PIC  S9(4).                                      
           02  E8DATF    PICTURE X.                                             
           02  FILLER REDEFINES E8DATF.                                         
             03 E8DATA    PICTURE X.                                            
           02  E8DATI  PIC X(2).                                                
           02  E8DAML    COMP  PIC  S9(4).                                      
           02  E8DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E8DAMF.                                         
             03 E8DAMA    PICTURE X.                                            
           02  E8DAMI  PIC X(2).                                                
           02  E8DAJL    COMP  PIC  S9(4).                                      
           02  E8DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E8DAJF.                                         
             03 E8DAJA    PICTURE X.                                            
           02  E8DAJI  PIC X(4).                                                
           02  E8BETRL    COMP  PIC  S9(4).                                     
           02  E8BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E8BETRF.                                        
             03 E8BETRA    PICTURE X.                                           
           02  E8BETRI  PIC X(13).                                              
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9DATL    COMP  PIC  S9(4).                                      
           02  E9DATF    PICTURE X.                                             
           02  FILLER REDEFINES E9DATF.                                         
             03 E9DATA    PICTURE X.                                            
           02  E9DATI  PIC X(2).                                                
           02  E9DAML    COMP  PIC  S9(4).                                      
           02  E9DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E9DAMF.                                         
             03 E9DAMA    PICTURE X.                                            
           02  E9DAMI  PIC X(2).                                                
           02  E9DAJL    COMP  PIC  S9(4).                                      
           02  E9DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E9DAJF.                                         
             03 E9DAJA    PICTURE X.                                            
           02  E9DAJI  PIC X(4).                                                
           02  E9BETRL    COMP  PIC  S9(4).                                     
           02  E9BETRF    PICTURE X.                                            
           02  FILLER REDEFINES E9BETRF.                                        
             03 E9BETRA    PICTURE X.                                           
           02  E9BETRI  PIC X(13).                                              
           02  E10FCL    COMP  PIC  S9(4).                                      
           02  E10FCF    PICTURE X.                                             
           02  FILLER REDEFINES E10FCF.                                         
             03 E10FCA    PICTURE X.                                            
           02  E10FCI  PIC X(1).                                                
           02  E10DATL    COMP  PIC  S9(4).                                     
           02  E10DATF    PICTURE X.                                            
           02  FILLER REDEFINES E10DATF.                                        
             03 E10DATA    PICTURE X.                                           
           02  E10DATI  PIC X(2).                                               
           02  E10DAML    COMP  PIC  S9(4).                                     
           02  E10DAMF    PICTURE X.                                            
           02  FILLER REDEFINES E10DAMF.                                        
             03 E10DAMA    PICTURE X.                                           
           02  E10DAMI  PIC X(2).                                               
           02  E10DAJL    COMP  PIC  S9(4).                                     
           02  E10DAJF    PICTURE X.                                            
           02  FILLER REDEFINES E10DAJF.                                        
             03 E10DAJA    PICTURE X.                                           
           02  E10DAJI  PIC X(4).                                               
           02  E10BETRL    COMP  PIC  S9(4).                                    
           02  E10BETRF    PICTURE X.                                           
           02  FILLER REDEFINES E10BETRF.                                       
             03 E10BETRA    PICTURE X.                                          
           02  E10BETRI  PIC X(13).                                             
       01  BVB0030O REDEFINES BVB0030I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(33).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTATO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EKNRO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ASONDERO  PIC X(60).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWAEHRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9BETRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10DATO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10DAMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10DAJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10BETRO  PIC X(13).                                             
