       01  BVB0015I.                                                            
           02  FILLER PIC X(12).                                                
           02  EAUSWL    COMP  PIC  S9(4).                                      
           02  EAUSWF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSWF.                                         
             03 EAUSWA    PICTURE X.                                            
           02  EAUSWI  PIC X(1).                                                
           02  ASTNRL    COMP  PIC  S9(4).                                      
           02  ASTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ASTNRF.                                         
             03 ASTNRA    PICTURE X.                                            
           02  ASTNRI  PIC X(7).                                                
           02  ASTPRZL    COMP  PIC  S9(4).                                     
           02  ASTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ASTPRZF.                                        
             03 ASTPRZA    PICTURE X.                                           
           02  ASTPRZI  PIC X(1).                                               
           02  ATDVVERL    COMP  PIC  S9(4).                                    
           02  ATDVVERF    PICTURE X.                                           
           02  FILLER REDEFINES ATDVVERF.                                       
             03 ATDVVERA    PICTURE X.                                          
           02  ATDVVERI  PIC X(11).                                             
           02  EDVVERML    COMP  PIC  S9(4).                                    
           02  EDVVERMF    PICTURE X.                                           
           02  FILLER REDEFINES EDVVERMF.                                       
             03 EDVVERMA    PICTURE X.                                          
           02  EDVVERMI  PIC X(1).                                              
           02  EANREDEL    COMP  PIC  S9(4).                                    
           02  EANREDEF    PICTURE X.                                           
           02  FILLER REDEFINES EANREDEF.                                       
             03 EANREDEA    PICTURE X.                                          
           02  EANREDEI  PIC X(1).                                              
           02  EAKADL    COMP  PIC  S9(4).                                      
           02  EAKADF    PICTURE X.                                             
           02  FILLER REDEFINES EAKADF.                                         
             03 EAKADA    PICTURE X.                                            
           02  EAKADI  PIC X(10).                                               
           02  EADELL    COMP  PIC  S9(4).                                      
           02  EADELF    PICTURE X.                                             
           02  FILLER REDEFINES EADELF.                                         
             03 EADELA    PICTURE X.                                            
           02  EADELI  PIC X(10).                                               
           02  EVORNAML    COMP  PIC  S9(4).                                    
           02  EVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES EVORNAMF.                                       
             03 EVORNAMA    PICTURE X.                                          
           02  EVORNAMI  PIC X(20).                                             
           02  ENAMEL    COMP  PIC  S9(4).                                      
           02  ENAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ENAMEF.                                         
             03 ENAMEA    PICTURE X.                                            
           02  ENAMEI  PIC X(40).                                               
           02  EGEBDTL    COMP  PIC  S9(4).                                     
           02  EGEBDTF    PICTURE X.                                            
           02  FILLER REDEFINES EGEBDTF.                                        
             03 EGEBDTA    PICTURE X.                                           
           02  EGEBDTI  PIC X(2).                                               
           02  EGEBDML    COMP  PIC  S9(4).                                     
           02  EGEBDMF    PICTURE X.                                            
           02  FILLER REDEFINES EGEBDMF.                                        
             03 EGEBDMA    PICTURE X.                                           
           02  EGEBDMI  PIC X(2).                                               
           02  EGEBDJL    COMP  PIC  S9(4).                                     
           02  EGEBDJF    PICTURE X.                                            
           02  FILLER REDEFINES EGEBDJF.                                        
             03 EGEBDJA    PICTURE X.                                           
           02  EGEBDJI  PIC X(4).                                               
           02  EZUSTLL    COMP  PIC  S9(4).                                     
           02  EZUSTLF    PICTURE X.                                            
           02  FILLER REDEFINES EZUSTLF.                                        
             03 EZUSTLA    PICTURE X.                                           
           02  EZUSTLI  PIC X(2).                                               
           02  ESTRASSL    COMP  PIC  S9(4).                                    
           02  ESTRASSF    PICTURE X.                                           
           02  FILLER REDEFINES ESTRASSF.                                       
             03 ESTRASSA    PICTURE X.                                          
           02  ESTRASSI  PIC X(40).                                             
           02  EPLZAKTL    COMP  PIC  S9(4).                                    
           02  EPLZAKTF    PICTURE X.                                           
           02  FILLER REDEFINES EPLZAKTF.                                       
             03 EPLZAKTA    PICTURE X.                                          
           02  EPLZAKTI  PIC X(5).                                              
           02  EORTL    COMP  PIC  S9(4).                                       
           02  EORTF    PICTURE X.                                              
           02  FILLER REDEFINES EORTF.                                          
             03 EORTA    PICTURE X.                                             
           02  EORTI  PIC X(40).                                                
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  EAUSLI  PIC X(3).                                                
           02  ETELFONL    COMP  PIC  S9(4).                                    
           02  ETELFONF    PICTURE X.                                           
           02  FILLER REDEFINES ETELFONF.                                       
             03 ETELFONA    PICTURE X.                                          
           02  ETELFONI  PIC X(26).                                             
           02  ETELFAXL    COMP  PIC  S9(4).                                    
           02  ETELFAXF    PICTURE X.                                           
           02  FILLER REDEFINES ETELFAXF.                                       
             03 ETELFAXA    PICTURE X.                                          
           02  ETELFAXI  PIC X(26).                                             
           02  EMOBKDL    COMP  PIC  S9(4).                                     
           02  EMOBKDF    PICTURE X.                                            
           02  FILLER REDEFINES EMOBKDF.                                        
             03 EMOBKDA    PICTURE X.                                           
           02  EMOBKDI  PIC X(26).                                              
           02  EMATYPL    COMP  PIC  S9(4).                                     
           02  EMATYPF    PICTURE X.                                            
           02  FILLER REDEFINES EMATYPF.                                        
             03 EMATYPA    PICTURE X.                                           
           02  EMATYPI  PIC X(1).                                               
           02  EEINDTL    COMP  PIC  S9(4).                                     
           02  EEINDTF    PICTURE X.                                            
           02  FILLER REDEFINES EEINDTF.                                        
             03 EEINDTA    PICTURE X.                                           
           02  EEINDTI  PIC X(2).                                               
           02  EEINDML    COMP  PIC  S9(4).                                     
           02  EEINDMF    PICTURE X.                                            
           02  FILLER REDEFINES EEINDMF.                                        
             03 EEINDMA    PICTURE X.                                           
           02  EEINDMI  PIC X(2).                                               
           02  EEINDJL    COMP  PIC  S9(4).                                     
           02  EEINDJF    PICTURE X.                                            
           02  FILLER REDEFINES EEINDJF.                                        
             03 EEINDJA    PICTURE X.                                           
           02  EEINDJI  PIC X(4).                                               
           02  EMSNRL    COMP  PIC  S9(4).                                      
           02  EMSNRF    PICTURE X.                                             
           02  FILLER REDEFINES EMSNRF.                                         
             03 EMSNRA    PICTURE X.                                            
           02  EMSNRI  PIC X(4).                                                
           02  EDIRNRL    COMP  PIC  S9(4).                                     
           02  EDIRNRF    PICTURE X.                                            
           02  FILLER REDEFINES EDIRNRF.                                        
             03 EDIRNRA    PICTURE X.                                           
           02  EDIRNRI  PIC X(3).                                               
           02  EBETRNRL    COMP  PIC  S9(4).                                    
           02  EBETRNRF    PICTURE X.                                           
           02  FILLER REDEFINES EBETRNRF.                                       
             03 EBETRNRA    PICTURE X.                                          
           02  EBETRNRI  PIC X(7).                                              
           02  EBETPRZL    COMP  PIC  S9(4).                                    
           02  EBETPRZF    PICTURE X.                                           
           02  FILLER REDEFINES EBETPRZF.                                       
             03 EBETPRZA    PICTURE X.                                          
           02  EBETPRZI  PIC X(1).                                              
           02  EANWEL    COMP  PIC  S9(4).                                      
           02  EANWEF    PICTURE X.                                             
           02  FILLER REDEFINES EANWEF.                                         
             03 EANWEA    PICTURE X.                                            
           02  EANWEI  PIC X(7).                                                
           02  EASTPRZL    COMP  PIC  S9(4).                                    
           02  EASTPRZF    PICTURE X.                                           
           02  FILLER REDEFINES EASTPRZF.                                       
             03 EASTPRZA    PICTURE X.                                          
           02  EASTPRZI  PIC X(1).                                              
       01  BVB0015O REDEFINES BVB0015I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAUSWO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATDVVERO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  EDVVERMO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANREDEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAKADO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EADELO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVORNAMO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ENAMEO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGEBDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGEBDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGEBDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EZUSTLO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTRASSO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPLZAKTO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  EORTO  PIC X(40).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAUSLO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  ETELFONO  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  ETELFAXO  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  EMOBKDO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMATYPO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EMSNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDIRNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBETRNRO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBETPRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANWEO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EASTPRZO  PIC X(1).                                              
