       01  BVB0065I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(20).                                               
           02  AVORNAML    COMP  PIC  S9(4).                                    
           02  AVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVORNAMF.                                       
             03 AVORNAMA    PICTURE X.                                          
           02  AVORNAMI  PIC X(15).                                             
           02  ABTRNAML    COMP  PIC  S9(4).                                    
           02  ABTRNAMF    PICTURE X.                                           
           02  FILLER REDEFINES ABTRNAMF.                                       
             03 ABTRNAMA    PICTURE X.                                          
           02  ABTRNAMI  PIC X(16).                                             
           02  ABVABTL    COMP  PIC  S9(4).                                     
           02  ABVABTF    PICTURE X.                                            
           02  FILLER REDEFINES ABVABTF.                                        
             03 ABVABTA    PICTURE X.                                           
           02  ABVABTI  PIC X(2).                                               
           02  ABVABML    COMP  PIC  S9(4).                                     
           02  ABVABMF    PICTURE X.                                            
           02  FILLER REDEFINES ABVABMF.                                        
             03 ABVABMA    PICTURE X.                                           
           02  ABVABMI  PIC X(2).                                               
           02  ABVABJL    COMP  PIC  S9(4).                                     
           02  ABVABJF    PICTURE X.                                            
           02  FILLER REDEFINES ABVABJF.                                        
             03 ABVABJA    PICTURE X.                                           
           02  ABVABJI  PIC X(4).                                               
           02  ASPERREL    COMP  PIC  S9(4).                                    
           02  ASPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ASPERREF.                                       
             03 ASPERREA    PICTURE X.                                          
           02  ASPERREI  PIC X(1).                                              
           02  ESPERREL    COMP  PIC  S9(4).                                    
           02  ESPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ESPERREF.                                       
             03 ESPERREA    PICTURE X.                                          
           02  ESPERREI  PIC X(1).                                              
           02  AIBANL    COMP  PIC  S9(4).                                      
           02  AIBANF    PICTURE X.                                             
           02  FILLER REDEFINES AIBANF.                                         
             03 AIBANA    PICTURE X.                                            
           02  AIBANI  PIC X(1).                                                
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  EIBANI  PIC X(34).                                               
           02  ABLZL    COMP  PIC  S9(4).                                       
           02  ABLZF    PICTURE X.                                              
           02  FILLER REDEFINES ABLZF.                                          
             03 ABLZA    PICTURE X.                                             
           02  ABLZI  PIC X(1).                                                 
           02  EBLZL    COMP  PIC  S9(4).                                       
           02  EBLZF    PICTURE X.                                              
           02  FILLER REDEFINES EBLZF.                                          
             03 EBLZA    PICTURE X.                                             
           02  EBLZI  PIC X(8).                                                 
           02  ABANKL    COMP  PIC  S9(4).                                      
           02  ABANKF    PICTURE X.                                             
           02  FILLER REDEFINES ABANKF.                                         
             03 ABANKA    PICTURE X.                                            
           02  ABANKI  PIC X(1).                                                
           02  EBANKL    COMP  PIC  S9(4).                                      
           02  EBANKF    PICTURE X.                                             
           02  FILLER REDEFINES EBANKF.                                         
             03 EBANKA    PICTURE X.                                            
           02  EBANKI  PIC X(40).                                               
           02  AKTONRL    COMP  PIC  S9(4).                                     
           02  AKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES AKTONRF.                                        
             03 AKTONRA    PICTURE X.                                           
           02  AKTONRI  PIC X(1).                                               
           02  EKTONRL    COMP  PIC  S9(4).                                     
           02  EKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES EKTONRF.                                        
             03 EKTONRA    PICTURE X.                                           
           02  EKTONRI  PIC X(20).                                              
           02  ABVINHL    COMP  PIC  S9(4).                                     
           02  ABVINHF    PICTURE X.                                            
           02  FILLER REDEFINES ABVINHF.                                        
             03 ABVINHA    PICTURE X.                                           
           02  ABVINHI  PIC X(1).                                               
           02  EBVINHL    COMP  PIC  S9(4).                                     
           02  EBVINHF    PICTURE X.                                            
           02  FILLER REDEFINES EBVINHF.                                        
             03 EBVINHA    PICTURE X.                                           
           02  EBVINHI  PIC X(40).                                              
       01  BVB0065O REDEFINES BVB0065I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORNAMO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABTRNAMO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABVABTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABVABMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABVABJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIBANO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EIBANO  PIC X(34).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABLZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBLZO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ABANKO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBANKO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKTONRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKTONRO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABVINHO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBVINHO  PIC X(40).                                              
