       01  BVB0025I.                                                            
           02  FILLER PIC X(12).                                                
           02  PERS3L    COMP  PIC  S9(4).                                      
           02  PERS3F    PICTURE X.                                             
           02  FILLER REDEFINES PERS3F.                                         
             03 PERS3A    PICTURE X.                                            
           02  PERS3I  PIC X(7).                                                
           02  DATUM3L    COMP  PIC  S9(4).                                     
           02  DATUM3F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM3F.                                        
             03 DATUM3A    PICTURE X.                                           
           02  DATUM3I  PIC X(8).                                               
           02  UHR3L    COMP  PIC  S9(4).                                       
           02  UHR3F    PICTURE X.                                              
           02  FILLER REDEFINES UHR3F.                                          
             03 UHR3A    PICTURE X.                                             
           02  UHR3I  PIC X(5).                                                 
           02  VBSTAT3L    COMP  PIC  S9(4).                                    
           02  VBSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES VBSTAT3F.                                       
             03 VBSTAT3A    PICTURE X.                                          
           02  VBSTAT3I  PIC X(12).                                             
           02  DAT3L    COMP  PIC  S9(4).                                       
           02  DAT3F    PICTURE X.                                              
           02  FILLER REDEFINES DAT3F.                                          
             03 DAT3A    PICTURE X.                                             
           02  DAT3I  PIC X(5).                                                 
           02  TEXT3L    COMP  PIC  S9(4).                                      
           02  TEXT3F    PICTURE X.                                             
           02  FILLER REDEFINES TEXT3F.                                         
             03 TEXT3A    PICTURE X.                                            
           02  TEXT3I  PIC X(5).                                                
           02  STUFE3L    COMP  PIC  S9(4).                                     
           02  STUFE3F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE3F.                                        
             03 STUFE3A    PICTURE X.                                           
           02  STUFE3I  PIC X(4).                                               
           02  NAME3L    COMP  PIC  S9(4).                                      
           02  NAME3F    PICTURE X.                                             
           02  FILLER REDEFINES NAME3F.                                         
             03 NAME3A    PICTURE X.                                            
           02  NAME3I  PIC X(28).                                               
           02  DIR3L    COMP  PIC  S9(4).                                       
           02  DIR3F    PICTURE X.                                              
           02  FILLER REDEFINES DIR3F.                                          
             03 DIR3A    PICTURE X.                                             
           02  DIR3I  PIC X(3).                                                 
           02  STR31L    COMP  PIC  S9(4).                                      
           02  STR31F    PICTURE X.                                             
           02  FILLER REDEFINES STR31F.                                         
             03 STR31A    PICTURE X.                                            
           02  STR31I  PIC X(1).                                                
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  B3Z05L    COMP  PIC  S9(4).                                      
           02  B3Z05F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z05F.                                         
             03 B3Z05A    PICTURE X.                                            
           02  B3Z05I  PIC X(79).                                               
           02  B3Z06L    COMP  PIC  S9(4).                                      
           02  B3Z06F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z06F.                                         
             03 B3Z06A    PICTURE X.                                            
           02  B3Z06I  PIC X(79).                                               
           02  B3Z07L    COMP  PIC  S9(4).                                      
           02  B3Z07F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z07F.                                         
             03 B3Z07A    PICTURE X.                                            
           02  B3Z07I  PIC X(79).                                               
           02  B3Z08L    COMP  PIC  S9(4).                                      
           02  B3Z08F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z08F.                                         
             03 B3Z08A    PICTURE X.                                            
           02  B3Z08I  PIC X(79).                                               
           02  B3Z09L    COMP  PIC  S9(4).                                      
           02  B3Z09F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z09F.                                         
             03 B3Z09A    PICTURE X.                                            
           02  B3Z09I  PIC X(79).                                               
           02  B3Z10L    COMP  PIC  S9(4).                                      
           02  B3Z10F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z10F.                                         
             03 B3Z10A    PICTURE X.                                            
           02  B3Z10I  PIC X(79).                                               
           02  B3Z11L    COMP  PIC  S9(4).                                      
           02  B3Z11F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z11F.                                         
             03 B3Z11A    PICTURE X.                                            
           02  B3Z11I  PIC X(79).                                               
           02  B3Z12L    COMP  PIC  S9(4).                                      
           02  B3Z12F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z12F.                                         
             03 B3Z12A    PICTURE X.                                            
           02  B3Z12I  PIC X(79).                                               
           02  B3Z13L    COMP  PIC  S9(4).                                      
           02  B3Z13F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z13F.                                         
             03 B3Z13A    PICTURE X.                                            
           02  B3Z13I  PIC X(79).                                               
           02  B3Z14L    COMP  PIC  S9(4).                                      
           02  B3Z14F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z14F.                                         
             03 B3Z14A    PICTURE X.                                            
           02  B3Z14I  PIC X(79).                                               
           02  B3Z15L    COMP  PIC  S9(4).                                      
           02  B3Z15F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z15F.                                         
             03 B3Z15A    PICTURE X.                                            
           02  B3Z15I  PIC X(79).                                               
           02  B3Z16L    COMP  PIC  S9(4).                                      
           02  B3Z16F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z16F.                                         
             03 B3Z16A    PICTURE X.                                            
           02  B3Z16I  PIC X(79).                                               
           02  B3Z17L    COMP  PIC  S9(4).                                      
           02  B3Z17F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z17F.                                         
             03 B3Z17A    PICTURE X.                                            
           02  B3Z17I  PIC X(79).                                               
           02  B3Z18L    COMP  PIC  S9(4).                                      
           02  B3Z18F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z18F.                                         
             03 B3Z18A    PICTURE X.                                            
           02  B3Z18I  PIC X(79).                                               
           02  B3Z19L    COMP  PIC  S9(4).                                      
           02  B3Z19F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z19F.                                         
             03 B3Z19A    PICTURE X.                                            
           02  B3Z19I  PIC X(79).                                               
           02  B3Z20L    COMP  PIC  S9(4).                                      
           02  B3Z20F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z20F.                                         
             03 B3Z20A    PICTURE X.                                            
           02  B3Z20I  PIC X(79).                                               
           02  B3Z21L    COMP  PIC  S9(4).                                      
           02  B3Z21F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z21F.                                         
             03 B3Z21A    PICTURE X.                                            
           02  B3Z21I  PIC X(79).                                               
           02  B3Z22L    COMP  PIC  S9(4).                                      
           02  B3Z22F    PICTURE X.                                             
           02  FILLER REDEFINES B3Z22F.                                         
             03 B3Z22A    PICTURE X.                                            
           02  B3Z22I  PIC X(79).                                               
           02  VBNR31L    COMP  PIC  S9(4).                                     
           02  VBNR31F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR31F.                                        
             03 VBNR31A    PICTURE X.                                           
           02  VBNR31I  PIC X(7).                                               
           02  LMON3L    COMP  PIC  S9(4).                                      
           02  LMON3F    PICTURE X.                                             
           02  FILLER REDEFINES LMON3F.                                         
             03 LMON3A    PICTURE X.                                            
           02  LMON3I  PIC X(2).                                                
           02  VOND3L    COMP  PIC  S9(4).                                      
           02  VOND3F    PICTURE X.                                             
           02  FILLER REDEFINES VOND3F.                                         
             03 VOND3A    PICTURE X.                                            
           02  VOND3I  PIC X(4).                                                
           02  BISD3L    COMP  PIC  S9(4).                                      
           02  BISD3F    PICTURE X.                                             
           02  FILLER REDEFINES BISD3F.                                         
             03 BISD3A    PICTURE X.                                            
           02  BISD3I  PIC X(4).                                                
           02  ANW3L    COMP  PIC  S9(4).                                       
           02  ANW3F    PICTURE X.                                              
           02  FILLER REDEFINES ANW3F.                                          
             03 ANW3A    PICTURE X.                                             
           02  ANW3I  PIC X(4).                                                 
           02  FEHL3L    COMP  PIC  S9(4).                                      
           02  FEHL3F    PICTURE X.                                             
           02  FILLER REDEFINES FEHL3F.                                         
             03 FEHL3A    PICTURE X.                                            
           02  FEHL3I  PIC X(79).                                               
       01  BVB0025O REDEFINES BVB0025I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBSTAT3O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  DAT3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TEXT3O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE3O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME3O  PIC X(28).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIR3O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STR31O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  B3Z05O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z06O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z07O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z08O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z09O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z10O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z11O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z12O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z13O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z14O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z15O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z16O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z17O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z18O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z19O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z20O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z21O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  B3Z22O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR31O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  LMON3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VOND3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  BISD3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANW3O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  FEHL3O  PIC X(79).                                               
