      *   Mainframe Express 3.1  6.018.0057
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-65)
      *   MapSet Name   BPA0047
      *   Date Created  03/07/2018
      *   Time Created  14:25:55

      *  Input Data For Map BPA0047
         01 BPA0047I.
            03 FILLER                         PIC X(12).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EPRODSLL                       PIC S9(4) COMP.
            03 EPRODSLF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODSLI                       PIC X(3).
            03 APRODBML                       PIC S9(4) COMP.
            03 APRODBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRODBMI                       PIC X(10).
            03 ASEIFBL                        PIC S9(4) COMP.
            03 ASEIFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIFBI                        PIC X(6).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(3).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(3).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(12).
            03 EPGTARIL                       PIC S9(4) COMP.
            03 EPGTARIF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPGTARII                       PIC X(15).
            03 EABTTL                         PIC S9(4) COMP.
            03 EABTTF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EABTTI                         PIC X(2).
            03 EABMML                         PIC S9(4) COMP.
            03 EABMMF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EABMMI                         PIC X(2).
            03 EABJJL                         PIC S9(4) COMP.
            03 EABJJF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EABJJI                         PIC X(4).
            03 EBISTTL                        PIC S9(4) COMP.
            03 EBISTTF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EBISTTI                        PIC X(2).
            03 EBISMML                        PIC S9(4) COMP.
            03 EBISMMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EBISMMI                        PIC X(2).
            03 EBISJJL                        PIC S9(4) COMP.
            03 EBISJJF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EBISJJI                        PIC X(4).
            03 AFCFBL                         PIC S9(4) COMP.
            03 AFCFBF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AFCFBI                         PIC X(2).
            03 DFHG001I                       OCCURS 11 TIMES.
               05 EFCZL                          PIC S9(4) COMP.
               05 EFCZF                          PIC X.
               05 FILLER                         PIC X(1).
               05 EFCZI                          PIC X(1).
               05 EPRODSTL                       PIC S9(4) COMP.
               05 EPRODSTF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EPRODSTI                       PIC X(3).
               05 APRODBLL                       PIC S9(4) COMP.
               05 APRODBLF                       PIC X.
               05 FILLER                         PIC X(1).
               05 APRODBLI                       PIC X(20).
               05 EPGTARTL                       PIC S9(4) COMP.
               05 EPGTARTF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EPGTARTI                       PIC X(15).
               05 EGABTTL                        PIC S9(4) COMP.
               05 EGABTTF                        PIC X.
               05 FILLER                         PIC X(1).
               05 EGABTTI                        PIC X(2).
               05 EGABMML                        PIC S9(4) COMP.
               05 EGABMMF                        PIC X.
               05 FILLER                         PIC X(1).
               05 EGABMMI                        PIC X(2).
               05 EGABJJL                        PIC S9(4) COMP.
               05 EGABJJF                        PIC X.
               05 FILLER                         PIC X(1).
               05 EGABJJI                        PIC X(4).
               05 EGBISTTL                       PIC S9(4) COMP.
               05 EGBISTTF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EGBISTTI                       PIC X(2).
               05 EGBISMML                       PIC S9(4) COMP.
               05 EGBISMMF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EGBISMMI                       PIC X(2).
               05 EGBISJJL                       PIC S9(4) COMP.
               05 EGBISJJF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EGBISJJI                       PIC X(4).
               05 AVGESL                         PIC S9(4) COMP.
               05 AVGESF                         PIC X.
               05 FILLER                         PIC X(1).
               05 AVGESI                         PIC X(9).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(79).

      *  Output Data For Map BPA0047
         01 BPA0047O REDEFINES BPA0047I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 EGESA                          PIC X.
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EPRODSLA                       PIC X.
            03 EPRODSLH                       PIC X.
            03 EPRODSLO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 APRODBMA                       PIC X.
            03 APRODBMH                       PIC X.
            03 APRODBMO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 ASEIFBA                        PIC X.
            03 ASEIFBH                        PIC X.
            03 ASEIFBO                        PIC X(6).
            03 FILLER                         PIC X(2).
            03 ESEIAKTA                       PIC X.
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 ASEISTRA                       PIC X.
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEIGESA                       PIC X.
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(12).
            03 FILLER                         PIC X(2).
            03 EPGTARIA                       PIC X.
            03 EPGTARIH                       PIC X.
            03 EPGTARIO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EABTTA                         PIC X.
            03 EABTTH                         PIC X.
            03 EABTTO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 EABMMA                         PIC X.
            03 EABMMH                         PIC X.
            03 EABMMO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 EABJJA                         PIC X.
            03 EABJJH                         PIC X.
            03 EABJJO                         PIC X(4).
            03 FILLER                         PIC X(2).
            03 EBISTTA                        PIC X.
            03 EBISTTH                        PIC X.
            03 EBISTTO                        PIC X(2).
            03 FILLER                         PIC X(2).
            03 EBISMMA                        PIC X.
            03 EBISMMH                        PIC X.
            03 EBISMMO                        PIC X(2).
            03 FILLER                         PIC X(2).
            03 EBISJJA                        PIC X.
            03 EBISJJH                        PIC X.
            03 EBISJJO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AFCFBA                         PIC X.
            03 AFCFBH                         PIC X.
            03 AFCFBO                         PIC X(2).
            03 DFHG001O OCCURS 11.
               05 FILLER                         PIC X(2).
               05 EFCZA                          PIC X.
               05 EFCZH                          PIC X.
               05 EFCZO                          PIC X(1).
               05 FILLER                         PIC X(2).
               05 EPRODSTA                       PIC X.
               05 EPRODSTH                       PIC X.
               05 EPRODSTO                       PIC X(3).
               05 FILLER                         PIC X(2).
               05 APRODBLA                       PIC X.
               05 APRODBLH                       PIC X.
               05 APRODBLO                       PIC X(20).
               05 FILLER                         PIC X(2).
               05 EPGTARTA                       PIC X.
               05 EPGTARTH                       PIC X.
               05 EPGTARTO                       PIC X(15).
               05 FILLER                         PIC X(2).
               05 EGABTTA                        PIC X.
               05 EGABTTH                        PIC X.
               05 EGABTTO                        PIC X(2).
               05 FILLER                         PIC X(2).
               05 EGABMMA                        PIC X.
               05 EGABMMH                        PIC X.
               05 EGABMMO                        PIC X(2).
               05 FILLER                         PIC X(2).
               05 EGABJJA                        PIC X.
               05 EGABJJH                        PIC X.
               05 EGABJJO                        PIC X(4).
               05 FILLER                         PIC X(2).
               05 EGBISTTA                       PIC X.
               05 EGBISTTH                       PIC X.
               05 EGBISTTO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 EGBISMMA                       PIC X.
               05 EGBISMMH                       PIC X.
               05 EGBISMMO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 EGBISJJA                       PIC X.
               05 EGBISJJH                       PIC X.
               05 EGBISJJO                       PIC X(4).
               05 FILLER                         PIC X(2).
               05 AVGESA                         PIC X.
               05 AVGESH                         PIC X.
               05 AVGESO                         PIC X(9).
            03 FILLER                         PIC X(2).
            03 AFCANZA                        PIC X.
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(79).


