      *   Mainframe Express 3.1  6.018.0057
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-65)
      *   MapSet Name   BPA0025
      *   Date Created  09/25/2018
      *   Time Created  14:58:31

      *  Input Data For Map BPA0025
         01 BPA0025I.
            03 FILLER                         PIC X(12).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(9).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 EUNRL                          PIC S9(4) COMP.
            03 EUNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EUNRI                          PIC X(3).
            03 ESCHICHL                       PIC S9(4) COMP.
            03 ESCHICHF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESCHICHI                       PIC X(3).
            03 ASEIFBL                        PIC S9(4) COMP.
            03 ASEIFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIFBI                        PIC X(6).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(3).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(3).
            03 EPRODSLL                       PIC S9(4) COMP.
            03 EPRODSLF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODSLI                       PIC X(3).
            03 APRODBML                       PIC S9(4) COMP.
            03 APRODBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRODBMI                       PIC X(10).
            03 EFAEVTTL                       PIC S9(4) COMP.
            03 EFAEVTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVTTI                       PIC X(2).
            03 EFAEVMML                       PIC S9(4) COMP.
            03 EFAEVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVMMI                       PIC X(2).
            03 EFAEVJJL                       PIC S9(4) COMP.
            03 EFAEVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVJJI                       PIC X(4).
            03 EFAEBTTL                       PIC S9(4) COMP.
            03 EFAEBTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBTTI                       PIC X(2).
            03 EFAEBMML                       PIC S9(4) COMP.
            03 EFAEBMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBMMI                       PIC X(2).
            03 EFAEBJJL                       PIC S9(4) COMP.
            03 EFAEBJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBJJI                       PIC X(4).
            03 EFOLGNRL                       PIC S9(4) COMP.
            03 EFOLGNRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFOLGNRI                       PIC X(3).
            03 EABRVMML                       PIC S9(4) COMP.
            03 EABRVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EABRVMMI                       PIC X(2).
            03 EABRVJJL                       PIC S9(4) COMP.
            03 EABRVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EABRVJJI                       PIC X(4).
            03 EABRBMML                       PIC S9(4) COMP.
            03 EABRBMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EABRBMMI                       PIC X(2).
            03 EABRBJJL                       PIC S9(4) COMP.
            03 EABRBJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EABRBJJI                       PIC X(4).
            03 AKENBEZL                       PIC S9(4) COMP.
            03 AKENBEZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKENBEZI                       PIC X(8).
            03 EGELKENL                       PIC S9(4) COMP.
            03 EGELKENF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EGELKENI                       PIC X(6).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(17).
            03 ANAMEFBL                       PIC S9(4) COMP.
            03 ANAMEFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEFBI                       PIC X(5).
            03 ANAMEL                         PIC S9(4) COMP.
            03 ANAMEF                         PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEI                         PIC X(25).
            03 AFCFBL                         PIC S9(4) COMP.
            03 AFCFBF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AFCFBI                         PIC X(2).
            03 APRFB1L                        PIC S9(4) COMP.
            03 APRFB1F                        PIC X.
            03 FILLER                         PIC X(1).
            03 APRFB1I                        PIC X(4).
            03 AORDFB1L                       PIC S9(4) COMP.
            03 AORDFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AORDFB1I                       PIC X(3).
            03 AFAVFB1L                       PIC S9(4) COMP.
            03 AFAVFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAVFB1I                       PIC X(6).
            03 AFABFB1L                       PIC S9(4) COMP.
            03 AFABFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFABFB1I                       PIC X(10).
            03 AHISFB1L                       PIC S9(4) COMP.
            03 AHISFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHISFB1I                       PIC X(3).
            03 AVSTFB1L                       PIC S9(4) COMP.
            03 AVSTFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTFB1I                       PIC X(5).
            03 AABRFB1L                       PIC S9(4) COMP.
            03 AABRFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRFB1I                       PIC X(8).
            03 ADBVFB1L                       PIC S9(4) COMP.
            03 ADBVFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADBVFB1I                       PIC X(3).
            03 AGPBFB1L                       PIC S9(4) COMP.
            03 AGPBFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGPBFB1I                       PIC X(12).
            03 AEINFB1L                       PIC S9(4) COMP.
            03 AEINFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEINFB1I                       PIC X(6).
            03 APRFB2L                        PIC S9(4) COMP.
            03 APRFB2F                        PIC X.
            03 FILLER                         PIC X(1).
            03 APRFB2I                        PIC X(4).
            03 AORDFB2L                       PIC S9(4) COMP.
            03 AORDFB2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AORDFB2I                       PIC X(3).
            03 AFAVFB2L                       PIC S9(4) COMP.
            03 AFAVFB2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAVFB2I                       PIC X(6).
            03 AFABFB2L                       PIC S9(4) COMP.
            03 AFABFB2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFABFB2I                       PIC X(10).
            03 AHISFB2L                       PIC S9(4) COMP.
            03 AHISFB2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHISFB2I                       PIC X(3).
            03 AABRFB2L                       PIC S9(4) COMP.
            03 AABRFB2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRFB2I                       PIC X(8).
            03 DFHG001I                       OCCURS 9 TIMES.
               05 EFCL                           PIC S9(4) COMP.
               05 EFCF                           PIC X.
               05 FILLER                         PIC X(1).
               05 EFCI                           PIC X(1).
               05 AZINFOL                        PIC S9(4) COMP.
               05 AZINFOF                        PIC X.
               05 FILLER                         PIC X(1).
               05 AZINFOI                        PIC X(2).
               05 APRODSLL                       PIC S9(4) COMP.
               05 APRODSLF                       PIC X.
               05 FILLER                         PIC X(1).
               05 APRODSLI                       PIC X(3).
               05 AORDNRL                        PIC S9(4) COMP.
               05 AORDNRF                        PIC X.
               05 FILLER                         PIC X(1).
               05 AORDNRI                        PIC X(2).
               05 AFAEVONL                       PIC S9(4) COMP.
               05 AFAEVONF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AFAEVONI                       PIC X(10).
               05 AFAEBISL                       PIC S9(4) COMP.
               05 AFAEBISF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AFAEBISI                       PIC X(10).
               05 AHISTNRL                       PIC S9(4) COMP.
               05 AHISTNRF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AHISTNRI                       PIC X(2).
               05 AVSTATL                        PIC S9(4) COMP.
               05 AVSTATF                        PIC X.
               05 FILLER                         PIC X(1).
               05 AVSTATI                        PIC X(4).
               05 AABRDATL                       PIC S9(4) COMP.
               05 AABRDATF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AABRDATI                       PIC X(7).
               05 EDGVL                          PIC S9(4) COMP.
               05 EDGVF                          PIC X.
               05 FILLER                         PIC X(1).
               05 EDGVI                          PIC X(5).
               05 AGPVBTGL                       PIC S9(4) COMP.
               05 AGPVBTGF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AGPVBTGI                       PIC X(12).
               05 AEINHL                         PIC S9(4) COMP.
               05 AEINHF                         PIC X.
               05 FILLER                         PIC X(1).
               05 AEINHI                         PIC X(8).
            03 AEINFB2L                       PIC S9(4) COMP.
            03 AEINFB2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEINFB2I                       PIC X(6).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(79).

      *  Output Data For Map BPA0025
         01 BPA0025O REDEFINES BPA0025I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 EGESA                          PIC X.
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(9).
            03 FILLER                         PIC X(2).
            03 EVNRA                          PIC X.
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(2).
            03 EUNRA                          PIC X.
            03 EUNRH                          PIC X.
            03 EUNRO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 ESCHICHA                       PIC X.
            03 ESCHICHH                       PIC X.
            03 ESCHICHO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 ASEIFBA                        PIC X.
            03 ASEIFBH                        PIC X.
            03 ASEIFBO                        PIC X(6).
            03 FILLER                         PIC X(2).
            03 ESEIAKTA                       PIC X.
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 ASEISTRA                       PIC X.
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEIGESA                       PIC X.
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 EPRODSLA                       PIC X.
            03 EPRODSLH                       PIC X.
            03 EPRODSLO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 APRODBMA                       PIC X.
            03 APRODBMH                       PIC X.
            03 APRODBMO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 EFAEVTTA                       PIC X.
            03 EFAEVTTH                       PIC X.
            03 EFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVMMA                       PIC X.
            03 EFAEVMMH                       PIC X.
            03 EFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVJJA                       PIC X.
            03 EFAEVJJH                       PIC X.
            03 EFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EFAEBTTA                       PIC X.
            03 EFAEBTTH                       PIC X.
            03 EFAEBTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEBMMA                       PIC X.
            03 EFAEBMMH                       PIC X.
            03 EFAEBMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEBJJA                       PIC X.
            03 EFAEBJJH                       PIC X.
            03 EFAEBJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EFOLGNRA                       PIC X.
            03 EFOLGNRH                       PIC X.
            03 EFOLGNRO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 EABRVMMA                       PIC X.
            03 EABRVMMH                       PIC X.
            03 EABRVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EABRVJJA                       PIC X.
            03 EABRVJJH                       PIC X.
            03 EABRVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EABRBMMA                       PIC X.
            03 EABRBMMH                       PIC X.
            03 EABRBMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EABRBJJA                       PIC X.
            03 EABRBJJH                       PIC X.
            03 EABRBJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AKENBEZA                       PIC X.
            03 AKENBEZH                       PIC X.
            03 AKENBEZO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 EGELKENA                       PIC X.
            03 EGELKENH                       PIC X.
            03 EGELKENO                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(17).
            03 FILLER                         PIC X(2).
            03 ANAMEFBA                       PIC X.
            03 ANAMEFBH                       PIC X.
            03 ANAMEFBO                       PIC X(5).
            03 FILLER                         PIC X(2).
            03 ANAMEA                         PIC X.
            03 ANAMEH                         PIC X.
            03 ANAMEO                         PIC X(25).
            03 FILLER                         PIC X(2).
            03 AFCFBA                         PIC X.
            03 AFCFBH                         PIC X.
            03 AFCFBO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 APRFB1A                        PIC X.
            03 APRFB1H                        PIC X.
            03 APRFB1O                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AORDFB1A                       PIC X.
            03 AORDFB1H                       PIC X.
            03 AORDFB1O                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFAVFB1A                       PIC X.
            03 AFAVFB1H                       PIC X.
            03 AFAVFB1O                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 AFABFB1A                       PIC X.
            03 AFABFB1H                       PIC X.
            03 AFABFB1O                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AHISFB1A                       PIC X.
            03 AHISFB1H                       PIC X.
            03 AHISFB1O                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AVSTFB1A                       PIC X.
            03 AVSTFB1H                       PIC X.
            03 AVSTFB1O                       PIC X(5).
            03 FILLER                         PIC X(2).
            03 AABRFB1A                       PIC X.
            03 AABRFB1H                       PIC X.
            03 AABRFB1O                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 ADBVFB1A                       PIC X.
            03 ADBVFB1H                       PIC X.
            03 ADBVFB1O                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AGPBFB1A                       PIC X.
            03 AGPBFB1H                       PIC X.
            03 AGPBFB1O                       PIC X(12).
            03 FILLER                         PIC X(2).
            03 AEINFB1A                       PIC X.
            03 AEINFB1H                       PIC X.
            03 AEINFB1O                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 APRFB2A                        PIC X.
            03 APRFB2H                        PIC X.
            03 APRFB2O                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AORDFB2A                       PIC X.
            03 AORDFB2H                       PIC X.
            03 AORDFB2O                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFAVFB2A                       PIC X.
            03 AFAVFB2H                       PIC X.
            03 AFAVFB2O                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 AFABFB2A                       PIC X.
            03 AFABFB2H                       PIC X.
            03 AFABFB2O                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AHISFB2A                       PIC X.
            03 AHISFB2H                       PIC X.
            03 AHISFB2O                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AABRFB2A                       PIC X.
            03 AABRFB2H                       PIC X.
            03 AABRFB2O                       PIC X(8).
            03 DFHG001O OCCURS 9.
               05 FILLER                         PIC X(2).
               05 EFCA                           PIC X.
               05 EFCH                           PIC X.
               05 EFCO                           PIC X(1).
               05 FILLER                         PIC X(2).
               05 AZINFOA                        PIC X.
               05 AZINFOH                        PIC X.
               05 AZINFOO                        PIC X(2).
               05 FILLER                         PIC X(2).
               05 APRODSLA                       PIC X.
               05 APRODSLH                       PIC X.
               05 APRODSLO                       PIC X(3).
               05 FILLER                         PIC X(2).
               05 AORDNRA                        PIC X.
               05 AORDNRH                        PIC X.
               05 AORDNRO                        PIC X(2).
               05 FILLER                         PIC X(2).
               05 AFAEVONA                       PIC X.
               05 AFAEVONH                       PIC X.
               05 AFAEVONO                       PIC X(10).
               05 FILLER                         PIC X(2).
               05 AFAEBISA                       PIC X.
               05 AFAEBISH                       PIC X.
               05 AFAEBISO                       PIC X(10).
               05 FILLER                         PIC X(2).
               05 AHISTNRA                       PIC X.
               05 AHISTNRH                       PIC X.
               05 AHISTNRO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 AVSTATA                        PIC X.
               05 AVSTATH                        PIC X.
               05 AVSTATO                        PIC X(4).
               05 FILLER                         PIC X(2).
               05 AABRDATA                       PIC X.
               05 AABRDATH                       PIC X.
               05 AABRDATO                       PIC X(7).
               05 FILLER                         PIC X(2).
               05 EDGVA                          PIC X.
               05 EDGVH                          PIC X.
               05 EDGVO                          PIC X(5).
               05 FILLER                         PIC X(2).
               05 AGPVBTGA                       PIC X.
               05 AGPVBTGH                       PIC X.
               05 AGPVBTGO                       PIC X(12).
               05 FILLER                         PIC X(2).
               05 AEINHA                         PIC X.
               05 AEINHH                         PIC X.
               05 AEINHO                         PIC X(8).
            03 FILLER                         PIC X(2).
            03 AEINFB2A                       PIC X.
            03 AEINFB2H                       PIC X.
            03 AEINFB2O                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 AFCANZA                        PIC X.
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(79).


