      *   Mainframe Express 3.1  6.013.0041
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-57)
      *   MapSet Name   BPA0054
      *   Date Created  08/10/2017
      *   Time Created  14:49:51

      *  Input Data For Map BPA0054
         01 BPA0054I.
            03 FILLER                         PIC X(12).
            03 AGESFBL                        PIC S9(4) COMP.
            03 AGESFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESFBI                        PIC X(4).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 APINFBL                        PIC S9(4) COMP.
            03 APINFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 APINFBI                        PIC X(4).
            03 EPINL                          PIC S9(4) COMP.
            03 EPINF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPINI                          PIC X(9).
            03 EPINPZL                        PIC S9(4) COMP.
            03 EPINPZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPINPZI                        PIC X(2).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(30).
            03 AVERSL                         PIC S9(4) COMP.
            03 AVERSF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSI                         PIC X(3).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVGESBML                       PIC S9(4) COMP.
            03 AVGESBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESBMI                       PIC X(4).
            03 AERKZFBL                       PIC S9(4) COMP.
            03 AERKZFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AERKZFBI                       PIC X(8).
            03 AERSTKZL                       PIC S9(4) COMP.
            03 AERSTKZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AERSTKZI                       PIC X(1).
            03 ALUPDDAL                       PIC S9(4) COMP.
            03 ALUPDDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDDAI                       PIC X(10).
            03 ALUPDUSL                       PIC S9(4) COMP.
            03 ALUPDUSF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDUSI                       PIC X(8).
            03 ATNRTXTL                       PIC S9(4) COMP.
            03 ATNRTXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ATNRTXTI                       PIC X(9).
            03 ETNRL                          PIC S9(4) COMP.
            03 ETNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 ETNRI                          PIC X(10).
            03 EKNAMEL                        PIC S9(4) COMP.
            03 EKNAMEF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKNAMEI                        PIC X(25).
            03 EFAEVTTL                       PIC S9(4) COMP.
            03 EFAEVTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVTTI                       PIC X(2).
            03 EFAEVMML                       PIC S9(4) COMP.
            03 EFAEVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVMMI                       PIC X(2).
            03 EFAEVJJL                       PIC S9(4) COMP.
            03 EFAEVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVJJI                       PIC X(4).
            03 EKVNAMEL                       PIC S9(4) COMP.
            03 EKVNAMEF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKVNAMEI                       PIC X(20).
            03 AFAEBFBL                       PIC S9(4) COMP.
            03 AFAEBFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBFBI                       PIC X(11).
            03 EFAEBTTL                       PIC S9(4) COMP.
            03 EFAEBTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBTTI                       PIC X(2).
            03 EFAEBMML                       PIC S9(4) COMP.
            03 EFAEBMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBMMI                       PIC X(2).
            03 EFAEBJJL                       PIC S9(4) COMP.
            03 EFAEBJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEBJJI                       PIC X(4).
            03 EAVERML                        PIC S9(4) COMP.
            03 EAVERMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMI                        PIC X(7).
            03 EAVERMPL                       PIC S9(4) COMP.
            03 EAVERMPF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMPI                       PIC X(1).
            03 AABRETTL                       PIC S9(4) COMP.
            03 AABRETTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRETTI                       PIC X(2).
            03 AABREMML                       PIC S9(4) COMP.
            03 AABREMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREMMI                       PIC X(2).
            03 AABREJJL                       PIC S9(4) COMP.
            03 AABREJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREJJI                       PIC X(4).
            03 AVBEGFBL                       PIC S9(4) COMP.
            03 AVBEGFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVBEGFBI                       PIC X(15).
            03 EVBEGTTL                       PIC S9(4) COMP.
            03 EVBEGTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGTTI                       PIC X(2).
            03 EVBEGMML                       PIC S9(4) COMP.
            03 EVBEGMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGMMI                       PIC X(2).
            03 EVBEGJJL                       PIC S9(4) COMP.
            03 EVBEGJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGJJI                       PIC X(4).
            03 AVENDTXL                       PIC S9(4) COMP.
            03 AVENDTXF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVENDTXI                       PIC X(15).
            03 EVENDTTL                       PIC S9(4) COMP.
            03 EVENDTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDTTI                       PIC X(2).
            03 EVENDMML                       PIC S9(4) COMP.
            03 EVENDMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDMMI                       PIC X(2).
            03 EVENDJJL                       PIC S9(4) COMP.
            03 EVENDJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDJJI                       PIC X(4).
            03 EWAEBKL                        PIC S9(4) COMP.
            03 EWAEBKF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EWAEBKI                        PIC X(4).
            03 AHFKZFBL                       PIC S9(4) COMP.
            03 AHFKZFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AAHFKZFBI                      PIC X(08).
            03 EHAFTKZL                       PIC S9(4) COMP.
            03 EHAFTKZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHAFTKZI                       PIC X(2).
            03 AZHLWFBL                       PIC S9(4) COMP.
            03 AZHLWFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLWFBI                       PIC X(13).
            03 EZHLWL                         PIC S9(4) COMP.
            03 EZHLWF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZHLWI                         PIC X(2).
            03 AZHLTXTL                       PIC S9(4) COMP.
            03 AZHLTXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLTXTI                       PIC X(10).
            03 APFLSTXL                       PIC S9(4) COMP.
            03 APFLSTXF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APFLSTXI                       PIC X(19).
            03 EBPFLSUL                       PIC S9(4) COMP.
            03 EBPFLSUF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EBPFLSUI                       PIC X(13).
            03 AEDATFBL                       PIC S9(4) COMP.
            03 AEDATFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEDATFBI                       PIC X(25).
            03 EEDATTTL                       PIC S9(4) COMP.
            03 EEDATTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EEDATTTI                       PIC X(2).
            03 EEDATMML                       PIC S9(4) COMP.
            03 EEDATMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EEDATMMI                       PIC X(2).
            03 EEDATJJL                       PIC S9(4) COMP.
            03 EEDATJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EEDATJJI                       PIC X(4).
            03 AGPROVBL                       PIC S9(4) COMP.
            03 AGPROVBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGPROVBI                       PIC X(13).
            03 ASPKZFBL                       PIC S9(4) COMP.
            03 ASPKZFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASPKZFBI                       PIC X(21).
            03 ESPLIKZL                       PIC S9(4) COMP.
            03 ESPLIKZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESPLIKZI                       PIC X(1).
            03 AVERPFBL                       PIC S9(4) COMP.
            03 AVERPFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERPFBI                       PIC X(19).
            03 EVERSPNL                       PIC S9(4) COMP.
            03 EVERSPNF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVERSPNI                       PIC X(2).
            03 AVTTXTL                        PIC S9(4) COMP.
            03 AVTTXTF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVTTXTI                        PIC X(3).
            03 EVTL                           PIC S9(4) COMP.
            03 EVTF                           PIC X.
            03 FILLER                         PIC X(1).
            03 EVTI                           PIC X(3).

            03 AFBLZTXL                       PIC S9(4) COMP.
            03 AFBLZTXF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBLZTXI                       PIC X(18).
            03 ELFZEITL                       PIC S9(4) COMP.
            03 ELFZEITF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELFZEITI                       PIC X(4).
            03 APGVFBL                        PIC S9(4) COMP.
            03 APGVFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGVFBI                        PIC X(4).
            03 AKZFBL                         PIC S9(4) COMP.
            03 AKZFBF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AKZFBI                         PIC X(2).
            03 ASUBETXL                       PIC S9(4) COMP.
            03 ASUBETXF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASUBETXI                       PIC X(7).
            03 EPGVL                          PIC S9(4) COMP.
            03 EPGVF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPGVI                          PIC X(4).
            03 APGPGVL                        PIC S9(4) COMP.
            03 APGPGVF                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGPGVI                        PIC X(4).
            03 APGVKZL                        PIC S9(4) COMP.
            03 APGVKZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGVKZI                        PIC X(1).
            03 EPRODL                         PIC S9(4) COMP.
            03 EPRODF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODI                         PIC X(3).
            03 EPGTARIL                       PIC S9(4) COMP.
            03 EPGTARIF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPGTARII                       PIC X(15).
            03 EPPFLSUL                       PIC S9(4) COMP.
            03 EPPFLSUF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPPFLSUI                       PIC X(14).
            03 EPROVSL                        PIC S9(4) COMP.
            03 EPROVSF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVSI                        PIC X(9).
            03 EPROVBL                        PIC S9(4) COMP.
            03 EPROVBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVBI                        PIC X(15).
            03 AFCZANZL                       PIC S9(4) COMP.
            03 AFCZANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZANZI                       PIC X(79).

      *  Output Data For Map BPA0054
         01 BPA0054O REDEFINES BPA0054I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 AGESFBA                        PIC X.
            03 AGESFBH                        PIC X.
            03 AGESFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 EGESA                          PIC X.
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EVNRA                          PIC X.
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(2).
            03 APINFBA                        PIC X.
            03 APINFBH                        PIC X.
            03 APINFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 EPINA                          PIC X.
            03 EPINH                          PIC X.
            03 EPINO                          PIC X(9).
            03 FILLER                         PIC X(2).
            03 EPINPZA                        PIC X.
            03 EPINPZH                        PIC X.
            03 EPINPZO                        PIC X(2).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(30).
            03 FILLER                         PIC X(2).
            03 AVERSA                         PIC X.
            03 AVERSH                         PIC X.
            03 AVERSO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 AVSTATA                        PIC X.
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVGESBMA                       PIC X.
            03 AVGESBMH                       PIC X.
            03 AVGESBMO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AERKZFBA                       PIC X.
            03 AERKZFBH                       PIC X.
            03 AERKZFBO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 AERSTKZA                       PIC X.
            03 AERSTKZH                       PIC X.
            03 AERSTKZO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ALUPDDAA                       PIC X.
            03 ALUPDDAH                       PIC X.
            03 ALUPDDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 ALUPDUSA                       PIC X.
            03 ALUPDUSH                       PIC X.
            03 ALUPDUSO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 ATNRTXTA                       PIC X.
            03 ATNRTXTH                       PIC X.
            03 ATNRTXTO                       PIC X(9).
            03 FILLER                         PIC X(2).
            03 ETNRA                          PIC X.
            03 ETNRH                          PIC X.
            03 ETNRO                          PIC X(10).
            03 FILLER                         PIC X(2).
            03 EKNAMEA                        PIC X.
            03 EKNAMEH                        PIC X.
            03 EKNAMEO                        PIC X(25).
            03 FILLER                         PIC X(2).
            03 EFAEVTTA                       PIC X.
            03 EFAEVTTH                       PIC X.
            03 EFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVMMA                       PIC X.
            03 EFAEVMMH                       PIC X.
            03 EFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVJJA                       PIC X.
            03 EFAEVJJH                       PIC X.
            03 EFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EKVNAMEA                       PIC X.
            03 EKVNAMEH                       PIC X.
            03 EKVNAMEO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 AFAEBFBA                       PIC X.
            03 AFAEBFBH                       PIC X.
            03 AFAEBFBO                       PIC X(11).
            03 FILLER                         PIC X(2).
            03 EFAEBTTA                       PIC X.
            03 EFAEBTTH                       PIC X.
            03 EFAEBTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEBMMA                       PIC X.
            03 EFAEBMMH                       PIC X.
            03 EFAEBMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEBJJA                       PIC X.
            03 EFAEBJJH                       PIC X.
            03 EFAEBJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EAVERMA                        PIC X.
            03 EAVERMH                        PIC X.
            03 EAVERMO                        PIC X(7).
            03 FILLER                         PIC X(2).
            03 EAVERMPA                       PIC X.
            03 EAVERMPH                       PIC X.
            03 EAVERMPO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 AABRETTA                       PIC X.
            03 AABRETTH                       PIC X.
            03 AABRETTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AABREMMA                       PIC X.
            03 AABREMMH                       PIC X.
            03 AABREMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AABREJJA                       PIC X.
            03 AABREJJH                       PIC X.
            03 AABREJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVBEGFBA                       PIC X.
            03 AVBEGFBH                       PIC X.
            03 AVBEGFBO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EVBEGTTA                       PIC X.
            03 EVBEGTTH                       PIC X.
            03 EVBEGTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVBEGMMA                       PIC X.
            03 EVBEGMMH                       PIC X.
            03 EVBEGMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVBEGJJA                       PIC X.
            03 EVBEGJJH                       PIC X.
            03 EVBEGJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVENDTXA                       PIC X.
            03 AVENDTXH                       PIC X.
            03 AVENDTXO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EVENDTTA                       PIC X.
            03 EVENDTTH                       PIC X.
            03 EVENDTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVENDMMA                       PIC X.
            03 EVENDMMH                       PIC X.
            03 EVENDMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVENDJJA                       PIC X.
            03 EVENDJJH                       PIC X.
            03 EVENDJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EWAEBKA                        PIC X.
            03 EWAEBKH                        PIC X.
            03 EWAEBKO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AHFKZFBA                       PIC X.
            03 AHFKZFBH                       PIC X.
            03 AHFKZFBO                       PIC X(08).
            03 FILLER                         PIC X(2).
            03 EHAFTKZA                       PIC X.
            03 EHAFTKZH                       PIC X.
            03 EHAFTKZO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AZHLWFBA                       PIC X.
            03 AZHLWFBH                       PIC X.
            03 AZHLWFBO                       PIC X(13).
            03 FILLER                         PIC X(2).
            03 EZHLWA                         PIC X.
            03 EZHLWH                         PIC X.
            03 EZHLWO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 AZHLTXTA                       PIC X.
            03 AZHLTXTH                       PIC X.
            03 AZHLTXTO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 APFLSTXA                       PIC X.
            03 APFLSTXH                       PIC X.
            03 APFLSTXO                       PIC X(19).
            03 FILLER                         PIC X(2).
            03 EBPFLSUA                       PIC X.
            03 EBPFLSUH                       PIC X.
            03 EBPFLSUO                       PIC X(13).
            03 FILLER                         PIC X(2).
            03 AEDATFBA                       PIC X.
            03 AEDATFBH                       PIC X.
            03 AEDATFBO                       PIC X(25).
            03 FILLER                         PIC X(2).
            03 EEDATTTA                       PIC X.
            03 EEDATTTH                       PIC X.
            03 EEDATTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EEDATMMA                       PIC X.
            03 EEDATMMH                       PIC X.
            03 EEDATMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EEDATJJA                       PIC X.
            03 EEDATJJH                       PIC X.
            03 EEDATJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AGPROVBA                       PIC X.
            03 AGPROVBH                       PIC X.
            03 AGPROVBO                       PIC X(13).
            03 FILLER                         PIC X(2).
            03 ASPKZFBA                       PIC X.
            03 ASPKZFBH                       PIC X.
            03 ASPKZFBO                       PIC X(21).
            03 FILLER                         PIC X(2).
            03 ESPLIKZA                       PIC X.
            03 ESPLIKZH                       PIC X.
            03 ESPLIKZO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 AVERPFBA                       PIC X.
            03 AVERPFBH                       PIC X.
            03 AVERPFBO                       PIC X(19).
            03 FILLER                         PIC X(2).
            03 EVERSPNA                       PIC X.
            03 EVERSPNH                       PIC X.
            03 EVERSPNO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AVTTXTA                        PIC X.
            03 AVTTXTH                        PIC X.
            03 AVTTXTO                        PIC X(3).
            03 FILLER                         PIC X(2).
            03 EVTA                           PIC X.
            03 EVTH                           PIC X.
            03 EVTO                           PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFBLZTXA                       PIC X.
            03 AFBLZTXH                       PIC X.
            03 AFBLZTXO                       PIC X(18).
            03 FILLER                         PIC X(2).
            03 ELFZEITA                       PIC X.
            03 ELFZEITH                       PIC X.
            03 ELFZEITO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 APGVFBA                        PIC X.
            03 APGVFBH                        PIC X.
            03 APGVFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AKZFBA                         PIC X.
            03 AKZFBH                         PIC X.
            03 AKZFBO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 ASUBETXA                       PIC X.
            03 ASUBETXH                       PIC X.
            03 ASUBETXO                       PIC X(7).
            03 FILLER                         PIC X(2).
            03 EPGVA                          PIC X.
            03 EPGVH                          PIC X.
            03 EPGVO                          PIC X(4).
            03 FILLER                         PIC X(2).
            03 APGPGVA                        PIC X.
            03 APGPGVH                        PIC X.
            03 APGPGVO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 APGVKZA                        PIC X.
            03 APGVKZH                        PIC X.
            03 APGVKZO                        PIC X(1).
            03 FILLER                         PIC X(2).
            03 EPRODA                         PIC X.
            03 EPRODH                         PIC X.
            03 EPRODO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 EPGTARIA                       PIC X.
            03 EPGTARIH                       PIC X.
            03 EPGTARIO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EPPFLSUA                       PIC X.
            03 EPPFLSUH                       PIC X.
            03 EPPFLSUO                       PIC X(14).
            03 FILLER                         PIC X(2).
            03 EPROVSA                        PIC X.
            03 EPROVSH                        PIC X.
            03 EPROVSO                        PIC X(9).
            03 FILLER                         PIC X(2).
            03 EPROVBA                        PIC X.
            03 EPROVBH                        PIC X.
            03 EPROVBO                        PIC X(15).
            03 FILLER                         PIC X(2).
            03 AFCZANZA                       PIC X.
            03 AFCZANZH                       PIC X.
            03 AFCZANZO                       PIC X(79).



