      *   Mainframe Express 3.1  6.013.0041
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-57)
      *   MapSet Name   BPA0068
      *   Date Created  04/18/2017
      *   Time Created  16:29:35

      *  Input Data For Map BPA0068
         01 BPA0068I.
            03 FILLER                         PIC X(12).
            03 AGESFBL                        PIC S9(4) COMP.
            03 AGESFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESFBI                        PIC X(4).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 EWAEBKL                        PIC S9(4) COMP.
            03 EWAEBKF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EWAEBKI                        PIC X(3).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(30).
            03 AVERSL                         PIC S9(4) COMP.
            03 AVERSF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSI                         PIC X(3).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVGESBML                       PIC S9(4) COMP.
            03 AVGESBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESBMI                       PIC X(4).
            03 ALUPDDAL                       PIC S9(4) COMP.
            03 ALUPDDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDDAI                       PIC X(10).
            03 ALUPDUSL                       PIC S9(4) COMP.
            03 ALUPDUSF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDUSI                       PIC X(8).
            03 EKNAMEL                        PIC S9(4) COMP.
            03 EKNAMEF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKNAMEI                        PIC X(25).
            03 EFAEVTTL                       PIC S9(4) COMP.
            03 EFAEVTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVTTI                       PIC X(2).
            03 EFAEVMML                       PIC S9(4) COMP.
            03 EFAEVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVMMI                       PIC X(2).
            03 EFAEVJJL                       PIC S9(4) COMP.
            03 EFAEVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVJJI                       PIC X(4).
            03 EKVNAMEL                       PIC S9(4) COMP.
            03 EKVNAMEF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKVNAMEI                       PIC X(20).
            03 AABRETTL                       PIC S9(4) COMP.
            03 AABRETTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRETTI                       PIC X(2).
            03 AABREMML                       PIC S9(4) COMP.
            03 AABREMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREMMI                       PIC X(2).
            03 AABREJJL                       PIC S9(4) COMP.
            03 AABREJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREJJI                       PIC X(4).
            03 EAVERML                        PIC S9(4) COMP.
            03 EAVERMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMI                        PIC X(7).
            03 EAVERMPL                       PIC S9(4) COMP.
            03 EAVERMPF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMPI                       PIC X(1).
            03 EVBEGTTL                       PIC S9(4) COMP.
            03 EVBEGTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGTTI                       PIC X(2).
            03 EVBEGMML                       PIC S9(4) COMP.
            03 EVBEGMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGMMI                       PIC X(2).
            03 EVBEGJJL                       PIC S9(4) COMP.
            03 EVBEGJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGJJI                       PIC X(4).
            03 EVERBRL                        PIC S9(4) COMP.
            03 EVERBRF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVERBRI                        PIC X(10).
            03 EGESBTRL                       PIC S9(4) COMP.
            03 EGESBTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EGESBTRI                       PIC X(15).
            03 ELFZEITL                       PIC S9(4) COMP.
            03 ELFZEITF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELFZEITI                       PIC X(2).
            03 EUMSATZL                       PIC S9(4) COMP.
            03 EUMSATZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMSATZI                       PIC X(7).
            03 EZAEHLNL                       PIC S9(4) COMP.
            03 EZAEHLNF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EZAEHLNI                       PIC X(20).
            03 EUMSBTRL                       PIC S9(4) COMP.
            03 EUMSBTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMSBTRI                       PIC X(15).
            03 ESTOGRDL                       PIC S9(4) COMP.
            03 ESTOGRDF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESTOGRDI                       PIC X(2).
            03 ASTOTXTL                       PIC S9(4) COMP.
            03 ASTOTXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTOTXTI                       PIC X(20).
            03 EPGPARTL                       PIC S9(4) COMP.
            03 EPGPARTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPGPARTI                       PIC X(2).
            03 APARTXTL                       PIC S9(4) COMP.
            03 APARTXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APARTXTI                       PIC X(20).
            03 ETARBEZL                       PIC S9(4) COMP.
            03 ETARBEZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ETARBEZI                       PIC X(50).
            03 EPGVL                          PIC S9(4) COMP.
            03 EPGVF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPGVI                          PIC X(4).
            03 EPRODL                         PIC S9(4) COMP.
            03 EPRODF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODI                         PIC X(3).
            03 APGTARIL                       PIC S9(4) COMP.
            03 APGTARIF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APGTARII                       PIC X(15).
            03 EPPFLSUL                       PIC S9(4) COMP.
            03 EPPFLSUF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPPFLSUI                       PIC X(15).
            03 EPROVSL                        PIC S9(4) COMP.
            03 EPROVSF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVSI                        PIC X(9).
            03 EPROVBL                        PIC S9(4) COMP.
            03 EPROVBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVBI                        PIC X(13).
            03 AFCZANZL                       PIC S9(4) COMP.
            03 AFCZANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZANZI                       PIC X(79).

      *  Output Data For Map BPA0068
         01 BPA0068O REDEFINES BPA0068I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 AGESFBA                        PIC X.
            03 AGESFBH                        PIC X.
            03 AGESFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 EGESA                          PIC X.
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EVNRA                          PIC X.
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(2).
            03 EWAEBKA                        PIC X.
            03 EWAEBKH                        PIC X.
            03 EWAEBKO                        PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(30).
            03 FILLER                         PIC X(2).
            03 AVERSA                         PIC X.
            03 AVERSH                         PIC X.
            03 AVERSO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 AVSTATA                        PIC X.
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVGESBMA                       PIC X.
            03 AVGESBMH                       PIC X.
            03 AVGESBMO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 ALUPDDAA                       PIC X.
            03 ALUPDDAH                       PIC X.
            03 ALUPDDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 ALUPDUSA                       PIC X.
            03 ALUPDUSH                       PIC X.
            03 ALUPDUSO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 EKNAMEA                        PIC X.
            03 EKNAMEH                        PIC X.
            03 EKNAMEO                        PIC X(25).
            03 FILLER                         PIC X(2).
            03 EFAEVTTA                       PIC X.
            03 EFAEVTTH                       PIC X.
            03 EFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVMMA                       PIC X.
            03 EFAEVMMH                       PIC X.
            03 EFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVJJA                       PIC X.
            03 EFAEVJJH                       PIC X.
            03 EFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EKVNAMEA                       PIC X.
            03 EKVNAMEH                       PIC X.
            03 EKVNAMEO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 AABRETTA                       PIC X.
            03 AABRETTH                       PIC X.
            03 AABRETTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AABREMMA                       PIC X.
            03 AABREMMH                       PIC X.
            03 AABREMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AABREJJA                       PIC X.
            03 AABREJJH                       PIC X.
            03 AABREJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EAVERMA                        PIC X.
            03 EAVERMH                        PIC X.
            03 EAVERMO                        PIC X(7).
            03 FILLER                         PIC X(2).
            03 EAVERMPA                       PIC X.
            03 EAVERMPH                       PIC X.
            03 EAVERMPO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 EVBEGTTA                       PIC X.
            03 EVBEGTTH                       PIC X.
            03 EVBEGTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVBEGMMA                       PIC X.
            03 EVBEGMMH                       PIC X.
            03 EVBEGMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVBEGJJA                       PIC X.
            03 EVBEGJJH                       PIC X.
            03 EVBEGJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVERBRA                        PIC X.
            03 EVERBRH                        PIC X.
            03 EVERBRO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EGESBTRA                       PIC X.
            03 EGESBTRH                       PIC X.
            03 EGESBTRO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 ELFZEITA                       PIC X.
            03 ELFZEITH                       PIC X.
            03 ELFZEITO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUMSATZA                       PIC X.
            03 EUMSATZH                       PIC X.
            03 EUMSATZO                       PIC X(7).
            03 FILLER                         PIC X(2).
            03 EZAEHLNA                       PIC X.
            03 EZAEHLNH                       PIC X.
            03 EZAEHLNO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 EUMSBTRA                       PIC X.
            03 EUMSBTRH                       PIC X.
            03 EUMSBTRO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 ESTOGRDA                       PIC X.
            03 ESTOGRDH                       PIC X.
            03 ESTOGRDO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 ASTOTXTA                       PIC X.
            03 ASTOTXTH                       PIC X.
            03 ASTOTXTO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 EPGPARTA                       PIC X.
            03 EPGPARTH                       PIC X.
            03 EPGPARTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 APARTXTA                       PIC X.
            03 APARTXTH                       PIC X.
            03 APARTXTO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 ETARBEZA                       PIC X.
            03 ETARBEZH                       PIC X.
            03 ETARBEZO                       PIC X(50).
            03 FILLER                         PIC X(2).
            03 EPGVA                          PIC X.
            03 EPGVH                          PIC X.
            03 EPGVO                          PIC X(4).
            03 FILLER                         PIC X(2).
            03 EPRODA                         PIC X.
            03 EPRODH                         PIC X.
            03 EPRODO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 APGTARIA                       PIC X.
            03 APGTARIH                       PIC X.
            03 APGTARIO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EPPFLSUA                       PIC X.
            03 EPPFLSUH                       PIC X.
            03 EPPFLSUO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EPROVSA                        PIC X.
            03 EPROVSH                        PIC X.
            03 EPROVSO                        PIC X(9).
            03 FILLER                         PIC X(2).
            03 EPROVBA                        PIC X.
            03 EPROVBH                        PIC X.
            03 EPROVBO                        PIC X(13).
            03 FILLER                         PIC X(2).
            03 AFCZANZA                       PIC X.
            03 AFCZANZH                       PIC X.
            03 AFCZANZO                       PIC X(79).


