      *   Mainframe Express 3.1  6.018.0057
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-65)
      *   MapSet Name   BPA0029
      *   Date Created  05/15/2018
      *   Time Created  11:12:03

      *  Input Data For Map BPA0029
         01 BPA0029I.
            03 FILLER                         PIC X(12).
            03 APINFBL                        PIC S9(4) COMP.
            03 APINFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 APINFBI                        PIC X(4).
            03 APINL                          PIC S9(4) COMP.
            03 APINF                          PIC X.
            03 FILLER                         PIC X(1).
            03 APINI                          PIC X(9).
            03 APRODSLL                       PIC S9(4) COMP.
            03 APRODSLF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRODSLI                       PIC X(3).
            03 AORDNFBL                       PIC S9(4) COMP.
            03 AORDNFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AORDNFBI                       PIC X(8).
            03 AORDNRL                        PIC S9(4) COMP.
            03 AORDNRF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AORDNRI                        PIC X(2).
            03 AFAEVONL                       PIC S9(4) COMP.
            03 AFAEVONF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVONI                       PIC X(10).
            03 AFAEBISL                       PIC S9(4) COMP.
            03 AFAEBISF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBISI                       PIC X(10).
            03 AFGNRL                         PIC S9(4) COMP.
            03 AFGNRF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AFGNRI                         PIC X(3).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(20).
            03 ANAMEFBL                       PIC S9(4) COMP.
            03 ANAMEFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEFBI                       PIC X(5).
            03 AKDNAMEL                       PIC S9(4) COMP.
            03 AKDNAMEF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKDNAMEI                       PIC X(25).
            03 AHISTNRL                       PIC S9(4) COMP.
            03 AHISTNRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHISTNRI                       PIC X(3).
            03 ABWSUFBL                       PIC S9(4) COMP.
            03 ABWSUFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABWSUFBI                       PIC X(17).
            03 ABEWSUML                       PIC S9(4) COMP.
            03 ABEWSUMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABEWSUMI                       PIC X(14).
            03 ARBWSFBL                       PIC S9(4) COMP.
            03 ARBWSFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARBWSFBI                       PIC X(28).
            03 ARBEWSUL                       PIC S9(4) COMP.
            03 ARBEWSUF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARBEWSUI                       PIC X(14).
            03 APAL                           PIC S9(4) COMP.
            03 APAF                           PIC X.
            03 FILLER                         PIC X(1).
            03 APAI                           PIC X(2).
            03 ADGVL                          PIC S9(4) COMP.
            03 ADGVF                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADGVI                          PIC X(5).
            03 AVMKZL                         PIC S9(4) COMP.
            03 AVMKZF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVMKZI                         PIC X(4).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVVGKFBL                       PIC S9(4) COMP.
            03 AVVGKFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVVGKFBI                       PIC X(7).
            03 AVVGKZL                        PIC S9(4) COMP.
            03 AVVGKZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVVGKZI                        PIC X(1).
            03 ABRUTFBL                       PIC S9(4) COMP.
            03 ABRUTFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABRUTFBI                       PIC X(19).
            03 ABRUTTOL                       PIC S9(4) COMP.
            03 ABRUTTOF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABRUTTOI                       PIC X(14).
            03 APPFDFBL                       PIC S9(4) COMP.
            03 APPFDFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFDFBI                       PIC X(25).
            03 APPFBEGL                       PIC S9(4) COMP.
            03 APPFBEGF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFBEGI                       PIC X(10).
            03 APPFBTGL                       PIC S9(4) COMP.
            03 APPFBTGF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFBTGI                       PIC X(14).
            03 AGRPL                          PIC S9(4) COMP.
            03 AGRPF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGRPI                          PIC X(13).
            03 AWAEHRGL                       PIC S9(4) COMP.
            03 AWAEHRGF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AWAEHRGI                       PIC X(4).
            03 AGSPL                          PIC S9(4) COMP.
            03 AGSPF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGSPI                          PIC X(14).
            03 APOVVFBL                       PIC S9(4) COMP.
            03 APOVVFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APOVVFBI                       PIC X(15).
            03 APROVVRL                       PIC S9(4) COMP.
            03 APROVVRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 APROVVRI                       PIC X(5).
            03 ANTOFBL                        PIC S9(4) COMP.
            03 ANTOFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ANTOFBI                        PIC X(6).
            03 AFBKENNL                       PIC S9(4) COMP.
            03 AFBKENNF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBKENNI                       PIC X(8).
            03 AGLKENNL                       PIC S9(4) COMP.
            03 AGLKENNF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGLKENNI                       PIC X(6).
            03 ASEIFBL                        PIC S9(4) COMP.
            03 ASEIFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIFBI                        PIC X(5).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(2).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(2).
            03 AKZFBL                         PIC S9(4) COMP.
            03 AKZFBF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AKZFBI                         PIC X(2).
            03 DFHG001I                       OCCURS 7 TIMES.
               05 APROEMPL                       PIC S9(4) COMP.
               05 APROEMPF                       PIC X.
               05 FILLER                         PIC X(1).
               05 APROEMPI                       PIC X(7).
               05 APEPRFZL                       PIC S9(4) COMP.
               05 APEPRFZF                       PIC X.
               05 FILLER                         PIC X(1).
               05 APEPRFZI                       PIC X(1).
               05 APENKL                         PIC S9(4) COMP.
               05 APENKF                         PIC X.
               05 FILLER                         PIC X(1).
               05 APENKI                         PIC X(20).
               05 ADIPROVL                       PIC S9(4) COMP.
               05 ADIPROVF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ADIPROVI                       PIC X(3).
               05 AAZBTGL                        PIC S9(4) COMP.
               05 AAZBTGF                        PIC X.
               05 FILLER                         PIC X(1).
               05 AAZBTGI                        PIC X(11).
               05 ARCKBTGL                       PIC S9(4) COMP.
               05 ARCKBTGF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ARCKBTGI                       PIC X(11).
               05 AKZPPFLL                       PIC S9(4) COMP.
               05 AKZPPFLF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AKZPPFLI                       PIC X(2).
               05 ABUDATL                        PIC S9(4) COMP.
               05 ABUDATF                        PIC X.
               05 FILLER                         PIC X(1).
               05 ABUDATI                        PIC X(10).
            03 AGESL                          PIC S9(4) COMP.
            03 AGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 AVNRL                          PIC S9(4) COMP.
            03 AVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AVNRI                          PIC X(15).
            03 AUNUML                         PIC S9(4) COMP.
            03 AUNUMF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNUMI                         PIC X(3).
            03 ASCHINRL                       PIC S9(4) COMP.
            03 ASCHINRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASCHINRI                       PIC X(3).

      *  Output Data For Map BPA0029
         01 BPA0029O REDEFINES BPA0029I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 APINFBA                        PIC X.
            03 APINFBH                        PIC X.
            03 APINFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 APINA                          PIC X.
            03 APINH                          PIC X.
            03 APINO                          PIC X(9).
            03 FILLER                         PIC X(2).
            03 APRODSLA                       PIC X.
            03 APRODSLH                       PIC X.
            03 APRODSLO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 AORDNFBA                       PIC X.
            03 AORDNFBH                       PIC X.
            03 AORDNFBO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 AORDNRA                        PIC X.
            03 AORDNRH                        PIC X.
            03 AORDNRO                        PIC X(2).
            03 FILLER                         PIC X(2).
            03 AFAEVONA                       PIC X.
            03 AFAEVONH                       PIC X.
            03 AFAEVONO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AFAEBISA                       PIC X.
            03 AFAEBISH                       PIC X.
            03 AFAEBISO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AFGNRA                         PIC X.
            03 AFGNRH                         PIC X.
            03 AFGNRO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 ANAMEFBA                       PIC X.
            03 ANAMEFBH                       PIC X.
            03 ANAMEFBO                       PIC X(5).
            03 FILLER                         PIC X(2).
            03 AKDNAMEA                       PIC X.
            03 AKDNAMEH                       PIC X.
            03 AKDNAMEO                       PIC X(25).
            03 FILLER                         PIC X(2).
            03 AHISTNRA                       PIC X.
            03 AHISTNRH                       PIC X.
            03 AHISTNRO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 ABWSUFBA                       PIC X.
            03 ABWSUFBH                       PIC X.
            03 ABWSUFBO                       PIC X(17).
            03 FILLER                         PIC X(2).
            03 ABEWSUMA                       PIC X.
            03 ABEWSUMH                       PIC X.
            03 ABEWSUMO                       PIC X(14).
            03 FILLER                         PIC X(2).
            03 ARBWSFBA                       PIC X.
            03 ARBWSFBH                       PIC X.
            03 ARBWSFBO                       PIC X(28).
            03 FILLER                         PIC X(2).
            03 ARBEWSUA                       PIC X.
            03 ARBEWSUH                       PIC X.
            03 ARBEWSUO                       PIC X(14).
            03 FILLER                         PIC X(2).
            03 APAA                           PIC X.
            03 APAH                           PIC X.
            03 APAO                           PIC X(2).
            03 FILLER                         PIC X(2).
            03 ADGVA                          PIC X.
            03 ADGVH                          PIC X.
            03 ADGVO                          PIC X(5).
            03 FILLER                         PIC X(2).
            03 AVMKZA                         PIC X.
            03 AVMKZH                         PIC X.
            03 AVMKZO                         PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVSTATA                        PIC X.
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVVGKFBA                       PIC X.
            03 AVVGKFBH                       PIC X.
            03 AVVGKFBO                       PIC X(7).
            03 FILLER                         PIC X(2).
            03 AVVGKZA                        PIC X.
            03 AVVGKZH                        PIC X.
            03 AVVGKZO                        PIC X(1).
            03 FILLER                         PIC X(2).
            03 ABRUTFBA                       PIC X.
            03 ABRUTFBH                       PIC X.
            03 ABRUTFBO                       PIC X(19).
            03 FILLER                         PIC X(2).
            03 ABRUTTOA                       PIC X.
            03 ABRUTTOH                       PIC X.
            03 ABRUTTOO                       PIC X(14).
            03 FILLER                         PIC X(2).
            03 APPFDFBA                       PIC X.
            03 APPFDFBH                       PIC X.
            03 APPFDFBO                       PIC X(25).
            03 FILLER                         PIC X(2).
            03 APPFBEGA                       PIC X.
            03 APPFBEGH                       PIC X.
            03 APPFBEGO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 APPFBTGA                       PIC X.
            03 APPFBTGH                       PIC X.
            03 APPFBTGO                       PIC X(14).
            03 FILLER                         PIC X(2).
            03 AGRPA                          PIC X.
            03 AGRPH                          PIC X.
            03 AGRPO                          PIC X(13).
            03 FILLER                         PIC X(2).
            03 AWAEHRGA                       PIC X.
            03 AWAEHRGH                       PIC X.
            03 AWAEHRGO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AGSPA                          PIC X.
            03 AGSPH                          PIC X.
            03 AGSPO                          PIC X(14).
            03 FILLER                         PIC X(2).
            03 APOVVFBA                       PIC X.
            03 APOVVFBH                       PIC X.
            03 APOVVFBO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 APROVVRA                       PIC X.
            03 APROVVRH                       PIC X.
            03 APROVVRO                       PIC X(5).
            03 FILLER                         PIC X(2).
            03 ANTOFBA                        PIC X.
            03 ANTOFBH                        PIC X.
            03 ANTOFBO                        PIC X(6).
            03 FILLER                         PIC X(2).
            03 AFBKENNA                       PIC X.
            03 AFBKENNH                       PIC X.
            03 AFBKENNO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 AGLKENNA                       PIC X.
            03 AGLKENNH                       PIC X.
            03 AGLKENNO                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 ASEIFBA                        PIC X.
            03 ASEIFBH                        PIC X.
            03 ASEIFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 ESEIAKTA                       PIC X.
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 ASEISTRA                       PIC X.
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEIGESA                       PIC X.
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AKZFBA                         PIC X.
            03 AKZFBH                         PIC X.
            03 AKZFBO                         PIC X(2).
            03 DFHG001O OCCURS 7.
               05 FILLER                         PIC X(2).
               05 APROEMPA                       PIC X.
               05 APROEMPH                       PIC X.
               05 APROEMPO                       PIC X(7).
               05 FILLER                         PIC X(2).
               05 APEPRFZA                       PIC X.
               05 APEPRFZH                       PIC X.
               05 APEPRFZO                       PIC X(1).
               05 FILLER                         PIC X(2).
               05 APENKA                         PIC X.
               05 APENKH                         PIC X.
               05 APENKO                         PIC X(20).
               05 FILLER                         PIC X(2).
               05 ADIPROVA                       PIC X.
               05 ADIPROVH                       PIC X.
               05 ADIPROVO                       PIC X(3).
               05 FILLER                         PIC X(2).
               05 AAZBTGA                        PIC X.
               05 AAZBTGH                        PIC X.
               05 AAZBTGO                        PIC X(11).
               05 FILLER                         PIC X(2).
               05 ARCKBTGA                       PIC X.
               05 ARCKBTGH                       PIC X.
               05 ARCKBTGO                       PIC X(11).
               05 FILLER                         PIC X(2).
               05 AKZPPFLA                       PIC X.
               05 AKZPPFLH                       PIC X.
               05 AKZPPFLO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 ABUDATA                        PIC X.
               05 ABUDATH                        PIC X.
               05 ABUDATO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 AGESA                          PIC X.
            03 AGESH                          PIC X.
            03 AGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 AVNRA                          PIC X.
            03 AVNRH                          PIC X.
            03 AVNRO                          PIC X(15).
            03 FILLER                         PIC X(2).
            03 AUNUMA                         PIC X.
            03 AUNUMH                         PIC X.
            03 AUNUMO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 ASCHINRA                       PIC X.
            03 ASCHINRH                       PIC X.
            03 ASCHINRO                       PIC X(3).


