      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  10.01.2008
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2008 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI2224.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/DRKI2224.CPv  $
      *
      *   Rev 2.2   Jan 17 2008 16:16:50   t13ex14
      *AKI00694: Vorstandsauswertung
      *
      *   Rev 2.1   Jan 15 2008 10:46:38   t13ex14
      *AKI00694: Vorstandsauswertung
      *
      *   Rev 2.0   Jan 10 2008 15:42:46   t13ex14
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * --------+--------+----+---------------------------+----------*
      * AKI00694!11.01.08! 1.0! NEU                       ! WMI      *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************

       01  DRKI2224.

           05  VB-DATEN-EINGABE.
      *
               10  VB-NUMMER                     PIC  9(007).
               10  FILLER                        PIC  X(004).
               10  VB-STUFENNUMMER               PIC  9(003).
               10  FILLER                        PIC  X(005).
               10  VB-STUFENBEZEICH              PIC  X(003).
               10  FILLER                        PIC  X(005).
               10  VB-BEGINNDAT                  PIC  X(010).
               10  FILLER                        PIC  X(003).
               10  VB-ENDEDAT                    PIC  X(010).
      ************************* Ende DRKI2224 ************************
