      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 1999
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1999 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1145.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:\MF\CPY\DRKI1145.CPv  $
      *
      *   Rev 2.1   04 Jan 2001 17:13:36   T13AE38
      *AKI00155
      *
      *   Rev 2.0   07 Jun 2000 17:08:32   P13SP20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      ****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
171100* AKI00155!17.11.00!1.2 ! NEUE PI/PO FÜR UMSETZEN   ! SJO      *
      *         !        !    ! CHAR 26 HEX-STRING IN     !          *
      *         !        !    ! 13 STELLIGE ID IN UPKI0044!          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *
       01  PI-DRKI1145.
           05 PI-DRKI1145-STRING                PIC X(26).

       01  PO-DRKI1145.
           05 PO-DRKI1145-BINARY                PIC X(13).
      *---------------------------------------------------------------*
