      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   drki1502.cpy  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/cpy/DRKI1502.CPv  $
      *
      *   Rev 2.1   Mar 14 2003 13:23:00   T13EX39
      *FKI00694 zus. Protokoll-Datei
      *
      *   Rev 2.0   Feb 27 1999 12:52:48   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   09 Feb 1999 14:36:34   T13EX47
      *SELECT fuer das OZP ZWKI0357
      *
      *   Rev 1.0   29 Sep 1997 11:44:10   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ****************************************************************
      *    COPY-MEMBER: DRKI1502  FUNKTION lese-OZP                  *
      *    -------------------------------------------------------   *
      *    ERSTELLT: WHO                                             *
      *    DATUM:    10.02.2003                                      *
      ****************************************************************
      *    VERSION   01                                              *
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00694!21.01.03! 01 ! NEU                       ! HORNUNG  *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      ***************************************************************
      *                 PARAMETER-INPUT                             *
      ***************************************************************
       01  PI-DRKI1502.
           05  PI-DRKI1502-EVP-CC-ID          PIC S9(9) COMP.
           05  PI-DRKI1502-EVP-ORDER-NUMBER   PIC S9(9) COMP.

      ***************************************************************
      *                 PARAMETER-OUTPUT                            *
      ***************************************************************
       01  PO-DRKI1502.
           05  PO-DRKI1502-RC                  PIC  X(03).
               88  PO-DRKI1502-RC-OK           VALUE 'OK '.
               88  PO-DRKI1502-RC-NFD          VALUE 'NFD'.
           05 PO-DRKI1502-EVP-ID               PIC X(12).
      *
      ******** ENDE COPY-MEMBER (DRKI1502) *******************

