      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  25.02.2016
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2016 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3061.CPY  $
      *    $Revision:   2.4  $
      *
      *    $Log:   L:/mf/CPY/DRKI3061.CPv  $
      *
      *   Rev 2.4   May 31 2016 14:07:36   t13ex15
      *AKI01376: Wertung Invest bei übertragenen Verträgen (EV-Kenn
      *zeichen) Nacharbeiten Review
      *
      *   Rev 2.3   Mar 17 2016 07:28:40   t13ex15
      *AKI01376: Wertung Invest bei übertragenen Verträgen (EV-Kenn
      *zeichen) Source
      *
      *   Rev 2.2   Mar 16 2016 12:53:20   t13ex15
      *AKI01376: Wertung Invest bei übertragenen Verträgen (EV-Kenn
      *zeichen) Source
      *
      *   Rev 2.1   Mar 14 2016 08:02:10   t13ex15
      *AKI01376: Wertung Invest bei übertragenen Verträgen (EV-Kenn
      *zeichen) Source
      *
      *   Rev 2.0   Feb 25 2016 10:30:14   t13ex15
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *---------------------------------------------------------------*
      *    COPY-MEMBER: DRKI3061                                      *
      *    --------------------------------------------------------   *
      *    SST KLB Wertung nach Zuordnung durch Kundenübertragung     *
      *    --------------------------------------------------------   *
      *    ERSTELLT: Sabine Warz                                      *
      *    DATUM:    25.02.2016                                       *
      *****************************************************************
      *    VERSION  1
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI01376!25.02.16! 01 ! NEUERSTELLUNG             ! SWZ      *
      * -------------------------------------------------------------*
130516* AKI01376!13.05.16!2.3 ! Gesellschaft numerisch    ! SWZ      *
      * -------------------------------------------------------------*
      *         !        !    !                           !          *
      * -------------------------------------------------------------*
      *                                                              *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *
      *    DIESES COPY ENTHÄLT DIE INFORMATIONEN, DIE AUS DAISY
      *    KOMMEN FÜR EINE ANPASSUNG EIGENVERMITTELT
      *
      ****************************************************************
      *
      * Daten aus DAISY
      *
      * Satzlänge  80 Byte
      *
       01 'XX'-SATZ.

           05  FILLER                             PIC X(04).
           05  'XX'-GES                           PIC 9(02).
           05  FILLER                             PIC X(01).
           05  'XX'-VNR                           PIC X(15).
           05  FILLER                             PIC X(01).
           05  'XX'-TEXT                          PIC X(50).
           05  FILLER                             PIC X(07).





