      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0623.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\DRKI0623.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 12:58:06   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   19 Feb 1999 07:22:54   T13EX49
      *AKI00015 - Funktionen fuer UPKI0053
      *
      *   Rev 1.0   25 Aug 1998 09:24:28   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
       01  PI-UPKI0053.
           05 PI-UPKI0053-ERR-VERSNR          PIC X(15).
           05 PI-UPKI0053-FUNKTION            PIC X(008).
              88 PI-UPKI0053-DRKI0469             VALUE 'DRKI0469'.
              88 PI-UPKI0053-DRKI0472             VALUE 'DRKI0472'.
              88 PI-UPKI0053-DRKI0473             VALUE 'DRKI0473'.
              88 PI-UPKI0053-DRKI0479             VALUE 'DRKI0479'.
              88 PI-UPKI0053-DRKI0528             VALUE 'DRKI0528'.
              88 PI-UPKI0053-DRKI0584             VALUE 'DRKI0584'.
              88 PI-UPKI0053-DRKI0586             VALUE 'DRKI0586'.
