      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1302.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/cpy/DRKI1302.CPv  $
      *
      *   Rev 2.1   18 Oct 2001 16:57:14   t13ex49
      *FKI00515 - Unload-Datei für Korrektur der
      *Tabelle Bausparen (Badenia)
      *
      *   Rev 2.0   18 Sep 2001 10:04:28   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * FKI00515!11.10.01!    ! NEU                       !Peter Pohl*
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *--------------------------------------------------------------*
      ****************************************************************
       01  DRKI1302.
      *
           05  VERVERTRAGSNUMMER         PIC  X(015).
           05  Filler                    PIC  X(001).
           05  VERVERTRAGSID             PIC  X(013).
      *


