      *****************************************************************
      *    COPY-MEMBER: DRKI3938                                    
      *                                                              
      *   <RESTARTINFORMATION ZU PROGRAMM PMKI1566>                     
      *                                                              
      *                                                              
      *                                                              
      *                                                              
      *                                                              
      *                                                              
      *                                                              
      *****************************************************************
      *****************************************************************
      * LOGBUCH:                                                      *
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME     *
      * --------------------------------------------------------------*
      *            !21.02.22!                              ! U131381  *
      *            !        !                              !          *
      *            !        !                              !          *
      *                                                               *
      * ENDE-LOGBUCH                                                  *
      *****************************************************************
       01  DRKI3938-RESTARTINFO.
           05 DRKI3938-KEY.
              10 DRKI3938-VTRGID                 PIC  X(013).
              10 DRKI3938-VNR                    PIC  X(015).
           05 DRKI3204-ZAEHLER PACKED-DECIMAL.
              10 DRKI3938-EZ-G50AKT              PIC S9(009).
              10 DRKI3938-EZ-VEREIN-UPD          PIC S9(009).

      *****************************************************************
      *---------------------- ENDE XXXX0000 --------------------------* 
      *****************************************************************
