      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0062.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\DRKI0062.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 12:52:48   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   09 Feb 1999 14:36:34   T13EX47
      *SELECT fuer das OZP ZWKI0357
      *
      *   Rev 1.0   29 Sep 1997 11:44:10   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ****************************************************************
      *    COPY-MEMBER: DRki0062  FUNKTION lese-OZP                  *
      *    -------------------------------------------------------   *
      *    ERSTELLT: Parent                                          *
      *    DATUM:    05.11.1997                                      *
      ****************************************************************
      *    VERSION   01                                              *
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * DAISY   !05.11.97! 01 ! NEUERSTELLUNG             ! Parent   *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      ***************************************************************
      *                 PARAMETER-INPUT                             *
      ***************************************************************
       01  PI-DRKI0062.
           05  PI-DRKI0062-VNR                PIC X(15).
           05  PI-DRKI0062-PGEB-GES           PIC S9(4) BINARY.

      ***************************************************************
      *                 PARAMETER-OUTPUT                            *
      ***************************************************************
       01  PO-DRKI0062.
           05  PO-DRKI0062-RC                  PIC  X(03).
               88  PO-DRKI0062-RC-OK           VALUE 'OK '.
               88  PO-DRKI0062-RC-NFD          VALUE 'NFD'.
           05 PO-DRKI0062-VERTRAGS-ID          PIC  X(13).
      *
      ******** ENDE COPY-MEMBER (DRKI0062) *******************

