      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  17.06.2019
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2019 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3682.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI3682.CPv  $
      *
      *   Rev 2.1   Sep 02 2019 13:16:26   u130176
      *AKI01689: DSGVO:Löschverfahren für Tabelle VBSTAMMDATEN
      *
      *   Rev 2.0   Jun 17 2019 10:07:44   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*


      * 01  PO-DRKI3682.
           05  PO-DRKI3682-DATEN.
             10 PO-DRKI3682-VERPARTGESELLSCHID   PIC  9(2).
             10 PO-DRKI3682-SEMIKOLON-01         PIC  X(0001).
             10 PO-DRKI3682-VERVERTRAGSNUMMER    PIC  X(0015).
             10 PO-DRKI3682-SEMIKOLON-02         PIC  X(0001).
             10 PO-DRKI3682-VBSMITARBEITERNR     PIC  9(9).
             10 PO-DRKI3682-SEMIKOLON-03         PIC  X(0001).
             10 PO-DRKI3682-VBSMANDANTNR         PIC  9(9).
             10 PO-DRKI3682-SEMIKOLON-04         PIC  X(0001).
             10 PO-DRKI3682-VBSANREDE            PIC  9(4).
             10 PO-DRKI3682-SEMIKOLON-05         PIC  X(0001).
             10 PO-DRKI3682-VBSNAME              PIC  X(0040).
             10 PO-DRKI3682-SEMIKOLON-06         PIC  X(0001).
             10 PO-DRKI3682-VBSVORNAME           PIC  X(0020).
             10 PO-DRKI3682-SEMIKOLON-07         PIC  X(0001).
             10 PO-DRKI3682-VBSGEBGRUENDDAT      PIC  X(010).
             10 PO-DRKI3682-SEMIKOLON-08         PIC  X(0001).
             10 PO-DRKI3682-VBSSTRUKTURSTUFE     PIC  9(9).
             10 PO-DRKI3682-SEMIKOLON-09         PIC  X(0001).
             10 PO-DRKI3682-VBSDIREKTION         PIC  9(4).
             10 PO-DRKI3682-SEMIKOLON-10         PIC  X(0001).
             10 PO-DRKI3682-VBSAUSTRITTSDATUM    PIC  X(010).

