      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  12.03.2012
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI2571.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI2571.CPv  $
      *
      *   Rev 2.1   Jul 20 2012 10:15:08   t13ex27
      *AKI01135: Kundendaten physisch löschen-Abgleich
      *
      *   Rev 2.0   Mar 12 2012 11:30:26   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *  Statistikdatei aus Abgleich
      ****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00886!12.03.11! 2.1! NEU                       !I. Frenzel*
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
       01 DRKI2571.
          05  SATZART                  PIC X(001).
          05  OKITABELLE               PIC X(030).
          05  HOSTID                   PIC X(026).
          05  ZAHL                     PIC 9(008) COMP-3.
      ****************************************************************
