      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Mai 2002
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2002 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1484.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/cpy/DRKI1484.CPv  $
      *
      *   Rev 2.1   Dec 12 2002 07:07:20   t13ex49
      *AKI00314 - erstmalige Prod-Übergabe
      *
      *   Rev 2.0   Oct 16 2002 08:32:10   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRKI1484                                      *
      *    --------------------------------------------------------   *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00314!12.06.02!    ! NEU                       !Peter Pohl*
      * -------------------------------------------------------------*
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *
      *    Satzaufbau Delta der URL-Adressen
      *
      *    Länge: 148 Byte
      *
      ****************************************************************

       01  DRKI1484.
           05 DRKI1484-VERARB-KENNZEICHEN      PIC  X(001).
      *       A = Aktiv D = Delete

           05 DRKI1484-VBNUMMER                PIC  X(007).
           05 DRKI1484-URL-NAME                PIC  X(083).
           05 DRKI1484-VB-Beginn               PIC  X(010).
           05 DRKI1484-DL-Beginn               PIC  X(010).
           05 DRKI1484-ALD                     PIC  X(001).
           05 DRKI1484-LEERFELD                PIC  X(036).

      *---------------------------------------------------------------*

