      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1422.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/cpy/DRKI1422.CPv  $
      *
      *   Rev 2.1   Sep 02 2002 16:00:24   t13ex49
      *AKI00288 - eMail-Teil der 
      *VB-Schnittstelle 
      *erstmalige Übergabe
      *
      *   Rev 2.0   Apr 23 2002 16:02:16   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRKI1422                                      *
      *    --------------------------------------------------------   *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00288!14.06.02!    ! NEU                       !Peter Pohl*
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *
      *    Satzaufbau der Schnittstellendatei aus dem VB-System
      *
      *    Länge: 128 Byte
      *
      ****************************************************************

       01  DRKI1422.
           05 DRKI1422-VBNUMMER                PIC  9(007).
           05 DRKI1422-EMAIL-NAME              PIC  X(070).
           05 DRKI1422-STUFE                   PIC  X(003).
           05 DRKI1422-PRAXIS                  PIC  X(001).
           05 DRKI1422-GESELLSCHAFT            PIC  X(001).
      *       1 @dvat.de  2 @DVAT.AT

           05 DRKI1422-REGION                  PIC  X(004).
           05 DRKI1422-LEER                    PIC  X(042).

      *---------------------------------------------------------------*

