      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0505.CPY  $
      *    $Revision:   2.29  $
      *
      *    $Log:   L:/mf/CPY/DRKI0505.CPv  $
      *
      *   Rev 2.29   May 27 2020 14:47:04   t13ex78
      *AKI01771: Bugfixing Vorzeichen BONUS
      *
      *   Rev 2.28   Apr 15 2020 08:18:54   t13ex78
      *AKI01771: Programme und Copies
      *
      *   Rev 2.27   Dec 16 2014 16:37:12   t13ex20
      *AKI01330: Badenia - Überarbeitung der Produktschlüssel
      *
      *   Rev 2.26   Nov 15 2012 15:31:24   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.25   Nov 15 2012 14:42:32   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.24   Nov 15 2012 14:31:16   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.23   Nov 15 2012 14:23:20   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.22   Aug 02 2010 12:32:40   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.21   Aug 02 2010 12:17:44   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.20   Aug 02 2010 12:09:10   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.19   Aug 02 2010 11:30:24   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.18   Aug 02 2010 10:58:58   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.17   Jul 14 2010 18:02:18   t13ex52
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.16   Jul 14 2010 17:22:12   t13ex52
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.15   Jul 13 2010 19:37:50   t13ex52
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.14   Feb 09 2010 12:22:36   t13ex14
      *AKI00911: Vorzeichenänderung f. Ermittl., Aufber., Aktual. B
      *ausparen
      *
      *   Rev 2.13   Oct 26 2009 07:36:34   t13ex14
      *AKI00846: Erw. der Bestands-DTAs Badenia: Programme u. Auftr
      *äge
      *
      *   Rev 2.12   Aug 29 2008 11:11:22   t13ex14
      *AKI00737: Badenia-Zwischen-und Vorfinanzierungen; Vertragsda
      *ten
      *
      *   Rev 2.11   May 07 2008 09:10:36   t13ex14
      *AKI00700: Neue Bestandsfelder im Vertrags-DTA Badenia
      *
      *   Rev 2.10   11 Aug 2007 12:40:24   t13ae31
      *AKI00623: Erweiterung des Bestands-DTA von der Badenia
      *
      *   Rev 2.9   Nov 17 2005 15:44:32   t13ex48
      *AKI00524: Erweiterter DTA-Badenia Bausparkasse.
      *
      *   Rev 2.8   Apr 05 2005 17:43:34   t13ex27
      *AKI00475: Anpassungen für Badenia
      *
      *   Rev 2.7   Jul 06 2004 13:49:32   t13ex49
      *AKI00419: Bestandsdatenerweiterung bei der Badenia Bausparka
      *sse AG
      *
      *   Rev 2.6   Apr 02 2003 13:27:06   t13ae31
      *AKI00333 neue Felder ZINSPLUS BWZVJ ZINSLFDJAHR
      *
      *   Rev 2.5   Jan 24 2003 07:49:56   t13ae31
      *FKI00695 Beitrag Minus zulassen
      *
      *   Rev 2.4   Jan 25 2002 08:52:14   t13ex49
      *AKI00258 - Dezimalstellen
      *
      *   Rev 2.3   20 Dec 2000 13:58:52   T13EX49
      *AKI00153 - Änderung Bewertungszahl
      *
      *   Rev 2.2   Jun 30 1999 09:38:58   T13EX51
      *AKI00030 Einfügen WKZ
      *
      *   Rev 2.1   Apr 08 1999 15:39:22   T13EX51
      *AKI00021
      *
      *   Rev 2.0   Mar 01 1999 15:06:24   T13EX51
      *Neue Revision AKI000001
      *
      *   Rev 1.0   07 Aug 1998 14:43:34   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ******************************************************************
      *              #####################                             *
      *     ########    D R K I 0 5 0 5    ########                    *
      *              #####################                             *
      *                                                                *
      *  COPY-MEMBER FUER BADENIA Vertragsdaten Änderungsbestand       *
      *                                                                *
      *                                                                *
      *    SATZLÄNGE   186 Bytes                                       *
      *    SATZLÄNGE   187 Bytes (Bewertungszahl)                      *
291101*    SATZLÄNGE   193 Bytes (Vertragssumme und Fehlbetrag)        *
100303*    SATZLÄNGE   226        ZINSPLUS/BWZVORJAHR/ZINSLFDJAHR      *
250504*    Satzlänge   276 Bytes (SCHL-WOHN-PROG + Filler)             *
200207*    Satzlänge   500 Bytes (neue Produkte Finanzierungen)        *
110809*    Satzlänge  1000 Bytes                                       *
      *                                                                *
      *----------------------------------------------------------------*
      *    LOGBUCH                                                     *
      *DATUM   !      ÄNDERUNG                         !NAME     !VERS.*
      *AUFTRAG !                                       !         !     *
      *--------!---------------------------------------!---------!-----*
      *03.08.98!NEUERSTELLUNG                          !Dobslaff ! 01  *
      *KI-NEU  !                                       !         !     *
      *        !                                       !         !     *
      *AKI00030!Einfügen Währungskennzeichen           !Dobslaff ! 02  *
081100*        !                                       !         !     *
081100*08.11.99! BEWERTUNGSZAHL um eine Vorkomma-      !P. Pohl  !     *
081100*AKI00153! stelle erweitert                      !         !     *
      *        !                                       !         !     *
291101*29.11.01! Einführung Dezimalstellen für:        !P. Pohl  !     *
291101*AKI00258! D-VSUMME (Vertragssumme) sowie        !         !     *
291101*        ! D-FEHL-MIN-ANSPAR (Fehlbetrag)        !         !     *
      *        !                                       !         !     *
240103*FKI00695! Vorzeichen Beitrag                    !P. Hübner!     *
      *        !                                       !         !     *
100303*AKI00333! neue Felder ZINSPLUS/BWZVORJAHR       !P.Hübner !     *
100303*        !              ZINSLFDJAHR              !         !     *
      *        !                                       !         !     *
250504*AKI00410! neues Feld SCHL-WOHN-PROG             !P. Pohl  !     *
      *AKI00475! neue Felder BASERHOEHEZBPROZ          !I.Frenzel!     *
      *        ! und EHELEUTEKZ                        !         !     *
      *--------!---------------------------------------!---------!     *
211005*AKI00524! neue Felder VERMITTELTKZ              !H.Sebbach!     *
      *21.10.05! und         BLANKODARLKZ              !         !     *
200207*AKI00623! neue Felder für Finanz.produkte       !P. Hübner!     *
      *        !                                       !         !     *
100308*AKI00700! neue Felder ZP-FAKTOR, ZP-BETRAG,     !W.Misgeld!     *
100308*        ! ZP-GENERATION                         !         !     *
      *        !                                       !         !     *
120808*AKI00737! neues Feld AE-LFDNR für  ZWK/BVD      !W.Misgeld!     *
      *        !                                       !         !     *
110809*AKI00846! DTA-Erweiterung                       !W.Misgeld!     *
      *        !                                       !         !     *
250110*AKI00911! Änd.6 Feld. mit Vorzeichen            !W.Misgeld!     *
      *                                                                *
180610*AKI00967! DTA-Erweiterung um 7 Datenfelder      !H.Schlenther!  *
      *   UE002! gesamt 36 Byte.                       !         !     *
      *        !                                       !         !     *
280912*AKI01157! DTA-Erw. f. übersparte Verträge       !W.Misgeld!     *
      *        !                                       !         !     *
121114*AKI01330! Ueberarbeitung Produktschluessel      !UZI      !     *
      *        !                                       !         !     *
      *        !                                       !         !     *
      *AKI01771! Umbenennung diverser Felder           ! T13EX78 !     *
      *        ! Teils neue Schlüssel (SCHL-WOHN-PROG) !         !     *
      *        ! 5 komplett neue Felder                !         !     *
      *AKI01771! Vorzeichen bei AE-BONUS               ! T13EX78 !     *
      *----------------------------------------------------------------*
      *DBO-9564!21.12.21!       NEUES FELD             ! T13EX39 !     *
      *        !        !       PE-AUSZAHLUNGSART      !         !     *
      ******************************************************************
       01  DRKI0505.
      *
           05 AE-AEND-KZ               PIC  X(001).
      *
      *  I --> Neuanlage
      *  U --> Änderung
      *  D --> Stornierung
      *
120808***  05 AE-VNR                   PIC  9(015).
120808     05 AE-VNR-LFDNR.
120808        15 AE-VNR                PIC  9(015).
120808        15 AE-LFDNR              PIC  X(001).
120808*        1 = Bausparvertrag
120808*        2 = ZWK (Zwischenkredit)/BVD (Bauvorausdarlehen)
      *
           05 AE-PRODSCHL             PIC  9(002).
           05 AE-PRODSCHL-AEKZ        PIC  X.
           05 AE-LAUFZEIT             PIC  X(002).
           05 AE-LAUFZEIT-AEKZ        PIC  X.
           05 AE-VBEGINN              PIC  9(008).
           05 AE-VBEGINN-AEKZ         PIC  X.
           05 AE-VENDE                PIC  9(008).
           05 AE-VENDE-AEKZ           PIC  X.
291101*    05 AE-VSUMME               PIC  9(007).
291101     05 AE-VSUMME               PIC  9(008)V99.
           05 AE-VSUMME-AEKZ          PIC  X.
240103***  05 AE-BEITRAG              PIC  9(005)V99.
240103     05 AE-BEITRAG              PIC  S9(005)V99.
           05 AE-BEITRAG-AEKZ         PIC  X.
           05 AE-KTO-STAND            PIC  X(001).
           05 AE-KTO-STAND-AEKZ       PIC  X.
081100*    05 AE-BEWERT-ZAHL          PIC  9(002)V99999.
081100     05 AE-BEWERT-ZAHL          PIC  9(003)V99999.
           05 AE-BEWERT-ZAHL-AEKZ     PIC  X.
           05 AE-T-VAR-T3             PIC  X(001).
           05 AE-T-VAR-T3-AEKZ        PIC  X.
           05 AE-ZINSSATZ-ALLG        PIC  9(003)V99.
           05 AE-ZINSSATZ-ALLG-AEKZ   PIC  X.
           05 AE-DARL-ZINS-TARIF      PIC  9(003)V99.
           05 AE-DARL-ZINS-TARIF-AEKZ PIC  X.
           05 AE-DISAGIO-PROZ         PIC  9(003)V99.
           05 AE-DISAGIO-PROZ-AEKZ    PIC  X.
291101*    05 AE-FEHL-MIN-ANSPAR      PIC  9(007).
291101     05 AE-FEHL-MIN-ANSPAR      PIC  9(008)V99.
           05 AE-FEHL-MIN-ANSPAR-AEKZ PIC  X.
           05 AE-ENDE-STEUER-LAUFZEIT PIC  9(008).
           05 AE-ENDE-STEUER-LAUFZEIT-AEKZ PIC X.
           05 AE-DAT-WOBAU-PRAEMIE    PIC  9(008).
           05 AE-DAT-WOBAU-PRAEMIE-AEKZ    PIC X.
           05 AE-DAT-ZUTEIL-AUSSICHT  PIC  9(008).
           05 AE-DAT-ZUTEIL-AUSSICHT-AEKZ  PIC X.
           05 AE-DAT-MIN-ANSPAR       PIC  9(008).
           05 AE-DAT-MIN-ANSPAR-AEKZ  PIC  X.
           05 AE-PART-INFO            PIC  X(020).
           05 AE-PART-INFO-AEKZ       PIC  X.
           05 AE-VBNR                 PIC  9(009).
           05 AE-VBNR-AEKZ            PIC  X.
           05 AE-MIN-ANSPAR-PROZ      PIC  9(003)V99.
           05 AE-MIN-ANSPAR-PROZ-AEKZ PIC  X.
           05 AE-ZAHLW                PIC  9(002).
           05 AE-ZAHLW-AEKZ           PIC  X.
      *
      *  01 --> jährlich
      *  02 --> halbjährlich
      *  04 --> vierteljährlich
      *  06 --> monatlich
      *  07 --> Einmalzahlung Laufzeit mind. 12 Mon.
      *  08 --> Einmalzahlung/Einmalprämie
      *  09 --> 2-monatlich
      *  99 --> Zahlweise fehlt
      *
           05 AE-SPARBETRAG           PIC  9(009)V99.
           05 AE-SPARBETRAG-AEKZ      PIC  X.
100308*    Zinsplusbetrag-Stand des Vorjahres:
100303     05 AE-BONUS                PIC  S9(009)V99.
100303     05 AE-BONUS-AEKZ           PIC  X.
100303     05 AE-BWZ-VORJAHR          PIC  9(003)V9(005).
100303     05 AE-BWZ-VORJAHR-AEKZ     PIC  X.
100303     05 AE-ZINS-LFD-JAHR        PIC  S9(009)V99.
100303     05 AE-ZINS-LFD-JAHR-AEKZ   PIC  X.
           05 AE-VERTRAG-WKZ          PIC  X(003).
           05 AE-VERTRAGWKZ-AEKZ      PIC  X.
250504     05 AE-SCHL-WOHN-PROG       PIC  9(002).
250504     05 AE-SCHL-WOHN-PROG-AEKZ  PIC  X.
250205     05 AE-BASERHOEHEZBPROZ     PIC  9(003)V9(002).
250205     05 AE-BASERHOEHEZBPROZ-AEKZ PIC  X.
250205     05 AE-EHELEUTEKZ           PIC  X(001).
250205     05 AE-EHELEUTEKZ-AEKZ      PIC  X.
211005     05 AE-BLANKODARLKZ         PIC  X.
211005     05 AE-BLANKODARLKZ-AEKZ    PIC  X.
211005     05 AE-VERMITTELTKZ         PIC  X.
211005     05 AE-VERMITTELTKZ-AEKZ    PIC  X.
200207     05 AE-DATUM-SPERRFRIST      PIC  9(008).
200207     05 AE-DATUM-SPERRFRIST-AEKZ    PIC  X.
200207     05 AE-ZINSVORTRAG           PIC  S9(9)V99.
200207     05 AE-ZINSVORTRAG-AEKZ    PIC  X.
200207     05 AE-DATUM-AG-EINGANG      PIC  9(008).
200207     05 AE-DATUM-AG-EINGANG-AEKZ    PIC  X.
200207     05 AE-FIN-PRODUKT-SCHL      PIC  99.
200207     05 AE-FIN-PRODUKT-SCHL-AEKZ    PIC  X.
200207     05 AE-DATUM-ZINSFEST-AB     PIC  9(008).
200207     05 AE-DATUM-ZINSFEST-AB-AEKZ    PIC  X.
200207     05 AE-DATUM-ZINSFEST-BIS    PIC  9(008).
200207     05 AE-DATUM-ZINSFEST-BIS-AEKZ    PIC  X.
200207     05 AE-DARL-ZINS-NOMINAL     PIC  9(3)V999.
200207     05 AE-DARL-ZINS-NOMINAL-AEKZ    PIC  X.
200207     05 AE-DARL-ZINS-EFFEKTIV    PIC  9(3)V999.
200207     05 AE-DARL-ZINS-EFFEKTIV-AEKZ    PIC  X.
200207     05 AE-ANNU-RATE             PIC  9(9)V99.
200207     05 AE-ANNU-RATE-AEKZ    PIC  X.
200207     05 AE-LAUFZEIT-FIN          PIC  9(003).
200207     05 AE-LAUFZEIT-FIN-AEKZ    PIC  X.
200207     05 AE-SONDERTILG-JAHR       PIC  9(9)V99.
200207     05 AE-SONDERTILG-JAHR-AEKZ    PIC  X.
200207     05 AE-DARLEHEN-HOEHE        PIC  9(9)V99.
200207     05 AE-DARLEHEN-HOEHE-AEKZ    PIC  X.
200207     05 AE-DARLEHEN-SALDO        PIC  S9(9)V99.
200207     05 AE-DARLEHEN-SALDO-AEKZ    PIC  X.
200207     05 AE-DATUM-AF-BEGINN       PIC  9(008).
200207     05 AE-DATUM-AF-BEGINN-AEKZ    PIC  X.
100308     05 AE-BONUS-FAKTOR         PIC S9(002)V99.
100308     05 AE-BONUS-FAKTOR-AEKZ    PIC  X.
100308*    Zinsplusbetrag-Stand des aktuellen Jahres:
100308     05 AE-BONUS-VORJAHR        PIC S9(009)V99.
100308     05 AE-BONUS-VORJAHR-AEKZ   PIC  X.
100308     05 AE-ZP-GENERATION        PIC  9(002).
100308     05 AE-ZP-GENERATION-AEKZ   PIC  X.
110809     05 AE-EINZBETRAGMON        PIC  9(007)V99.
>>         05 AE-EINZBETRAGMON-AEKZ   PIC  X.
           05 AE-EINZGDATUMMON        PIC  9(008).
           05 AE-EINZGDATUMMON-AEKZ   PIC  X.
           05 AE-EINZBETRAGJHR        PIC  9(007)V99.
           05 AE-EINZBETRAGJHR-AEKZ   PIC  X.
           05 AE-EINZGDATUMJHR        PIC  9(008).
           05 AE-EINZGDATUMJHR-AEKZ   PIC  X.
           05 AE-EINZUGDYNAM          PIC  9(003)V99.
           05 AE-EINZUGDYNAM-AEKZ     PIC  X.
           05 AE-MINBEWERTZAHL        PIC  9(003)V999.
           05 AE-MINBEWERTZAHL-AEKZ   PIC  X.
           05 AE-INKASSOART           PIC  X(001).
      *  05 --> Lastschrift
           05 AE-INKASSOART-AEKZ      PIC  X.


           05 AE-STEUERLFZDAT         PIC  9(008).
           05 AE-STEUERLFZDAT-AEKZ    PIC  X.
250110*    05 AE-VLSUMJAHR            PIC  9(007)V99.
250110     05 AE-VLSUMJAHR            PIC S9(007)V99.
           05 AE-VLSUMJAHR-AEKZ       PIC  X.
           05 AE-WOPKZ                PIC  X(001).
           05 AE-WOPKZ-AEKZ           PIC  X.
           05 AE-WOPAVORJHR           PIC  9(004).
           05 AE-WOPAVORJHR-AEKZ      PIC  X.
           05 AE-WOPAVORVORJHR        PIC  9(004).
           05 AE-WOPAVORVORJHR-AEKZ   PIC  X.
           05 AE-DAUERZULAGEKZ        PIC  X(001).
           05 AE-DAUERZULAGEKZ-AEKZ   PIC  X.
           05 AE-JAHRESZULAGE.
              10 AE-JAHRESZULAGE-TAB  OCCURS 5.
                 15 AE-JAHRZULAGE     PIC  9(004).
250110*          15 AE-JHRZULAGGUT    PIC  9(007)V99.
250110           15 AE-JHRZULAGGUT    PIC S9(007)V99.
                 15 AE-DATZULAGGUT    PIC  9(008).
           05 AE-JAHRESZULAGE-AEKZ    PIC  X.
250110*    05 AE-SUMFOEREINZHL        PIC  9(007)V99.
250110     05 AE-SUMFOEREINZHL        PIC S9(007)V99.
           05 AE-SUMFOEREINZHL-AEKZ   PIC  X.
250110*    05 AE-SALDWHNFOEKTO        PIC  9(007)V99.
250110     05 AE-SALDWHNFOEKTO        PIC S9(007)V99.
           05 AE-SALDWHNFOEKTO-AEKZ   PIC  X.
250110*    05 AE-SUMAVWLEINZHL        PIC  9(007)V99.
250110     05 AE-SUMAVWLEINZHL        PIC S9(007)V99.
           05 AE-SUMAVWLEINZHL-AEKZ   PIC  X.
250110*    05 AE-SUMFOERVORJHR        PIC  9(007)V99.
250110     05 AE-SUMFOERVORJHR        PIC S9(007)V99.
           05 AE-SUMFOERVORJHR-AEKZ   PIC  X.
           05 AE-VARIANWECHSKZ        PIC  X(001).
           05 AE-VARIANWECHSKZ-AEKZ   PIC  X.
           05 AE-FINANZIERNGKZ        PIC  X(001).
           05 AE-FINANZIERNGKZ-AEKZ   PIC  X.
           05 AE-ZUTEILANWDAT         PIC  9(008).
           05 AE-ZUTEILANWDAT-AEKZ    PIC  X.
           05 AE-DARLEHNAKTEKZ        PIC  X(001).
           05 AE-DARLEHNAKTEKZ-AEKZ   PIC  X.
           05 AE-ENDEBINDFRIST        PIC  X(010).
           05 AE-ENDEBINDFRIST-AEKZ   PIC  X.
           05 AE-LETZTEDATAKTU        PIC  9(008).
           05 AE-LETZTEDATAKTU-AEKZ   PIC  X.
           05 AE-ZIELTILGUNG          PIC  9(003)V99.
           05 AE-ZIELTILGUNG-AEKZ     PIC  X.
           05 AE-MEHRZUTEILUNG        PIC  9(007)V99.
           05 AE-MEHRZUTEILUNG-AEKZ   PIC  X.
           05 AE-ABTRETUNGBLZ         PIC  9(008).
           05 AE-ABTRETUNGBLZ-AEKZ    PIC  X.
           05 AE-TARIFUMSTBTRG        PIC  9(005)V99.
           05 AE-TARIFUMSTBTRG-AEKZ   PIC  X.
           05 AE-ANFTILGUNG           PIC  9(003)V99.
    <<     05 AE-ANFTILGUNG-AEKZ      PIC  X.
      ***
180610***  Datum letzte Zuteilung i.d.F. JJJJMMTT
    >>     05 AE-LETZTEZUTEIL         PIC  9(008).
           05 AE-LETZTEZUTEIL-AEKZ    PIC  X.
      *
      ***  Zuteilungsanwartschaft; Datum, wann der Vertrag voraussicht-
      ***  lich zugeteilt wird. zeitraum max. 10 Wochen.
      ***  i.d.F JJJJMMTT.
           05 AE-ZUTEILANWART         PIC  9(008).
           05 AE-ZUTEILANWART-AEKZ    PIC  X.
      *
      ***  WOP-Anspruch Wohnungsbau-Prämie
           05 AE-WOPANSPRUCH          PIC  S9(007)V99.
           05 AE-WOPANSPRUCH-AEKZ     PIC  X.
      *
      ***  Sparzulage frei ab. Datum i.d.F. JJJJMMTT.
           05 AE-SPARZULFREIAB        PIC  9(008).
           05 AE-SPARZULFREIAB-AEKZ   PIC  X.
      *
      ***  Vermoegenswirksame Leistung(VL). Wurde auf diesen Vertrag
      ***  VL einbezahlt ? 'J' Ja, 'N' Nein, Blank.
           05 AE-VWLKZ                PIC  X.
           05 AE-VWLKZ-AEKZ           PIC  X.
      *
      ***  ImmoFit-KZ. Für MOREBA-Steuerung notwendig.
      ***  'A' aktiver oder 'I'naktiver ImmoFit-Vertrag.
           05 AE-IMMOFITKZ            PIC  X.
           05 AE-IMMOFITKZ-AEKZ       PIC  X.
      *
      ***  Werbeverbot-Kennzeichen. hat der kunbde das Werbeverbot aus-
      ***  gesprochen ? 'J' Ja oder 'N' Nein oder Blank.
      ***  (Derzeit ist jedoch keine Anzeige in KI erwuenscht.)
           05 AE-WERBVERBOTKZ         PIC  X.
           05 AE-WERBVERBOTKZ-AEKZ    PIC  X.
    <<*
180610**
280912     05 AE-DATGHBZINSBEGR        PIC  9(008).
>>    *    Guthabenszinsbegrenzung-Ab: Datum ab dem die Badenia nur
      *    noch maximal die Bausparsumme zur Zinsermittlung heranzieht.
      *    Format JJJJMMTT
           05 AE-DATGHBZINSBEGR-AEKZ   PIC  X.


           05 AE-MAXZINSKAPITAL        PIC  S9(009)V99.
      *    Maximal verzinstes Guthaben
           05 AE-MAXZINSKAPITAL-AEKZ   PIC  X.


           05 AE-MIETKAUTIONKZ         PIC  X.
      *    Mietkaution liegt vor: Ausprägung 'J'a, 'N'ein oder ' '
           05 AE-MIETKAUTIONKZ-AEKZ    PIC  X.


           05 AE-PASSWVEREINB          PIC  X.
      *    Geheimwortvereinb. liegt vor: Ausprägung 'J'a, 'N'ein od. ' '
           05 AE-PASSWVEREINB-AEKZ     PIC  X.


           05 AE-DATLETZTERKAZ         PIC  9(008).
      *    Letzter Kontoauszug am; Format JJJJMMTT
           05 AE-DATLETZTERKAZ-AEKZ    PIC  X.


           05 AE-NRLETZTERKAZ          PIC  X(007).
      *    Nummer des aktuellen Kontoauszug; Format XXXX/XX
           05 AE-NRLETZTERKAZ-AEKZ     PIC  X.


           05 AE-DATNVBESCHEIN         PIC  9(008).
      *    Nichtveranlagungsbescheinigung-Bis: Datum, bis zu dem die
      *    Zinserträge des Kunde von der Abgeltungssteuer befreit sind.
      *    Format JJJJMMTT
           05 AE-DATNVBESCHEIN-AEKZ    PIC  X.


           05 AE-VLPERSONALTKZ         PIC  X.
    <<*    VL-Personalisiert: Ausprägungen 'J'a, 'N'ein oder ' '
280912     05 AE-VLPERSONALTKZ-AEKZ    PIC  X.


121114     05 AE-ONLINE-KI-PRODUKT       PIC  X(050).
>>         05 AE-ONLINE-KI-PRODUKT-AEKZ  PIC  X(001).
           05 AE-ONLINE-KI-ART           PIC  X(050).
           05 AE-ONLINE-KI-ART-AEKZ      PIC  X(001).
           05 AE-FRONTEND-TECHNISCH      PIC  X(008).
           05 AE-FRONTEND-TECHNISCH-AEKZ PIC  X(001).
<<         05 AE-ABB-VERSION             PIC  X(007).
121114     05 AE-ABB-VERSION-AEKZ        PIC  X(001).
           05 AE-BONUS-ART               PIC  9(002).
           05 AE-BONUS-ART-AEKZ          PIC  X(001).
           05 AE-BONUS-BEGINN            PIC  9(008).
           05 AE-BONUS-BEGINN-AEKZ       PIC  X(001).
           05 AE-TUB-AKTION              PIC  X(001).
           05 AE-TUB-AKTION-AEKZ         PIC  X(001).
           05 AE-SONDERZAHLUNG           PIC  9(003)V9(002).
           05 AE-SONDERZAHLUNG-AEKZ      PIC  X(001).
           05 AE-SONDERTILGUNG           PIC  9(003)V9(002).
           05 AE-SONDERTILGUNG-AEKZ      PIC  X(001).
           05 AE-PEAUSZAHLART            PIC  X(001).
           05 AE-PEAUSZAHLART-AEKZ       PIC  X(001).
                  
           05 FILLER                     PIC  X(063).
      *******************************************************



