      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 1999
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1999 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1118.CPY  $
      *    $Revision:   2.5  $
      *
      *    $Log:   L:/mf/CPY/DRKI1118.CPv  $
      *
      *   Rev 2.5   Oct 31 2005 15:51:22   t13ex27
      *AKI00521: DB-Änderung für Fix 80 PC-Programme
      *
      *   Rev 2.4   Jul 21 2005 10:23:44   t13ex27
      *AKI00505: DB-Änderung für Fix 77 PC-Programme und -Prozeduren
      *
      *   Rev 2.3   Jun 23 2004 15:20:52   t13ex27
      *Code-Page Korrektur
      *
      *   Rev 2.2   Mar 05 2002 09:47:16   T13EX27
      *FKI00590 "§" falsch umgesetzt
      *
      *   Rev 2.1   22 Oct 2001 14:41:10   t13ex27
      *Umstellung von OS2 auf W2000
      *
      *   Rev 2.0   07 Jun 2000 17:08:12   P13SP20
      *Archiverstellung
      *
      ****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00113!22.10.01!2.1 ! NEU                       ! Frenzel  *
      * FKI00590!05.03.02!2.2 ! Falsches Zeichen für "§"  ! Frenzel  *
      * FKI00861!23.06.04!2.3 ! Falsche Zeichen für é usw.! Frenzel  *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *---------------------------------------------------------------*
      * Codepage fuer Windows 2000
      *---------------------------------------------------------------*
       01  HEX-ASCII-ZEICHEN.
000001           10  FILLER  PIC X VALUE X"00".
000002           10  FILLER  PIC X VALUE X"01".
000003           10  FILLER  PIC X VALUE X"02".
000004           10  FILLER  PIC X VALUE X"03".
000005           10  FILLER  PIC X VALUE X"EC".
000006           10  FILLER  PIC X VALUE X"09".
000007           10  FILLER  PIC X VALUE X"CA".
000008           10  FILLER  PIC X VALUE X"7F".
000009           10  FILLER  PIC X VALUE X"E2".
000010           10  FILLER  PIC X VALUE X"D2".
000011           10  FILLER  PIC X VALUE X"D3".
000012           10  FILLER  PIC X VALUE X"0B".
000013           10  FILLER  PIC X VALUE X"0C".
000014           10  FILLER  PIC X VALUE X"0D".
000015           10  FILLER  PIC X VALUE X"0E".
000016           10  FILLER  PIC X VALUE X"A9".
000017           10  FILLER  PIC X VALUE X"10".
000018           10  FILLER  PIC X VALUE X"11".
000019           10  FILLER  PIC X VALUE X"12".
000020           10  FILLER  PIC X VALUE X"13".
000021           10  FILLER  PIC X VALUE X"EF".
000022           10  FILLER  PIC X VALUE X"C5".
000023           10  FILLER  PIC X VALUE X"08".
000024           10  FILLER  PIC X VALUE X"CB".
000025           10  FILLER  PIC X VALUE X"18".
000026           10  FILLER  PIC X VALUE X"19".
000027           10  FILLER  PIC X VALUE X"9A".
000028           10  FILLER  PIC X VALUE X"D8".
000029           10  FILLER  PIC X VALUE X"1C".
000030           10  FILLER  PIC X VALUE X"1D".
000031           10  FILLER  PIC X VALUE X"1E".
000032           10  FILLER  PIC X VALUE X"1F".
000033           10  FILLER  PIC X VALUE X"B7".
000034           10  FILLER  PIC X VALUE X"B8".
000035           10  FILLER  PIC X VALUE X"B9".
000036           10  FILLER  PIC X VALUE X"BB".
000037           10  FILLER  PIC X VALUE X"8E".
000038           10  FILLER  PIC X VALUE X"0A".
000039           10  FILLER  PIC X VALUE X"17".
000040           10  FILLER  PIC X VALUE X"1B".
000041           10  FILLER  PIC X VALUE X"CC".
000042           10  FILLER  PIC X VALUE X"CD".
000043           10  FILLER  PIC X VALUE X"CF".
000044           10  FILLER  PIC X VALUE X"D0".
000045           10  FILLER  PIC X VALUE X"D1".
000046           10  FILLER  PIC X VALUE X"05".
000047           10  FILLER  PIC X VALUE X"06".
000048           10  FILLER  PIC X VALUE X"07".
000049           10  FILLER  PIC X VALUE X"D9".
000050           10  FILLER  PIC X VALUE X"DA".
000051           10  FILLER  PIC X VALUE X"16".
000052           10  FILLER  PIC X VALUE X"DD".
000053           10  FILLER  PIC X VALUE X"DE".
000054           10  FILLER  PIC X VALUE X"E1".
000055           10  FILLER  PIC X VALUE X"E0".
000056           10  FILLER  PIC X VALUE X"04".
000057           10  FILLER  PIC X VALUE X"E3".
000058           10  FILLER  PIC X VALUE X"E5".
000059           10  FILLER  PIC X VALUE X"E9".
000060           10  FILLER  PIC X VALUE X"EB".
000061           10  FILLER  PIC X VALUE X"B0".
000062           10  FILLER  PIC X VALUE X"B1".
000063           10  FILLER  PIC X VALUE X"9E".
000064           10  FILLER  PIC X VALUE X"1A".
000065           10  FILLER  PIC X VALUE X"20".
000066           10  FILLER  PIC X VALUE X"C9".
000067           10  FILLER  PIC X VALUE X"E2".
000068           10  FILLER  PIC X VALUE X"7B".
000069           10  FILLER  PIC X VALUE X"E0".
000070           10  FILLER  PIC X VALUE X"E1".
000071           10  FILLER  PIC X VALUE X"F2".
000072           10  FILLER  PIC X VALUE X"E5".
000073           10  FILLER  PIC X VALUE X"E7".
000074           10  FILLER  PIC X VALUE X"F1".
000075           10  FILLER  PIC X VALUE X"C4".
000076           10  FILLER  PIC X VALUE X"2E".
000077           10  FILLER  PIC X VALUE X"3C".
000078           10  FILLER  PIC X VALUE X"28".
000079           10  FILLER  PIC X VALUE X"2B".
000080           10  FILLER  PIC X VALUE X"21".
000081           10  FILLER  PIC X VALUE X"26".
000082           10  FILLER  PIC X VALUE X"E9".
000083           10  FILLER  PIC X VALUE X"EA".
000084           10  FILLER  PIC X VALUE X"EB".
000085           10  FILLER  PIC X VALUE X"E8".
000086           10  FILLER  PIC X VALUE X"ED".
000087           10  FILLER  PIC X VALUE X"EE".
000088           10  FILLER  PIC X VALUE X"EF".
000089           10  FILLER  PIC X VALUE X"EC".
000090           10  FILLER  PIC X VALUE X"7E".
000091           10  FILLER  PIC X VALUE X"DC".
000092           10  FILLER  PIC X VALUE X"24".
000093           10  FILLER  PIC X VALUE X"2A".
000094           10  FILLER  PIC X VALUE X"29".
000095           10  FILLER  PIC X VALUE X"3B".
000096           10  FILLER  PIC X VALUE X"5E".
000097           10  FILLER  PIC X VALUE X"2D".
000098           10  FILLER  PIC X VALUE X"2F".
000099           10  FILLER  PIC X VALUE X"C2".
000100           10  FILLER  PIC X VALUE X"5B".
000101           10  FILLER  PIC X VALUE X"C0".
000102           10  FILLER  PIC X VALUE X"C1".
000103           10  FILLER  PIC X VALUE X"C3".
000104           10  FILLER  PIC X VALUE X"C5".
000105           10  FILLER  PIC X VALUE X"C7".
000106           10  FILLER  PIC X VALUE X"D1".
000107           10  FILLER  PIC X VALUE X"F6".
000108           10  FILLER  PIC X VALUE X"2C".
000109           10  FILLER  PIC X VALUE X"25".
000110           10  FILLER  PIC X VALUE X"5F".
000111           10  FILLER  PIC X VALUE X"3E".
000112           10  FILLER  PIC X VALUE X"3F".
000113           10  FILLER  PIC X VALUE X"BA".
000114           10  FILLER  PIC X VALUE X"C9".
000115           10  FILLER  PIC X VALUE X"CA".
000116           10  FILLER  PIC X VALUE X"CB".
000117           10  FILLER  PIC X VALUE X"C8".
000118           10  FILLER  PIC X VALUE X"CD".
000119           10  FILLER  PIC X VALUE X"CE".
000120           10  FILLER  PIC X VALUE X"CF".
000121           10  FILLER  PIC X VALUE X"CC".
000122           10  FILLER  PIC X VALUE X"60".
000123           10  FILLER  PIC X VALUE X"3A".
000124           10  FILLER  PIC X VALUE X"23".
000125           10  FILLER  PIC X VALUE X"A7".
000126           10  FILLER  PIC X VALUE X"27".
000127           10  FILLER  PIC X VALUE X"3D".
000128           10  FILLER  PIC X VALUE X"22".
000129           10  FILLER  PIC X VALUE X"C3".
000130           10  FILLER  PIC X VALUE X"61".
000131           10  FILLER  PIC X VALUE X"62".
000132           10  FILLER  PIC X VALUE X"63".
000133           10  FILLER  PIC X VALUE X"64".
000134           10  FILLER  PIC X VALUE X"65".
000135           10  FILLER  PIC X VALUE X"66".
000136           10  FILLER  PIC X VALUE X"67".
000137           10  FILLER  PIC X VALUE X"68".
000138           10  FILLER  PIC X VALUE X"69".
000139           10  FILLER  PIC X VALUE X"AE".
000140           10  FILLER  PIC X VALUE X"AF".
000141           10  FILLER  PIC X VALUE X"C6".
000142           10  FILLER  PIC X VALUE X"C7".
000143           10  FILLER  PIC X VALUE X"C8".
000144           10  FILLER  PIC X VALUE X"A4".
000145           10  FILLER  PIC X VALUE X"F8".
000146           10  FILLER  PIC X VALUE X"6A".
000147           10  FILLER  PIC X VALUE X"6B".
000148           10  FILLER  PIC X VALUE X"6C".
000149           10  FILLER  PIC X VALUE X"6D".
000150           10  FILLER  PIC X VALUE X"6E".
000151           10  FILLER  PIC X VALUE X"6F".
000152           10  FILLER  PIC X VALUE X"70".
000153           10  FILLER  PIC X VALUE X"71".
000154           10  FILLER  PIC X VALUE X"72".
000155           10  FILLER  PIC X VALUE X"A6".
000156           10  FILLER  PIC X VALUE X"20".
000157           10  FILLER  PIC X VALUE X"91".
000158           10  FILLER  PIC X VALUE X"CE".
000159           10  FILLER  PIC X VALUE X"92".
000160           10  FILLER  PIC X VALUE X"0F".
000161           10  FILLER  PIC X VALUE X"E6".
000162           10  FILLER  PIC X VALUE X"DF".
000163           10  FILLER  PIC X VALUE X"73".
000164           10  FILLER  PIC X VALUE X"74".
000165           10  FILLER  PIC X VALUE X"75".
000166           10  FILLER  PIC X VALUE X"76".
000167           10  FILLER  PIC X VALUE X"77".
000168           10  FILLER  PIC X VALUE X"78".
000169           10  FILLER  PIC X VALUE X"79".
000170           10  FILLER  PIC X VALUE X"7A".
000171           10  FILLER  PIC X VALUE X"AD".
000172           10  FILLER  PIC X VALUE X"A8".
000173           10  FILLER  PIC X VALUE X"D4".
000174           10  FILLER  PIC X VALUE X"D5".
000175           10  FILLER  PIC X VALUE X"99".
000176           10  FILLER  PIC X VALUE X"D7".
000177           10  FILLER  PIC X VALUE X"9B".
000178           10  FILLER  PIC X VALUE X"A3".
000179           10  FILLER  PIC X VALUE X"9D".
000180           10  FILLER  PIC X VALUE X"FA".
000181           10  FILLER  PIC X VALUE X"9F".
000182           10  FILLER  PIC X VALUE X"40".
000183           10  FILLER  PIC X VALUE X"14".
000184           10  FILLER  PIC X VALUE X"AC".
000185           10  FILLER  PIC X VALUE X"AB".
000186           10  FILLER  PIC X VALUE X"BE".
000187           10  FILLER  PIC X VALUE X"AC".
000188           10  FILLER  PIC X VALUE X"B3".
000189           10  FILLER  PIC X VALUE X"84".
000190           10  FILLER  PIC X VALUE X"FE".
000191           10  FILLER  PIC X VALUE X"BF".
000192           10  FILLER  PIC X VALUE X"E7".
000193           10  FILLER  PIC X VALUE X"E4".
000194           10  FILLER  PIC X VALUE X"41".
000195           10  FILLER  PIC X VALUE X"42".
000196           10  FILLER  PIC X VALUE X"43".
000197           10  FILLER  PIC X VALUE X"44".
000198           10  FILLER  PIC X VALUE X"45".
000199           10  FILLER  PIC X VALUE X"46".
000200           10  FILLER  PIC X VALUE X"47".
000201           10  FILLER  PIC X VALUE X"48".
000202           10  FILLER  PIC X VALUE X"49".
000203           10  FILLER  PIC X VALUE X"E8".
000204           10  FILLER  PIC X VALUE X"F4".
000205           10  FILLER  PIC X VALUE X"7C".
000206           10  FILLER  PIC X VALUE X"F2".
000207           10  FILLER  PIC X VALUE X"F3".
000208           10  FILLER  PIC X VALUE X"F5".
000209           10  FILLER  PIC X VALUE X"FC".
000210           10  FILLER  PIC X VALUE X"4A".
000211           10  FILLER  PIC X VALUE X"4B".
000212           10  FILLER  PIC X VALUE X"4C".
000213           10  FILLER  PIC X VALUE X"4D".
000214           10  FILLER  PIC X VALUE X"4E".
000215           10  FILLER  PIC X VALUE X"4F".
000216           10  FILLER  PIC X VALUE X"50".
000217           10  FILLER  PIC X VALUE X"51".
000218           10  FILLER  PIC X VALUE X"52".
000219           10  FILLER  PIC X VALUE X"EE".
000220           10  FILLER  PIC X VALUE X"FB".
000221           10  FILLER  PIC X VALUE X"7D".
000222           10  FILLER  PIC X VALUE X"F9".
000223           10  FILLER  PIC X VALUE X"FA".
000224           10  FILLER  PIC X VALUE X"FF".
000225           10  FILLER  PIC X VALUE X"D6".
000226           10  FILLER  PIC X VALUE X"F0".
000227           10  FILLER  PIC X VALUE X"53".
000228           10  FILLER  PIC X VALUE X"54".
000229           10  FILLER  PIC X VALUE X"55".
000230           10  FILLER  PIC X VALUE X"56".
000231           10  FILLER  PIC X VALUE X"57".
000232           10  FILLER  PIC X VALUE X"58".
000233           10  FILLER  PIC X VALUE X"59".
000234           10  FILLER  PIC X VALUE X"5A".
000235           10  FILLER  PIC X VALUE X"B2".
000236           10  FILLER  PIC X VALUE X"D4".
000237           10  FILLER  PIC X VALUE X"5C".
000238           10  FILLER  PIC X VALUE X"D2".
000239           10  FILLER  PIC X VALUE X"D3".
000240           10  FILLER  PIC X VALUE X"D5".
000241           10  FILLER  PIC X VALUE X"30".
000242           10  FILLER  PIC X VALUE X"31".
000243           10  FILLER  PIC X VALUE X"32".
000244           10  FILLER  PIC X VALUE X"33".
000245           10  FILLER  PIC X VALUE X"34".
000246           10  FILLER  PIC X VALUE X"35".
000247           10  FILLER  PIC X VALUE X"36".
000248           10  FILLER  PIC X VALUE X"37".
000249           10  FILLER  PIC X VALUE X"38".
000250           10  FILLER  PIC X VALUE X"39".
000251           10  FILLER  PIC X VALUE X"DB".
000252           10  FILLER  PIC X VALUE X"DB".
000253           10  FILLER  PIC X VALUE X"5D".
000254           10  FILLER  PIC X VALUE X"D9".
000255           10  FILLER  PIC X VALUE X"DA".
000256           10  FILLER  PIC X VALUE X"FF".
