      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  09.04.2020
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2020 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3774.CPY  $
      *    $Revision:   2.3  $
      *
      *    $Log:   L:/mf/CPY/DRKI3774.CPv  $
      *
      *   Rev 2.3   Oct 08 2020 14:41:26   u130684
      *AKI01773: Anbindung Compeon an DV - Verarbeitung
      *
      *   Rev 2.2   Oct 06 2020 17:09:54   u130684
      *AKI01773: Anbindung Compeon an DV - Verarbeitung
      *
      *   Rev 2.1   Jun 23 2020 13:15:52   t13ex27
      *AKI01773: Anbindung Compeon an DV - Verarbeitung
      *
      *   Rev 2.0   Apr 09 2020 16:06:48   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*

             10 'XX'-VERARB-KZ                  PIC  X(001).
             10 'XX'-GES                        PIC  9(002).
             10 'XX'-VNR                        PIC  9(015).
 
             10 'XX'-AKTSALDO                   PIC S9(12)V9(2) COMP-3.
             10 'XX'-AKTSALDO-KZ                PIC  X(001).
 
             10 'XX'-AUSZAHLUNG                 PIC  X(010).
             10 'XX'-AUSZAHLUNG-KZ              PIC  X(001).
 
             10 'XX'-DELETEKZ                   PIC  X(0001).
             10 'XX'-DELETEKZ-KZ                PIC  X(001).
 
             10 'XX'-FAELLIG                    PIC  X(010).
             10 'XX'-FAELLIG-KZ                 PIC  X(001).
 
             10 'XX'-FINBETRAG                  PIC S9(12)V9(2) COMP-3.
             10 'XX'-FINBETRAG-KZ               PIC  X(001).
 
             10 'XX'-IBANKREDIT                 PIC  X(0034).
             10 'XX'-IBANKREDIT-KZ              PIC  X(001).
 
             10 'XX'-PRODUKTART                 PIC  X(0001).
             10 'XX'-PRODUKTART-KZ              PIC  X(001).
 
             10 'XX'-PRODUKTGEBER               PIC  X(0030).
             10 'XX'-PRODUKTGEBER-KZ            PIC  X(001).
 
             10 'XX'-PRODUKTID                  PIC S9(4) COMP.
             10 'XX'-PRODUKTID-KZ               PIC  X(001).
 
             10 'XX'-RATE                       PIC S9(12)V9(2) COMP-3.
             10 'XX'-RATE-KZ                    PIC  X(001).
 
             10 'XX'-RESTLAUF                   PIC S9(3)V COMP-3.
             10 'XX'-RESTLAUF-KZ                PIC  X(001).
 
             10 'XX'-SOLLZINS                   PIC S9(2)V9(4) COMP-3.
             10 'XX'-SOLLZINS-KZ                PIC  X(001).
 
             10 'XX'-ZUSAGE                     PIC  X(010).
             10 'XX'-ZUSAGE-KZ                  PIC  X(001).


