      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  15.11.2016
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2016 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3115.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI3115.CPv  $
      *
      *   Rev 2.1   Nov 28 2016 10:08:28   t13ex27
      *AKI01462: Korrespondenz-Makler AML
      *
      *   Rev 2.0   Nov 15 2016 16:42:36   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*

      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI01462!15.11.16!2.1 ! NEU                       ! IFR      *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *
      *    AML-Komplettbestand Maklerstorno
      *
      ****************************************************************
      *
               05  'XXX'-AML-SA        PIC X(01).
      *            SATZART        = 'C'
               05  'XXX'-AML-KEY.
                   10  'XXX'-AML-VNR   PIC X(10).
      *                VERTRAGSNUMMER

               05  'XXX'-AML-ZUST      PIC 9(04).
      *            VERTRAGSZUSTAND

