      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  11.12.2017
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2017 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3184.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI3184.CPv  $
      *
      *   Rev 2.1   Feb 19 2018 08:13:00   t13ac20
      *AKI01534: G20 - Projekt LENA: Kunde
      *
      *   Rev 2.0   Dec 11 2017 11:28:18   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *
      *    ÄNDERUNGSDATEN AUS ERMITTLUNG KUNDE FÜR KUNDE
      *    AMLEBEN - G20 (PSLIFE)
      *
      *---------------------------------------------------------------*
      *    LOGBUCH
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AKI01534!11.12.17!2.1 ! NEUERSTELLUNG             ! SWO
      *         !        !    !                           !
      *         !        !    !                           !
      *****************************************************************
      *
           05 VERARB-KZN                         PIC  X(001).
           05 GES                                PIC  X(002).
           05 VNR                                PIC  X(015).
           05 ROLLE                              PIC  X(004).
      *
           05 NACHNAME-ALT                       PIC  X(040).
           05 VORNAME-ALT                        PIC  X(040).
           05 GEBDAT-ALT                         PIC  X(010).
      *
           05 BZ-ROLLE                           PIC  X(001).
      *
           05 NACHNAME                           PIC  X(040).
           05 NACHNAME-KZN                       PIC  X(001).
           05 VORNAME                            PIC  X(040).
           05 VORNAME-KZN                        PIC  X(001).
           05 GEBDAT                             PIC  X(010).
           05 GEBDAT-KZN                         PIC  X(001).
           05 ANREDE                             PIC S9(002).
           05 ANREDE-KZN                         PIC  X(001).
           05 GESCHLECHT                         PIC  X(001).
           05 GESCHLECHT-KZN                     PIC  X(001).
           05 STRASSE                            PIC  X(040).
           05 STRASSE-KZN                        PIC  X(001).
           05 POSTFACH                           PIC  X(006).
           05 POSTFACH-KZN                       PIC  X(001).
           05 AUSL-KZN                           PIC  X(003).
           05 AUSL-KZN-KZN                       PIC  X(001).
           05 PLZ                                PIC  X(009).
           05 PLZ-KZN                            PIC  X(001).
           05 ORT                                PIC  X(040).
           05 ORT-KZN                            PIC  X(001).
           05 IBAN                               PIC  X(034).
           05 IBAN-KZN                           PIC  X(001).
           05 BIC                                PIC  X(011).
           05 BIC-KZN                            PIC  X(001).

