      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 1999
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1999 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1006.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:\MF\CPY\DRKI1006.CPv  $
      *
      *   Rev 2.1   Mar 10 2000 09:24:34   T13EX49
      *FKI00340 - erstmalige Übergabe
      *
      *   Rev 2.0   Feb 09 2000 14:16:34   P13SP20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
       01  DRKI01006.
           05 I-ADRESS-ID                  PIC X(13).
           05 I-ORT                        PIC X(30).
           05 FILLER                       PIC X(01).
           05 I-STRASSE                    PIC X(45).
           05 FILLER                       PIC X(01).


