      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  20.02.2004
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2004 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1645.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI1645.CPv  $
      *
      *   Rev 2.1   Feb 23 2004 10:12:36   t13ex49
      *erstmalige Übergabe
      *
      *   Rev 2.0   Feb 20 2004 09:50:20   t13ex49
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *    COPY-MEMBER: DRKI1645                                      *
      *    --------------------------------------------------------   *
      *    Korrektur der PERSONADRESSBEZ für Haushalte wg. Repl.fehler*
      *    --------------------------------------------------------   *
      *    ERSTELLT: Peter Pohl                                       *
      *****************************************************************
      *    VERSION  1
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00114!20.02.04!    ! NEUERSTELLUNG             !Peter Pohl*
      * -------------------------------------------------------------*
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      ****************************************************************
      *   Länge 78 Byte)                        *
      *                                                              *
      ****************************************************************
      *
       01 DRKI1645.
          05 FILLER                         PIC  X(002).
          05 DRKI1645-VBNUMMER              PIC S9(009) COMP.
          05 DRKI1645-PERSABPERSONENID      PIC  X(013).
          05 DRKI1645-PERSABADRESSEID       PIC  X(013).
          05 DRKI1645-PERSABADRESSARTID     PIC S9(004) COMP.
          05 DRKI1645-PERSABVERTRADRKZ      PIC  X(001).
      ***** Ende Copy-Member DRKI1645 *****************************

