      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  11.08.2011
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2011 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI2521.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI2521.CPv  $
      *
      *   Rev 2.1   Sep 06 2011 15:41:40   t13ex52
      *AKI01037: SUH - FK-Maskenänderungen 
      *
      *   Rev 2.0   Aug 11 2011 12:31:14   t13ex52
      *Archiverstellung
      *    Satzlaenge: 166 Byte (160 Byte wg. COMP.)
      *----------------------------------------------------------------*
       01  WU-SGWBESVEREINB.
          05 SGWVERTRAGSID         PIC  X(13).
          05 SGWVETLFDNR           PIC  S9(4) COMP.
          05 SGWRGID               PIC  S9(4) COMP.
          05 SGWPSGBLFDNR          PIC  S9(4) COMP.
          05 SGWEINZVTGHOSTID      PIC  X(15).
          05 SGWBEDKLAUSELNR       PIC  X(20).
          05 SGWVERTBTEILTXT       PIC  X(80).
          05 LETZTEAENDERUNG       PIC  X(26).
      **
      ******************************************************************
      ******************** Ende DRKI2521 *******************************
      ******************************************************************
