      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  02.09.2019
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2019 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3721.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/DRKI3721.CPv  $
      *
      *   Rev 2.2   Sep 20 2019 10:52:30   t13ac23
      *AKI01717: Neue KD-Zuordnung 
      *
      *   Rev 2.1   Sep 19 2019 08:38:12   t13ac23
      *AKI01717: Neue KD-Zuordnung
      *
      *   Rev 2.0   Sep 02 2019 13:24:32   t13ac23
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *
      *    Änderung der KB-GRUPPE AMLEBEN
      *
      *---------------------------------------------------------------*
      *    LOGBUCH
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AKI01717!30.08.19!2.1 ! Neuerstellung             ! Detmar
      *         !        !    !                           !
      *         !        !    !                           !
      *****************************************************************
      *
       01  AML-RUMS-AEND.
           05 DRKI3721-KB-GRUPPE-NEU.
              10 DRKI3721-VERTRAGSNUMMER         PIC X(015).
              10 FILLER                          PIC X(002).
              10 DRKI3721-KB-GRUPPE              PIC X(003).

