      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 1999
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1999 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0953.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:\MF\CPY\DRKI0953.CPv  $
      *
      *   Rev 2.2   04 Sep 2000 11:00:34   T13EX49
      *AKI00071 - endgültige Einführung
      *
      *   Rev 2.1   Apr 14 2000 08:45:56   T13EX49
      *AKI00071 - erstmalige Übergabe
      *
      *   Rev 2.0   Nov 29 1999 13:55:04   P13SP20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *    COPY-MEMBER: DRKI0953                                      *
      *    --------------------------------------------------------   *
      *    VB-Schnittstelle -                                         *
      *    Datei mit VB-NR, Direktion und Strukturstufe               *
      *    --------------------------------------------------------   *
      *    ERSTELLT: Peter Pohl                                       *
      *    DATUM:    10. 01. 2000                                     *
      *****************************************************************
      *    VERSION  1
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00071!10.01.00! 01 ! NEU                       !Peter Pohl*
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      *---------------------------------------------------------------*
       01  SORT-SATZ.
           05 VB-NR                        PIC 9(07).
           05 DIR-NR                       PIC 9(07).
           05 MS-NR                        PIC 9(04).
           05 ST-TYP                       PIC 9(04).
      *           ED   = 01                                             00040000
      *           MA   = 02                                             00050000
      *           GK   = 03                                             00060000
      *           RFT  = 04                                             00070000
      *           KL   = 05                                             00080000
      *           JPI  = 06                                             00090000
      *           SDNR = 07                                             00100000

      *---------------------------------------------------------------*
