      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  03.02.2004
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2004 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1635.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI1635.CPv  $
      *
      *   Rev 2.1   Feb 03 2004 10:18:02   t13ex49
      *Erstmalige Übergabe
      *
      *   Rev 2.0   Feb 03 2004 08:30:00   t13ex49
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00114!03.02.04! 01 ! NEUERSTELLUNG             !Peter Pohl*
      * -------------------------------------------------------------*
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      ****************************************************************
      *    Korrektur Huaptadressen                                   *
      *    PersonenID und AdresseNeuID aus AdressAenderung           *
      *                                                              *
      ****************************************************************
      *
       01 DRKI1635.
          05 DRKI1635-SATZ.
            10 DRKI1635-ADAPERSONENID            PIC  X(013).
            10 DRKI1635-ADAADRESSNEUID           PIC  X(013).
      *
      ***** Ende Copy-Member DRKI1635 *****************************

