      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  16.01.2012
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKW0026.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKW0026.CPv  $
      *
      *   Rev 2.1   Jan 19 2012 15:41:22   t13ex27
      *AKI01112: Rück-DTA-Wien mit aktuellen Daten
      *
      *   Rev 2.0   Jan 16 2012 11:35:04   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *                                                               *
      *    COPY-Member zum Rück-DTA                                   *
      *                                                               *
      *    SATZLÄNGE   78                                             *
      *                                                               *
      *---------------------------------------------------------------*
      ****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI01112!16.01.12!2.1 ! Neu                       ! IFR      *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
       01  DRKW0026.

      *        Vertragssystem_id
           05  DRKW0026-VUBRDTAZIEL                    PIC  9(002).
           05  DRKW0026-VERPARTGESELLSCHID             PIC  9(002).
           05  DRKW0026-VERVERTRAGSNUMMER              PIC  X(015).
           05  DRKW0026-MITARBEITERNR                  PIC  9(007).
           05  DRKW0026-VERINTERNEVERTRNR              PIC  9(007).
           05  DRKW0026-KNDANZNAME                     PIC  X(025).
           05  DRKW0026-KNDANZVORNAME                  PIC  X(020).

      ****************************************************************
