      *---------------------------------------------------------------* 
      *    Standard fuer alle Objekte unter PVCS VM                     
      *            Datum      :  21.11.2014                             
      *            Kategorie  :  Copystrecke                            
      *---------------------------------------------------------------* 
      *    Copyright (c) 2014 ATLAS Dienstleistungen f. V. GmbH         
      *---------------------------------------------------------------* 
      *    $Workfile:   DRMA5054.CPY  $                                         

      *    $Revision:   2.1  $                                          
      *                                                                 
      *    $Log:   L:/mf/CPY/DRMA5054.CPv  $                                
      *
      *   Rev 2.1   Nov 21 2014 10:29:10   T13AC20
      *AMA00123: Auszahlung aus geschlossenen ED-Konten bei tätigem
      * D-Leiter
      *                                                                 
      *   Rev 2.0   Nov 21 2014 09:40:46   T13AC20                      
      *Archiverstellung                                                 
      *                                                                 
      *---------------------------------------------------------------* 
      **************************************************************    
      *                                                                 
      *     EINGABE: UPMA5017   FUNKTION V1                             
      *                                                                 
      *     SOURCE-NAME      :  DRMA5054                                
      *                                                                 
      *     GENERIERUNG      :  21.11.2014/10:25:16                     
      *     DURCH            :  PMMA5004/01.00.01                       
      *                                                                 
      * LOGBUCH                                                         
      * AENDERUNGEN:                                                    
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME       
      * --------------------------------------------------------------  
      * AMA00123!19.11.14!2.1  ! NEUERSTELLUNG             ! WOLFF      
      *         !        !     !                           !            
      *         !        !     !                           !            
      *                                                                 
      * ENDELOGBUCH                                                     
      **************************************************************    
      *                                                                 
      *                                                                 
           05 DRMA5054.                                                 
              07 DGAT0100.                                              
                 09 FUNKTION            pic X(8).                       
              07 VERSION                pic X.                          
              07 VBNR                   pic 9(9).                       
      *                                                                 
      **************************************************************    
