      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  24.04.2014
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2014 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA2551.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA2551.CPv  $
      *
      *   Rev 2.1   Apr 29 2014 11:44:52   t13ac20
      *AMA00059: Badenia: Sourcen
      *
      *   Rev 2.0   Apr 24 2014 13:22:38   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     DATENSATZ: POSTVERTEILUNGSSCHL. BADENIA  - EINGABE
      *
      *     SOURCE-NAME      :  DRMA2551
      *
      *     GENERIERUNG      :  24.04.2014/13:26:42
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------+--------+-----+---------------------------+----------
      * AMA00059!24.04.14!2.1  ! NUR ÜBERNAHME AUS AACHEN  ! WOLFF
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA2551.
              07 SATZ-KZ                pic X.
              07 VBNR                   pic 9(6).
      *
      **************************************************************
