      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA0771.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA0771.CPv  $
      *
      *   Rev 2.1   Jun 28 2013 16:03:10   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Überdeckung je VB für SUSIS-Stammdaten
      *
      *     SOURCE-NAME      :  DRMA0771
      *     DMR-NAME         :  DR-OV0771
      *
      *     AUTOR            :  WOLFF, STEFAN
      *     GENERIERUNG      :  29.04.10/12:34
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA0771.
              07 VBNR                   PIC 9(9).
              07 UEBERDECK-BETR         PIC S9(9)V99   PACKED-DECIMAL.
      *
      **************************************************************
