      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  26.01.2015
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2015 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5058.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5058.CPv  $
      *
      *   Rev 2.1   Feb 13 2015 15:26:10   t13ac19
      *AMA00147: Änderung Sonderleistungen 2015 - Copies
      *
      *   Rev 2.0   Jan 26 2015 20:38:38   t13ac19
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     DATENSATZ: REF.BESTAND SONDERLEISTUNGEN VON DVAG
      *
      *     SOURCE-NAME      :  DRMA5058
      *
      *     GENERIERUNG      :  26.01.2015/19:58:40
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00147!26.01.15!2.1  ! NEUERSTELLUNG             ! O.WILHELM
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5058.
              07 DGMA0001.
                 09 VBNR                pic 9(7).
                 09 KTY-EP-TYP          pic 9(4).
                 09 KNR-EP-TYP          pic 9(4).
                 09 WERTUNGSZEITRAUM    pic 99.
      *
      **************************************************************

