      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  22.04.2014
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2014 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA2563.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA2563.CPv  $
      *
      *   Rev 2.1   Apr 29 2014 11:45:14   t13ac20
      *AMA00059: Badenia: Sourcen
      *
      *   Rev 2.0   Apr 22 2014 16:56:08   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     DATENSATZ: VB-NUMMERNDATEI BADENIA
      *
      *     SOURCE-NAME      :  DRMA2563
      *
      *     GENERIERUNG      :  22.04.2014/16:59:09
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------+--------+-----+---------------------------+----------
      * AMA00059!22.04.14!2.1  ! ÜBERNAHME AUS AACHEN      ! WOLFF
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA2563.
              07 SATZART                pic XX.
              07 VBNR                   pic 9(9).
      *
      **************************************************************
