      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  02.11.2016
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2016 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5158.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5158.CPv  $
      *
      *   Rev 2.1   Dec 21 2016 15:24:30   t13ac18
      *AMA00296: USt: LUCY II - CR Erweiterung Deckblatt - Sourcen
      *
      *   Rev 2.0   Nov 02 2016 14:46:12   t13ac18
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     DATENSATZ UST-KORR. DECKBLATT
      *
      *     SOURCE-NAME      :  DRMA5158
      *
      *     GENERIERUNG      :  23.11.2016/13:56:13
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00296!02.11.16!1    ! NEUANLAGE                 ! D.WILHELM
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5158.
              07 VBNR                   pic 9(9).
              07 KORREKTUR-ZIEL-STATUS  pic X.
              07 STEUERJAHR             pic X(4).
              07 NETTOBETRAG            pic S9(9)V99   packed-decimal.
              07 UST                    pic S9(9)V99   packed-decimal.
              07 BUCHDAT                pic X(10).
      *
      **************************************************************

