      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1256.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1256.CPv  $
      *
      *   Rev 2.1   Jun 28 2013 16:21:36   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA1253 - SELECT-2
      *     RDz
      *     SOURCE-NAME      :  DRMA1256
      *     DMR-NAME         :  DG-OV1256
      *
      *     AUTOR            :  WOLFF,STEFAN
      *     GENERIERUNG      :  15.11.2010/16:22:58
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA1256.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 VG                     PIC S9(4)      BINARY.
              07 FACH-KENNUNG           PIC X(10).
      *
      **************************************************************
