      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1459.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1459.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 08:59:36   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA1458 - SELECT
      *
      *     SOURCE-NAME      :  DRMA1459
      *     DMR-NAME         :  DG-OV1459
      *
      *     AUTOR            :  KOCHS, ANDREAS
      *     GENERIERUNG      :  26.05.00/14:16
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
000010     05 DRMA1459.
000020        07 FUNKTION               PICTURE X(8).
000030        07 NOTIZ-ID               PICTURE S9(15) PACKED-DECIMAL.
      *
      **************************************************************
