      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  27.05.2015
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2015 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5090.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5090.CPv  $
      *
      *   Rev 2.1   Jul 28 2015 15:43:02   t13ac18
      *AMA00128: USt: KOMA0504-Übernahme - Teil 1 - Copies Übernahm
      *e Referenztabelle
      *
      *   Rev 2.0   May 27 2015 14:25:20   t13ac18
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Arbeitssatz Referenztab. Prod. Daisy-Teil
      *
      *     SOURCE-NAME      :  DRMA5090
      *
      *     GENERIERUNG      :  01.06.2015/16:46:54
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00128!26.05.15!2.1  ! Neuerstellung             ! D.WILHELM
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5090.
              07 PG                     pic S9(4)      binary.
              07 PRODSCHL               pic S9(4)      binary.
              07 PROD-BEZEICH-KURZ      pic X(10).
              07 PROD-BEZEICH-LANG      pic X(40).
              07 PRODSPARTE             pic S9(4)      binary.
              07 KNR-ART-PROV-TYP       pic S9(4)      binary.
              07 UST-SATZ               pic S999V99    packed-decimal.
              07 SL-KZN                 pic S9(4)      binary.
      *
      **************************************************************

