      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA4382.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA4382.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 17:30:54   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe: UPMA4381   Funktion V1
      *     RDz
      *     SOURCE-NAME      :  DRMA4382
      *     DMR-NAME         :  DG-OV4382
      *
      *     AUTOR            :  VON HELDEN, URSULA
      *     GENERIERUNG      :  31.01.2012/16:43:25
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA4382.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 VG                     PIC 9(4).
      *
      **************************************************************
