      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  12.08.2015
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2015 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5118.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5118.CPv  $
      *
      *   Rev 2.1   Aug 27 2015 19:12:42   t13ac18
      *AMA00150: USt: KOMA0510-VB-Statistik - Copies
      *
      *   Rev 2.0   Aug 12 2015 09:44:22   t13ac17
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Provisionsverdienst UST-Anteil
      *
      *     SOURCE-NAME      :  DRMA5118
      *
      *     GENERIERUNG      :  21.08.2015/12:06:56
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00150!17.08.15!2.1  ! NEUERSTELLUNG             ! D.WILHELM
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5118.
              07 PV-GS-NT-EG-UST        pic S9(9)V99   packed-decimal.
              07 PV-GS-NT-GR-UST        pic S9(9)V99   packed-decimal.
              07 PV-FG-NT-EG-UST        pic S9(9)V99   packed-decimal.
              07 PV-FG-NT-GR-UST        pic S9(9)V99   packed-decimal.
      *
      **************************************************************

