      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1743.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1743.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 10:26:34   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA1742 - SELECT
      *
      *     SOURCE-NAME      :  DRMA1743
      *     DMR-NAME         :  DG-OV1743
      *
      *     AUTOR            :  WOLFF, STEFAN
      *     GENERIERUNG      :  11.08.00/16:50
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
000010     05 DRMA1743.
000020        07 FUNKTION               PICTURE X(8).
000030        07 DRUCK-ID               PICTURE S9(15) PACKED-DECIMAL.
      *
      **************************************************************
