      *---------------------------------------------------------------* 
      *    Standard fuer alle Objekte unter PVCS VM                     
      *            Datum      :  02.05.2014                             
      *            Kategorie  :  Copystrecke                            
      *---------------------------------------------------------------* 
      *                                                                 
      *---------------------------------------------------------------* 
      *    Copyright (c) 2014 ATLAS Dienstleistungen f. V. GmbH         
      *---------------------------------------------------------------* 
      *    $Workfile:   DRMA2853.CPY  $                                         

      *    $Revision:   2.1  $                                          
      *                                                                 
      *    $Log:   L:/mf/CPY/DRMA2853.CPv  $                                
      *
      *   Rev 2.1   May 06 2014 16:54:34   t13ac20
      *AMA00058: Advocard: Sourcen
      *                                                                 
      *   Rev 2.0   May 02 2014 13:03:12   t13ac20                      
      *Archiverstellung                                                 
      *                                                                 
      *---------------------------------------------------------------* 
      **************************************************************    
      *                                                                 
      *     DATENSATZ: VB-NUMMERNDATEI ADVOCARD                         
      *                                                                 
      *     SOURCE-NAME      :  DRMA2853                                
      *                                                                 
      *     GENERIERUNG      :  02.05.2014/13:06:22                     
      *     DURCH            :  PMMA5004/01.00.01                       
      *                                                                 
      * LOGBUCH                                                         
      * AENDERUNGEN:                                                    
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME       
      * --------+--------+-----+---------------------------+----------  
      * AMA00058!02.05.14!2.1  ! ÜBERNAHME AUS AACHEN      ! WOLFF      
      *         !        !     !                           !            
      *         !        !     !                           !            
      *                                                                 
      * ENDELOGBUCH                                                     
      **************************************************************    
      *                                                                 
      *                                                                 
           05 DRMA2853.                                                 
              07 SATZART                pic XX.                         
              07 VBNR                   pic 9(9).                       
      *                                                                 
      **************************************************************    
