      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA2425.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA2425.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 11:32:26   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA1193 - SELECT-3
      *
      *     SOURCE-NAME      :  DRMA2425
      *     DMR-NAME         :  DG-OV2425
      *
      *     AUTOR            :  WOLFF, STEFAN
      *     GENERIERUNG      :  13.05.08/11:33
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA2425.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 DIR-NR                 PIC S9(4)      BINARY.
      *
      **************************************************************
