      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  25.04.2018
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2018 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5166.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5166.CPv  $
      *
      *   Rev 2.1   Jun 12 2018 12:45:36   t13ac19
      *AMA00400: Generali Allfinanz AG - Copies OWI
      *
      *   Rev 2.0   Apr 25 2018 11:25:30   t13ac19
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Schnittstellensatz FS-CD
      *
      *     SOURCE-NAME      :  DRMA5166
      *
      *     AUTOR            :  WILHELM, OLIVER
      *     GENERIERUNG      :  27.12.07/13:54
      *     LETZTE AENDERUNG :
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00400!26.02.18!2.1  ! Neuerstellung             ! O.WILHELM
      *         !        !     ! (Kopie von DRMA3394)      !
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5166.
              07 VBNR                   PIC X(7).
              07 FACH-KENNUNG           PIC X(10).
              07 BUCHDAT                PIC X(10).
              07 KTO-KZN-1              PIC 9.
              07 GKTO-KZN-1             PIC 999.
              07 BNGBETR-1              PIC X(14).
              07 BUCHTEXT               PIC X(40).
              07 FILLER                 PIC X(15).
      *
      **************************************************************

