      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DROP0021.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\DROP0021.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 14:14:48   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.0   Nov 04 1995 09:00:50   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ***************************************************************** 00010000
      *    COPY-MEMBER: DROP0021  SATZDEFINITION SPNP-REFERENZDATEI   * 00020000
      *    --------------------------------------------------------   * 00030000
      *    VERSION   1    19.01.95 16:01:44
      *    --------------------------------------------------------   * 00050000
      *    ERSTELLT: WIECHERS                                         * 00060000
      *    DATUM:    19.01.1995                                       * 00070000
      *    STAND:    19.01.1995                                       * 00080000
      *****************************************************************
      ****************************************************************  00091000
      * AENDERUNGEN:                                                 *  00092000
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *  00093000
      * -------------------------------------------------------------*  00094000
      * AFOP0055!19.01.95! 01 ! NEU                       !WIECHERS  *  00095002
      *         !        !    !                           !          *  00096001
      *         !        !    !                           !          *  00099200
      *         !        !    !                           !          *  00099300
      *                                                              *  00099400
      * ENDE-LOGBUCH                                                 *  00099500
      ****************************************************************  00091000
       01  UF1-SATZ.
           05  UF1-KEY.
               10  UF1-GES           PIC 99.
               10  UF1-VSNR          PIC 9(15).
               10  UF1-INTVSNR       PIC 9(15).
