      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   drop0019.cpy  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:\MF\CPY\drop0019.cpv  $
      *
      *   Rev 2.1   19 Jul 2000 09:49:28   T13EX15
      *FOP0339: Anpassung an geäderte VIEW AT9017
      *
      *   Rev 2.0   Feb 27 1999 14:14:46   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.0   Nov 04 1995 09:00:24   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ***************************************************************** 00010000
      *    COPY-MEMBER: DROP0019  GESELLSCHAFTS-TABELLE (DROM6778)    * 00020000
      *    --------------------------------------------------------   * 00030000
      *    VERSION   1    19.01.95 15:59:58
      *    --------------------------------------------------------   * 00050000
      *    ERSTELLT: PROEMPELER                                       * 00060000
      *    DATUM:    19.01.1995                                       * 00070000
      *    STAND:    19.01.1995                                       * 00080000
      *****************************************************************
      ****************************************************************  00091000
      * AENDERUNGEN:                                                 *  00092000
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *  00093000
      * -------------------------------------------------------------*  00094000
      * AFOP0055!19.01.95! 01 ! NEU                       !WIECHERS  *  00095002
      *         !        !    !                           !          *  00096001
FOP339* FOP00339!19.07.00! 01 ! Anpassung an geänderte VIE!Gsellhofer*  00095002
      *         !        !    !                           !          *  00099300
      *                                                              *  00099400
      * ENDE-LOGBUCH                                                 *  00099500
      ****************************************************************  00091000
000010     05 DROM6778.
FOP339*       07 GESKZ                  PICTURE S99    COMPUTATIONAL.
FOP339        07 GESKZ                  PICTURE 99.
000030        07 GESBEZ-KURZ            PICTURE X(10).
000040        07 GESBEZ-LANG            PICTURE X(40).
000050        07 LKZ                    PICTURE X(4).
000060        07 BEW-ART-KZ             PICTURE X(10).
FOP339        07 FILLER                 PICTURE X(34).
