      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA1297.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:\MF\CPY\DRPA1297.CPv  $
      *
      *   Rev 2.1   Aug 31 1999 14:05:36   T13EX21
      *APA00053 - Neuerstellung
      *
      *   Rev 2.0   Mar 30 1999 08:44:28   P13SP99
      *Neuerstellung
      *
      *   Rev 2.0   Mar 05 1999 10:18:56   P13SP20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1297                                      *
      *    --------------------------------------------------------   *
      *    AUSGABESATZ: AUSGABEDATEI AUS PMPA0054                     *
      *    --------------------------------------------------------   *
      *    ERSTELLT: M. STORCH                                        *
      *    DATUM:    26.08.1999                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * APA00053!26.08.99! 01 ! NEU                       ! STORCH   *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
          10 DAISY-STORNO-DATEN.
            20 DRPA1297-PGEB-GES               PIC 9(002).
            20 DRPA1297-FILL-1                 PIC X(001) VALUE SPACE.
            20 DRPA1297-PMPE-VNR               PIC 9(012).
            20 DRPA1297-FILL-2                 PIC X(001) VALUE SPACE.
            20 DRPA1297-PMPE-FAELLIG-VON       PIC X(010).
            20 DRPA1297-FILL-3                 PIC X(001) VALUE SPACE.
            20 DRPA1297-PMPP-PGV               PIC 9(001).
            20 DRPA1297-FILL-4                 PIC X(001) VALUE SPACE.
            20 DRPA1297-PMPP-PG-GSMT-PROV      PIC 9(007)V99.
            20 DRPA1297-FILL-5                 PIC X(019) VALUE SPACE.
      *
      ******* ENDE COPY-MEMBER DRPA1297 *****************************
