      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA0824.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\DRPA0824.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 14:29:36   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   11 Nov 1998 09:56:20   T01JM2S
      *PEG-PRODUKTIONSüBERGABE
      *
      *   Rev 1.0   14 Jan 1998 12:44:38   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA0824                                      *
      *    --------------------------------------------------------   *
      *    KOF-DATEN                                                  *
      *    --------------------------------------------------------   *
      *    ERSTELLT: WOLFF                                            *
      *    DATUM:    05.02.1998                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AFPA0012!05.02.98! 01 ! NEU                       ! WOLFF    *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DIE DATEN FÜR KOF.                    *
      *                                                              *
      ****************************************************************
      *
             30 KOF-DATEN.
                35 PDTA-ID                          PIC S9(015)
                                                        PACKED-DECIMAL.
                35 PGEB-GES                         PIC S9(004) BINARY.
                35 KNR-FKT-BEREICH                  PIC S9(004) BINARY.
                35 KNR-WAEHRUNG                     PIC S9(004) BINARY.
                35 KOF-GSMT-PROV                    PIC S9(013)V99
                                                        PACKED-DECIMAL.
                35 KOF-ANZ-BEWEGUNG                 PIC S9(009) BINARY.
                35 KOF-ABSCHLUSS-DAT                PIC  X(010).
      *
      ******* ENDE COPY-MEMBER **************************************
