      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  28.04.2017
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2017 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA1871.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRPA1871.CPv  $
      *
      *   Rev 2.1   May 18 2017 15:49:36   t13ae46
      *APA02438: Devolo: PEG-Copy JWA 
      *
      *   Rev 2.0   Apr 28 2017 10:01:04   t13ae46
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1871  PEG-DATENSATZ DER DEVOLO (93)       *
      *    ---------------------------------------------------------  *
      *    ERSTELLT: WANG                                             *
      *    DATUM:    28.04.17                                         *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * APA02438!28.04.17!2.1 ! NEUERSTELLUNG             ! WANG     *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DEN AUFBAU DES PEG-DATENSATZES DES    *
      *    DEVOLO-DTA'S.                                             *
      *                                                              *
      ****************************************************************
      *
             30 DEVOLO-DATENSATZ.
                35 VNR                    PIC  9(015).
                35 VERTRAG-BEGINN         PIC  X(010).
                35 FAELLIG-VON            PIC  X(010).
                35 AVERM                  PIC  9(007).
                35 PGEB-GES               PIC  9(002).
                35 KUNDE-NNAME            PIC  X(035).
                35 KUNDE-VNAME            PIC  X(035).
                35 ABR-DAT-PG             PIC  X(010).
                35 VERTRAG-WAEHRUNG       PIC  X(003).
                35 PGV-PG                 PIC  X(004).
                35 PG-PROD-BEZ            PIC  X(015).
                35 PROV-SATZ              PIC  9(003)V999.
                35 PROV-BETRAG            PIC S9(007)V99.
                35 PPFL-SUMME             PIC S9(007)V99.
                35 UMSATZ-STEUER-BETRAG   PIC S9(007)V99.
                35 UMSATZ-STEUER-SATZ     PIC  9(003)V999.
                35 RECHNUNG-NR-DEVOLO     PIC  X(012).
                35 GESAMT-BETRAG          PIC S9(007)V99.
                35 FILLER                 PIC  X(021).
      ******* ENDE COPY-MEMBER **************************************



