      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  16.12.2013
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2013 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA1786.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRPA1786.CPv  $
      *
      *   Rev 2.1   Jan 10 2014 13:40:02   t13ex72
      *APA01526: Projekt Kalypso Teilprojekt 5 (Provisionsverteilun
      *g): GeVo Leben (CBO)
      *
      *   Rev 2.0   Dec 16 2013 14:00:12   t13ex72
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1786                                      *
      *    --------------------------------------------------------   *
      *    KONSTANTEN RHÖN-KLINIKEN                                   *
      *    --------------------------------------------------------   *
      *    ERSTELLT: BÖTTCHER                                         *
      *    DATUM:    16.12.2013                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * APA01526!16.12.13! 01 ! NEU                       ! BÖTTCHER *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESE TABELLE ENTHÄLT KONSTANTEN RUND UM RHÖN-KLINIKEN    *
      *                                                              *
      ****************************************************************
      *
      *01  DRPA1786.
      *    05  FILLER                    PIC X(026)
      *                                  VALUE '*** KONSTANTEN ***'.
      *
           05  DRPA1786-SAM-NR-RHOEN        PIC 9(006).
               88 DRPA1786-RHOEN-JA
                  VALUES
                  530630
                  530631
                  530632
                  530633
                  530634
                  530635
                  530636
                  530637
                  530638
                  530639.

           05  DRPA1786-PEST-ID-RHOEN-ALT   PIC 9(015)
               VALUE 249999999999998.
      
           05  DRPA1786-PEST-ID-RHOEN-NEU   PIC 9(015)
               VALUE 249999999999999.
      
           05  DRPA1786-RHOEN-DAT           PIC 9(008) VALUE 20000720.


      ****************************************************************
      ****************************************************************
