      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA1501.CPY  $
      *    $Revision:   2.5  $
      *
      *    $Log:   L:\MF\CPY\DRPA1501.CPv  $
      *
      *   Rev 2.5   31 Jul 2001 11:32:26   t13ae46
      *APA00133: Korrigirren
      *
      *   Rev 2.4   24 Jul 2001 10:12:44   t13ae46
      *APA00133 korrigieren
      *
      *   Rev 2.3   23 Jul 2001 11:06:16   t13ae46
      *APA00133
      *
      *   Rev 2.2   20 Jul 2001 12:04:54   t13ae46
      *APA00133
      *
      *   Rev 2.1   16 Jul 2001 10:19:00   t13ae46
      *APA00133
      *PEG-Datensatz Dreba-CH
      *
      *   Rev 2.0   04 Jul 2001 11:10:24   p13sp13
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1501  PEG-DATENSATZ DER DREBA-CH(43)      *
      *    ---------------------------------------------------------  *
      *    ERSTELLT: WANG                                             *
      *    DATUM:    11.07.01                                         *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * APA00133!11.07.01!2.1 ! NEUERSTELLUNG             ! WANG     *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DEN AUFBAU DES PEG-DATENSATZES DES    *
      *    DRESDNER BANK SCHWEIZ-DTA'S.                              *
      ****************************************************************
      *
             30 DRESDNERBANK-SCHWEIZ-DATENSATZ.
                 35 PGEB-GES                 PIC  9(002).
                 35 VNR                      PIC  9(008).
                 35 FILLER                   PIC  9(007).
                 35 FAELLIG-VON              PIC  9(008).
                 35 PG-PROD-BEZ              PIC  9(002).
                 35 PRODART                  PIC  9(001).
                 35 PIN                      PIC  9(007).
                 35 FILLER                   PIC  9(002).
                 35 FILLER                   PIC  9(008).
                 35 KUNDE-NNAME              PIC  X(020).
                 35 AVERM                    PIC  9(007).
                 35 FILLER                   PIC  9(001).
                 35 ABR-DAT-PG               PIC  9(008).
                 35 PROV-SATZ                PIC S9(002)V9(03).
                 35 PPFL-SUMME               PIC S9(007)V9(02).
                 35 PROV-BETRAG              PIC S9(007)V9(02).
      *
      ******** ENDE COPY-MEMBER **************************************
