      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA0406.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRPA0406.CPv  $
      *
      *   Rev 2.1   Jun 09 2020 11:25:56   t13ex44
      *APA02908: Änderung der Abrechnungsweise beim Ersatzversicher
      *ungsgeschäft mit Umstellung von Ges. 11 auf Ges. 10 (betriff
      *finanz 2)
      *
      *   Rev 2.0   May 27 1999 13:26:52   T01JM2S
      *APA00042
      *
      *   Rev 1.0   23 Jul 1997 12:32:44   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA0406                                      *
      *    --------------------------------------------------------   *
      *    PVOR-DATEN                                                 *
      *    --------------------------------------------------------   *
      *    ERSTELLT: WOLFF                                            *
      *    DATUM:    22.10.1997                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AFPA0012!22.10.97! 01 ! NEU                       ! WOLFF    *
      * APA02908!17.02.20!2.1 ! PGEB-GES-VORV. HINZU      ! SCHEIDEL *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DIE DATEN FÜR PVOR.                   *
      *                                                              *
      ****************************************************************
      *
                   30 PVOR-DATEN.
170220                35 PGEB-GES-VERTRAG    PIC S9(004) BINARY.
                      35 PRINTE-VERTRAG      PIC S9(015) PACKED-DECIMAL.
170220                35 PGEB-GES-VORVERTRAG PIC S9(004) BINARY.
                      35 PRINTE-VORVERTRAG   PIC S9(015) PACKED-DECIMAL.
      *
      ******* ENDE COPY-MEMBER **************************************

