      *****************************************************************
      *    VERSION
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  ! AENDERUNG                       ! NAME
      * ---------------------------------------------------------------
      * DBO-7450!20.10.20!NEUERSTELLUNG                    !SCHUMACHER
      *TLMAE-859!28.11.22!TEST DEPLOY GITHUB ACTIONS       !SCHUMACHER
      *         !        !                                 !
      *         !        !                                 !
      *
      * ENDE-LOGBUCH
      *****************************************************************
      *****************************************************************
      *
      *    TEST AUSGABE-COPY ZUR DEMONSTRATION DES NEUEN
      *    ENTWICKLUNGS- UND DEPLOYMENTVERFAHREN.
      *
      *
      *
      *
      *
      *  
      *
      *****************************************************************
      *
       01 DTA-AUSGABE.
           05 DTA-AUS-NACHNAME         PIC X(040).
           05 DTA-AUS-VORNAME          PIC X(040).
           05 DTA-AUS-ALTER            PIC 9(003).
           05 DTA-TLMAE-859-NR1        PIC 9(003).
           
           
           