      *****************************************************************
      *    VERSION
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  ! AENDERUNG                       ! NAME
      * ---------------------------------------------------------------
      * DBO-7450!20.10.20!NEUERSTELLUNG                    !SCHUMACHER
      *TLMAE-289!26.01.21!TEST-UU-3 CONCURRENT DEPLOYMENT  !SCHUMACHER
      *TLMAE-859!28.11.22!TEST DEPLOY GITHUB ACTIONS       !SCHUMACHER
      *         !        !                                 !
      *
      * ENDE-LOGBUCH
      *****************************************************************
      *****************************************************************
      *
      *    TEST EINGABE-COPY ZUR DEMONSTRATION DES NEUEN
      *    ENTWICKLUNGS- UND DEPLOYMENTVERFAHREN.
      *
      *
      *
      *
      *
      *  
      *
      *****************************************************************
      *
       01 DTA-EINGABE.
           05 DTA-EIN-ALTER            PIC 9(003).
           05 DTA-EIN-VORNAME          PIC X(040).
           05 DTA-EIN-NACHNAME         PIC X(040).
           05 DTA-TLMAE-859-NR1        PIC X(040).
           