      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  28.11.2017
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2017 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DSKI0312.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DSKI0312.CPv  $
      *
      *   Rev 2.1   Feb 19 2018 07:58:28   t13ac20
      *AKI01534: G20 - Projekt LENA: Vertrag
      *
      *   Rev 2.0   Nov 28 2017 14:59:06   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *---------------------------------------------------------------*
      *
      *    Konstanten für Support-Tabelle
      *    GRVLEBEN - TCKI0312
      *
      *---------------------------------------------------------------*
      *    LOGBUCH
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AKI01534!28.11.17!2.1 ! Neuerstellung             ! SWO
      *         !        !    !                           !
      *         !        !    !                           !
      *****************************************************************
      *
       01  FILLER.
           05 K-GRVID-UNBEKANNT                  PIC S9(002) VALUE -2.
           05 K-GRVID-3PUNKTE                    PIC S9(002) VALUE -1.
           05 K-GRVID-5                          PIC S9(002) VALUE 01.
           05 K-GRVID-6                          PIC S9(002) VALUE 02.
           05 K-GRVID-7                          PIC S9(002) VALUE 03.
           05 K-GRVID-8                          PIC S9(002) VALUE 04.
           05 K-GRVID-9                          PIC S9(002) VALUE 05.
           05 K-GRVID-10                         PIC S9(002) VALUE 06.
           05 K-GRVID-NEIN                       PIC S9(002) VALUE 08.
           05 K-GRVID-GRV                        PIC S9(002) VALUE 09.
           05 K-GRVID-AVMG                       PIC S9(002) VALUE 10.
           05 K-GRVID-BBGR                       PIC S9(002) VALUE 11.
           05 K-GRVID-AVMG-BBGR                  PIC S9(002) VALUE 17.
           05 K-GRVID-3                          PIC S9(002) VALUE 18.
           05 K-GRVID-4                          PIC S9(002) VALUE 19.
           05 K-GRVID-2                          PIC S9(002) VALUE 20.
           05 K-GRVID-11                         PIC S9(002) VALUE 21.
           05 K-GRVID-12                         PIC S9(002) VALUE 22.
           05 K-GRVID-14                         PIC S9(002) VALUE 23.
           05 K-GRVID-15                         PIC S9(002) VALUE 24.
           05 K-GRVID-10-BBGR                    PIC S9(002) VALUE 25.
           05 K-GRVID-3-BBGR                     PIC S9(002) VALUE 27.
           05 K-GRVID-5-BBGR                     PIC S9(002) VALUE 27.
           05 K-GRVID-6-BBGR                     PIC S9(002) VALUE 28.
           05 K-GRVID-7-BBGR                     PIC S9(002) VALUE 29.
           05 K-GRVID-8-BBGR                     PIC S9(002) VALUE 30.
           05 K-GRVID-9-BBGR                     PIC S9(002) VALUE 31.

