       01  UA928I.                                                              
           02  FILLER PIC X(12).                                                
           02  T01USE2L    COMP  PIC  S9(4).                                    
           02  T01USE2F    PICTURE X.                                           
           02  FILLER REDEFINES T01USE2F.                                       
             03 T01USE2A    PICTURE X.                                          
           02  T01USE2I  PIC X(5).                                              
           02  PNR2L    COMP  PIC  S9(4).                                       
           02  PNR2F    PICTURE X.                                              
           02  FILLER REDEFINES PNR2F.                                          
             03 PNR2A    PICTURE X.                                             
           02  PNR2I  PIC X(7).                                                 
           02  T01DAT2L    COMP  PIC  S9(4).                                    
           02  T01DAT2F    PICTURE X.                                           
           02  FILLER REDEFINES T01DAT2F.                                       
             03 T01DAT2A    PICTURE X.                                          
           02  T01DAT2I  PIC X(6).                                              
           02  DATUM2L    COMP  PIC  S9(4).                                     
           02  DATUM2F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM2F.                                        
             03 DATUM2A    PICTURE X.                                           
           02  DATUM2I  PIC X(8).                                               
           02  T01PUN2L    COMP  PIC  S9(4).                                    
           02  T01PUN2F    PICTURE X.                                           
           02  FILLER REDEFINES T01PUN2F.                                       
             03 T01PUN2A    PICTURE X.                                          
           02  T01PUN2I  PIC X(1).                                              
           02  UHR2L    COMP  PIC  S9(4).                                       
           02  UHR2F    PICTURE X.                                              
           02  FILLER REDEFINES UHR2F.                                          
             03 UHR2A    PICTURE X.                                             
           02  UHR2I  PIC X(5).                                                 
           02  T03UEB2L    COMP  PIC  S9(4).                                    
           02  T03UEB2F    PICTURE X.                                           
           02  FILLER REDEFINES T03UEB2F.                                       
             03 T03UEB2A    PICTURE X.                                          
           02  T03UEB2I  PIC X(44).                                             
           02  GES2L    COMP  PIC  S9(4).                                       
           02  GES2F    PICTURE X.                                              
           02  FILLER REDEFINES GES2F.                                          
             03 GES2A    PICTURE X.                                             
           02  GES2I  PIC X(23).                                                
           02  T05VBN2L    COMP  PIC  S9(4).                                    
           02  T05VBN2F    PICTURE X.                                           
           02  FILLER REDEFINES T05VBN2F.                                       
             03 T05VBN2A    PICTURE X.                                          
           02  T05VBN2I  PIC X(15).                                             
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  PRZVB2L    COMP  PIC  S9(4).                                     
           02  PRZVB2F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB2F.                                        
             03 PRZVB2A    PICTURE X.                                           
           02  PRZVB2I  PIC X(1).                                               
           02  T06VMN2L    COMP  PIC  S9(4).                                    
           02  T06VMN2F    PICTURE X.                                           
           02  FILLER REDEFINES T06VMN2F.                                       
             03 T06VMN2A    PICTURE X.                                          
           02  T06VMN2I  PIC X(15).                                             
           02  VBNRVM2L    COMP  PIC  S9(4).                                    
           02  VBNRVM2F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM2F.                                       
             03 VBNRVM2A    PICTURE X.                                          
           02  VBNRVM2I  PIC X(7).                                              
           02  PRZVM2L    COMP  PIC  S9(4).                                     
           02  PRZVM2F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM2F.                                        
             03 PRZVM2A    PICTURE X.                                           
           02  PRZVM2I  PIC X(1).                                               
           02  T07VNR2L    COMP  PIC  S9(4).                                    
           02  T07VNR2F    PICTURE X.                                           
           02  FILLER REDEFINES T07VNR2F.                                       
             03 T07VNR2A    PICTURE X.                                          
           02  T07VNR2I  PIC X(15).                                             
           02  SPARTE2L    COMP  PIC  S9(4).                                    
           02  SPARTE2F    PICTURE X.                                           
           02  FILLER REDEFINES SPARTE2F.                                       
             03 SPARTE2A    PICTURE X.                                          
           02  SPARTE2I  PIC X(1).                                              
           02  VNR2L    COMP  PIC  S9(4).                                       
           02  VNR2F    PICTURE X.                                              
           02  FILLER REDEFINES VNR2F.                                          
             03 VNR2A    PICTURE X.                                             
           02  VNR2I  PIC X(7).                                                 
           02  PRZVG2L    COMP  PIC  S9(4).                                     
           02  PRZVG2F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVG2F.                                        
             03 PRZVG2A    PICTURE X.                                           
           02  PRZVG2I  PIC X(2).                                               
           02  TVNRA2L    COMP  PIC  S9(4).                                     
           02  TVNRA2F    PICTURE X.                                            
           02  FILLER REDEFINES TVNRA2F.                                        
             03 TVNRA2A    PICTURE X.                                           
           02  TVNRA2I  PIC X(19).                                              
           02  VBNRA2L    COMP  PIC  S9(4).                                     
           02  VBNRA2F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA2F.                                        
             03 VBNRA2A    PICTURE X.                                           
           02  VBNRA2I  PIC X(7).                                               
           02  SPARTA2L    COMP  PIC  S9(4).                                    
           02  SPARTA2F    PICTURE X.                                           
           02  FILLER REDEFINES SPARTA2F.                                       
             03 SPARTA2A    PICTURE X.                                          
           02  SPARTA2I  PIC X(1).                                              
           02  VNRA2L    COMP  PIC  S9(4).                                      
           02  VNRA2F    PICTURE X.                                             
           02  FILLER REDEFINES VNRA2F.                                         
             03 VNRA2A    PICTURE X.                                            
           02  VNRA2I  PIC X(7).                                                
           02  PRZVGA2L    COMP  PIC  S9(4).                                    
           02  PRZVGA2F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVGA2F.                                       
             03 PRZVGA2A    PICTURE X.                                          
           02  PRZVGA2I  PIC X(2).                                              
           02  ZNAME2L    COMP  PIC  S9(4).                                     
           02  ZNAME2F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME2F.                                        
             03 ZNAME2A    PICTURE X.                                           
           02  ZNAME2I  PIC X(26).                                              
           02  VNAME2L    COMP  PIC  S9(4).                                     
           02  VNAME2F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME2F.                                        
             03 VNAME2A    PICTURE X.                                           
           02  VNAME2I  PIC X(26).                                              
           02  PLZ2L    COMP  PIC  S9(4).                                       
           02  PLZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ2F.                                          
             03 PLZ2A    PICTURE X.                                             
           02  PLZ2I  PIC X(5).                                                 
           02  ORT2L    COMP  PIC  S9(4).                                       
           02  ORT2F    PICTURE X.                                              
           02  FILLER REDEFINES ORT2F.                                          
             03 ORT2A    PICTURE X.                                             
           02  ORT2I  PIC X(21).                                                
           02  AUSL2L    COMP  PIC  S9(4).                                      
           02  AUSL2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL2F.                                         
             03 AUSL2A    PICTURE X.                                            
           02  AUSL2I  PIC X(3).                                                
           02  EALTER2L    COMP  PIC  S9(4).                                    
           02  EALTER2F    PICTURE X.                                           
           02  FILLER REDEFINES EALTER2F.                                       
             03 EALTER2A    PICTURE X.                                          
           02  EALTER2I  PIC X(2).                                              
           02  TARIF2L    COMP  PIC  S9(4).                                     
           02  TARIF2F    PICTURE X.                                            
           02  FILLER REDEFINES TARIF2F.                                        
             03 TARIF2A    PICTURE X.                                           
           02  TARIF2I  PIC X(10).                                              
           02  PROD2L    COMP  PIC  S9(4).                                      
           02  PROD2F    PICTURE X.                                             
           02  FILLER REDEFINES PROD2F.                                         
             03 PROD2A    PICTURE X.                                            
           02  PROD2I  PIC X(2).                                                
           02  SUMME2L    COMP  PIC  S9(4).                                     
           02  SUMME2F    PICTURE X.                                            
           02  FILLER REDEFINES SUMME2F.                                        
             03 SUMME2A    PICTURE X.                                           
           02  SUMME2I  PIC X(9).                                               
           02  BEGINN2L    COMP  PIC  S9(4).                                    
           02  BEGINN2F    PICTURE X.                                           
           02  FILLER REDEFINES BEGINN2F.                                       
             03 BEGINN2A    PICTURE X.                                          
           02  BEGINN2I  PIC X(8).                                              
           02  DAUHV2L    COMP  PIC  S9(4).                                     
           02  DAUHV2F    PICTURE X.                                            
           02  FILLER REDEFINES DAUHV2F.                                        
             03 DAUHV2A    PICTURE X.                                           
           02  DAUHV2I  PIC X(2).                                               
           02  DBEIZ2L    COMP  PIC  S9(4).                                     
           02  DBEIZ2F    PICTURE X.                                            
           02  FILLER REDEFINES DBEIZ2F.                                        
             03 DBEIZ2A    PICTURE X.                                           
           02  DBEIZ2I  PIC X(2).                                               
           02  T18BFR2L    COMP  PIC  S9(4).                                    
           02  T18BFR2F    PICTURE X.                                           
           02  FILLER REDEFINES T18BFR2F.                                       
             03 T18BFR2A    PICTURE X.                                          
           02  T18BFR2I  PIC X(13).                                             
           02  BEIBFR2L    COMP  PIC  S9(4).                                    
           02  BEIBFR2F    PICTURE X.                                           
           02  FILLER REDEFINES BEIBFR2F.                                       
             03 BEIBFR2A    PICTURE X.                                          
           02  BEIBFR2I  PIC X(9).                                              
           02  DBUZ2L    COMP  PIC  S9(4).                                      
           02  DBUZ2F    PICTURE X.                                             
           02  FILLER REDEFINES DBUZ2F.                                         
             03 DBUZ2A    PICTURE X.                                            
           02  DBUZ2I  PIC X(2).                                                
           02  BUREN2L    COMP  PIC  S9(4).                                     
           02  BUREN2F    PICTURE X.                                            
           02  FILLER REDEFINES BUREN2F.                                        
             03 BUREN2A    PICTURE X.                                           
           02  BUREN2I  PIC X(2).                                               
           02  DYNPRZ2L    COMP  PIC  S9(4).                                    
           02  DYNPRZ2F    PICTURE X.                                           
           02  FILLER REDEFINES DYNPRZ2F.                                       
             03 DYNPRZ2A    PICTURE X.                                          
           02  DYNPRZ2I  PIC X(2).                                              
           02  T19BUR2L    COMP  PIC  S9(4).                                    
           02  T19BUR2F    PICTURE X.                                           
           02  FILLER REDEFINES T19BUR2F.                                       
             03 T19BUR2A    PICTURE X.                                          
           02  T19BUR2I  PIC X(13).                                             
           02  BEIBUR2L    COMP  PIC  S9(4).                                    
           02  BEIBUR2F    PICTURE X.                                           
           02  FILLER REDEFINES BEIBUR2F.                                       
             03 BEIBUR2A    PICTURE X.                                          
           02  BEIBUR2I  PIC X(9).                                              
           02  BEITR2L    COMP  PIC  S9(4).                                     
           02  BEITR2F    PICTURE X.                                            
           02  FILLER REDEFINES BEITR2F.                                        
             03 BEITR2A    PICTURE X.                                           
           02  BEITR2I  PIC X(10).                                              
           02  ZW2L    COMP  PIC  S9(4).                                        
           02  ZW2F    PICTURE X.                                               
           02  FILLER REDEFINES ZW2F.                                           
             03 ZW2A    PICTURE X.                                              
           02  ZW2I  PIC X(1).                                                  
           02  T20HV2L    COMP  PIC  S9(4).                                     
           02  T20HV2F    PICTURE X.                                            
           02  FILLER REDEFINES T20HV2F.                                        
             03 T20HV2A    PICTURE X.                                           
           02  T20HV2I  PIC X(13).                                              
           02  BEIHV2L    COMP  PIC  S9(4).                                     
           02  BEIHV2F    PICTURE X.                                            
           02  FILLER REDEFINES BEIHV2F.                                        
             03 BEIHV2A    PICTURE X.                                           
           02  BEIHV2I  PIC X(9).                                               
           02  VZAN2L    COMP  PIC  S9(4).                                      
           02  VZAN2F    PICTURE X.                                             
           02  FILLER REDEFINES VZAN2F.                                         
             03 VZAN2A    PICTURE X.                                            
           02  VZAN2I  PIC X(1).                                                
           02  BAV2L    COMP  PIC  S9(4).                                       
           02  BAV2F    PICTURE X.                                              
           02  FILLER REDEFINES BAV2F.                                          
             03 BAV2A    PICTURE X.                                             
           02  BAV2I  PIC X(1).                                                 
           02  T22BFR2L    COMP  PIC  S9(4).                                    
           02  T22BFR2F    PICTURE X.                                           
           02  FILLER REDEFINES T22BFR2F.                                       
             03 T22BFR2A    PICTURE X.                                          
           02  T22BFR2I  PIC X(13).                                             
           02  AEBFR2L    COMP  PIC  S9(4).                                     
           02  AEBFR2F    PICTURE X.                                            
           02  FILLER REDEFINES AEBFR2F.                                        
             03 AEBFR2A    PICTURE X.                                           
           02  AEBFR2I  PIC X(8).                                               
           02  AE2L    COMP  PIC  S9(4).                                        
           02  AE2F    PICTURE X.                                               
           02  FILLER REDEFINES AE2F.                                           
             03 AE2A    PICTURE X.                                              
           02  AE2I  PIC X(8).                                                  
           02  T23BUR2L    COMP  PIC  S9(4).                                    
           02  T23BUR2F    PICTURE X.                                           
           02  FILLER REDEFINES T23BUR2F.                                       
             03 T23BUR2A    PICTURE X.                                          
           02  T23BUR2I  PIC X(13).                                             
           02  AEBUR2L    COMP  PIC  S9(4).                                     
           02  AEBUR2F    PICTURE X.                                            
           02  FILLER REDEFINES AEBUR2F.                                        
             03 AEBUR2A    PICTURE X.                                           
           02  AEBUR2I  PIC X(8).                                               
           02  SCHBET2L    COMP  PIC  S9(4).                                    
           02  SCHBET2F    PICTURE X.                                           
           02  FILLER REDEFINES SCHBET2F.                                       
             03 SCHBET2A    PICTURE X.                                          
           02  SCHBET2I  PIC X(8).                                              
           02  T24HV2L    COMP  PIC  S9(4).                                     
           02  T24HV2F    PICTURE X.                                            
           02  FILLER REDEFINES T24HV2F.                                        
             03 T24HV2A    PICTURE X.                                           
           02  T24HV2I  PIC X(13).                                              
           02  AEHV2L    COMP  PIC  S9(4).                                      
           02  AEHV2F    PICTURE X.                                             
           02  FILLER REDEFINES AEHV2F.                                         
             03 AEHV2A    PICTURE X.                                            
           02  AEHV2I  PIC X(8).                                                
           02  ANART2L    COMP  PIC  S9(4).                                     
           02  ANART2F    PICTURE X.                                            
           02  FILLER REDEFINES ANART2F.                                        
             03 ANART2A    PICTURE X.                                           
           02  ANART2I  PIC X(1).                                               
           02  ANDAT2L    COMP  PIC  S9(4).                                     
           02  ANDAT2F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT2F.                                        
             03 ANDAT2A    PICTURE X.                                           
           02  ANDAT2I  PIC X(8).                                               
           02  ERFDAT2L    COMP  PIC  S9(4).                                    
           02  ERFDAT2F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT2F.                                       
             03 ERFDAT2A    PICTURE X.                                          
           02  ERFDAT2I  PIC X(8).                                              
           02  STAT21L    COMP  PIC  S9(4).                                     
           02  STAT21F    PICTURE X.                                            
           02  FILLER REDEFINES STAT21F.                                        
             03 STAT21A    PICTURE X.                                           
           02  STAT21I  PIC X(2).                                               
           02  STAT22L    COMP  PIC  S9(4).                                     
           02  STAT22F    PICTURE X.                                            
           02  FILLER REDEFINES STAT22F.                                        
             03 STAT22A    PICTURE X.                                           
           02  STAT22I  PIC X(2).                                               
           02  STAT23L    COMP  PIC  S9(4).                                     
           02  STAT23F    PICTURE X.                                            
           02  FILLER REDEFINES STAT23F.                                        
             03 STAT23A    PICTURE X.                                           
           02  STAT23I  PIC X(2).                                               
           02  STDAT21L    COMP  PIC  S9(4).                                    
           02  STDAT21F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT21F.                                       
             03 STDAT21A    PICTURE X.                                          
           02  STDAT21I  PIC X(8).                                              
           02  STDAT22L    COMP  PIC  S9(4).                                    
           02  STDAT22F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT22F.                                       
             03 STDAT22A    PICTURE X.                                          
           02  STDAT22I  PIC X(8).                                              
           02  STDAT23L    COMP  PIC  S9(4).                                    
           02  STDAT23F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT23F.                                       
             03 STDAT23A    PICTURE X.                                          
           02  STDAT23I  PIC X(8).                                              
           02  VBNR2EL    COMP  PIC  S9(4).                                     
           02  VBNR2EF    PICTURE X.                                            
           02  FILLER REDEFINES VBNR2EF.                                        
             03 VBNR2EA    PICTURE X.                                           
           02  VBNR2EI  PIC X(7).                                               
           02  GES2EL    COMP  PIC  S9(4).                                      
           02  GES2EF    PICTURE X.                                             
           02  FILLER REDEFINES GES2EF.                                         
             03 GES2EA    PICTURE X.                                            
           02  GES2EI  PIC X(2).                                                
           02  VNR2EL    COMP  PIC  S9(4).                                      
           02  VNR2EF    PICTURE X.                                             
           02  FILLER REDEFINES VNR2EF.                                         
             03 VNR2EA    PICTURE X.                                            
           02  VNR2EI  PIC 9(15).                                               
           02  NAME2EL    COMP  PIC  S9(4).                                     
           02  NAME2EF    PICTURE X.                                            
           02  FILLER REDEFINES NAME2EF.                                        
             03 NAME2EA    PICTURE X.                                           
           02  NAME2EI  PIC X(8).                                               
           02  TRANS2EL    COMP  PIC  S9(4).                                    
           02  TRANS2EF    PICTURE X.                                           
           02  FILLER REDEFINES TRANS2EF.                                       
             03 TRANS2EA    PICTURE X.                                          
           02  TRANS2EI  PIC X(4).                                              
           02  FEHLER2L    COMP  PIC  S9(4).                                    
           02  FEHLER2F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER2F.                                       
             03 FEHLER2A    PICTURE X.                                          
           02  FEHLER2I  PIC X(78).                                             
       01  UA928O REDEFINES UA928I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  T01USE2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  PNR2O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  T01DAT2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  DATUM2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  T01PUN2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  T03UEB2O  PIC X(44).                                             
           02  FILLER PICTURE X(3).                                             
           02  GES2O  PIC X(23).                                                
           02  FILLER PICTURE X(3).                                             
           02  T05VBN2O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  T06VMN2O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  T07VNR2O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  SPARTE2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNR2O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZVG2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVNRA2O  PIC X(19).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRA2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SPARTA2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRA2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVGA2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZNAME2O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAME2O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZ2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT2O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  EALTER2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TARIF2O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROD2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUMME2O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEGINN2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  DAUHV2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  DBEIZ2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  T18BFR2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  BEIBFR2O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  DBUZ2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  BUREN2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  DYNPRZ2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  T19BUR2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  BEIBUR2O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR2O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZW2O  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  T20HV2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIHV2O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  VZAN2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  BAV2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  T22BFR2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEBFR2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AE2O  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  T23BUR2O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEBUR2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  SCHBET2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  T24HV2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEHV2O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANART2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT21O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STAT22O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STAT23O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT21O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STDAT22O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STDAT23O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNR2EO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GES2EO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR2EO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME2EO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANS2EO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLER2O  PIC X(78).                                             
