       01  UA920I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS42L    COMP  PIC  S9(4).                                     
           02  PERS42F    PICTURE X.                                            
           02  FILLER REDEFINES PERS42F.                                        
             03 PERS42A    PICTURE X.                                           
           02  PERS42I  PIC X(7).                                               
           02  DATUM42L    COMP  PIC  S9(4).                                    
           02  DATUM42F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM42F.                                       
             03 DATUM42A    PICTURE X.                                          
           02  DATUM42I  PIC X(8).                                              
           02  UHR42L    COMP  PIC  S9(4).                                      
           02  UHR42F    PICTURE X.                                             
           02  FILLER REDEFINES UHR42F.                                         
             03 UHR42A    PICTURE X.                                            
           02  UHR42I  PIC X(5).                                                
           02  VBN42L    COMP  PIC  S9(4).                                      
           02  VBN42F    PICTURE X.                                             
           02  FILLER REDEFINES VBN42F.                                         
             03 VBN42A    PICTURE X.                                            
           02  VBN42I  PIC X(7).                                                
           02  PRZVB42L    COMP  PIC  S9(4).                                    
           02  PRZVB42F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVB42F.                                       
             03 PRZVB42A    PICTURE X.                                          
           02  PRZVB42I  PIC X(1).                                              
           02  DIR42L    COMP  PIC  S9(4).                                      
           02  DIR42F    PICTURE X.                                             
           02  FILLER REDEFINES DIR42F.                                         
             03 DIR42A    PICTURE X.                                            
           02  DIR42I  PIC X(3).                                                
           02  VBNA42L    COMP  PIC  S9(4).                                     
           02  VBNA42F    PICTURE X.                                            
           02  FILLER REDEFINES VBNA42F.                                        
             03 VBNA42A    PICTURE X.                                           
           02  VBNA42I  PIC X(20).                                              
           02  VMNR42L    COMP  PIC  S9(4).                                     
           02  VMNR42F    PICTURE X.                                            
           02  FILLER REDEFINES VMNR42F.                                        
             03 VMNR42A    PICTURE X.                                           
           02  VMNR42I  PIC X(7).                                               
           02  PRZVM42L    COMP  PIC  S9(4).                                    
           02  PRZVM42F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVM42F.                                       
             03 PRZVM42A    PICTURE X.                                          
           02  PRZVM42I  PIC X(1).                                              
           02  VMNA42L    COMP  PIC  S9(4).                                     
           02  VMNA42F    PICTURE X.                                            
           02  FILLER REDEFINES VMNA42F.                                        
             03 VMNA42A    PICTURE X.                                           
           02  VMNA42I  PIC X(20).                                              
           02  VNR42L    COMP  PIC  S9(4).                                      
           02  VNR42F    PICTURE X.                                             
           02  FILLER REDEFINES VNR42F.                                         
             03 VNR42A    PICTURE X.                                            
           02  VNR42I  PIC X(7).                                                
           02  PRZVG42L    COMP  PIC  S9(4).                                    
           02  PRZVG42F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVG42F.                                       
             03 PRZVG42A    PICTURE X.                                          
           02  PRZVG42I  PIC X(2).                                              
           02  TAN42L    COMP  PIC  S9(4).                                      
           02  TAN42F    PICTURE X.                                             
           02  FILLER REDEFINES TAN42F.                                         
             03 TAN42A    PICTURE X.                                            
           02  TAN42I  PIC X(6).                                                
           02  ANRED42L    COMP  PIC  S9(4).                                    
           02  ANRED42F    PICTURE X.                                           
           02  FILLER REDEFINES ANRED42F.                                       
             03 ANRED42A    PICTURE X.                                          
           02  ANRED42I  PIC X(9).                                              
           02  TZU42L    COMP  PIC  S9(4).                                      
           02  TZU42F    PICTURE X.                                             
           02  FILLER REDEFINES TZU42F.                                         
             03 TZU42A    PICTURE X.                                            
           02  TZU42I  PIC X(6).                                                
           02  ZNAME42L    COMP  PIC  S9(4).                                    
           02  ZNAME42F    PICTURE X.                                           
           02  FILLER REDEFINES ZNAME42F.                                       
             03 ZNAME42A    PICTURE X.                                          
           02  ZNAME42I  PIC X(26).                                             
           02  TVOR42L    COMP  PIC  S9(4).                                     
           02  TVOR42F    PICTURE X.                                            
           02  FILLER REDEFINES TVOR42F.                                        
             03 TVOR42A    PICTURE X.                                           
           02  TVOR42I  PIC X(7).                                               
           02  VNAME42L    COMP  PIC  S9(4).                                    
           02  VNAME42F    PICTURE X.                                           
           02  FILLER REDEFINES VNAME42F.                                       
             03 VNAME42A    PICTURE X.                                          
           02  VNAME42I  PIC X(26).                                             
           02  TSTR42L    COMP  PIC  S9(4).                                     
           02  TSTR42F    PICTURE X.                                            
           02  FILLER REDEFINES TSTR42F.                                        
             03 TSTR42A    PICTURE X.                                           
           02  TSTR42I  PIC X(7).                                               
           02  STR42L    COMP  PIC  S9(4).                                      
           02  STR42F    PICTURE X.                                             
           02  FILLER REDEFINES STR42F.                                         
             03 STR42A    PICTURE X.                                            
           02  STR42I  PIC X(26).                                               
           02  TPLZ42L    COMP  PIC  S9(4).                                     
           02  TPLZ42F    PICTURE X.                                            
           02  FILLER REDEFINES TPLZ42F.                                        
             03 TPLZ42A    PICTURE X.                                           
           02  TPLZ42I  PIC X(3).                                               
           02  TORT42L    COMP  PIC  S9(4).                                     
           02  TORT42F    PICTURE X.                                            
           02  FILLER REDEFINES TORT42F.                                        
             03 TORT42A    PICTURE X.                                           
           02  TORT42I  PIC X(7).                                               
           02  TAUSL42L    COMP  PIC  S9(4).                                    
           02  TAUSL42F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSL42F.                                       
             03 TAUSL42A    PICTURE X.                                          
           02  TAUSL42I  PIC X(4).                                              
           02  PLZ42L    COMP  PIC  S9(4).                                      
           02  PLZ42F    PICTURE X.                                             
           02  FILLER REDEFINES PLZ42F.                                         
             03 PLZ42A    PICTURE X.                                            
           02  PLZ42I  PIC X(5).                                                
           02  ORT42L    COMP  PIC  S9(4).                                      
           02  ORT42F    PICTURE X.                                             
           02  FILLER REDEFINES ORT42F.                                         
             03 ORT42A    PICTURE X.                                            
           02  ORT42I  PIC X(21).                                               
           02  AUSL42L    COMP  PIC  S9(4).                                     
           02  AUSL42F    PICTURE X.                                            
           02  FILLER REDEFINES AUSL42F.                                        
             03 AUSL42A    PICTURE X.                                           
           02  AUSL42I  PIC X(3).                                               
           02  TBET142L    COMP  PIC  S9(4).                                    
           02  TBET142F    PICTURE X.                                           
           02  FILLER REDEFINES TBET142F.                                       
             03 TBET142A    PICTURE X.                                          
           02  TBET142I  PIC X(7).                                              
           02  FDS142L    COMP  PIC  S9(4).                                     
           02  FDS142F    PICTURE X.                                            
           02  FILLER REDEFINES FDS142F.                                        
             03 FDS142A    PICTURE X.                                           
           02  FDS142I  PIC X(2).                                               
           02  BET142L    COMP  PIC  S9(4).                                     
           02  BET142F    PICTURE X.                                            
           02  FILLER REDEFINES BET142F.                                        
             03 BET142A    PICTURE X.                                           
           02  BET142I  PIC X(7).                                               
           02  TBET242L    COMP  PIC  S9(4).                                    
           02  TBET242F    PICTURE X.                                           
           02  FILLER REDEFINES TBET242F.                                       
             03 TBET242A    PICTURE X.                                          
           02  TBET242I  PIC X(7).                                              
           02  FDS242L    COMP  PIC  S9(4).                                     
           02  FDS242F    PICTURE X.                                            
           02  FILLER REDEFINES FDS242F.                                        
             03 FDS242A    PICTURE X.                                           
           02  FDS242I  PIC X(2).                                               
           02  BET242L    COMP  PIC  S9(4).                                     
           02  BET242F    PICTURE X.                                            
           02  FILLER REDEFINES BET242F.                                        
             03 BET242A    PICTURE X.                                           
           02  BET242I  PIC X(7).                                               
           02  TBET342L    COMP  PIC  S9(4).                                    
           02  TBET342F    PICTURE X.                                           
           02  FILLER REDEFINES TBET342F.                                       
             03 TBET342A    PICTURE X.                                          
           02  TBET342I  PIC X(7).                                              
           02  FDS342L    COMP  PIC  S9(4).                                     
           02  FDS342F    PICTURE X.                                            
           02  FILLER REDEFINES FDS342F.                                        
             03 FDS342A    PICTURE X.                                           
           02  FDS342I  PIC X(2).                                               
           02  BET342L    COMP  PIC  S9(4).                                     
           02  BET342F    PICTURE X.                                            
           02  FILLER REDEFINES BET342F.                                        
             03 BET342A    PICTURE X.                                           
           02  BET342I  PIC X(7).                                               
           02  TBET442L    COMP  PIC  S9(4).                                    
           02  TBET442F    PICTURE X.                                           
           02  FILLER REDEFINES TBET442F.                                       
             03 TBET442A    PICTURE X.                                          
           02  TBET442I  PIC X(7).                                              
           02  FDS442L    COMP  PIC  S9(4).                                     
           02  FDS442F    PICTURE X.                                            
           02  FILLER REDEFINES FDS442F.                                        
             03 FDS442A    PICTURE X.                                           
           02  FDS442I  PIC X(2).                                               
           02  BET442L    COMP  PIC  S9(4).                                     
           02  BET442F    PICTURE X.                                            
           02  FILLER REDEFINES BET442F.                                        
             03 BET442A    PICTURE X.                                           
           02  BET442I  PIC X(7).                                               
           02  TBET542L    COMP  PIC  S9(4).                                    
           02  TBET542F    PICTURE X.                                           
           02  FILLER REDEFINES TBET542F.                                       
             03 TBET542A    PICTURE X.                                          
           02  TBET542I  PIC X(7).                                              
           02  FDS542L    COMP  PIC  S9(4).                                     
           02  FDS542F    PICTURE X.                                            
           02  FILLER REDEFINES FDS542F.                                        
             03 FDS542A    PICTURE X.                                           
           02  FDS542I  PIC X(2).                                               
           02  BET542L    COMP  PIC  S9(4).                                     
           02  BET542F    PICTURE X.                                            
           02  FILLER REDEFINES BET542F.                                        
             03 BET542A    PICTURE X.                                           
           02  BET542I  PIC X(7).                                               
           02  TBET642L    COMP  PIC  S9(4).                                    
           02  TBET642F    PICTURE X.                                           
           02  FILLER REDEFINES TBET642F.                                       
             03 TBET642A    PICTURE X.                                          
           02  TBET642I  PIC X(7).                                              
           02  FDS642L    COMP  PIC  S9(4).                                     
           02  FDS642F    PICTURE X.                                            
           02  FILLER REDEFINES FDS642F.                                        
             03 FDS642A    PICTURE X.                                           
           02  FDS642I  PIC X(2).                                               
           02  BET642L    COMP  PIC  S9(4).                                     
           02  BET642F    PICTURE X.                                            
           02  FILLER REDEFINES BET642F.                                        
             03 BET642A    PICTURE X.                                           
           02  BET642I  PIC X(7).                                               
           02  TBET742L    COMP  PIC  S9(4).                                    
           02  TBET742F    PICTURE X.                                           
           02  FILLER REDEFINES TBET742F.                                       
             03 TBET742A    PICTURE X.                                          
           02  TBET742I  PIC X(7).                                              
           02  FDS742L    COMP  PIC  S9(4).                                     
           02  FDS742F    PICTURE X.                                            
           02  FILLER REDEFINES FDS742F.                                        
             03 FDS742A    PICTURE X.                                           
           02  FDS742I  PIC X(2).                                               
           02  BET742L    COMP  PIC  S9(4).                                     
           02  BET742F    PICTURE X.                                            
           02  FILLER REDEFINES BET742F.                                        
             03 BET742A    PICTURE X.                                           
           02  BET742I  PIC X(7).                                               
           02  TBET842L    COMP  PIC  S9(4).                                    
           02  TBET842F    PICTURE X.                                           
           02  FILLER REDEFINES TBET842F.                                       
             03 TBET842A    PICTURE X.                                          
           02  TBET842I  PIC X(7).                                              
           02  FDS842L    COMP  PIC  S9(4).                                     
           02  FDS842F    PICTURE X.                                            
           02  FILLER REDEFINES FDS842F.                                        
             03 FDS842A    PICTURE X.                                           
           02  FDS842I  PIC X(2).                                               
           02  BET842L    COMP  PIC  S9(4).                                     
           02  BET842F    PICTURE X.                                            
           02  FILLER REDEFINES BET842F.                                        
             03 BET842A    PICTURE X.                                           
           02  BET842I  PIC X(7).                                               
           02  TBET942L    COMP  PIC  S9(4).                                    
           02  TBET942F    PICTURE X.                                           
           02  FILLER REDEFINES TBET942F.                                       
             03 TBET942A    PICTURE X.                                          
           02  TBET942I  PIC X(7).                                              
           02  FDS942L    COMP  PIC  S9(4).                                     
           02  FDS942F    PICTURE X.                                            
           02  FILLER REDEFINES FDS942F.                                        
             03 FDS942A    PICTURE X.                                           
           02  FDS942I  PIC X(2).                                               
           02  BET942L    COMP  PIC  S9(4).                                     
           02  BET942F    PICTURE X.                                            
           02  FILLER REDEFINES BET942F.                                        
             03 BET942A    PICTURE X.                                           
           02  BET942I  PIC X(7).                                               
           02  TART42L    COMP  PIC  S9(4).                                     
           02  TART42F    PICTURE X.                                            
           02  FILLER REDEFINES TART42F.                                        
             03 TART42A    PICTURE X.                                           
           02  TART42I  PIC X(10).                                              
           02  ANART42L    COMP  PIC  S9(4).                                    
           02  ANART42F    PICTURE X.                                           
           02  FILLER REDEFINES ANART42F.                                       
             03 ANART42A    PICTURE X.                                          
           02  ANART42I  PIC X(1).                                              
           02  TAND42L    COMP  PIC  S9(4).                                     
           02  TAND42F    PICTURE X.                                            
           02  FILLER REDEFINES TAND42F.                                        
             03 TAND42A    PICTURE X.                                           
           02  TAND42I  PIC X(6).                                               
           02  ANDAT42L    COMP  PIC  S9(4).                                    
           02  ANDAT42F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT42F.                                       
             03 ANDAT42A    PICTURE X.                                          
           02  ANDAT42I  PIC X(6).                                              
           02  TERD42L    COMP  PIC  S9(4).                                     
           02  TERD42F    PICTURE X.                                            
           02  FILLER REDEFINES TERD42F.                                        
             03 TERD42A    PICTURE X.                                           
           02  TERD42I  PIC X(10).                                              
           02  ERFDA42L    COMP  PIC  S9(4).                                    
           02  ERFDA42F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDA42F.                                       
             03 ERFDA42A    PICTURE X.                                          
           02  ERFDA42I  PIC X(6).                                              
           02  TSTAT42L    COMP  PIC  S9(4).                                    
           02  TSTAT42F    PICTURE X.                                           
           02  FILLER REDEFINES TSTAT42F.                                       
             03 TSTAT42A    PICTURE X.                                          
           02  TSTAT42I  PIC X(7).                                              
           02  STAT42L    COMP  PIC  S9(4).                                     
           02  STAT42F    PICTURE X.                                            
           02  FILLER REDEFINES STAT42F.                                        
             03 STAT42A    PICTURE X.                                           
           02  STAT42I  PIC X(2).                                               
           02  TEING42L    COMP  PIC  S9(4).                                    
           02  TEING42F    PICTURE X.                                           
           02  FILLER REDEFINES TEING42F.                                       
             03 TEING42A    PICTURE X.                                          
           02  TEING42I  PIC X(46).                                             
           02  EING42L    COMP  PIC  S9(4).                                     
           02  EING42F    PICTURE X.                                            
           02  FILLER REDEFINES EING42F.                                        
             03 EING42A    PICTURE X.                                           
           02  EING42I  PIC X(1).                                               
           02  FEHL42L    COMP  PIC  S9(4).                                     
           02  FEHL42F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL42F.                                        
             03 FEHL42A    PICTURE X.                                           
           02  FEHL42I  PIC X(78).                                              
       01  UA920O REDEFINES UA920I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS42O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATUM42O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR42O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN42O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB42O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIR42O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNA42O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNR42O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVM42O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNA42O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNR42O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVG42O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAN42O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRED42O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZU42O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZNAME42O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVOR42O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNAME42O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TSTR42O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  STR42O  PIC X(26).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPLZ42O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TORT42O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUSL42O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZ42O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  ORT42O  PIC X(21).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSL42O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET142O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS142O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET142O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET242O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS242O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET242O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET342O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS342O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET342O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET442O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS442O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET442O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET542O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS542O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET542O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET642O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS642O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET642O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET742O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS742O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET742O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET842O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS842O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET842O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBET942O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  FDS942O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  BET942O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TART42O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART42O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAND42O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT42O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TERD42O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERFDA42O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTAT42O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT42O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEING42O  PIC X(46).                                             
           02  FILLER PICTURE X(3).                                             
           02  EING42O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL42O  PIC X(78).                                              
