       01  UA929I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR9L    COMP  PIC  S9(4).                                       
           02  PNR9F    PICTURE X.                                              
           02  FILLER REDEFINES PNR9F.                                          
             03 PNR9A    PICTURE X.                                             
           02  PNR9I  PIC X(7).                                                 
           02  DATUM9L    COMP  PIC  S9(4).                                     
           02  DATUM9F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM9F.                                        
             03 DATUM9A    PICTURE X.                                           
           02  DATUM9I  PIC X(8).                                               
           02  UHR9L    COMP  PIC  S9(4).                                       
           02  UHR9F    PICTURE X.                                              
           02  FILLER REDEFINES UHR9F.                                          
             03 UHR9A    PICTURE X.                                             
           02  UHR9I  PIC X(5).                                                 
           02  GES9L    COMP  PIC  S9(4).                                       
           02  GES9F    PICTURE X.                                              
           02  FILLER REDEFINES GES9F.                                          
             03 GES9A    PICTURE X.                                             
           02  GES9I  PIC X(28).                                                
           02  VBNR9L    COMP  PIC  S9(4).                                      
           02  VBNR9F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR9F.                                         
             03 VBNR9A    PICTURE X.                                            
           02  VBNR9I  PIC X(7).                                                
           02  PRZVB9L    COMP  PIC  S9(4).                                     
           02  PRZVB9F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB9F.                                        
             03 PRZVB9A    PICTURE X.                                           
           02  PRZVB9I  PIC X(1).                                               
           02  VBNRVM9L    COMP  PIC  S9(4).                                    
           02  VBNRVM9F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM9F.                                       
             03 VBNRVM9A    PICTURE X.                                          
           02  VBNRVM9I  PIC X(7).                                              
           02  PRZVM9L    COMP  PIC  S9(4).                                     
           02  PRZVM9F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM9F.                                        
             03 PRZVM9A    PICTURE X.                                           
           02  PRZVM9I  PIC X(1).                                               
           02  VNR9L    COMP  PIC  S9(4).                                       
           02  VNR9F    PICTURE X.                                              
           02  FILLER REDEFINES VNR9F.                                          
             03 VNR9A    PICTURE X.                                             
           02  VNR9I  PIC X(12).                                                
           02  TIVNR9L    COMP  PIC  S9(4).                                     
           02  TIVNR9F    PICTURE X.                                            
           02  FILLER REDEFINES TIVNR9F.                                        
             03 TIVNR9A    PICTURE X.                                           
           02  TIVNR9I  PIC X(10).                                              
           02  IVNR9L    COMP  PIC  S9(4).                                      
           02  IVNR9F    PICTURE X.                                             
           02  FILLER REDEFINES IVNR9F.                                         
             03 IVNR9A    PICTURE X.                                            
           02  IVNR9I  PIC X(7).                                                
           02  PRIVNR9L    COMP  PIC  S9(4).                                    
           02  PRIVNR9F    PICTURE X.                                           
           02  FILLER REDEFINES PRIVNR9F.                                       
             03 PRIVNR9A    PICTURE X.                                          
           02  PRIVNR9I  PIC X(2).                                              
           02  TVNRA9L    COMP  PIC  S9(4).                                     
           02  TVNRA9F    PICTURE X.                                            
           02  FILLER REDEFINES TVNRA9F.                                        
             03 TVNRA9A    PICTURE X.                                           
           02  TVNRA9I  PIC X(19).                                              
           02  VBNRA9L    COMP  PIC  S9(4).                                     
           02  VBNRA9F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA9F.                                        
             03 VBNRA9A    PICTURE X.                                           
           02  VBNRA9I  PIC X(7).                                               
           02  VNRA9L    COMP  PIC  S9(4).                                      
           02  VNRA9F    PICTURE X.                                             
           02  FILLER REDEFINES VNRA9F.                                         
             03 VNRA9A    PICTURE X.                                            
           02  VNRA9I  PIC X(12).                                               
           02  ANREDE9L    COMP  PIC  S9(4).                                    
           02  ANREDE9F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE9F.                                       
             03 ANREDE9A    PICTURE X.                                          
           02  ANREDE9I  PIC X(9).                                              
           02  ZNAME9L    COMP  PIC  S9(4).                                     
           02  ZNAME9F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME9F.                                        
             03 ZNAME9A    PICTURE X.                                           
           02  ZNAME9I  PIC X(26).                                              
           02  VNAME9L    COMP  PIC  S9(4).                                     
           02  VNAME9F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME9F.                                        
             03 VNAME9A    PICTURE X.                                           
           02  VNAME9I  PIC X(26).                                              
           02  STR9L    COMP  PIC  S9(4).                                       
           02  STR9F    PICTURE X.                                              
           02  FILLER REDEFINES STR9F.                                          
             03 STR9A    PICTURE X.                                             
           02  STR9I  PIC X(26).                                                
           02  PLZ9L    COMP  PIC  S9(4).                                       
           02  PLZ9F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ9F.                                          
             03 PLZ9A    PICTURE X.                                             
           02  PLZ9I  PIC X(5).                                                 
           02  ORT9L    COMP  PIC  S9(4).                                       
           02  ORT9F    PICTURE X.                                              
           02  FILLER REDEFINES ORT9F.                                          
             03 ORT9A    PICTURE X.                                             
           02  ORT9I  PIC X(21).                                                
           02  AUSL9L    COMP  PIC  S9(4).                                      
           02  AUSL9F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL9F.                                         
             03 AUSL9A    PICTURE X.                                            
           02  AUSL9I  PIC X(3).                                                
           02  FNR91L    COMP  PIC  S9(4).                                      
           02  FNR91F    PICTURE X.                                             
           02  FILLER REDEFINES FNR91F.                                         
             03 FNR91A    PICTURE X.                                            
           02  FNR91I  PIC X(2).                                                
           02  SUM91L    COMP  PIC  S9(4).                                      
           02  SUM91F    PICTURE X.                                             
           02  FILLER REDEFINES SUM91F.                                         
             03 SUM91A    PICTURE X.                                            
           02  SUM91I  PIC X(8).                                                
           02  FNR92L    COMP  PIC  S9(4).                                      
           02  FNR92F    PICTURE X.                                             
           02  FILLER REDEFINES FNR92F.                                         
             03 FNR92A    PICTURE X.                                            
           02  FNR92I  PIC X(2).                                                
           02  SUM92L    COMP  PIC  S9(4).                                      
           02  SUM92F    PICTURE X.                                             
           02  FILLER REDEFINES SUM92F.                                         
             03 SUM92A    PICTURE X.                                            
           02  SUM92I  PIC X(8).                                                
           02  AE9L    COMP  PIC  S9(4).                                        
           02  AE9F    PICTURE X.                                               
           02  FILLER REDEFINES AE9F.                                           
             03 AE9A    PICTURE X.                                              
           02  AE9I  PIC X(8).                                                  
           02  ANART9L    COMP  PIC  S9(4).                                     
           02  ANART9F    PICTURE X.                                            
           02  FILLER REDEFINES ANART9F.                                        
             03 ANART9A    PICTURE X.                                           
           02  ANART9I  PIC X(2).                                               
           02  ANDAT9L    COMP  PIC  S9(4).                                     
           02  ANDAT9F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT9F.                                        
             03 ANDAT9A    PICTURE X.                                           
           02  ANDAT9I  PIC X(8).                                               
           02  ERFDAT9L    COMP  PIC  S9(4).                                    
           02  ERFDAT9F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT9F.                                       
             03 ERFDAT9A    PICTURE X.                                          
           02  ERFDAT9I  PIC X(8).                                              
           02  STAT91L    COMP  PIC  S9(4).                                     
           02  STAT91F    PICTURE X.                                            
           02  FILLER REDEFINES STAT91F.                                        
             03 STAT91A    PICTURE X.                                           
           02  STAT91I  PIC X(2).                                               
           02  STDAT91L    COMP  PIC  S9(4).                                    
           02  STDAT91F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT91F.                                       
             03 STDAT91A    PICTURE X.                                          
           02  STDAT91I  PIC X(8).                                              
           02  STAT92L    COMP  PIC  S9(4).                                     
           02  STAT92F    PICTURE X.                                            
           02  FILLER REDEFINES STAT92F.                                        
             03 STAT92A    PICTURE X.                                           
           02  STAT92I  PIC X(2).                                               
           02  STDAT92L    COMP  PIC  S9(4).                                    
           02  STDAT92F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT92F.                                       
             03 STDAT92A    PICTURE X.                                          
           02  STDAT92I  PIC X(8).                                              
           02  STAT93L    COMP  PIC  S9(4).                                     
           02  STAT93F    PICTURE X.                                            
           02  FILLER REDEFINES STAT93F.                                        
             03 STAT93A    PICTURE X.                                           
           02  STAT93I  PIC X(2).                                               
           02  STDAT93L    COMP  PIC  S9(4).                                    
           02  STDAT93F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT93F.                                       
             03 STDAT93A    PICTURE X.                                          
           02  STDAT93I  PIC X(8).                                              
           02  VBNR9EL    COMP  PIC  S9(4).                                     
           02  VBNR9EF    PICTURE X.                                            
           02  FILLER REDEFINES VBNR9EF.                                        
             03 VBNR9EA    PICTURE X.                                           
           02  VBNR9EI  PIC X(7).                                               
           02  GES9EL    COMP  PIC  S9(4).                                      
           02  GES9EF    PICTURE X.                                             
           02  FILLER REDEFINES GES9EF.                                         
             03 GES9EA    PICTURE X.                                            
           02  GES9EI  PIC X(2).                                                
           02  VNR9EL    COMP  PIC  S9(4).                                      
           02  VNR9EF    PICTURE X.                                             
           02  FILLER REDEFINES VNR9EF.                                         
             03 VNR9EA    PICTURE X.                                            
           02  VNR9EI  PIC 9(15).                                               
           02  NAME9EL    COMP  PIC  S9(4).                                     
           02  NAME9EF    PICTURE X.                                            
           02  FILLER REDEFINES NAME9EF.                                        
             03 NAME9EA    PICTURE X.                                           
           02  NAME9EI  PIC X(8).                                               
           02  TRANS9EL    COMP  PIC  S9(4).                                    
           02  TRANS9EF    PICTURE X.                                           
           02  FILLER REDEFINES TRANS9EF.                                       
             03 TRANS9EA    PICTURE X.                                          
           02  TRANS9EI  PIC X(4).                                              
           02  FEHLER9L    COMP  PIC  S9(4).                                    
           02  FEHLER9F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER9F.                                       
             03 FEHLER9A    PICTURE X.                                          
           02  FEHLER9I  PIC X(79).                                             
       01  UA929O REDEFINES UA929I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR9O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUM9O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR9O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GES9O  PIC X(28).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR9O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB9O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM9O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM9O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR9O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TIVNR9O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  IVNR9O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRIVNR9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNRA9O  PIC X(19).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRA9O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRA9O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREDE9O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZNAME9O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAME9O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  STR9O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ9O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT9O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL9O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  FNR91O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM91O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  FNR92O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM92O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE9O  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ANART9O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT9O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT9O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT91O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT91O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT92O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT92O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT93O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT93O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNR9EO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GES9EO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR9EO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME9EO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANS9EO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLER9O  PIC X(79).                                             
