       01  UA921I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS36L    COMP  PIC  S9(4).                                     
           02  PERS36F    PICTURE X.                                            
           02  FILLER REDEFINES PERS36F.                                        
             03 PERS36A    PICTURE X.                                           
           02  PERS36I  PIC X(7).                                               
           02  DATUM36L    COMP  PIC  S9(4).                                    
           02  DATUM36F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM36F.                                       
             03 DATUM36A    PICTURE X.                                          
           02  DATUM36I  PIC X(8).                                              
           02  UHR36L    COMP  PIC  S9(4).                                      
           02  UHR36F    PICTURE X.                                             
           02  FILLER REDEFINES UHR36F.                                         
             03 UHR36A    PICTURE X.                                            
           02  UHR36I  PIC X(5).                                                
           02  GES36L    COMP  PIC  S9(4).                                      
           02  GES36F    PICTURE X.                                             
           02  FILLER REDEFINES GES36F.                                         
             03 GES36A    PICTURE X.                                            
           02  GES36I  PIC X(23).                                               
           02  VBNR36L    COMP  PIC  S9(4).                                     
           02  VBNR36F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR36F.                                        
             03 VBNR36A    PICTURE X.                                           
           02  VBNR36I  PIC X(7).                                               
           02  PRZVB36L    COMP  PIC  S9(4).                                    
           02  PRZVB36F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVB36F.                                       
             03 PRZVB36A    PICTURE X.                                          
           02  PRZVB36I  PIC X(1).                                              
           02  DIR36L    COMP  PIC  S9(4).                                      
           02  DIR36F    PICTURE X.                                             
           02  FILLER REDEFINES DIR36F.                                         
             03 DIR36A    PICTURE X.                                            
           02  DIR36I  PIC X(3).                                                
           02  VBNA36L    COMP  PIC  S9(4).                                     
           02  VBNA36F    PICTURE X.                                            
           02  FILLER REDEFINES VBNA36F.                                        
             03 VBNA36A    PICTURE X.                                           
           02  VBNA36I  PIC X(20).                                              
           02  VBVM36L    COMP  PIC  S9(4).                                     
           02  VBVM36F    PICTURE X.                                            
           02  FILLER REDEFINES VBVM36F.                                        
             03 VBVM36A    PICTURE X.                                           
           02  VBVM36I  PIC X(7).                                               
           02  PRZVM36L    COMP  PIC  S9(4).                                    
           02  PRZVM36F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVM36F.                                       
             03 PRZVM36A    PICTURE X.                                          
           02  PRZVM36I  PIC X(1).                                              
           02  VMNA36L    COMP  PIC  S9(4).                                     
           02  VMNA36F    PICTURE X.                                            
           02  FILLER REDEFINES VMNA36F.                                        
             03 VMNA36A    PICTURE X.                                           
           02  VMNA36I  PIC X(20).                                              
           02  TVT36L    COMP  PIC  S9(4).                                      
           02  TVT36F    PICTURE X.                                             
           02  FILLER REDEFINES TVT36F.                                         
             03 TVT36A    PICTURE X.                                            
           02  TVT36I  PIC X(10).                                               
           02  VNR36L    COMP  PIC  S9(4).                                      
           02  VNR36F    PICTURE X.                                             
           02  FILLER REDEFINES VNR36F.                                         
             03 VNR36A    PICTURE X.                                            
           02  VNR36I  PIC X(7).                                                
           02  PRZ36L    COMP  PIC  S9(4).                                      
           02  PRZ36F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ36F.                                         
             03 PRZ36A    PICTURE X.                                            
           02  PRZ36I  PIC X(2).                                                
           02  TAN36L    COMP  PIC  S9(4).                                      
           02  TAN36F    PICTURE X.                                             
           02  FILLER REDEFINES TAN36F.                                         
             03 TAN36A    PICTURE X.                                            
           02  TAN36I  PIC X(6).                                                
           02  ANRE36L    COMP  PIC  S9(4).                                     
           02  ANRE36F    PICTURE X.                                            
           02  FILLER REDEFINES ANRE36F.                                        
             03 ANRE36A    PICTURE X.                                           
           02  ANRE36I  PIC X(9).                                               
           02  TZU36L    COMP  PIC  S9(4).                                      
           02  TZU36F    PICTURE X.                                             
           02  FILLER REDEFINES TZU36F.                                         
             03 TZU36A    PICTURE X.                                            
           02  TZU36I  PIC X(6).                                                
           02  ZNAME36L    COMP  PIC  S9(4).                                    
           02  ZNAME36F    PICTURE X.                                           
           02  FILLER REDEFINES ZNAME36F.                                       
             03 ZNAME36A    PICTURE X.                                          
           02  ZNAME36I  PIC X(26).                                             
           02  TVOR36L    COMP  PIC  S9(4).                                     
           02  TVOR36F    PICTURE X.                                            
           02  FILLER REDEFINES TVOR36F.                                        
             03 TVOR36A    PICTURE X.                                           
           02  TVOR36I  PIC X(7).                                               
           02  VNAME36L    COMP  PIC  S9(4).                                    
           02  VNAME36F    PICTURE X.                                           
           02  FILLER REDEFINES VNAME36F.                                       
             03 VNAME36A    PICTURE X.                                          
           02  VNAME36I  PIC X(26).                                             
           02  TEPLZ36L    COMP  PIC  S9(4).                                    
           02  TEPLZ36F    PICTURE X.                                           
           02  FILLER REDEFINES TEPLZ36F.                                       
             03 TEPLZ36A    PICTURE X.                                          
           02  TEPLZ36I  PIC X(3).                                              
           02  TORT36L    COMP  PIC  S9(4).                                     
           02  TORT36F    PICTURE X.                                            
           02  FILLER REDEFINES TORT36F.                                        
             03 TORT36A    PICTURE X.                                           
           02  TORT36I  PIC X(7).                                               
           02  TAUSL36L    COMP  PIC  S9(4).                                    
           02  TAUSL36F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSL36F.                                       
             03 TAUSL36A    PICTURE X.                                          
           02  TAUSL36I  PIC X(4).                                              
           02  PLZ36L    COMP  PIC  S9(4).                                      
           02  PLZ36F    PICTURE X.                                             
           02  FILLER REDEFINES PLZ36F.                                         
             03 PLZ36A    PICTURE X.                                            
           02  PLZ36I  PIC X(5).                                                
           02  ORT36L    COMP  PIC  S9(4).                                      
           02  ORT36F    PICTURE X.                                             
           02  FILLER REDEFINES ORT36F.                                         
             03 ORT36A    PICTURE X.                                            
           02  ORT36I  PIC X(21).                                               
           02  AUSL36L    COMP  PIC  S9(4).                                     
           02  AUSL36F    PICTURE X.                                            
           02  FILLER REDEFINES AUSL36F.                                        
             03 AUSL36A    PICTURE X.                                           
           02  AUSL36I  PIC X(3).                                               
           02  TPROD36L    COMP  PIC  S9(4).                                    
           02  TPROD36F    PICTURE X.                                           
           02  FILLER REDEFINES TPROD36F.                                       
             03 TPROD36A    PICTURE X.                                          
           02  TPROD36I  PIC X(11).                                             
           02  PROD36L    COMP  PIC  S9(4).                                     
           02  PROD36F    PICTURE X.                                            
           02  FILLER REDEFINES PROD36F.                                        
             03 PROD36A    PICTURE X.                                           
           02  PROD36I  PIC X(2).                                               
           02  TSUM36L    COMP  PIC  S9(4).                                     
           02  TSUM36F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM36F.                                        
             03 TSUM36A    PICTURE X.                                           
           02  TSUM36I  PIC X(7).                                               
           02  SUM36L    COMP  PIC  S9(4).                                      
           02  SUM36F    PICTURE X.                                             
           02  FILLER REDEFINES SUM36F.                                         
             03 SUM36A    PICTURE X.                                            
           02  SUM36I  PIC X(10).                                               
           02  TART36L    COMP  PIC  S9(4).                                     
           02  TART36F    PICTURE X.                                            
           02  FILLER REDEFINES TART36F.                                        
             03 TART36A    PICTURE X.                                           
           02  TART36I  PIC X(10).                                              
           02  ANART36L    COMP  PIC  S9(4).                                    
           02  ANART36F    PICTURE X.                                           
           02  FILLER REDEFINES ANART36F.                                       
             03 ANART36A    PICTURE X.                                          
           02  ANART36I  PIC X(1).                                              
           02  TAND36L    COMP  PIC  S9(4).                                     
           02  TAND36F    PICTURE X.                                            
           02  FILLER REDEFINES TAND36F.                                        
             03 TAND36A    PICTURE X.                                           
           02  TAND36I  PIC X(6).                                               
           02  ANDAT36L    COMP  PIC  S9(4).                                    
           02  ANDAT36F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT36F.                                       
             03 ANDAT36A    PICTURE X.                                          
           02  ANDAT36I  PIC X(6).                                              
           02  TERD36L    COMP  PIC  S9(4).                                     
           02  TERD36F    PICTURE X.                                            
           02  FILLER REDEFINES TERD36F.                                        
             03 TERD36A    PICTURE X.                                           
           02  TERD36I  PIC X(10).                                              
           02  ERFD36L    COMP  PIC  S9(4).                                     
           02  ERFD36F    PICTURE X.                                            
           02  FILLER REDEFINES ERFD36F.                                        
             03 ERFD36A    PICTURE X.                                           
           02  ERFD36I  PIC X(6).                                               
           02  TSTAT36L    COMP  PIC  S9(4).                                    
           02  TSTAT36F    PICTURE X.                                           
           02  FILLER REDEFINES TSTAT36F.                                       
             03 TSTAT36A    PICTURE X.                                          
           02  TSTAT36I  PIC X(7).                                              
           02  STAT36L    COMP  PIC  S9(4).                                     
           02  STAT36F    PICTURE X.                                            
           02  FILLER REDEFINES STAT36F.                                        
             03 STAT36A    PICTURE X.                                           
           02  STAT36I  PIC X(2).                                               
           02  TEING36L    COMP  PIC  S9(4).                                    
           02  TEING36F    PICTURE X.                                           
           02  FILLER REDEFINES TEING36F.                                       
             03 TEING36A    PICTURE X.                                          
           02  TEING36I  PIC X(46).                                             
           02  EING36L    COMP  PIC  S9(4).                                     
           02  EING36F    PICTURE X.                                            
           02  FILLER REDEFINES EING36F.                                        
             03 EING36A    PICTURE X.                                           
           02  EING36I  PIC X(1).                                               
           02  FEHL36L    COMP  PIC  S9(4).                                     
           02  FEHL36F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL36F.                                        
             03 FEHL36A    PICTURE X.                                           
           02  FEHL36I  PIC X(78).                                              
       01  UA921O REDEFINES UA921I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS36O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATUM36O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR36O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  GES36O  PIC X(23).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR36O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVB36O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIR36O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNA36O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBVM36O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVM36O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNA36O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVT36O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR36O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ36O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAN36O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRE36O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZU36O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZNAME36O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVOR36O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNAME36O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TEPLZ36O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TORT36O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUSL36O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZ36O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  ORT36O  PIC X(21).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSL36O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROD36O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  PROD36O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSUM36O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SUM36O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  TART36O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART36O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAND36O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT36O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TERD36O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERFD36O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTAT36O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT36O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEING36O  PIC X(46).                                             
           02  FILLER PICTURE X(3).                                             
           02  EING36O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL36O  PIC X(78).                                              
