       01  UA922I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS87L    COMP  PIC  S9(4).                                     
           02  PERS87F    PICTURE X.                                            
           02  FILLER REDEFINES PERS87F.                                        
             03 PERS87A    PICTURE X.                                           
           02  PERS87I  PIC X(7).                                               
           02  DATUM87L    COMP  PIC  S9(4).                                    
           02  DATUM87F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM87F.                                       
             03 DATUM87A    PICTURE X.                                          
           02  DATUM87I  PIC X(8).                                              
           02  UHR87L    COMP  PIC  S9(4).                                      
           02  UHR87F    PICTURE X.                                             
           02  FILLER REDEFINES UHR87F.                                         
             03 UHR87A    PICTURE X.                                            
           02  UHR87I  PIC X(5).                                                
           02  GES87L    COMP  PIC  S9(4).                                      
           02  GES87F    PICTURE X.                                             
           02  FILLER REDEFINES GES87F.                                         
             03 GES87A    PICTURE X.                                            
           02  GES87I  PIC X(23).                                               
           02  VBNR87L    COMP  PIC  S9(4).                                     
           02  VBNR87F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR87F.                                        
             03 VBNR87A    PICTURE X.                                           
           02  VBNR87I  PIC X(7).                                               
           02  PRZVB87L    COMP  PIC  S9(4).                                    
           02  PRZVB87F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVB87F.                                       
             03 PRZVB87A    PICTURE X.                                          
           02  PRZVB87I  PIC X(1).                                              
           02  DIR87L    COMP  PIC  S9(4).                                      
           02  DIR87F    PICTURE X.                                             
           02  FILLER REDEFINES DIR87F.                                         
             03 DIR87A    PICTURE X.                                            
           02  DIR87I  PIC X(3).                                                
           02  VBNA87L    COMP  PIC  S9(4).                                     
           02  VBNA87F    PICTURE X.                                            
           02  FILLER REDEFINES VBNA87F.                                        
             03 VBNA87A    PICTURE X.                                           
           02  VBNA87I  PIC X(20).                                              
           02  VBVM87L    COMP  PIC  S9(4).                                     
           02  VBVM87F    PICTURE X.                                            
           02  FILLER REDEFINES VBVM87F.                                        
             03 VBVM87A    PICTURE X.                                           
           02  VBVM87I  PIC X(7).                                               
           02  PRZVM87L    COMP  PIC  S9(4).                                    
           02  PRZVM87F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVM87F.                                       
             03 PRZVM87A    PICTURE X.                                          
           02  PRZVM87I  PIC X(1).                                              
           02  VMNA87L    COMP  PIC  S9(4).                                     
           02  VMNA87F    PICTURE X.                                            
           02  FILLER REDEFINES VMNA87F.                                        
             03 VMNA87A    PICTURE X.                                           
           02  VMNA87I  PIC X(20).                                              
           02  TVT87L    COMP  PIC  S9(4).                                      
           02  TVT87F    PICTURE X.                                             
           02  FILLER REDEFINES TVT87F.                                         
             03 TVT87A    PICTURE X.                                            
           02  TVT87I  PIC X(10).                                               
           02  VNR187L    COMP  PIC  S9(4).                                     
           02  VNR187F    PICTURE X.                                            
           02  FILLER REDEFINES VNR187F.                                        
             03 VNR187A    PICTURE X.                                           
           02  VNR187I  PIC X(1).                                               
           02  VNR287L    COMP  PIC  S9(4).                                     
           02  VNR287F    PICTURE X.                                            
           02  FILLER REDEFINES VNR287F.                                        
             03 VNR287A    PICTURE X.                                           
           02  VNR287I  PIC X(1).                                               
           02  VNR387L    COMP  PIC  S9(4).                                     
           02  VNR387F    PICTURE X.                                            
           02  FILLER REDEFINES VNR387F.                                        
             03 VNR387A    PICTURE X.                                           
           02  VNR387I  PIC X(2).                                               
           02  VNR487L    COMP  PIC  S9(4).                                     
           02  VNR487F    PICTURE X.                                            
           02  FILLER REDEFINES VNR487F.                                        
             03 VNR487A    PICTURE X.                                           
           02  VNR487I  PIC X(1).                                               
           02  VNR587L    COMP  PIC  S9(4).                                     
           02  VNR587F    PICTURE X.                                            
           02  FILLER REDEFINES VNR587F.                                        
             03 VNR587A    PICTURE X.                                           
           02  VNR587I  PIC X(3).                                               
           02  VNR687L    COMP  PIC  S9(4).                                     
           02  VNR687F    PICTURE X.                                            
           02  FILLER REDEFINES VNR687F.                                        
             03 VNR687A    PICTURE X.                                           
           02  VNR687I  PIC X(1).                                               
           02  VNR787L    COMP  PIC  S9(4).                                     
           02  VNR787F    PICTURE X.                                            
           02  FILLER REDEFINES VNR787F.                                        
             03 VNR787A    PICTURE X.                                           
           02  VNR787I  PIC X(3).                                               
           02  VNR887L    COMP  PIC  S9(4).                                     
           02  VNR887F    PICTURE X.                                            
           02  FILLER REDEFINES VNR887F.                                        
             03 VNR887A    PICTURE X.                                           
           02  VNR887I  PIC X(1).                                               
           02  VNR987L    COMP  PIC  S9(4).                                     
           02  VNR987F    PICTURE X.                                            
           02  FILLER REDEFINES VNR987F.                                        
             03 VNR987A    PICTURE X.                                           
           02  VNR987I  PIC X(1).                                               
           02  TAN87L    COMP  PIC  S9(4).                                      
           02  TAN87F    PICTURE X.                                             
           02  FILLER REDEFINES TAN87F.                                         
             03 TAN87A    PICTURE X.                                            
           02  TAN87I  PIC X(6).                                                
           02  ANRE87L    COMP  PIC  S9(4).                                     
           02  ANRE87F    PICTURE X.                                            
           02  FILLER REDEFINES ANRE87F.                                        
             03 ANRE87A    PICTURE X.                                           
           02  ANRE87I  PIC X(9).                                               
           02  TZU87L    COMP  PIC  S9(4).                                      
           02  TZU87F    PICTURE X.                                             
           02  FILLER REDEFINES TZU87F.                                         
             03 TZU87A    PICTURE X.                                            
           02  TZU87I  PIC X(6).                                                
           02  ZNAME87L    COMP  PIC  S9(4).                                    
           02  ZNAME87F    PICTURE X.                                           
           02  FILLER REDEFINES ZNAME87F.                                       
             03 ZNAME87A    PICTURE X.                                          
           02  ZNAME87I  PIC X(26).                                             
           02  TVOR87L    COMP  PIC  S9(4).                                     
           02  TVOR87F    PICTURE X.                                            
           02  FILLER REDEFINES TVOR87F.                                        
             03 TVOR87A    PICTURE X.                                           
           02  TVOR87I  PIC X(7).                                               
           02  VNAME87L    COMP  PIC  S9(4).                                    
           02  VNAME87F    PICTURE X.                                           
           02  FILLER REDEFINES VNAME87F.                                       
             03 VNAME87A    PICTURE X.                                          
           02  VNAME87I  PIC X(26).                                             
           02  TEPLZ87L    COMP  PIC  S9(4).                                    
           02  TEPLZ87F    PICTURE X.                                           
           02  FILLER REDEFINES TEPLZ87F.                                       
             03 TEPLZ87A    PICTURE X.                                          
           02  TEPLZ87I  PIC X(3).                                              
           02  TORT87L    COMP  PIC  S9(4).                                     
           02  TORT87F    PICTURE X.                                            
           02  FILLER REDEFINES TORT87F.                                        
             03 TORT87A    PICTURE X.                                           
           02  TORT87I  PIC X(7).                                               
           02  TAUSL87L    COMP  PIC  S9(4).                                    
           02  TAUSL87F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSL87F.                                       
             03 TAUSL87A    PICTURE X.                                          
           02  TAUSL87I  PIC X(4).                                              
           02  PLZ87L    COMP  PIC  S9(4).                                      
           02  PLZ87F    PICTURE X.                                             
           02  FILLER REDEFINES PLZ87F.                                         
             03 PLZ87A    PICTURE X.                                            
           02  PLZ87I  PIC X(5).                                                
           02  ORT87L    COMP  PIC  S9(4).                                      
           02  ORT87F    PICTURE X.                                             
           02  FILLER REDEFINES ORT87F.                                         
             03 ORT87A    PICTURE X.                                            
           02  ORT87I  PIC X(21).                                               
           02  AUSL87L    COMP  PIC  S9(4).                                     
           02  AUSL87F    PICTURE X.                                            
           02  FILLER REDEFINES AUSL87F.                                        
             03 AUSL87A    PICTURE X.                                           
           02  AUSL87I  PIC X(3).                                               
           02  TPROD87L    COMP  PIC  S9(4).                                    
           02  TPROD87F    PICTURE X.                                           
           02  FILLER REDEFINES TPROD87F.                                       
             03 TPROD87A    PICTURE X.                                          
           02  TPROD87I  PIC X(11).                                             
           02  PROD87L    COMP  PIC  S9(4).                                     
           02  PROD87F    PICTURE X.                                            
           02  FILLER REDEFINES PROD87F.                                        
             03 PROD87A    PICTURE X.                                           
           02  PROD87I  PIC X(2).                                               
           02  TSUM87L    COMP  PIC  S9(4).                                     
           02  TSUM87F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM87F.                                        
             03 TSUM87A    PICTURE X.                                           
           02  TSUM87I  PIC X(5).                                               
           02  SUM87L    COMP  PIC  S9(4).                                      
           02  SUM87F    PICTURE X.                                             
           02  FILLER REDEFINES SUM87F.                                         
             03 SUM87A    PICTURE X.                                            
           02  SUM87I  PIC X(6).                                                
           02  TBE87L    COMP  PIC  S9(4).                                      
           02  TBE87F    PICTURE X.                                             
           02  FILLER REDEFINES TBE87F.                                         
             03 TBE87A    PICTURE X.                                            
           02  TBE87I  PIC X(11).                                               
           02  BEG87L    COMP  PIC  S9(4).                                      
           02  BEG87F    PICTURE X.                                             
           02  FILLER REDEFINES BEG87F.                                         
             03 BEG87A    PICTURE X.                                            
           02  BEG87I  PIC X(6).                                                
           02  TART87L    COMP  PIC  S9(4).                                     
           02  TART87F    PICTURE X.                                            
           02  FILLER REDEFINES TART87F.                                        
             03 TART87A    PICTURE X.                                           
           02  TART87I  PIC X(10).                                              
           02  ANART87L    COMP  PIC  S9(4).                                    
           02  ANART87F    PICTURE X.                                           
           02  FILLER REDEFINES ANART87F.                                       
             03 ANART87A    PICTURE X.                                          
           02  ANART87I  PIC X(1).                                              
           02  TAND87L    COMP  PIC  S9(4).                                     
           02  TAND87F    PICTURE X.                                            
           02  FILLER REDEFINES TAND87F.                                        
             03 TAND87A    PICTURE X.                                           
           02  TAND87I  PIC X(6).                                               
           02  ANDAT87L    COMP  PIC  S9(4).                                    
           02  ANDAT87F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT87F.                                       
             03 ANDAT87A    PICTURE X.                                          
           02  ANDAT87I  PIC X(6).                                              
           02  TERD87L    COMP  PIC  S9(4).                                     
           02  TERD87F    PICTURE X.                                            
           02  FILLER REDEFINES TERD87F.                                        
             03 TERD87A    PICTURE X.                                           
           02  TERD87I  PIC X(10).                                              
           02  ERFD87L    COMP  PIC  S9(4).                                     
           02  ERFD87F    PICTURE X.                                            
           02  FILLER REDEFINES ERFD87F.                                        
             03 ERFD87A    PICTURE X.                                           
           02  ERFD87I  PIC X(6).                                               
           02  TSTAT87L    COMP  PIC  S9(4).                                    
           02  TSTAT87F    PICTURE X.                                           
           02  FILLER REDEFINES TSTAT87F.                                       
             03 TSTAT87A    PICTURE X.                                          
           02  TSTAT87I  PIC X(7).                                              
           02  STAT87L    COMP  PIC  S9(4).                                     
           02  STAT87F    PICTURE X.                                            
           02  FILLER REDEFINES STAT87F.                                        
             03 STAT87A    PICTURE X.                                           
           02  STAT87I  PIC X(2).                                               
           02  TEING87L    COMP  PIC  S9(4).                                    
           02  TEING87F    PICTURE X.                                           
           02  FILLER REDEFINES TEING87F.                                       
             03 TEING87A    PICTURE X.                                          
           02  TEING87I  PIC X(46).                                             
           02  EING87L    COMP  PIC  S9(4).                                     
           02  EING87F    PICTURE X.                                            
           02  FILLER REDEFINES EING87F.                                        
             03 EING87A    PICTURE X.                                           
           02  EING87I  PIC X(1).                                               
           02  FEHL87L    COMP  PIC  S9(4).                                     
           02  FEHL87F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL87F.                                        
             03 FEHL87A    PICTURE X.                                           
           02  FEHL87I  PIC X(78).                                              
       01  UA922O REDEFINES UA922I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS87O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATUM87O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR87O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  GES87O  PIC X(23).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR87O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVB87O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIR87O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNA87O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBVM87O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVM87O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNA87O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVT87O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR187O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR287O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR387O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR487O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR587O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR687O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR787O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR887O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR987O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAN87O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRE87O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZU87O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZNAME87O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVOR87O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNAME87O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TEPLZ87O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TORT87O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUSL87O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZ87O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  ORT87O  PIC X(21).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSL87O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROD87O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  PROD87O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSUM87O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  SUM87O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBE87O  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEG87O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  TART87O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART87O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAND87O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT87O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TERD87O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERFD87O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTAT87O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT87O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEING87O  PIC X(46).                                             
           02  FILLER PICTURE X(3).                                             
           02  EING87O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL87O  PIC X(78).                                              
