       01  UA931I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR5L    COMP  PIC  S9(4).                                       
           02  PNR5F    PICTURE X.                                              
           02  FILLER REDEFINES PNR5F.                                          
             03 PNR5A    PICTURE X.                                             
           02  PNR5I  PIC X(7).                                                 
           02  DATUM5L    COMP  PIC  S9(4).                                     
           02  DATUM5F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM5F.                                        
             03 DATUM5A    PICTURE X.                                           
           02  DATUM5I  PIC X(8).                                               
           02  UHR5L    COMP  PIC  S9(4).                                       
           02  UHR5F    PICTURE X.                                              
           02  FILLER REDEFINES UHR5F.                                          
             03 UHR5A    PICTURE X.                                             
           02  UHR5I  PIC X(5).                                                 
           02  GES5L    COMP  PIC  S9(4).                                       
           02  GES5F    PICTURE X.                                              
           02  FILLER REDEFINES GES5F.                                          
             03 GES5A    PICTURE X.                                             
           02  GES5I  PIC X(28).                                                
           02  VBNR5L    COMP  PIC  S9(4).                                      
           02  VBNR5F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR5F.                                         
             03 VBNR5A    PICTURE X.                                            
           02  VBNR5I  PIC X(7).                                                
           02  PRZVB5L    COMP  PIC  S9(4).                                     
           02  PRZVB5F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB5F.                                        
             03 PRZVB5A    PICTURE X.                                           
           02  PRZVB5I  PIC X(1).                                               
           02  VBNRVM5L    COMP  PIC  S9(4).                                    
           02  VBNRVM5F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM5F.                                       
             03 VBNRVM5A    PICTURE X.                                          
           02  VBNRVM5I  PIC X(7).                                              
           02  PRZVM5L    COMP  PIC  S9(4).                                     
           02  PRZVM5F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM5F.                                        
             03 PRZVM5A    PICTURE X.                                           
           02  PRZVM5I  PIC X(1).                                               
           02  DEPOT5L    COMP  PIC  S9(4).                                     
           02  DEPOT5F    PICTURE X.                                            
           02  FILLER REDEFINES DEPOT5F.                                        
             03 DEPOT5A    PICTURE X.                                           
           02  DEPOT5I  PIC X(2).                                               
           02  VNR5L    COMP  PIC  S9(4).                                       
           02  VNR5F    PICTURE X.                                              
           02  FILLER REDEFINES VNR5F.                                          
             03 VNR5A    PICTURE X.                                             
           02  VNR5I  PIC X(13).                                                
           02  TIVNR5L    COMP  PIC  S9(4).                                     
           02  TIVNR5F    PICTURE X.                                            
           02  FILLER REDEFINES TIVNR5F.                                        
             03 TIVNR5A    PICTURE X.                                           
           02  TIVNR5I  PIC X(10).                                              
           02  IVNR5L    COMP  PIC  S9(4).                                      
           02  IVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES IVNR5F.                                         
             03 IVNR5A    PICTURE X.                                            
           02  IVNR5I  PIC X(7).                                                
           02  PRIVNR5L    COMP  PIC  S9(4).                                    
           02  PRIVNR5F    PICTURE X.                                           
           02  FILLER REDEFINES PRIVNR5F.                                       
             03 PRIVNR5A    PICTURE X.                                          
           02  PRIVNR5I  PIC X(2).                                              
           02  TVNRA5L    COMP  PIC  S9(4).                                     
           02  TVNRA5F    PICTURE X.                                            
           02  FILLER REDEFINES TVNRA5F.                                        
             03 TVNRA5A    PICTURE X.                                           
           02  TVNRA5I  PIC X(19).                                              
           02  VBNRA5L    COMP  PIC  S9(4).                                     
           02  VBNRA5F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA5F.                                        
             03 VBNRA5A    PICTURE X.                                           
           02  VBNRA5I  PIC X(7).                                               
           02  VNRA5L    COMP  PIC  S9(4).                                      
           02  VNRA5F    PICTURE X.                                             
           02  FILLER REDEFINES VNRA5F.                                         
             03 VNRA5A    PICTURE X.                                            
           02  VNRA5I  PIC X(15).                                               
           02  ANREDE5L    COMP  PIC  S9(4).                                    
           02  ANREDE5F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE5F.                                       
             03 ANREDE5A    PICTURE X.                                          
           02  ANREDE5I  PIC X(9).                                              
           02  ZNAME5L    COMP  PIC  S9(4).                                     
           02  ZNAME5F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME5F.                                        
             03 ZNAME5A    PICTURE X.                                           
           02  ZNAME5I  PIC X(26).                                              
           02  VNAME5L    COMP  PIC  S9(4).                                     
           02  VNAME5F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME5F.                                        
             03 VNAME5A    PICTURE X.                                           
           02  VNAME5I  PIC X(26).                                              
           02  PLZ5L    COMP  PIC  S9(4).                                       
           02  PLZ5F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ5F.                                          
             03 PLZ5A    PICTURE X.                                             
           02  PLZ5I  PIC X(5).                                                 
           02  ORT5L    COMP  PIC  S9(4).                                       
           02  ORT5F    PICTURE X.                                              
           02  FILLER REDEFINES ORT5F.                                          
             03 ORT5A    PICTURE X.                                             
           02  ORT5I  PIC X(21).                                                
           02  AUSL5L    COMP  PIC  S9(4).                                      
           02  AUSL5F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL5F.                                         
             03 AUSL5A    PICTURE X.                                            
           02  AUSL5I  PIC X(3).                                                
           02  TSUM51L    COMP  PIC  S9(4).                                     
           02  TSUM51F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM51F.                                        
             03 TSUM51A    PICTURE X.                                           
           02  TSUM51I  PIC X(15).                                              
           02  FNR51L    COMP  PIC  S9(4).                                      
           02  FNR51F    PICTURE X.                                             
           02  FILLER REDEFINES FNR51F.                                         
             03 FNR51A    PICTURE X.                                            
           02  FNR51I  PIC X(2).                                                
           02  SUM51L    COMP  PIC  S9(4).                                      
           02  SUM51F    PICTURE X.                                             
           02  FILLER REDEFINES SUM51F.                                         
             03 SUM51A    PICTURE X.                                            
           02  SUM51I  PIC X(8).                                                
           02  TSUM52L    COMP  PIC  S9(4).                                     
           02  TSUM52F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM52F.                                        
             03 TSUM52A    PICTURE X.                                           
           02  TSUM52I  PIC X(15).                                              
           02  FNR52L    COMP  PIC  S9(4).                                      
           02  FNR52F    PICTURE X.                                             
           02  FILLER REDEFINES FNR52F.                                         
             03 FNR52A    PICTURE X.                                            
           02  FNR52I  PIC X(2).                                                
           02  SUM52L    COMP  PIC  S9(4).                                      
           02  SUM52F    PICTURE X.                                             
           02  FILLER REDEFINES SUM52F.                                         
             03 SUM52A    PICTURE X.                                            
           02  SUM52I  PIC X(8).                                                
           02  TSUM53L    COMP  PIC  S9(4).                                     
           02  TSUM53F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM53F.                                        
             03 TSUM53A    PICTURE X.                                           
           02  TSUM53I  PIC X(15).                                              
           02  FNR53L    COMP  PIC  S9(4).                                      
           02  FNR53F    PICTURE X.                                             
           02  FILLER REDEFINES FNR53F.                                         
             03 FNR53A    PICTURE X.                                            
           02  FNR53I  PIC X(2).                                                
           02  SUM53L    COMP  PIC  S9(4).                                      
           02  SUM53F    PICTURE X.                                             
           02  FILLER REDEFINES SUM53F.                                         
             03 SUM53A    PICTURE X.                                            
           02  SUM53I  PIC X(8).                                                
           02  TSUM54L    COMP  PIC  S9(4).                                     
           02  TSUM54F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM54F.                                        
             03 TSUM54A    PICTURE X.                                           
           02  TSUM54I  PIC X(15).                                              
           02  FNR54L    COMP  PIC  S9(4).                                      
           02  FNR54F    PICTURE X.                                             
           02  FILLER REDEFINES FNR54F.                                         
             03 FNR54A    PICTURE X.                                            
           02  FNR54I  PIC X(2).                                                
           02  SUM54L    COMP  PIC  S9(4).                                      
           02  SUM54F    PICTURE X.                                             
           02  FILLER REDEFINES SUM54F.                                         
             03 SUM54A    PICTURE X.                                            
           02  SUM54I  PIC X(8).                                                
           02  TSUM55L    COMP  PIC  S9(4).                                     
           02  TSUM55F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM55F.                                        
             03 TSUM55A    PICTURE X.                                           
           02  TSUM55I  PIC X(15).                                              
           02  FNR55L    COMP  PIC  S9(4).                                      
           02  FNR55F    PICTURE X.                                             
           02  FILLER REDEFINES FNR55F.                                         
             03 FNR55A    PICTURE X.                                            
           02  FNR55I  PIC X(2).                                                
           02  SUM55L    COMP  PIC  S9(4).                                      
           02  SUM55F    PICTURE X.                                             
           02  FILLER REDEFINES SUM55F.                                         
             03 SUM55A    PICTURE X.                                            
           02  SUM55I  PIC X(8).                                                
           02  TSUM56L    COMP  PIC  S9(4).                                     
           02  TSUM56F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM56F.                                        
             03 TSUM56A    PICTURE X.                                           
           02  TSUM56I  PIC X(15).                                              
           02  FNR56L    COMP  PIC  S9(4).                                      
           02  FNR56F    PICTURE X.                                             
           02  FILLER REDEFINES FNR56F.                                         
             03 FNR56A    PICTURE X.                                            
           02  FNR56I  PIC X(2).                                                
           02  SUM56L    COMP  PIC  S9(4).                                      
           02  SUM56F    PICTURE X.                                             
           02  FILLER REDEFINES SUM56F.                                         
             03 SUM56A    PICTURE X.                                            
           02  SUM56I  PIC X(8).                                                
           02  TSUM57L    COMP  PIC  S9(4).                                     
           02  TSUM57F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM57F.                                        
             03 TSUM57A    PICTURE X.                                           
           02  TSUM57I  PIC X(15).                                              
           02  FNR57L    COMP  PIC  S9(4).                                      
           02  FNR57F    PICTURE X.                                             
           02  FILLER REDEFINES FNR57F.                                         
             03 FNR57A    PICTURE X.                                            
           02  FNR57I  PIC X(2).                                                
           02  SUM57L    COMP  PIC  S9(4).                                      
           02  SUM57F    PICTURE X.                                             
           02  FILLER REDEFINES SUM57F.                                         
             03 SUM57A    PICTURE X.                                            
           02  SUM57I  PIC X(8).                                                
           02  TSUM58L    COMP  PIC  S9(4).                                     
           02  TSUM58F    PICTURE X.                                            
           02  FILLER REDEFINES TSUM58F.                                        
             03 TSUM58A    PICTURE X.                                           
           02  TSUM58I  PIC X(15).                                              
           02  FNR58L    COMP  PIC  S9(4).                                      
           02  FNR58F    PICTURE X.                                             
           02  FILLER REDEFINES FNR58F.                                         
             03 FNR58A    PICTURE X.                                            
           02  FNR58I  PIC X(2).                                                
           02  SUM58L    COMP  PIC  S9(4).                                      
           02  SUM58F    PICTURE X.                                             
           02  FILLER REDEFINES SUM58F.                                         
             03 SUM58A    PICTURE X.                                            
           02  SUM58I  PIC X(8).                                                
           02  AE5L    COMP  PIC  S9(4).                                        
           02  AE5F    PICTURE X.                                               
           02  FILLER REDEFINES AE5F.                                           
             03 AE5A    PICTURE X.                                              
           02  AE5I  PIC X(8).                                                  
           02  ANART5L    COMP  PIC  S9(4).                                     
           02  ANART5F    PICTURE X.                                            
           02  FILLER REDEFINES ANART5F.                                        
             03 ANART5A    PICTURE X.                                           
           02  ANART5I  PIC X(2).                                               
           02  ANDAT5L    COMP  PIC  S9(4).                                     
           02  ANDAT5F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT5F.                                        
             03 ANDAT5A    PICTURE X.                                           
           02  ANDAT5I  PIC X(8).                                               
           02  ERFDAT5L    COMP  PIC  S9(4).                                    
           02  ERFDAT5F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT5F.                                       
             03 ERFDAT5A    PICTURE X.                                          
           02  ERFDAT5I  PIC X(8).                                              
           02  STAT51L    COMP  PIC  S9(4).                                     
           02  STAT51F    PICTURE X.                                            
           02  FILLER REDEFINES STAT51F.                                        
             03 STAT51A    PICTURE X.                                           
           02  STAT51I  PIC X(2).                                               
           02  STDAT51L    COMP  PIC  S9(4).                                    
           02  STDAT51F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT51F.                                       
             03 STDAT51A    PICTURE X.                                          
           02  STDAT51I  PIC X(8).                                              
           02  STAT52L    COMP  PIC  S9(4).                                     
           02  STAT52F    PICTURE X.                                            
           02  FILLER REDEFINES STAT52F.                                        
             03 STAT52A    PICTURE X.                                           
           02  STAT52I  PIC X(2).                                               
           02  STDAT52L    COMP  PIC  S9(4).                                    
           02  STDAT52F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT52F.                                       
             03 STDAT52A    PICTURE X.                                          
           02  STDAT52I  PIC X(8).                                              
           02  STAT53L    COMP  PIC  S9(4).                                     
           02  STAT53F    PICTURE X.                                            
           02  FILLER REDEFINES STAT53F.                                        
             03 STAT53A    PICTURE X.                                           
           02  STAT53I  PIC X(2).                                               
           02  STDAT53L    COMP  PIC  S9(4).                                    
           02  STDAT53F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT53F.                                       
             03 STDAT53A    PICTURE X.                                          
           02  STDAT53I  PIC X(8).                                              
           02  VBNR5EL    COMP  PIC  S9(4).                                     
           02  VBNR5EF    PICTURE X.                                            
           02  FILLER REDEFINES VBNR5EF.                                        
             03 VBNR5EA    PICTURE X.                                           
           02  VBNR5EI  PIC X(7).                                               
           02  GES5EL    COMP  PIC  S9(4).                                      
           02  GES5EF    PICTURE X.                                             
           02  FILLER REDEFINES GES5EF.                                         
             03 GES5EA    PICTURE X.                                            
           02  GES5EI  PIC X(2).                                                
           02  VNR5EL    COMP  PIC  S9(4).                                      
           02  VNR5EF    PICTURE X.                                             
           02  FILLER REDEFINES VNR5EF.                                         
             03 VNR5EA    PICTURE X.                                            
           02  VNR5EI  PIC 9(15).                                               
           02  NAME5EL    COMP  PIC  S9(4).                                     
           02  NAME5EF    PICTURE X.                                            
           02  FILLER REDEFINES NAME5EF.                                        
             03 NAME5EA    PICTURE X.                                           
           02  NAME5EI  PIC X(8).                                               
           02  TRANS5EL    COMP  PIC  S9(4).                                    
           02  TRANS5EF    PICTURE X.                                           
           02  FILLER REDEFINES TRANS5EF.                                       
             03 TRANS5EA    PICTURE X.                                          
           02  TRANS5EI  PIC X(4).                                              
           02  FEHLER5L    COMP  PIC  S9(4).                                    
           02  FEHLER5F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER5F.                                       
             03 FEHLER5A    PICTURE X.                                          
           02  FEHLER5I  PIC X(79).                                             
       01  UA931O REDEFINES UA931I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR5O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUM5O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR5O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GES5O  PIC X(28).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM5O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  DEPOT5O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR5O  PIC X(13).                                                
           02  FILLER PICTURE X(3).                                             
           02  TIVNR5O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  IVNR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRIVNR5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNRA5O  PIC X(19).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRA5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRA5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREDE5O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZNAME5O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAME5O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZ5O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT5O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM51O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR51O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM51O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM52O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR52O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM52O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM53O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR53O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM53O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM54O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR54O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM54O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM55O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR55O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM55O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM56O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR56O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM56O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM57O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR57O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM57O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM58O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  FNR58O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUM58O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE5O  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ANART5O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT5O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT5O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT51O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT51O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT52O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT52O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT53O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT53O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNR5EO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GES5EO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR5EO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME5EO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANS5EO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLER5O  PIC X(79).                                             
