       01  UA930I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR4L    COMP  PIC  S9(4).                                       
           02  PNR4F    PICTURE X.                                              
           02  FILLER REDEFINES PNR4F.                                          
             03 PNR4A    PICTURE X.                                             
           02  PNR4I  PIC X(7).                                                 
           02  DATUM4L    COMP  PIC  S9(4).                                     
           02  DATUM4F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM4F.                                        
             03 DATUM4A    PICTURE X.                                           
           02  DATUM4I  PIC X(8).                                               
           02  UHR4L    COMP  PIC  S9(4).                                       
           02  UHR4F    PICTURE X.                                              
           02  FILLER REDEFINES UHR4F.                                          
             03 UHR4A    PICTURE X.                                             
           02  UHR4I  PIC X(5).                                                 
           02  GES4L    COMP  PIC  S9(4).                                       
           02  GES4F    PICTURE X.                                              
           02  FILLER REDEFINES GES4F.                                          
             03 GES4A    PICTURE X.                                             
           02  GES4I  PIC X(27).                                                
           02  VBNR4L    COMP  PIC  S9(4).                                      
           02  VBNR4F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR4F.                                         
             03 VBNR4A    PICTURE X.                                            
           02  VBNR4I  PIC X(7).                                                
           02  PRZVB4L    COMP  PIC  S9(4).                                     
           02  PRZVB4F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB4F.                                        
             03 PRZVB4A    PICTURE X.                                           
           02  PRZVB4I  PIC X(1).                                               
           02  VBNRVM4L    COMP  PIC  S9(4).                                    
           02  VBNRVM4F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM4F.                                       
             03 VBNRVM4A    PICTURE X.                                          
           02  VBNRVM4I  PIC X(7).                                              
           02  PRZVM4L    COMP  PIC  S9(4).                                     
           02  PRZVM4F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM4F.                                        
             03 PRZVM4A    PICTURE X.                                           
           02  PRZVM4I  PIC X(1).                                               
           02  VNR4L    COMP  PIC  S9(4).                                       
           02  VNR4F    PICTURE X.                                              
           02  FILLER REDEFINES VNR4F.                                          
             03 VNR4A    PICTURE X.                                             
           02  VNR4I  PIC X(15).                                                
           02  TIVNR4L    COMP  PIC  S9(4).                                     
           02  TIVNR4F    PICTURE X.                                            
           02  FILLER REDEFINES TIVNR4F.                                        
             03 TIVNR4A    PICTURE X.                                           
           02  TIVNR4I  PIC X(9).                                               
           02  IVNR4L    COMP  PIC  S9(4).                                      
           02  IVNR4F    PICTURE X.                                             
           02  FILLER REDEFINES IVNR4F.                                         
             03 IVNR4A    PICTURE X.                                            
           02  IVNR4I  PIC X(7).                                                
           02  IPRZ4L    COMP  PIC  S9(4).                                      
           02  IPRZ4F    PICTURE X.                                             
           02  FILLER REDEFINES IPRZ4F.                                         
             03 IPRZ4A    PICTURE X.                                            
           02  IPRZ4I  PIC X(2).                                                
           02  TVNRA4L    COMP  PIC  S9(4).                                     
           02  TVNRA4F    PICTURE X.                                            
           02  FILLER REDEFINES TVNRA4F.                                        
             03 TVNRA4A    PICTURE X.                                           
           02  TVNRA4I  PIC X(19).                                              
           02  VBNRA4L    COMP  PIC  S9(4).                                     
           02  VBNRA4F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA4F.                                        
             03 VBNRA4A    PICTURE X.                                           
           02  VBNRA4I  PIC X(7).                                               
           02  VNRA4L    COMP  PIC  S9(4).                                      
           02  VNRA4F    PICTURE X.                                             
           02  FILLER REDEFINES VNRA4F.                                         
             03 VNRA4A    PICTURE X.                                            
           02  VNRA4I  PIC X(15).                                               
           02  ANREDE4L    COMP  PIC  S9(4).                                    
           02  ANREDE4F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE4F.                                       
             03 ANREDE4A    PICTURE X.                                          
           02  ANREDE4I  PIC X(9).                                              
           02  ZNAME4L    COMP  PIC  S9(4).                                     
           02  ZNAME4F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME4F.                                        
             03 ZNAME4A    PICTURE X.                                           
           02  ZNAME4I  PIC X(26).                                              
           02  VNAME4L    COMP  PIC  S9(4).                                     
           02  VNAME4F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME4F.                                        
             03 VNAME4A    PICTURE X.                                           
           02  VNAME4I  PIC X(26).                                              
           02  STR4L    COMP  PIC  S9(4).                                       
           02  STR4F    PICTURE X.                                              
           02  FILLER REDEFINES STR4F.                                          
             03 STR4A    PICTURE X.                                             
           02  STR4I  PIC X(26).                                                
           02  PLZ4L    COMP  PIC  S9(4).                                       
           02  PLZ4F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ4F.                                          
             03 PLZ4A    PICTURE X.                                             
           02  PLZ4I  PIC X(5).                                                 
           02  ORT4L    COMP  PIC  S9(4).                                       
           02  ORT4F    PICTURE X.                                              
           02  FILLER REDEFINES ORT4F.                                          
             03 ORT4A    PICTURE X.                                             
           02  ORT4I  PIC X(21).                                                
           02  AUSL4L    COMP  PIC  S9(4).                                      
           02  AUSL4F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL4F.                                         
             03 AUSL4A    PICTURE X.                                            
           02  AUSL4I  PIC X(3).                                                
           02  PROD4L    COMP  PIC  S9(4).                                      
           02  PROD4F    PICTURE X.                                             
           02  FILLER REDEFINES PROD4F.                                         
             03 PROD4A    PICTURE X.                                            
           02  PROD4I  PIC X(2).                                                
           02  TSUMB4L    COMP  PIC  S9(4).                                     
           02  TSUMB4F    PICTURE X.                                            
           02  FILLER REDEFINES TSUMB4F.                                        
             03 TSUMB4A    PICTURE X.                                           
           02  TSUMB4I  PIC X(16).                                              
           02  SUMB4L    COMP  PIC  S9(4).                                      
           02  SUMB4F    PICTURE X.                                             
           02  FILLER REDEFINES SUMB4F.                                         
             03 SUMB4A    PICTURE X.                                            
           02  SUMB4I  PIC X(10).                                               
           02  TKRED4L    COMP  PIC  S9(4).                                     
           02  TKRED4F    PICTURE X.                                            
           02  FILLER REDEFINES TKRED4F.                                        
             03 TKRED4A    PICTURE X.                                           
           02  TKRED4I  PIC X(6).                                               
           02  KRED4L    COMP  PIC  S9(4).                                      
           02  KRED4F    PICTURE X.                                             
           02  FILLER REDEFINES KRED4F.                                         
             03 KRED4A    PICTURE X.                                            
           02  KRED4I  PIC X(10).                                               
           02  TPROV4L    COMP  PIC  S9(4).                                     
           02  TPROV4F    PICTURE X.                                            
           02  FILLER REDEFINES TPROV4F.                                        
             03 TPROV4A    PICTURE X.                                           
           02  TPROV4I  PIC X(9).                                               
           02  PROV4L    COMP  PIC  S9(4).                                      
           02  PROV4F    PICTURE X.                                             
           02  FILLER REDEFINES PROV4F.                                         
             03 PROV4A    PICTURE X.                                            
           02  PROV4I  PIC X(8).                                                
           02  AE4L    COMP  PIC  S9(4).                                        
           02  AE4F    PICTURE X.                                               
           02  FILLER REDEFINES AE4F.                                           
             03 AE4A    PICTURE X.                                              
           02  AE4I  PIC X(7).                                                  
           02  ANART4L    COMP  PIC  S9(4).                                     
           02  ANART4F    PICTURE X.                                            
           02  FILLER REDEFINES ANART4F.                                        
             03 ANART4A    PICTURE X.                                           
           02  ANART4I  PIC X(1).                                               
           02  ANDAT4L    COMP  PIC  S9(4).                                     
           02  ANDAT4F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT4F.                                        
             03 ANDAT4A    PICTURE X.                                           
           02  ANDAT4I  PIC X(8).                                               
           02  ERFDAT4L    COMP  PIC  S9(4).                                    
           02  ERFDAT4F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT4F.                                       
             03 ERFDAT4A    PICTURE X.                                          
           02  ERFDAT4I  PIC X(8).                                              
           02  STAT41L    COMP  PIC  S9(4).                                     
           02  STAT41F    PICTURE X.                                            
           02  FILLER REDEFINES STAT41F.                                        
             03 STAT41A    PICTURE X.                                           
           02  STAT41I  PIC X(2).                                               
           02  STDAT41L    COMP  PIC  S9(4).                                    
           02  STDAT41F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT41F.                                       
             03 STDAT41A    PICTURE X.                                          
           02  STDAT41I  PIC X(8).                                              
           02  STAT42L    COMP  PIC  S9(4).                                     
           02  STAT42F    PICTURE X.                                            
           02  FILLER REDEFINES STAT42F.                                        
             03 STAT42A    PICTURE X.                                           
           02  STAT42I  PIC X(2).                                               
           02  STDAT42L    COMP  PIC  S9(4).                                    
           02  STDAT42F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT42F.                                       
             03 STDAT42A    PICTURE X.                                          
           02  STDAT42I  PIC X(8).                                              
           02  STAT43L    COMP  PIC  S9(4).                                     
           02  STAT43F    PICTURE X.                                            
           02  FILLER REDEFINES STAT43F.                                        
             03 STAT43A    PICTURE X.                                           
           02  STAT43I  PIC X(2).                                               
           02  STDAT43L    COMP  PIC  S9(4).                                    
           02  STDAT43F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT43F.                                       
             03 STDAT43A    PICTURE X.                                          
           02  STDAT43I  PIC X(8).                                              
           02  VBNR4EL    COMP  PIC  S9(4).                                     
           02  VBNR4EF    PICTURE X.                                            
           02  FILLER REDEFINES VBNR4EF.                                        
             03 VBNR4EA    PICTURE X.                                           
           02  VBNR4EI  PIC X(7).                                               
           02  GES4EL    COMP  PIC  S9(4).                                      
           02  GES4EF    PICTURE X.                                             
           02  FILLER REDEFINES GES4EF.                                         
             03 GES4EA    PICTURE X.                                            
           02  GES4EI  PIC X(2).                                                
           02  VNR4EL    COMP  PIC  S9(4).                                      
           02  VNR4EF    PICTURE X.                                             
           02  FILLER REDEFINES VNR4EF.                                         
             03 VNR4EA    PICTURE X.                                            
           02  VNR4EI  PIC 9(15).                                               
           02  NAME4EL    COMP  PIC  S9(4).                                     
           02  NAME4EF    PICTURE X.                                            
           02  FILLER REDEFINES NAME4EF.                                        
             03 NAME4EA    PICTURE X.                                           
           02  NAME4EI  PIC X(8).                                               
           02  TRANS4EL    COMP  PIC  S9(4).                                    
           02  TRANS4EF    PICTURE X.                                           
           02  FILLER REDEFINES TRANS4EF.                                       
             03 TRANS4EA    PICTURE X.                                          
           02  TRANS4EI  PIC X(4).                                              
           02  FEHLER4L    COMP  PIC  S9(4).                                    
           02  FEHLER4F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER4F.                                       
             03 FEHLER4A    PICTURE X.                                          
           02  FEHLER4I  PIC X(79).                                             
       01  UA930O REDEFINES UA930I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR4O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUM4O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR4O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GES4O  PIC X(27).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM4O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR4O  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  TIVNR4O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  IVNR4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IPRZ4O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVNRA4O  PIC X(19).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRA4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRA4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREDE4O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZNAME4O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAME4O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  STR4O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ4O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT4O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL4O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROD4O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUMB4O  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  SUMB4O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  TKRED4O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  KRED4O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROV4O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV4O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE4O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ANART4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT4O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT4O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT41O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT41O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT42O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT42O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT43O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDAT43O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNR4EO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GES4EO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR4EO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME4EO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANS4EO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLER4O  PIC X(79).                                             
