       01  US011I.                                                              
           02  FILLER PIC X(12).                                                
           02  PANZL    COMP  PIC  S9(4).                                       
           02  PANZF    PICTURE X.                                              
           02  FILLER REDEFINES PANZF.                                          
             03 PANZA    PICTURE X.                                             
           02  PANZI  PIC X(10).                                                
           02  SIBLL    COMP  PIC  S9(4).                                       
           02  SIBLF    PICTURE X.                                              
           02  FILLER REDEFINES SIBLF.                                          
             03 SIBLA    PICTURE X.                                             
           02  SIBLI  PIC X(10).                                                
           02  PN1L    COMP  PIC  S9(4).                                        
           02  PN1F    PICTURE X.                                               
           02  FILLER REDEFINES PN1F.                                           
             03 PN1A    PICTURE X.                                              
           02  PN1I  PIC X(10).                                                 
           02  PL1L    COMP  PIC  S9(4).                                        
           02  PL1F    PICTURE X.                                               
           02  FILLER REDEFINES PL1F.                                           
             03 PL1A    PICTURE X.                                              
           02  PL1I  PIC X(10).                                                 
           02  PN2L    COMP  PIC  S9(4).                                        
           02  PN2F    PICTURE X.                                               
           02  FILLER REDEFINES PN2F.                                           
             03 PN2A    PICTURE X.                                              
           02  PN2I  PIC X(10).                                                 
           02  PL2L    COMP  PIC  S9(4).                                        
           02  PL2F    PICTURE X.                                               
           02  FILLER REDEFINES PL2F.                                           
             03 PL2A    PICTURE X.                                              
           02  PL2I  PIC X(10).                                                 
           02  PV2L    COMP  PIC  S9(4).                                        
           02  PV2F    PICTURE X.                                               
           02  FILLER REDEFINES PV2F.                                           
             03 PV2A    PICTURE X.                                              
           02  PV2I  PIC X(5).                                                  
           02  PN3L    COMP  PIC  S9(4).                                        
           02  PN3F    PICTURE X.                                               
           02  FILLER REDEFINES PN3F.                                           
             03 PN3A    PICTURE X.                                              
           02  PN3I  PIC X(10).                                                 
           02  PL3L    COMP  PIC  S9(4).                                        
           02  PL3F    PICTURE X.                                               
           02  FILLER REDEFINES PL3F.                                           
             03 PL3A    PICTURE X.                                              
           02  PL3I  PIC X(10).                                                 
           02  PV3L    COMP  PIC  S9(4).                                        
           02  PV3F    PICTURE X.                                               
           02  FILLER REDEFINES PV3F.                                           
             03 PV3A    PICTURE X.                                              
           02  PV3I  PIC X(5).                                                  
           02  PN4L    COMP  PIC  S9(4).                                        
           02  PN4F    PICTURE X.                                               
           02  FILLER REDEFINES PN4F.                                           
             03 PN4A    PICTURE X.                                              
           02  PN4I  PIC X(10).                                                 
           02  PL4L    COMP  PIC  S9(4).                                        
           02  PL4F    PICTURE X.                                               
           02  FILLER REDEFINES PL4F.                                           
             03 PL4A    PICTURE X.                                              
           02  PL4I  PIC X(10).                                                 
           02  PV4L    COMP  PIC  S9(4).                                        
           02  PV4F    PICTURE X.                                               
           02  FILLER REDEFINES PV4F.                                           
             03 PV4A    PICTURE X.                                              
           02  PV4I  PIC X(5).                                                  
           02  PN5L    COMP  PIC  S9(4).                                        
           02  PN5F    PICTURE X.                                               
           02  FILLER REDEFINES PN5F.                                           
             03 PN5A    PICTURE X.                                              
           02  PN5I  PIC X(10).                                                 
           02  PL5L    COMP  PIC  S9(4).                                        
           02  PL5F    PICTURE X.                                               
           02  FILLER REDEFINES PL5F.                                           
             03 PL5A    PICTURE X.                                              
           02  PL5I  PIC X(10).                                                 
           02  PV5L    COMP  PIC  S9(4).                                        
           02  PV5F    PICTURE X.                                               
           02  FILLER REDEFINES PV5F.                                           
             03 PV5A    PICTURE X.                                              
           02  PV5I  PIC X(5).                                                  
           02  PN6L    COMP  PIC  S9(4).                                        
           02  PN6F    PICTURE X.                                               
           02  FILLER REDEFINES PN6F.                                           
             03 PN6A    PICTURE X.                                              
           02  PN6I  PIC X(10).                                                 
           02  PL6L    COMP  PIC  S9(4).                                        
           02  PL6F    PICTURE X.                                               
           02  FILLER REDEFINES PL6F.                                           
             03 PL6A    PICTURE X.                                              
           02  PL6I  PIC X(10).                                                 
           02  PV6L    COMP  PIC  S9(4).                                        
           02  PV6F    PICTURE X.                                               
           02  FILLER REDEFINES PV6F.                                           
             03 PV6A    PICTURE X.                                              
           02  PV6I  PIC X(5).                                                  
           02  EINL    COMP  PIC  S9(4).                                        
           02  EINF    PICTURE X.                                               
           02  FILLER REDEFINES EINF.                                           
             03 EINA    PICTURE X.                                              
           02  EINI  PIC X(1).                                                  
           02  INFOL    COMP  PIC  S9(4).                                       
           02  INFOF    PICTURE X.                                              
           02  FILLER REDEFINES INFOF.                                          
             03 INFOA    PICTURE X.                                             
           02  INFOI  PIC X(9).                                                 
       01  US011O REDEFINES US011I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PANZO PIC ZZZZZZZZZ9.                                            
           02  FILLER PICTURE X(3).                                             
           02  SIBLO PIC ZZZZZZZZZ9.                                            
           02  FILLER PICTURE X(3).                                             
           02  PN1O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PL1O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PN2O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PL2O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PV2O  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  PN3O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PL3O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PV3O  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  PN4O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PL4O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PV4O  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  PN5O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PL5O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PV5O  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  PN6O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PL6O  PIC X(10).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PV6O  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  EINO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  INFOO PIC ZZZZZZZZ9.                                             
