      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   UU014S.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\UU014S.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 15:15:06   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.0   Nov 04 1995 09:45:40   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****  VERSION
      *************************************************
      **  AUFSTIEGS-TABELLE                          **
      **                                             **
      **   AENDERUNG - 19.03.91 - NAUMANN            **
      **   MIT DER EINFUEHRUNG RANGFREI, D.H.:       **
      **   STUFE RF-T M. STUF-NR. = 888,             **
      **   STUFE RF-R M. STUF-NR. = 889,             **
      **   STUFE RF-A M. STUF-NR. = 890              **
      **   VON OCC. 458 AUF OCC. 635 ERWEITERT.      **
      **   AENDERUNG - 15.10.91 - NAUMANN            **
      **   OCC.-EINTRAG 635 IST FALSCH, WURDE AUF    **
      **   656 KORRIGIERT                            **
      *************************************************
       01  T1-AUFST-TAB.
           02  FILLER                    PIC 9(6) VALUE 001002.
           02  FILLER                    PIC 9(6) VALUE 001003.
           02  FILLER                    PIC 9(6) VALUE 001004.
           02  FILLER                    PIC 9(6) VALUE 001009.
           02  FILLER                    PIC 9(6) VALUE 001016.
           02  FILLER                    PIC 9(6) VALUE 001018.
           02  FILLER                    PIC 9(6) VALUE 001019.
           02  FILLER                    PIC 9(6) VALUE 001161.
      *
           02  FILLER                    PIC 9(6) VALUE 002003.
           02  FILLER                    PIC 9(6) VALUE 002004.
           02  FILLER                    PIC 9(6) VALUE 002009.
           02  FILLER                    PIC 9(6) VALUE 002016.
           02  FILLER                    PIC 9(6) VALUE 002018.
           02  FILLER                    PIC 9(6) VALUE 002019.
           02  FILLER                    PIC 9(6) VALUE 002161.
      *
           02  FILLER                    PIC 9(6) VALUE 003002.
           02  FILLER                    PIC 9(6) VALUE 003004.
           02  FILLER                    PIC 9(6) VALUE 003009.
           02  FILLER                    PIC 9(6) VALUE 003016.
           02  FILLER                    PIC 9(6) VALUE 003018.
           02  FILLER                    PIC 9(6) VALUE 003019.
           02  FILLER                    PIC 9(6) VALUE 003161.
      *
           02  FILLER                    PIC 9(6) VALUE 004002.
           02  FILLER                    PIC 9(6) VALUE 004003.
           02  FILLER                    PIC 9(6) VALUE 004009.
           02  FILLER                    PIC 9(6) VALUE 004016.
           02  FILLER                    PIC 9(6) VALUE 004018.
           02  FILLER                    PIC 9(6) VALUE 004019.
           02  FILLER                    PIC 9(6) VALUE 004161.
      *
           02  FILLER                    PIC 9(6) VALUE 009001.
           02  FILLER                    PIC 9(6) VALUE 009002.
           02  FILLER                    PIC 9(6) VALUE 009003.
           02  FILLER                    PIC 9(6) VALUE 009004.
           02  FILLER                    PIC 9(6) VALUE 009016.
           02  FILLER                    PIC 9(6) VALUE 009018.
           02  FILLER                    PIC 9(6) VALUE 009019.
           02  FILLER                    PIC 9(6) VALUE 009161.
      *
           02  FILLER                    PIC 9(6) VALUE 010002.
           02  FILLER                    PIC 9(6) VALUE 010003.
           02  FILLER                    PIC 9(6) VALUE 010004.
           02  FILLER                    PIC 9(6) VALUE 010009.
           02  FILLER                    PIC 9(6) VALUE 010016.
           02  FILLER                    PIC 9(6) VALUE 010011.
           02  FILLER                    PIC 9(6) VALUE 010018.
           02  FILLER                    PIC 9(6) VALUE 010019.
           02  FILLER                    PIC 9(6) VALUE 010121.
           02  FILLER                    PIC 9(6) VALUE 010161.
           02  FILLER                    PIC 9(6) VALUE 010888.
           02  FILLER                    PIC 9(6) VALUE 010889.
           02  FILLER                    PIC 9(6) VALUE 010890.
      *
           02  FILLER                    PIC 9(6) VALUE 016002.
           02  FILLER                    PIC 9(6) VALUE 016003.
           02  FILLER                    PIC 9(6) VALUE 016004.
           02  FILLER                    PIC 9(6) VALUE 016009.
           02  FILLER                    PIC 9(6) VALUE 016018.
           02  FILLER                    PIC 9(6) VALUE 016019.
           02  FILLER                    PIC 9(6) VALUE 016161.
           02  FILLER                    PIC 9(6) VALUE 016888.
           02  FILLER                    PIC 9(6) VALUE 016889.
           02  FILLER                    PIC 9(6) VALUE 016890.
      *
           02  FILLER                    PIC 9(6) VALUE 011002.
           02  FILLER                    PIC 9(6) VALUE 011003.
           02  FILLER                    PIC 9(6) VALUE 011004.
           02  FILLER                    PIC 9(6) VALUE 011009.
           02  FILLER                    PIC 9(6) VALUE 011010.
           02  FILLER                    PIC 9(6) VALUE 011016.
           02  FILLER                    PIC 9(6) VALUE 011018.
           02  FILLER                    PIC 9(6) VALUE 011019.
           02  FILLER                    PIC 9(6) VALUE 011121.
           02  FILLER                    PIC 9(6) VALUE 011161.
           02  FILLER                    PIC 9(6) VALUE 011888.
           02  FILLER                    PIC 9(6) VALUE 011889.
           02  FILLER                    PIC 9(6) VALUE 011890.
      *
           02  FILLER                    PIC 9(6) VALUE 018002.
           02  FILLER                    PIC 9(6) VALUE 018003.
           02  FILLER                    PIC 9(6) VALUE 018004.
           02  FILLER                    PIC 9(6) VALUE 018009.
           02  FILLER                    PIC 9(6) VALUE 018016.
           02  FILLER                    PIC 9(6) VALUE 018019.
           02  FILLER                    PIC 9(6) VALUE 018161.
           02  FILLER                    PIC 9(6) VALUE 018888.
           02  FILLER                    PIC 9(6) VALUE 018889.
           02  FILLER                    PIC 9(6) VALUE 018890.
      *
           02  FILLER                    PIC 9(6) VALUE 019002.
           02  FILLER                    PIC 9(6) VALUE 019003.
           02  FILLER                    PIC 9(6) VALUE 019004.
           02  FILLER                    PIC 9(6) VALUE 019009.
           02  FILLER                    PIC 9(6) VALUE 019016.
           02  FILLER                    PIC 9(6) VALUE 019018.
           02  FILLER                    PIC 9(6) VALUE 019161.
           02  FILLER                    PIC 9(6) VALUE 019888.
           02  FILLER                    PIC 9(6) VALUE 019889.
           02  FILLER                    PIC 9(6) VALUE 019890.
      *
           02  FILLER                    PIC 9(6) VALUE 121002.
           02  FILLER                    PIC 9(6) VALUE 121003.
           02  FILLER                    PIC 9(6) VALUE 121004.
           02  FILLER                    PIC 9(6) VALUE 121009.
           02  FILLER                    PIC 9(6) VALUE 121010.
           02  FILLER                    PIC 9(6) VALUE 121016.
           02  FILLER                    PIC 9(6) VALUE 121018.
           02  FILLER                    PIC 9(6) VALUE 121019.
           02  FILLER                    PIC 9(6) VALUE 121161.
           02  FILLER                    PIC 9(6) VALUE 121222.
           02  FILLER                    PIC 9(6) VALUE 121252.
           02  FILLER                    PIC 9(6) VALUE 121262.
           02  FILLER                    PIC 9(6) VALUE 121272.
           02  FILLER                    PIC 9(6) VALUE 121888.
           02  FILLER                    PIC 9(6) VALUE 121889.
           02  FILLER                    PIC 9(6) VALUE 121890.
      *
           02  FILLER                    PIC 9(6) VALUE 161002.
           02  FILLER                    PIC 9(6) VALUE 161003.
           02  FILLER                    PIC 9(6) VALUE 161004.
           02  FILLER                    PIC 9(6) VALUE 161009.
           02  FILLER                    PIC 9(6) VALUE 161016.
           02  FILLER                    PIC 9(6) VALUE 161018.
           02  FILLER                    PIC 9(6) VALUE 161019.
           02  FILLER                    PIC 9(6) VALUE 161262.
           02  FILLER                    PIC 9(6) VALUE 161272.
           02  FILLER                    PIC 9(6) VALUE 161888.
           02  FILLER                    PIC 9(6) VALUE 161889.
           02  FILLER                    PIC 9(6) VALUE 161890.
      *
           02  FILLER                    PIC 9(6) VALUE 222002.
           02  FILLER                    PIC 9(6) VALUE 222003.
           02  FILLER                    PIC 9(6) VALUE 222004.
           02  FILLER                    PIC 9(6) VALUE 222009.
           02  FILLER                    PIC 9(6) VALUE 222010.
           02  FILLER                    PIC 9(6) VALUE 222016.
           02  FILLER                    PIC 9(6) VALUE 222018.
           02  FILLER                    PIC 9(6) VALUE 222019.
           02  FILLER                    PIC 9(6) VALUE 222121.
           02  FILLER                    PIC 9(6) VALUE 222161.
           02  FILLER                    PIC 9(6) VALUE 222252.
           02  FILLER                    PIC 9(6) VALUE 222262.
           02  FILLER                    PIC 9(6) VALUE 222272.
           02  FILLER                    PIC 9(6) VALUE 222323.
           02  FILLER                    PIC 9(6) VALUE 222363.
           02  FILLER                    PIC 9(6) VALUE 222888.
           02  FILLER                    PIC 9(6) VALUE 222889.
           02  FILLER                    PIC 9(6) VALUE 222890.
      *
           02  FILLER                    PIC 9(6) VALUE 252002.
           02  FILLER                    PIC 9(6) VALUE 252003.
           02  FILLER                    PIC 9(6) VALUE 252004.
           02  FILLER                    PIC 9(6) VALUE 252009.
           02  FILLER                    PIC 9(6) VALUE 252010.
           02  FILLER                    PIC 9(6) VALUE 252016.
           02  FILLER                    PIC 9(6) VALUE 252018.
           02  FILLER                    PIC 9(6) VALUE 252019.
           02  FILLER                    PIC 9(6) VALUE 252121.
           02  FILLER                    PIC 9(6) VALUE 252161.
           02  FILLER                    PIC 9(6) VALUE 252222.
           02  FILLER                    PIC 9(6) VALUE 252262.
           02  FILLER                    PIC 9(6) VALUE 252272.
           02  FILLER                    PIC 9(6) VALUE 252323.
           02  FILLER                    PIC 9(6) VALUE 252353.
           02  FILLER                    PIC 9(6) VALUE 252363.
           02  FILLER                    PIC 9(6) VALUE 252888.
           02  FILLER                    PIC 9(6) VALUE 252889.
           02  FILLER                    PIC 9(6) VALUE 252890.
      *
           02  FILLER                    PIC 9(6) VALUE 262002.
           02  FILLER                    PIC 9(6) VALUE 262003.
           02  FILLER                    PIC 9(6) VALUE 262004.
           02  FILLER                    PIC 9(6) VALUE 262009.
           02  FILLER                    PIC 9(6) VALUE 262016.
           02  FILLER                    PIC 9(6) VALUE 262018.
           02  FILLER                    PIC 9(6) VALUE 262019.
           02  FILLER                    PIC 9(6) VALUE 262161.
           02  FILLER                    PIC 9(6) VALUE 262272.
           02  FILLER                    PIC 9(6) VALUE 262363.
           02  FILLER                    PIC 9(6) VALUE 262888.
           02  FILLER                    PIC 9(6) VALUE 262889.
           02  FILLER                    PIC 9(6) VALUE 262890.
      *
           02  FILLER                    PIC 9(6) VALUE 272002.
           02  FILLER                    PIC 9(6) VALUE 272003.
           02  FILLER                    PIC 9(6) VALUE 272004.
           02  FILLER                    PIC 9(6) VALUE 272009.
           02  FILLER                    PIC 9(6) VALUE 272016.
           02  FILLER                    PIC 9(6) VALUE 272018.
           02  FILLER                    PIC 9(6) VALUE 272019.
           02  FILLER                    PIC 9(6) VALUE 272161.
           02  FILLER                    PIC 9(6) VALUE 272262.
           02  FILLER                    PIC 9(6) VALUE 272363.
           02  FILLER                    PIC 9(6) VALUE 272888.
           02  FILLER                    PIC 9(6) VALUE 272889.
           02  FILLER                    PIC 9(6) VALUE 272890.
      *
           02  FILLER                    PIC 9(6) VALUE 323002.
           02  FILLER                    PIC 9(6) VALUE 323003.
           02  FILLER                    PIC 9(6) VALUE 323004.
           02  FILLER                    PIC 9(6) VALUE 323009.
           02  FILLER                    PIC 9(6) VALUE 323010.
           02  FILLER                    PIC 9(6) VALUE 323016.
           02  FILLER                    PIC 9(6) VALUE 323018.
           02  FILLER                    PIC 9(6) VALUE 323019.
           02  FILLER                    PIC 9(6) VALUE 323121.
           02  FILLER                    PIC 9(6) VALUE 323161.
           02  FILLER                    PIC 9(6) VALUE 323222.
           02  FILLER                    PIC 9(6) VALUE 323252.
           02  FILLER                    PIC 9(6) VALUE 323262.
           02  FILLER                    PIC 9(6) VALUE 323272.
           02  FILLER                    PIC 9(6) VALUE 323353.
           02  FILLER                    PIC 9(6) VALUE 323363.
           02  FILLER                    PIC 9(6) VALUE 323424.
           02  FILLER                    PIC 9(6) VALUE 323464.
           02  FILLER                    PIC 9(6) VALUE 323888.
           02  FILLER                    PIC 9(6) VALUE 323889.
           02  FILLER                    PIC 9(6) VALUE 323890.
      *
           02  FILLER                    PIC 9(6) VALUE 353002.
           02  FILLER                    PIC 9(6) VALUE 353003.
           02  FILLER                    PIC 9(6) VALUE 353004.
           02  FILLER                    PIC 9(6) VALUE 353009.
           02  FILLER                    PIC 9(6) VALUE 353010.
           02  FILLER                    PIC 9(6) VALUE 353016.
           02  FILLER                    PIC 9(6) VALUE 353018.
           02  FILLER                    PIC 9(6) VALUE 353019.
           02  FILLER                    PIC 9(6) VALUE 353121.
           02  FILLER                    PIC 9(6) VALUE 353161.
           02  FILLER                    PIC 9(6) VALUE 353252.
           02  FILLER                    PIC 9(6) VALUE 353262.
           02  FILLER                    PIC 9(6) VALUE 353272.
           02  FILLER                    PIC 9(6) VALUE 353222.
           02  FILLER                    PIC 9(6) VALUE 353323.
           02  FILLER                    PIC 9(6) VALUE 353363.
           02  FILLER                    PIC 9(6) VALUE 353424.
           02  FILLER                    PIC 9(6) VALUE 353454.
           02  FILLER                    PIC 9(6) VALUE 353464.
           02  FILLER                    PIC 9(6) VALUE 353888.
           02  FILLER                    PIC 9(6) VALUE 353889.
           02  FILLER                    PIC 9(6) VALUE 353890.
      *
           02  FILLER                    PIC 9(6) VALUE 363002.
           02  FILLER                    PIC 9(6) VALUE 363003.
           02  FILLER                    PIC 9(6) VALUE 363004.
           02  FILLER                    PIC 9(6) VALUE 363009.
           02  FILLER                    PIC 9(6) VALUE 363016.
           02  FILLER                    PIC 9(6) VALUE 363018.
           02  FILLER                    PIC 9(6) VALUE 363019.
           02  FILLER                    PIC 9(6) VALUE 363161.
           02  FILLER                    PIC 9(6) VALUE 363262.
           02  FILLER                    PIC 9(6) VALUE 363272.
           02  FILLER                    PIC 9(6) VALUE 363464.
           02  FILLER                    PIC 9(6) VALUE 363888.
           02  FILLER                    PIC 9(6) VALUE 363889.
           02  FILLER                    PIC 9(6) VALUE 363890.
      *
           02  FILLER                    PIC 9(6) VALUE 424002.
           02  FILLER                    PIC 9(6) VALUE 424003.
           02  FILLER                    PIC 9(6) VALUE 424004.
           02  FILLER                    PIC 9(6) VALUE 424009.
           02  FILLER                    PIC 9(6) VALUE 424010.
           02  FILLER                    PIC 9(6) VALUE 424016.
           02  FILLER                    PIC 9(6) VALUE 424018.
           02  FILLER                    PIC 9(6) VALUE 424019.
           02  FILLER                    PIC 9(6) VALUE 424161.
           02  FILLER                    PIC 9(6) VALUE 424121.
           02  FILLER                    PIC 9(6) VALUE 424222.
           02  FILLER                    PIC 9(6) VALUE 424323.
           02  FILLER                    PIC 9(6) VALUE 424454.
           02  FILLER                    PIC 9(6) VALUE 424525.
           02  FILLER                    PIC 9(6) VALUE 424252.
           02  FILLER                    PIC 9(6) VALUE 424262.
           02  FILLER                    PIC 9(6) VALUE 424272.
           02  FILLER                    PIC 9(6) VALUE 424363.
           02  FILLER                    PIC 9(6) VALUE 424464.
           02  FILLER                    PIC 9(6) VALUE 424353.
           02  FILLER                    PIC 9(6) VALUE 424465.
           02  FILLER                    PIC 9(6) VALUE 424888.
           02  FILLER                    PIC 9(6) VALUE 424889.
           02  FILLER                    PIC 9(6) VALUE 424890.
      *
           02  FILLER                    PIC 9(6) VALUE 454002.
           02  FILLER                    PIC 9(6) VALUE 454003.
           02  FILLER                    PIC 9(6) VALUE 454004.
           02  FILLER                    PIC 9(6) VALUE 454009.
           02  FILLER                    PIC 9(6) VALUE 454010.
           02  FILLER                    PIC 9(6) VALUE 454016.
           02  FILLER                    PIC 9(6) VALUE 454018.
           02  FILLER                    PIC 9(6) VALUE 454019.
           02  FILLER                    PIC 9(6) VALUE 454161.
           02  FILLER                    PIC 9(6) VALUE 454252.
           02  FILLER                    PIC 9(6) VALUE 454262.
           02  FILLER                    PIC 9(6) VALUE 454272.
           02  FILLER                    PIC 9(6) VALUE 454121.
           02  FILLER                    PIC 9(6) VALUE 454222.
           02  FILLER                    PIC 9(6) VALUE 454323.
           02  FILLER                    PIC 9(6) VALUE 454424.
           02  FILLER                    PIC 9(6) VALUE 454353.
           02  FILLER                    PIC 9(6) VALUE 454363.
           02  FILLER                    PIC 9(6) VALUE 454464.
           02  FILLER                    PIC 9(6) VALUE 454465.
           02  FILLER                    PIC 9(6) VALUE 454525.
           02  FILLER                    PIC 9(6) VALUE 454555.
           02  FILLER                    PIC 9(6) VALUE 454888.
           02  FILLER                    PIC 9(6) VALUE 454889.
           02  FILLER                    PIC 9(6) VALUE 454890.
      *
           02  FILLER                    PIC 9(6) VALUE 464002.
           02  FILLER                    PIC 9(6) VALUE 464003.
           02  FILLER                    PIC 9(6) VALUE 464004.
           02  FILLER                    PIC 9(6) VALUE 464009.
           02  FILLER                    PIC 9(6) VALUE 464016.
           02  FILLER                    PIC 9(6) VALUE 464018.
           02  FILLER                    PIC 9(6) VALUE 464019.
           02  FILLER                    PIC 9(6) VALUE 464161.
           02  FILLER                    PIC 9(6) VALUE 464262.
           02  FILLER                    PIC 9(6) VALUE 464272.
           02  FILLER                    PIC 9(6) VALUE 464363.
           02  FILLER                    PIC 9(6) VALUE 464465.
           02  FILLER                    PIC 9(6) VALUE 464888.
           02  FILLER                    PIC 9(6) VALUE 464889.
           02  FILLER                    PIC 9(6) VALUE 464890.
      *
           02  FILLER                    PIC 9(6) VALUE 465002.
           02  FILLER                    PIC 9(6) VALUE 465003.
           02  FILLER                    PIC 9(6) VALUE 465004.
           02  FILLER                    PIC 9(6) VALUE 465009.
           02  FILLER                    PIC 9(6) VALUE 465016.
           02  FILLER                    PIC 9(6) VALUE 465018.
           02  FILLER                    PIC 9(6) VALUE 465019.
           02  FILLER                    PIC 9(6) VALUE 465161.
           02  FILLER                    PIC 9(6) VALUE 465262.
           02  FILLER                    PIC 9(6) VALUE 465272.
           02  FILLER                    PIC 9(6) VALUE 465363.
           02  FILLER                    PIC 9(6) VALUE 465464.
           02  FILLER                    PIC 9(6) VALUE 465566.
           02  FILLER                    PIC 9(6) VALUE 465888.
           02  FILLER                    PIC 9(6) VALUE 465889.
           02  FILLER                    PIC 9(6) VALUE 465890.
      *
           02  FILLER                    PIC 9(6) VALUE 525002.
           02  FILLER                    PIC 9(6) VALUE 525003.
           02  FILLER                    PIC 9(6) VALUE 525004.
           02  FILLER                    PIC 9(6) VALUE 525009.
           02  FILLER                    PIC 9(6) VALUE 525010.
           02  FILLER                    PIC 9(6) VALUE 525016.
           02  FILLER                    PIC 9(6) VALUE 525018.
           02  FILLER                    PIC 9(6) VALUE 525019.
           02  FILLER                    PIC 9(6) VALUE 525161.
           02  FILLER                    PIC 9(6) VALUE 525121.
           02  FILLER                    PIC 9(6) VALUE 525222.
           02  FILLER                    PIC 9(6) VALUE 525252.
           02  FILLER                    PIC 9(6) VALUE 525262.
           02  FILLER                    PIC 9(6) VALUE 525272.
           02  FILLER                    PIC 9(6) VALUE 525323.
           02  FILLER                    PIC 9(6) VALUE 525353.
           02  FILLER                    PIC 9(6) VALUE 525363.
           02  FILLER                    PIC 9(6) VALUE 525424.
           02  FILLER                    PIC 9(6) VALUE 525454.
           02  FILLER                    PIC 9(6) VALUE 525464.
           02  FILLER                    PIC 9(6) VALUE 525465.
           02  FILLER                    PIC 9(6) VALUE 525555.
           02  FILLER                    PIC 9(6) VALUE 525566.
           02  FILLER                    PIC 9(6) VALUE 525626.
           02  FILLER                    PIC 9(6) VALUE 525667.
           02  FILLER                    PIC 9(6) VALUE 525888.
           02  FILLER                    PIC 9(6) VALUE 525889.
           02  FILLER                    PIC 9(6) VALUE 525890.
      *
           02  FILLER                    PIC 9(6) VALUE 555002.
           02  FILLER                    PIC 9(6) VALUE 555003.
           02  FILLER                    PIC 9(6) VALUE 555004.
           02  FILLER                    PIC 9(6) VALUE 555009.
           02  FILLER                    PIC 9(6) VALUE 555010.
           02  FILLER                    PIC 9(6) VALUE 555016.
           02  FILLER                    PIC 9(6) VALUE 555018.
           02  FILLER                    PIC 9(6) VALUE 555019.
           02  FILLER                    PIC 9(6) VALUE 555121.
           02  FILLER                    PIC 9(6) VALUE 555161.
           02  FILLER                    PIC 9(6) VALUE 555222.
           02  FILLER                    PIC 9(6) VALUE 555252.
           02  FILLER                    PIC 9(6) VALUE 555262.
           02  FILLER                    PIC 9(6) VALUE 555272.
           02  FILLER                    PIC 9(6) VALUE 555323.
           02  FILLER                    PIC 9(6) VALUE 555353.
           02  FILLER                    PIC 9(6) VALUE 555363.
           02  FILLER                    PIC 9(6) VALUE 555424.
           02  FILLER                    PIC 9(6) VALUE 555454.
           02  FILLER                    PIC 9(6) VALUE 555464.
           02  FILLER                    PIC 9(6) VALUE 555465.
           02  FILLER                    PIC 9(6) VALUE 555525.
           02  FILLER                    PIC 9(6) VALUE 555566.
           02  FILLER                    PIC 9(6) VALUE 555626.
           02  FILLER                    PIC 9(6) VALUE 555656.
           02  FILLER                    PIC 9(6) VALUE 555667.
           02  FILLER                    PIC 9(6) VALUE 555888.
           02  FILLER                    PIC 9(6) VALUE 555889.
           02  FILLER                    PIC 9(6) VALUE 555890.
      *
           02  FILLER                    PIC 9(6) VALUE 566002.
           02  FILLER                    PIC 9(6) VALUE 566003.
           02  FILLER                    PIC 9(6) VALUE 566004.
           02  FILLER                    PIC 9(6) VALUE 566009.
           02  FILLER                    PIC 9(6) VALUE 566016.
           02  FILLER                    PIC 9(6) VALUE 566018.
           02  FILLER                    PIC 9(6) VALUE 566019.
           02  FILLER                    PIC 9(6) VALUE 566161.
           02  FILLER                    PIC 9(6) VALUE 566262.
           02  FILLER                    PIC 9(6) VALUE 566272.
           02  FILLER                    PIC 9(6) VALUE 566363.
           02  FILLER                    PIC 9(6) VALUE 566464.
           02  FILLER                    PIC 9(6) VALUE 566465.
           02  FILLER                    PIC 9(6) VALUE 566667.
           02  FILLER                    PIC 9(6) VALUE 566888.
           02  FILLER                    PIC 9(6) VALUE 566889.
           02  FILLER                    PIC 9(6) VALUE 566890.
      *
           02  FILLER                    PIC 9(6) VALUE 626002.
           02  FILLER                    PIC 9(6) VALUE 626003.
           02  FILLER                    PIC 9(6) VALUE 626004.
           02  FILLER                    PIC 9(6) VALUE 626009.
           02  FILLER                    PIC 9(6) VALUE 626010.
           02  FILLER                    PIC 9(6) VALUE 626016.
           02  FILLER                    PIC 9(6) VALUE 626018.
           02  FILLER                    PIC 9(6) VALUE 626019.
           02  FILLER                    PIC 9(6) VALUE 626121.
           02  FILLER                    PIC 9(6) VALUE 626161.
           02  FILLER                    PIC 9(6) VALUE 626222.
           02  FILLER                    PIC 9(6) VALUE 626262.
           02  FILLER                    PIC 9(6) VALUE 626272.
           02  FILLER                    PIC 9(6) VALUE 626323.
           02  FILLER                    PIC 9(6) VALUE 626363.
           02  FILLER                    PIC 9(6) VALUE 626424.
           02  FILLER                    PIC 9(6) VALUE 626464.
           02  FILLER                    PIC 9(6) VALUE 626555.
           02  FILLER                    PIC 9(6) VALUE 626252.
           02  FILLER                    PIC 9(6) VALUE 626353.
           02  FILLER                    PIC 9(6) VALUE 626454.
           02  FILLER                    PIC 9(6) VALUE 626465.
           02  FILLER                    PIC 9(6) VALUE 626566.
           02  FILLER                    PIC 9(6) VALUE 626757.
           02  FILLER                    PIC 9(6) VALUE 626768.
           02  FILLER                    PIC 9(6) VALUE 626525.
           02  FILLER                    PIC 9(6) VALUE 626656.
           02  FILLER                    PIC 9(6) VALUE 626667.
           02  FILLER                    PIC 9(6) VALUE 626888.
           02  FILLER                    PIC 9(6) VALUE 626889.
           02  FILLER                    PIC 9(6) VALUE 626890.
      *
           02  FILLER                    PIC 9(6) VALUE 656002.
           02  FILLER                    PIC 9(6) VALUE 656003.
           02  FILLER                    PIC 9(6) VALUE 656004.
           02  FILLER                    PIC 9(6) VALUE 656009.
           02  FILLER                    PIC 9(6) VALUE 656010.
           02  FILLER                    PIC 9(6) VALUE 656016.
           02  FILLER                    PIC 9(6) VALUE 656018.
           02  FILLER                    PIC 9(6) VALUE 656019.
           02  FILLER                    PIC 9(6) VALUE 656121.
           02  FILLER                    PIC 9(6) VALUE 656161.
           02  FILLER                    PIC 9(6) VALUE 656222.
           02  FILLER                    PIC 9(6) VALUE 656252.
           02  FILLER                    PIC 9(6) VALUE 656262.
           02  FILLER                    PIC 9(6) VALUE 656272.
           02  FILLER                    PIC 9(6) VALUE 656323.
           02  FILLER                    PIC 9(6) VALUE 656353.
           02  FILLER                    PIC 9(6) VALUE 656363.
           02  FILLER                    PIC 9(6) VALUE 656424.
           02  FILLER                    PIC 9(6) VALUE 656454.
           02  FILLER                    PIC 9(6) VALUE 656465.
           02  FILLER                    PIC 9(6) VALUE 656525.
           02  FILLER                    PIC 9(6) VALUE 656464.
           02  FILLER                    PIC 9(6) VALUE 656555.
           02  FILLER                    PIC 9(6) VALUE 656566.
           02  FILLER                    PIC 9(6) VALUE 656626.
           02  FILLER                    PIC 9(6) VALUE 656667.
           02  FILLER                    PIC 9(6) VALUE 656757.
           02  FILLER                    PIC 9(6) VALUE 656768.
           02  FILLER                    PIC 9(6) VALUE 656888.
           02  FILLER                    PIC 9(6) VALUE 656889.
           02  FILLER                    PIC 9(6) VALUE 656890.
      *
           02  FILLER                    PIC 9(6) VALUE 667002.
           02  FILLER                    PIC 9(6) VALUE 667003.
           02  FILLER                    PIC 9(6) VALUE 667004.
           02  FILLER                    PIC 9(6) VALUE 667009.
           02  FILLER                    PIC 9(6) VALUE 667016.
           02  FILLER                    PIC 9(6) VALUE 667018.
           02  FILLER                    PIC 9(6) VALUE 667019.
           02  FILLER                    PIC 9(6) VALUE 667161.
           02  FILLER                    PIC 9(6) VALUE 667465.
           02  FILLER                    PIC 9(6) VALUE 667262.
           02  FILLER                    PIC 9(6) VALUE 667272.
           02  FILLER                    PIC 9(6) VALUE 667363.
           02  FILLER                    PIC 9(6) VALUE 667464.
           02  FILLER                    PIC 9(6) VALUE 667566.
           02  FILLER                    PIC 9(6) VALUE 667768.
           02  FILLER                    PIC 9(6) VALUE 667888.
           02  FILLER                    PIC 9(6) VALUE 667889.
           02  FILLER                    PIC 9(6) VALUE 667890.
      *
           02  FILLER                    PIC 9(6) VALUE 757002.
           02  FILLER                    PIC 9(6) VALUE 757003.
           02  FILLER                    PIC 9(6) VALUE 757004.
           02  FILLER                    PIC 9(6) VALUE 757009.
           02  FILLER                    PIC 9(6) VALUE 757010.
           02  FILLER                    PIC 9(6) VALUE 757016.
           02  FILLER                    PIC 9(6) VALUE 757018.
           02  FILLER                    PIC 9(6) VALUE 757019.
           02  FILLER                    PIC 9(6) VALUE 757121.
           02  FILLER                    PIC 9(6) VALUE 757161.
           02  FILLER                    PIC 9(6) VALUE 757222.
           02  FILLER                    PIC 9(6) VALUE 757252.
           02  FILLER                    PIC 9(6) VALUE 757262.
           02  FILLER                    PIC 9(6) VALUE 757272.
           02  FILLER                    PIC 9(6) VALUE 757323.
           02  FILLER                    PIC 9(6) VALUE 757353.
           02  FILLER                    PIC 9(6) VALUE 757363.
           02  FILLER                    PIC 9(6) VALUE 757424.
           02  FILLER                    PIC 9(6) VALUE 757454.
           02  FILLER                    PIC 9(6) VALUE 757465.
           02  FILLER                    PIC 9(6) VALUE 757525.
           02  FILLER                    PIC 9(6) VALUE 757464.
           02  FILLER                    PIC 9(6) VALUE 757555.
           02  FILLER                    PIC 9(6) VALUE 757566.
           02  FILLER                    PIC 9(6) VALUE 757626.
           02  FILLER                    PIC 9(6) VALUE 757667.
           02  FILLER                    PIC 9(6) VALUE 757656.
           02  FILLER                    PIC 9(6) VALUE 757768.
           02  FILLER                    PIC 9(6) VALUE 757888.
           02  FILLER                    PIC 9(6) VALUE 757889.
           02  FILLER                    PIC 9(6) VALUE 757890.
      *
           02  FILLER                    PIC 9(6) VALUE 768002.
           02  FILLER                    PIC 9(6) VALUE 768003.
           02  FILLER                    PIC 9(6) VALUE 768004.
           02  FILLER                    PIC 9(6) VALUE 768009.
           02  FILLER                    PIC 9(6) VALUE 768016.
           02  FILLER                    PIC 9(6) VALUE 768018.
           02  FILLER                    PIC 9(6) VALUE 768019.
           02  FILLER                    PIC 9(6) VALUE 768161.
           02  FILLER                    PIC 9(6) VALUE 768262.
           02  FILLER                    PIC 9(6) VALUE 768272.
           02  FILLER                    PIC 9(6) VALUE 768363.
           02  FILLER                    PIC 9(6) VALUE 768464.
           02  FILLER                    PIC 9(6) VALUE 768465.
           02  FILLER                    PIC 9(6) VALUE 768566.
           02  FILLER                    PIC 9(6) VALUE 768667.
           02  FILLER                    PIC 9(6) VALUE 768888.
           02  FILLER                    PIC 9(6) VALUE 768889.
           02  FILLER                    PIC 9(6) VALUE 768890.
      *
           02  FILLER                    PIC 9(6) VALUE 858002.
           02  FILLER                    PIC 9(6) VALUE 858003.
           02  FILLER                    PIC 9(6) VALUE 858004.
           02  FILLER                    PIC 9(6) VALUE 858009.
           02  FILLER                    PIC 9(6) VALUE 858010.
           02  FILLER                    PIC 9(6) VALUE 858016.
           02  FILLER                    PIC 9(6) VALUE 858018.
           02  FILLER                    PIC 9(6) VALUE 858019.
           02  FILLER                    PIC 9(6) VALUE 858121.
           02  FILLER                    PIC 9(6) VALUE 858161.
           02  FILLER                    PIC 9(6) VALUE 858222.
           02  FILLER                    PIC 9(6) VALUE 858252.
           02  FILLER                    PIC 9(6) VALUE 858262.
           02  FILLER                    PIC 9(6) VALUE 858272.
           02  FILLER                    PIC 9(6) VALUE 858323.
           02  FILLER                    PIC 9(6) VALUE 858353.
           02  FILLER                    PIC 9(6) VALUE 858363.
           02  FILLER                    PIC 9(6) VALUE 858424.
           02  FILLER                    PIC 9(6) VALUE 858454.
           02  FILLER                    PIC 9(6) VALUE 858465.
           02  FILLER                    PIC 9(6) VALUE 858525.
           02  FILLER                    PIC 9(6) VALUE 858464.
           02  FILLER                    PIC 9(6) VALUE 858555.
           02  FILLER                    PIC 9(6) VALUE 858566.
           02  FILLER                    PIC 9(6) VALUE 858626.
           02  FILLER                    PIC 9(6) VALUE 858667.
           02  FILLER                    PIC 9(6) VALUE 858656.
           02  FILLER                    PIC 9(6) VALUE 858757.
           02  FILLER                    PIC 9(6) VALUE 858768.
           02  FILLER                    PIC 9(6) VALUE 858888.
           02  FILLER                    PIC 9(6) VALUE 858889.
           02  FILLER                    PIC 9(6) VALUE 858890.
      *
           02  FILLER                    PIC 9(6) VALUE 888002.
           02  FILLER                    PIC 9(6) VALUE 888003.
           02  FILLER                    PIC 9(6) VALUE 888004.
           02  FILLER                    PIC 9(6) VALUE 888009.
           02  FILLER                    PIC 9(6) VALUE 888010.
           02  FILLER                    PIC 9(6) VALUE 888016.
           02  FILLER                    PIC 9(6) VALUE 888018.
           02  FILLER                    PIC 9(6) VALUE 888019.
           02  FILLER                    PIC 9(6) VALUE 888121.
           02  FILLER                    PIC 9(6) VALUE 888161.
           02  FILLER                    PIC 9(6) VALUE 888222.
           02  FILLER                    PIC 9(6) VALUE 888252.
           02  FILLER                    PIC 9(6) VALUE 888262.
           02  FILLER                    PIC 9(6) VALUE 888272.
           02  FILLER                    PIC 9(6) VALUE 888323.
           02  FILLER                    PIC 9(6) VALUE 888353.
           02  FILLER                    PIC 9(6) VALUE 888363.
           02  FILLER                    PIC 9(6) VALUE 888424.
           02  FILLER                    PIC 9(6) VALUE 888454.
           02  FILLER                    PIC 9(6) VALUE 888465.
           02  FILLER                    PIC 9(6) VALUE 888525.
           02  FILLER                    PIC 9(6) VALUE 888464.
           02  FILLER                    PIC 9(6) VALUE 888555.
           02  FILLER                    PIC 9(6) VALUE 888566.
           02  FILLER                    PIC 9(6) VALUE 888626.
           02  FILLER                    PIC 9(6) VALUE 888667.
           02  FILLER                    PIC 9(6) VALUE 888656.
           02  FILLER                    PIC 9(6) VALUE 888757.
           02  FILLER                    PIC 9(6) VALUE 888768.
           02  FILLER                    PIC 9(6) VALUE 888858.
           02  FILLER                    PIC 9(6) VALUE 888889.
           02  FILLER                    PIC 9(6) VALUE 888890.
      *
           02  FILLER                    PIC 9(6) VALUE 889002.
           02  FILLER                    PIC 9(6) VALUE 889003.
           02  FILLER                    PIC 9(6) VALUE 889004.
           02  FILLER                    PIC 9(6) VALUE 889009.
           02  FILLER                    PIC 9(6) VALUE 889010.
           02  FILLER                    PIC 9(6) VALUE 889016.
           02  FILLER                    PIC 9(6) VALUE 889018.
           02  FILLER                    PIC 9(6) VALUE 889019.
           02  FILLER                    PIC 9(6) VALUE 889121.
           02  FILLER                    PIC 9(6) VALUE 889161.
           02  FILLER                    PIC 9(6) VALUE 889222.
           02  FILLER                    PIC 9(6) VALUE 889252.
           02  FILLER                    PIC 9(6) VALUE 889262.
           02  FILLER                    PIC 9(6) VALUE 889272.
           02  FILLER                    PIC 9(6) VALUE 889323.
           02  FILLER                    PIC 9(6) VALUE 889353.
           02  FILLER                    PIC 9(6) VALUE 889363.
           02  FILLER                    PIC 9(6) VALUE 889424.
           02  FILLER                    PIC 9(6) VALUE 889454.
           02  FILLER                    PIC 9(6) VALUE 889465.
           02  FILLER                    PIC 9(6) VALUE 889525.
           02  FILLER                    PIC 9(6) VALUE 889464.
           02  FILLER                    PIC 9(6) VALUE 889555.
           02  FILLER                    PIC 9(6) VALUE 889566.
           02  FILLER                    PIC 9(6) VALUE 889626.
           02  FILLER                    PIC 9(6) VALUE 889667.
           02  FILLER                    PIC 9(6) VALUE 889656.
           02  FILLER                    PIC 9(6) VALUE 889757.
           02  FILLER                    PIC 9(6) VALUE 889768.
           02  FILLER                    PIC 9(6) VALUE 889858.
           02  FILLER                    PIC 9(6) VALUE 889888.
           02  FILLER                    PIC 9(6) VALUE 889890.
      *
           02  FILLER                    PIC 9(6) VALUE 890002.
           02  FILLER                    PIC 9(6) VALUE 890003.
           02  FILLER                    PIC 9(6) VALUE 890004.
           02  FILLER                    PIC 9(6) VALUE 890009.
           02  FILLER                    PIC 9(6) VALUE 890010.
           02  FILLER                    PIC 9(6) VALUE 890016.
           02  FILLER                    PIC 9(6) VALUE 890018.
           02  FILLER                    PIC 9(6) VALUE 890019.
           02  FILLER                    PIC 9(6) VALUE 890121.
           02  FILLER                    PIC 9(6) VALUE 890161.
           02  FILLER                    PIC 9(6) VALUE 890222.
           02  FILLER                    PIC 9(6) VALUE 890252.
           02  FILLER                    PIC 9(6) VALUE 890262.
           02  FILLER                    PIC 9(6) VALUE 890272.
           02  FILLER                    PIC 9(6) VALUE 890323.
           02  FILLER                    PIC 9(6) VALUE 890353.
           02  FILLER                    PIC 9(6) VALUE 890363.
           02  FILLER                    PIC 9(6) VALUE 890424.
           02  FILLER                    PIC 9(6) VALUE 890454.
           02  FILLER                    PIC 9(6) VALUE 890465.
           02  FILLER                    PIC 9(6) VALUE 890525.
           02  FILLER                    PIC 9(6) VALUE 890464.
           02  FILLER                    PIC 9(6) VALUE 890555.
           02  FILLER                    PIC 9(6) VALUE 890566.
           02  FILLER                    PIC 9(6) VALUE 890626.
           02  FILLER                    PIC 9(6) VALUE 890667.
           02  FILLER                    PIC 9(6) VALUE 890656.
           02  FILLER                    PIC 9(6) VALUE 890757.
           02  FILLER                    PIC 9(6) VALUE 890768.
           02  FILLER                    PIC 9(6) VALUE 890858.
           02  FILLER                    PIC 9(6) VALUE 890888.
           02  FILLER                    PIC 9(6) VALUE 890889.
      *
           02  FILLER                    PIC 9(6) VALUE ZERO.
           02  FILLER                    PIC 9(6) VALUE ZERO.
           02  FILLER                    PIC 9(6) VALUE ZERO.
      *
           02  FILLER                    PIC X(6) VALUE 'END'.
       01  T1-AUFST-TABR  REDEFINES T1-AUFST-TAB.
           02  T1-AUFST-TAB1    OCCURS 656.
               05  T1-ALT          PIC 999.
               05  T1-NEU          PIC 999.
       01  T1-AUFST-TABR2 REDEFINES T1-AUFST-TAB.
           02  T1-AUFST-TAB2    OCCURS 656.
               05  T1-ALPH         PIC XXX.
               05  FILLER          PIC XXX.

