       01  UU313I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR91L    COMP  PIC  S9(4).                                      
           02  PNR91F    PICTURE X.                                             
           02  FILLER REDEFINES PNR91F.                                         
             03 PNR91A    PICTURE X.                                            
           02  PNR91I  PIC X(7).                                                
           02  DATE91L    COMP  PIC  S9(4).                                     
           02  DATE91F    PICTURE X.                                            
           02  FILLER REDEFINES DATE91F.                                        
             03 DATE91A    PICTURE X.                                           
           02  DATE91I  PIC X(8).                                               
           02  VZEIT91L    COMP  PIC  S9(4).                                    
           02  VZEIT91F    PICTURE X.                                           
           02  FILLER REDEFINES VZEIT91F.                                       
             03 VZEIT91A    PICTURE X.                                          
           02  VZEIT91I  PIC X(5).                                              
           02  GESOL    COMP  PIC  S9(4).                                       
           02  GESOF    PICTURE X.                                              
           02  FILLER REDEFINES GESOF.                                          
             03 GESOA    PICTURE X.                                             
           02  GESOI  PIC X(13).                                                
           02  TPOAV91L    COMP  PIC  S9(4).                                    
           02  TPOAV91F    PICTURE X.                                           
           02  FILLER REDEFINES TPOAV91F.                                       
             03 TPOAV91A    PICTURE X.                                          
           02  TPOAV91I  PIC X(13).                                             
           02  POAVO91L    COMP  PIC  S9(4).                                    
           02  POAVO91F    PICTURE X.                                           
           02  FILLER REDEFINES POAVO91F.                                       
             03 POAVO91A    PICTURE X.                                          
           02  POAVO91I  PIC X(9).                                              
           02  VBT91L    COMP  PIC  S9(4).                                      
           02  VBT91F    PICTURE X.                                             
           02  FILLER REDEFINES VBT91F.                                         
             03 VBT91A    PICTURE X.                                            
           02  VBT91I  PIC X(8).                                                
           02  VBNR91L    COMP  PIC  S9(4).                                     
           02  VBNR91F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR91F.                                        
             03 VBNR91A    PICTURE X.                                           
           02  VBNR91I  PIC X(7).                                               
           02  VBPZ91L    COMP  PIC  S9(4).                                     
           02  VBPZ91F    PICTURE X.                                            
           02  FILLER REDEFINES VBPZ91F.                                        
             03 VBPZ91A    PICTURE X.                                           
           02  VBPZ91I  PIC X(1).                                               
           02  VMT91L    COMP  PIC  S9(4).                                      
           02  VMT91F    PICTURE X.                                             
           02  FILLER REDEFINES VMT91F.                                         
             03 VMT91A    PICTURE X.                                            
           02  VMT91I  PIC X(8).                                                
           02  VMNR91L    COMP  PIC  S9(4).                                     
           02  VMNR91F    PICTURE X.                                            
           02  FILLER REDEFINES VMNR91F.                                        
             03 VMNR91A    PICTURE X.                                           
           02  VMNR91I  PIC X(7).                                               
           02  VMPZ91L    COMP  PIC  S9(4).                                     
           02  VMPZ91F    PICTURE X.                                            
           02  FILLER REDEFINES VMPZ91F.                                        
             03 VMPZ91A    PICTURE X.                                           
           02  VMPZ91I  PIC X(1).                                               
           02  VNRT91L    COMP  PIC  S9(4).                                     
           02  VNRT91F    PICTURE X.                                            
           02  FILLER REDEFINES VNRT91F.                                        
             03 VNRT91A    PICTURE X.                                           
           02  VNRT91I  PIC X(10).                                              
           02  VERNR91L    COMP  PIC  S9(4).                                    
           02  VERNR91F    PICTURE X.                                           
           02  FILLER REDEFINES VERNR91F.                                       
             03 VERNR91A    PICTURE X.                                          
           02  VERNR91I  PIC X(12).                                             
           02  VPRZE91L    COMP  PIC  S9(4).                                    
           02  VPRZE91F    PICTURE X.                                           
           02  FILLER REDEFINES VPRZE91F.                                       
             03 VPRZE91A    PICTURE X.                                          
           02  VPRZE91I  PIC X(2).                                              
           02  VNRI91L    COMP  PIC  S9(4).                                     
           02  VNRI91F    PICTURE X.                                            
           02  FILLER REDEFINES VNRI91F.                                        
             03 VNRI91A    PICTURE X.                                           
           02  VNRI91I  PIC X(12).                                              
           02  VPRZI91L    COMP  PIC  S9(4).                                    
           02  VPRZI91F    PICTURE X.                                           
           02  FILLER REDEFINES VPRZI91F.                                       
             03 VPRZI91A    PICTURE X.                                          
           02  VPRZI91I  PIC X(2).                                              
           02  TVNRN91L    COMP  PIC  S9(4).                                    
           02  TVNRN91F    PICTURE X.                                           
           02  FILLER REDEFINES TVNRN91F.                                       
             03 TVNRN91A    PICTURE X.                                          
           02  TVNRN91I  PIC X(17).                                             
           02  VBNRN91L    COMP  PIC  S9(4).                                    
           02  VBNRN91F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRN91F.                                       
             03 VBNRN91A    PICTURE X.                                          
           02  VBNRN91I  PIC X(7).                                              
           02  VNRN91L    COMP  PIC  S9(4).                                     
           02  VNRN91F    PICTURE X.                                            
           02  FILLER REDEFINES VNRN91F.                                        
             03 VNRN91A    PICTURE X.                                           
           02  VNRN91I  PIC X(12).                                              
           02  ANRET91L    COMP  PIC  S9(4).                                    
           02  ANRET91F    PICTURE X.                                           
           02  FILLER REDEFINES ANRET91F.                                       
             03 ANRET91A    PICTURE X.                                          
           02  ANRET91I  PIC X(6).                                              
           02  ANRE91L    COMP  PIC  S9(4).                                     
           02  ANRE91F    PICTURE X.                                            
           02  FILLER REDEFINES ANRE91F.                                        
             03 ANRE91A    PICTURE X.                                           
           02  ANRE91I  PIC X(9).                                               
           02  ANREI91L    COMP  PIC  S9(4).                                    
           02  ANREI91F    PICTURE X.                                           
           02  FILLER REDEFINES ANREI91F.                                       
             03 ANREI91A    PICTURE X.                                          
           02  ANREI91I  PIC X(9).                                              
           02  ZUNAT91L    COMP  PIC  S9(4).                                    
           02  ZUNAT91F    PICTURE X.                                           
           02  FILLER REDEFINES ZUNAT91F.                                       
             03 ZUNAT91A    PICTURE X.                                          
           02  ZUNAT91I  PIC X(6).                                              
           02  ZUNA91L    COMP  PIC  S9(4).                                     
           02  ZUNA91F    PICTURE X.                                            
           02  FILLER REDEFINES ZUNA91F.                                        
             03 ZUNA91A    PICTURE X.                                           
           02  ZUNA91I  PIC X(26).                                              
           02  ZUNAI91L    COMP  PIC  S9(4).                                    
           02  ZUNAI91F    PICTURE X.                                           
           02  FILLER REDEFINES ZUNAI91F.                                       
             03 ZUNAI91A    PICTURE X.                                          
           02  ZUNAI91I  PIC X(26).                                             
           02  VORNT91L    COMP  PIC  S9(4).                                    
           02  VORNT91F    PICTURE X.                                           
           02  FILLER REDEFINES VORNT91F.                                       
             03 VORNT91A    PICTURE X.                                          
           02  VORNT91I  PIC X(7).                                              
           02  VORNA91L    COMP  PIC  S9(4).                                    
           02  VORNA91F    PICTURE X.                                           
           02  FILLER REDEFINES VORNA91F.                                       
             03 VORNA91A    PICTURE X.                                          
           02  VORNA91I  PIC X(26).                                             
           02  VORNI91L    COMP  PIC  S9(4).                                    
           02  VORNI91F    PICTURE X.                                           
           02  FILLER REDEFINES VORNI91F.                                       
             03 VORNI91A    PICTURE X.                                          
           02  VORNI91I  PIC X(26).                                             
           02  SRTAT91L    COMP  PIC  S9(4).                                    
           02  SRTAT91F    PICTURE X.                                           
           02  FILLER REDEFINES SRTAT91F.                                       
             03 SRTAT91A    PICTURE X.                                          
           02  SRTAT91I  PIC X(7).                                              
           02  STRA91L    COMP  PIC  S9(4).                                     
           02  STRA91F    PICTURE X.                                            
           02  FILLER REDEFINES STRA91F.                                        
             03 STRA91A    PICTURE X.                                           
           02  STRA91I  PIC X(26).                                              
           02  STRAI91L    COMP  PIC  S9(4).                                    
           02  STRAI91F    PICTURE X.                                           
           02  FILLER REDEFINES STRAI91F.                                       
             03 STRAI91A    PICTURE X.                                          
           02  STRAI91I  PIC X(26).                                             
           02  TEPLZ91L    COMP  PIC  S9(4).                                    
           02  TEPLZ91F    PICTURE X.                                           
           02  FILLER REDEFINES TEPLZ91F.                                       
             03 TEPLZ91A    PICTURE X.                                          
           02  TEPLZ91I  PIC X(3).                                              
           02  PLZ91L    COMP  PIC  S9(4).                                      
           02  PLZ91F    PICTURE X.                                             
           02  FILLER REDEFINES PLZ91F.                                         
             03 PLZ91A    PICTURE X.                                            
           02  PLZ91I  PIC X(5).                                                
           02  PLZI91L    COMP  PIC  S9(4).                                     
           02  PLZI91F    PICTURE X.                                            
           02  FILLER REDEFINES PLZI91F.                                        
             03 PLZI91A    PICTURE X.                                           
           02  PLZI91I  PIC X(5).                                               
           02  WOHNT91L    COMP  PIC  S9(4).                                    
           02  WOHNT91F    PICTURE X.                                           
           02  FILLER REDEFINES WOHNT91F.                                       
             03 WOHNT91A    PICTURE X.                                          
           02  WOHNT91I  PIC X(3).                                              
           02  TAUSL91L    COMP  PIC  S9(4).                                    
           02  TAUSL91F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSL91F.                                       
             03 TAUSL91A    PICTURE X.                                          
           02  TAUSL91I  PIC X(4).                                              
           02  WOHN91L    COMP  PIC  S9(4).                                     
           02  WOHN91F    PICTURE X.                                            
           02  FILLER REDEFINES WOHN91F.                                        
             03 WOHN91A    PICTURE X.                                           
           02  WOHN91I  PIC X(21).                                              
           02  AUSL91L    COMP  PIC  S9(4).                                     
           02  AUSL91F    PICTURE X.                                            
           02  FILLER REDEFINES AUSL91F.                                        
             03 AUSL91A    PICTURE X.                                           
           02  AUSL91I  PIC X(3).                                               
           02  WOHNI91L    COMP  PIC  S9(4).                                    
           02  WOHNI91F    PICTURE X.                                           
           02  FILLER REDEFINES WOHNI91F.                                       
             03 WOHNI91A    PICTURE X.                                          
           02  WOHNI91I  PIC X(21).                                             
           02  AUSLI91L    COMP  PIC  S9(4).                                    
           02  AUSLI91F    PICTURE X.                                           
           02  FILLER REDEFINES AUSLI91F.                                       
             03 AUSLI91A    PICTURE X.                                          
           02  AUSLI91I  PIC X(3).                                              
           02  PRODT91L    COMP  PIC  S9(4).                                    
           02  PRODT91F    PICTURE X.                                           
           02  FILLER REDEFINES PRODT91F.                                       
             03 PRODT91A    PICTURE X.                                          
           02  PRODT91I  PIC X(7).                                              
           02  PROD91L    COMP  PIC  S9(4).                                     
           02  PROD91F    PICTURE X.                                            
           02  FILLER REDEFINES PROD91F.                                        
             03 PROD91A    PICTURE X.                                           
           02  PROD91I  PIC X(2).                                               
           02  PROD92L    COMP  PIC  S9(4).                                     
           02  PROD92F    PICTURE X.                                            
           02  FILLER REDEFINES PROD92F.                                        
             03 PROD92A    PICTURE X.                                           
           02  PROD92I  PIC X(2).                                               
           02  PROD93L    COMP  PIC  S9(4).                                     
           02  PROD93F    PICTURE X.                                            
           02  FILLER REDEFINES PROD93F.                                        
             03 PROD93A    PICTURE X.                                           
           02  PROD93I  PIC X(2).                                               
           02  PROD94L    COMP  PIC  S9(4).                                     
           02  PROD94F    PICTURE X.                                            
           02  FILLER REDEFINES PROD94F.                                        
             03 PROD94A    PICTURE X.                                           
           02  PROD94I  PIC X(2).                                               
           02  PROD95L    COMP  PIC  S9(4).                                     
           02  PROD95F    PICTURE X.                                            
           02  FILLER REDEFINES PROD95F.                                        
             03 PROD95A    PICTURE X.                                           
           02  PROD95I  PIC X(2).                                               
           02  PRODI91L    COMP  PIC  S9(4).                                    
           02  PRODI91F    PICTURE X.                                           
           02  FILLER REDEFINES PRODI91F.                                       
             03 PRODI91A    PICTURE X.                                          
           02  PRODI91I  PIC X(2).                                              
           02  PRODI92L    COMP  PIC  S9(4).                                    
           02  PRODI92F    PICTURE X.                                           
           02  FILLER REDEFINES PRODI92F.                                       
             03 PRODI92A    PICTURE X.                                          
           02  PRODI92I  PIC X(2).                                              
           02  PRODI93L    COMP  PIC  S9(4).                                    
           02  PRODI93F    PICTURE X.                                           
           02  FILLER REDEFINES PRODI93F.                                       
             03 PRODI93A    PICTURE X.                                          
           02  PRODI93I  PIC X(2).                                              
           02  PRODI94L    COMP  PIC  S9(4).                                    
           02  PRODI94F    PICTURE X.                                           
           02  FILLER REDEFINES PRODI94F.                                       
             03 PRODI94A    PICTURE X.                                          
           02  PRODI94I  PIC X(2).                                              
           02  PRODI95L    COMP  PIC  S9(4).                                    
           02  PRODI95F    PICTURE X.                                           
           02  FILLER REDEFINES PRODI95F.                                       
             03 PRODI95A    PICTURE X.                                          
           02  PRODI95I  PIC X(2).                                              
           02  VBEGT91L    COMP  PIC  S9(4).                                    
           02  VBEGT91F    PICTURE X.                                           
           02  FILLER REDEFINES VBEGT91F.                                       
             03 VBEGT91A    PICTURE X.                                          
           02  VBEGT91I  PIC X(11).                                             
           02  VBEG91L    COMP  PIC  S9(4).                                     
           02  VBEG91F    PICTURE X.                                            
           02  FILLER REDEFINES VBEG91F.                                        
             03 VBEG91A    PICTURE X.                                           
           02  VBEG91I  PIC X(8).                                               
           02  VBEGI91L    COMP  PIC  S9(4).                                    
           02  VBEGI91F    PICTURE X.                                           
           02  FILLER REDEFINES VBEGI91F.                                       
             03 VBEGI91A    PICTURE X.                                          
           02  VBEGI91I  PIC X(6).                                              
           02  VABLT91L    COMP  PIC  S9(4).                                    
           02  VABLT91F    PICTURE X.                                           
           02  FILLER REDEFINES VABLT91F.                                       
             03 VABLT91A    PICTURE X.                                          
           02  VABLT91I  PIC X(5).                                              
           02  VABL91L    COMP  PIC  S9(4).                                     
           02  VABL91F    PICTURE X.                                            
           02  FILLER REDEFINES VABL91F.                                        
             03 VABL91A    PICTURE X.                                           
           02  VABL91I  PIC X(8).                                               
           02  VABLI91L    COMP  PIC  S9(4).                                    
           02  VABLI91F    PICTURE X.                                           
           02  FILLER REDEFINES VABLI91F.                                       
             03 VABLI91A    PICTURE X.                                          
           02  VABLI91I  PIC X(6).                                              
           02  ZWT91L    COMP  PIC  S9(4).                                      
           02  ZWT91F    PICTURE X.                                             
           02  FILLER REDEFINES ZWT91F.                                         
             03 ZWT91A    PICTURE X.                                            
           02  ZWT91I  PIC X(13).                                               
           02  ZW91L    COMP  PIC  S9(4).                                       
           02  ZW91F    PICTURE X.                                              
           02  FILLER REDEFINES ZW91F.                                          
             03 ZW91A    PICTURE X.                                             
           02  ZW91I  PIC X(1).                                                 
           02  ZWI91L    COMP  PIC  S9(4).                                      
           02  ZWI91F    PICTURE X.                                             
           02  FILLER REDEFINES ZWI91F.                                         
             03 ZWI91A    PICTURE X.                                            
           02  ZWI91I  PIC X(1).                                                
           02  HANT91L    COMP  PIC  S9(4).                                     
           02  HANT91F    PICTURE X.                                            
           02  FILLER REDEFINES HANT91F.                                        
             03 HANT91A    PICTURE X.                                           
           02  HANT91I  PIC X(13).                                              
           02  HAND91L    COMP  PIC  S9(4).                                     
           02  HAND91F    PICTURE X.                                            
           02  FILLER REDEFINES HAND91F.                                        
             03 HAND91A    PICTURE X.                                           
           02  HAND91I  PIC X(1).                                               
           02  HANDI91L    COMP  PIC  S9(4).                                    
           02  HANDI91F    PICTURE X.                                           
           02  FILLER REDEFINES HANDI91F.                                       
             03 HANDI91A    PICTURE X.                                          
           02  HANDI91I  PIC X(1).                                              
           02  BEITT91L    COMP  PIC  S9(4).                                    
           02  BEITT91F    PICTURE X.                                           
           02  FILLER REDEFINES BEITT91F.                                       
             03 BEITT91A    PICTURE X.                                          
           02  BEITT91I  PIC X(7).                                              
           02  BEITR91L    COMP  PIC  S9(4).                                    
           02  BEITR91F    PICTURE X.                                           
           02  FILLER REDEFINES BEITR91F.                                       
             03 BEITR91A    PICTURE X.                                          
           02  BEITR91I  PIC X(9).                                              
           02  BEITR92L    COMP  PIC  S9(4).                                    
           02  BEITR92F    PICTURE X.                                           
           02  FILLER REDEFINES BEITR92F.                                       
             03 BEITR92A    PICTURE X.                                          
           02  BEITR92I  PIC X(9).                                              
           02  BEITR93L    COMP  PIC  S9(4).                                    
           02  BEITR93F    PICTURE X.                                           
           02  FILLER REDEFINES BEITR93F.                                       
             03 BEITR93A    PICTURE X.                                          
           02  BEITR93I  PIC X(9).                                              
           02  BEITI91L    COMP  PIC  S9(4).                                    
           02  BEITI91F    PICTURE X.                                           
           02  FILLER REDEFINES BEITI91F.                                       
             03 BEITI91A    PICTURE X.                                          
           02  BEITI91I  PIC X(9).                                              
           02  BEITI92L    COMP  PIC  S9(4).                                    
           02  BEITI92F    PICTURE X.                                           
           02  FILLER REDEFINES BEITI92F.                                       
             03 BEITI92A    PICTURE X.                                          
           02  BEITI92I  PIC X(9).                                              
           02  BEITI93L    COMP  PIC  S9(4).                                    
           02  BEITI93F    PICTURE X.                                           
           02  FILLER REDEFINES BEITI93F.                                       
             03 BEITI93A    PICTURE X.                                          
           02  BEITI93I  PIC X(9).                                              
           02  BEITR94L    COMP  PIC  S9(4).                                    
           02  BEITR94F    PICTURE X.                                           
           02  FILLER REDEFINES BEITR94F.                                       
             03 BEITR94A    PICTURE X.                                          
           02  BEITR94I  PIC X(9).                                              
           02  BEITR95L    COMP  PIC  S9(4).                                    
           02  BEITR95F    PICTURE X.                                           
           02  FILLER REDEFINES BEITR95F.                                       
             03 BEITR95A    PICTURE X.                                          
           02  BEITR95I  PIC X(9).                                              
           02  BEITI94L    COMP  PIC  S9(4).                                    
           02  BEITI94F    PICTURE X.                                           
           02  FILLER REDEFINES BEITI94F.                                       
             03 BEITI94A    PICTURE X.                                          
           02  BEITI94I  PIC X(9).                                              
           02  BEITI95L    COMP  PIC  S9(4).                                    
           02  BEITI95F    PICTURE X.                                           
           02  FILLER REDEFINES BEITI95F.                                       
             03 BEITI95A    PICTURE X.                                          
           02  BEITI95I  PIC X(9).                                              
           02  AET91L    COMP  PIC  S9(4).                                      
           02  AET91F    PICTURE X.                                             
           02  FILLER REDEFINES AET91F.                                         
             03 AET91A    PICTURE X.                                            
           02  AET91I  PIC X(12).                                               
           02  AE91L    COMP  PIC  S9(4).                                       
           02  AE91F    PICTURE X.                                              
           02  FILLER REDEFINES AE91F.                                          
             03 AE91A    PICTURE X.                                             
           02  AE91I  PIC X(8).                                                 
           02  ANAR91L    COMP  PIC  S9(4).                                     
           02  ANAR91F    PICTURE X.                                            
           02  FILLER REDEFINES ANAR91F.                                        
             03 ANAR91A    PICTURE X.                                           
           02  ANAR91I  PIC X(10).                                              
           02  ANART91L    COMP  PIC  S9(4).                                    
           02  ANART91F    PICTURE X.                                           
           02  FILLER REDEFINES ANART91F.                                       
             03 ANART91A    PICTURE X.                                          
           02  ANART91I  PIC X(2).                                              
           02  ANARI91L    COMP  PIC  S9(4).                                    
           02  ANARI91F    PICTURE X.                                           
           02  FILLER REDEFINES ANARI91F.                                       
             03 ANARI91A    PICTURE X.                                          
           02  ANARI91I  PIC X(1).                                              
           02  TWKZ91L    COMP  PIC  S9(4).                                     
           02  TWKZ91F    PICTURE X.                                            
           02  FILLER REDEFINES TWKZ91F.                                        
             03 TWKZ91A    PICTURE X.                                           
           02  TWKZ91I  PIC X(10).                                              
           02  WKZ91L    COMP  PIC  S9(4).                                      
           02  WKZ91F    PICTURE X.                                             
           02  FILLER REDEFINES WKZ91F.                                         
             03 WKZ91A    PICTURE X.                                            
           02  WKZ91I  PIC X(1).                                                
           02  WKZI91L    COMP  PIC  S9(4).                                     
           02  WKZI91F    PICTURE X.                                            
           02  FILLER REDEFINES WKZI91F.                                        
             03 WKZI91A    PICTURE X.                                           
           02  WKZI91I  PIC X(1).                                               
           02  ANDAT91L    COMP  PIC  S9(4).                                    
           02  ANDAT91F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT91F.                                       
             03 ANDAT91A    PICTURE X.                                          
           02  ANDAT91I  PIC X(13).                                             
           02  ANDA91L    COMP  PIC  S9(4).                                     
           02  ANDA91F    PICTURE X.                                            
           02  FILLER REDEFINES ANDA91F.                                        
             03 ANDA91A    PICTURE X.                                           
           02  ANDA91I  PIC X(8).                                               
           02  ANDAI91L    COMP  PIC  S9(4).                                    
           02  ANDAI91F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAI91F.                                       
             03 ANDAI91A    PICTURE X.                                          
           02  ANDAI91I  PIC X(6).                                              
           02  ANERT91L    COMP  PIC  S9(4).                                    
           02  ANERT91F    PICTURE X.                                           
           02  FILLER REDEFINES ANERT91F.                                       
             03 ANERT91A    PICTURE X.                                          
           02  ANERT91I  PIC X(13).                                             
           02  ANERF91L    COMP  PIC  S9(4).                                    
           02  ANERF91F    PICTURE X.                                           
           02  FILLER REDEFINES ANERF91F.                                       
             03 ANERF91A    PICTURE X.                                          
           02  ANERF91I  PIC X(8).                                              
           02  STDAT91L    COMP  PIC  S9(4).                                    
           02  STDAT91F    PICTURE X.                                           
           02  FILLER REDEFINES STDAT91F.                                       
             03 STDAT91A    PICTURE X.                                          
           02  STDAT91I  PIC X(13).                                             
           02  STDA91L    COMP  PIC  S9(4).                                     
           02  STDA91F    PICTURE X.                                            
           02  FILLER REDEFINES STDA91F.                                        
             03 STDA91A    PICTURE X.                                           
           02  STDA91I  PIC X(8).                                               
           02  STDAI91L    COMP  PIC  S9(4).                                    
           02  STDAI91F    PICTURE X.                                           
           02  FILLER REDEFINES STDAI91F.                                       
             03 STDAI91A    PICTURE X.                                          
           02  STDAI91I  PIC X(6).                                              
           02  ANSTA91L    COMP  PIC  S9(4).                                    
           02  ANSTA91F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTA91F.                                       
             03 ANSTA91A    PICTURE X.                                          
           02  ANSTA91I  PIC X(13).                                             
           02  ANST191L    COMP  PIC  S9(4).                                    
           02  ANST191F    PICTURE X.                                           
           02  FILLER REDEFINES ANST191F.                                       
             03 ANST191A    PICTURE X.                                          
           02  ANST191I  PIC X(2).                                              
           02  ANST291L    COMP  PIC  S9(4).                                    
           02  ANST291F    PICTURE X.                                           
           02  FILLER REDEFINES ANST291F.                                       
             03 ANST291A    PICTURE X.                                          
           02  ANST291I  PIC X(2).                                              
           02  ANST391L    COMP  PIC  S9(4).                                    
           02  ANST391F    PICTURE X.                                           
           02  FILLER REDEFINES ANST391F.                                       
             03 ANST391A    PICTURE X.                                          
           02  ANST391I  PIC X(2).                                              
           02  ANSTI91L    COMP  PIC  S9(4).                                    
           02  ANSTI91F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTI91F.                                       
             03 ANSTI91A    PICTURE X.                                          
           02  ANSTI91I  PIC X(2).                                              
           02  ASDAT91L    COMP  PIC  S9(4).                                    
           02  ASDAT91F    PICTURE X.                                           
           02  FILLER REDEFINES ASDAT91F.                                       
             03 ASDAT91A    PICTURE X.                                          
           02  ASDAT91I  PIC X(13).                                             
           02  ASDA191L    COMP  PIC  S9(4).                                    
           02  ASDA191F    PICTURE X.                                           
           02  FILLER REDEFINES ASDA191F.                                       
             03 ASDA191A    PICTURE X.                                          
           02  ASDA191I  PIC X(8).                                              
           02  ASDA291L    COMP  PIC  S9(4).                                    
           02  ASDA291F    PICTURE X.                                           
           02  FILLER REDEFINES ASDA291F.                                       
             03 ASDA291A    PICTURE X.                                          
           02  ASDA291I  PIC X(8).                                              
           02  ASDA391L    COMP  PIC  S9(4).                                    
           02  ASDA391F    PICTURE X.                                           
           02  FILLER REDEFINES ASDA391F.                                       
             03 ASDA391A    PICTURE X.                                          
           02  ASDA391I  PIC X(8).                                              
           02  ENTT91L    COMP  PIC  S9(4).                                     
           02  ENTT91F    PICTURE X.                                            
           02  FILLER REDEFINES ENTT91F.                                        
             03 ENTT91A    PICTURE X.                                           
           02  ENTT91I  PIC X(21).                                              
           02  ENT91L    COMP  PIC  S9(4).                                      
           02  ENT91F    PICTURE X.                                             
           02  FILLER REDEFINES ENT91F.                                         
             03 ENT91A    PICTURE X.                                            
           02  ENT91I  PIC X(1).                                                
           02  FMELD91L    COMP  PIC  S9(4).                                    
           02  FMELD91F    PICTURE X.                                           
           02  FILLER REDEFINES FMELD91F.                                       
             03 FMELD91A    PICTURE X.                                          
           02  FMELD91I  PIC X(78).                                             
       01  UU313O REDEFINES UU313I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR91O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATE91O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  VZEIT91O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  GESOO  PIC X(13).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPOAV91O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  POAVO91O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBT91O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR91O PIC 9(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBPZ91O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VMT91O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  VMNR91O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VMPZ91O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRT91O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERNR91O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  VPRZE91O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRI91O  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  VPRZI91O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNRN91O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBNRN91O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRN91O  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANRET91O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANRE91O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREI91O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUNAT91O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUNA91O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUNAI91O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  VORNT91O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VORNA91O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  VORNI91O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  SRTAT91O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRA91O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRAI91O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  TEPLZ91O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZ91O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZI91O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  WOHNT91O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAUSL91O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  WOHN91O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSL91O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  WOHNI91O  PIC X(21).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSLI91O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODT91O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROD91O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD92O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD93O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD94O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD95O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRODI91O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODI92O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODI93O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODI94O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODI95O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBEGT91O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBEG91O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VBEGI91O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  VABLT91O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  VABL91O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VABLI91O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZWT91O  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZW91O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZWI91O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  HANT91O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  HAND91O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  HANDI91O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITT91O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR91O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR92O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR93O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITI91O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITI92O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITI93O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR94O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR95O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITI94O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITI95O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  AET91O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  AE91O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANAR91O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART91O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANARI91O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TWKZ91O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  WKZ91O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  WKZI91O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT91O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANDA91O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  ANDAI91O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANERT91O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANERF91O PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  STDAT91O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  STDA91O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  STDAI91O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTA91O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANST191O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANST291O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANST391O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTI91O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASDAT91O  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASDA191O PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  ASDA291O PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  ASDA391O PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  ENTT91O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENT91O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FMELD91O  PIC X(78).                                             
