       01  UU315I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS83L    COMP  PIC  S9(4).                                     
           02  PERS83F    PICTURE X.                                            
           02  FILLER REDEFINES PERS83F.                                        
             03 PERS83A    PICTURE X.                                           
           02  PERS83I  PIC X(7).                                               
           02  DATUM83L    COMP  PIC  S9(4).                                    
           02  DATUM83F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM83F.                                       
             03 DATUM83A    PICTURE X.                                          
           02  DATUM83I  PIC X(8).                                              
           02  UHR83L    COMP  PIC  S9(4).                                      
           02  UHR83F    PICTURE X.                                             
           02  FILLER REDEFINES UHR83F.                                         
             03 UHR83A    PICTURE X.                                            
           02  UHR83I  PIC X(5).                                                
           02  GES83L    COMP  PIC  S9(4).                                      
           02  GES83F    PICTURE X.                                             
           02  FILLER REDEFINES GES83F.                                         
             03 GES83A    PICTURE X.                                            
           02  GES83I  PIC X(13).                                               
           02  VBNRA83L    COMP  PIC  S9(4).                                    
           02  VBNRA83F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRA83F.                                       
             03 VBNRA83A    PICTURE X.                                          
           02  VBNRA83I  PIC X(7).                                              
           02  PRZVB83L    COMP  PIC  S9(4).                                    
           02  PRZVB83F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVB83F.                                       
             03 PRZVB83A    PICTURE X.                                          
           02  PRZVB83I  PIC X(1).                                              
           02  DIR83L    COMP  PIC  S9(4).                                      
           02  DIR83F    PICTURE X.                                             
           02  FILLER REDEFINES DIR83F.                                         
             03 DIR83A    PICTURE X.                                            
           02  DIR83I  PIC X(3).                                                
           02  VBNA83L    COMP  PIC  S9(4).                                     
           02  VBNA83F    PICTURE X.                                            
           02  FILLER REDEFINES VBNA83F.                                        
             03 VBNA83A    PICTURE X.                                           
           02  VBNA83I  PIC X(20).                                              
           02  VBVM83L    COMP  PIC  S9(4).                                     
           02  VBVM83F    PICTURE X.                                            
           02  FILLER REDEFINES VBVM83F.                                        
             03 VBVM83A    PICTURE X.                                           
           02  VBVM83I  PIC X(7).                                               
           02  PRZVM83L    COMP  PIC  S9(4).                                    
           02  PRZVM83F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVM83F.                                       
             03 PRZVM83A    PICTURE X.                                          
           02  PRZVM83I  PIC X(1).                                              
           02  VMNA83L    COMP  PIC  S9(4).                                     
           02  VMNA83F    PICTURE X.                                            
           02  FILLER REDEFINES VMNA83F.                                        
             03 VMNA83A    PICTURE X.                                           
           02  VMNA83I  PIC X(20).                                              
           02  TVT83L    COMP  PIC  S9(4).                                      
           02  TVT83F    PICTURE X.                                             
           02  FILLER REDEFINES TVT83F.                                         
             03 TVT83A    PICTURE X.                                            
           02  TVT83I  PIC X(10).                                               
           02  VNR183L    COMP  PIC  S9(4).                                     
           02  VNR183F    PICTURE X.                                            
           02  FILLER REDEFINES VNR183F.                                        
             03 VNR183A    PICTURE X.                                           
           02  VNR183I  PIC X(10).                                              
           02  TAN83L    COMP  PIC  S9(4).                                      
           02  TAN83F    PICTURE X.                                             
           02  FILLER REDEFINES TAN83F.                                         
             03 TAN83A    PICTURE X.                                            
           02  TAN83I  PIC X(6).                                                
           02  ANRE83L    COMP  PIC  S9(4).                                     
           02  ANRE83F    PICTURE X.                                            
           02  FILLER REDEFINES ANRE83F.                                        
             03 ANRE83A    PICTURE X.                                           
           02  ANRE83I  PIC X(9).                                               
           02  TZU83L    COMP  PIC  S9(4).                                      
           02  TZU83F    PICTURE X.                                             
           02  FILLER REDEFINES TZU83F.                                         
             03 TZU83A    PICTURE X.                                            
           02  TZU83I  PIC X(6).                                                
           02  ZNAME83L    COMP  PIC  S9(4).                                    
           02  ZNAME83F    PICTURE X.                                           
           02  FILLER REDEFINES ZNAME83F.                                       
             03 ZNAME83A    PICTURE X.                                          
           02  ZNAME83I  PIC X(28).                                             
           02  TVOR83L    COMP  PIC  S9(4).                                     
           02  TVOR83F    PICTURE X.                                            
           02  FILLER REDEFINES TVOR83F.                                        
             03 TVOR83A    PICTURE X.                                           
           02  TVOR83I  PIC X(7).                                               
           02  VNAME83L    COMP  PIC  S9(4).                                    
           02  VNAME83F    PICTURE X.                                           
           02  FILLER REDEFINES VNAME83F.                                       
             03 VNAME83A    PICTURE X.                                          
           02  VNAME83I  PIC X(28).                                             
           02  TSTRA83L    COMP  PIC  S9(4).                                    
           02  TSTRA83F    PICTURE X.                                           
           02  FILLER REDEFINES TSTRA83F.                                       
             03 TSTRA83A    PICTURE X.                                          
           02  TSTRA83I  PIC X(7).                                              
           02  STRA83L    COMP  PIC  S9(4).                                     
           02  STRA83F    PICTURE X.                                            
           02  FILLER REDEFINES STRA83F.                                        
             03 STRA83A    PICTURE X.                                           
           02  STRA83I  PIC X(28).                                              
           02  TPLZA83L    COMP  PIC  S9(4).                                    
           02  TPLZA83F    PICTURE X.                                           
           02  FILLER REDEFINES TPLZA83F.                                       
             03 TPLZA83A    PICTURE X.                                          
           02  TPLZA83I  PIC X(3).                                              
           02  TORTA83L    COMP  PIC  S9(4).                                    
           02  TORTA83F    PICTURE X.                                           
           02  FILLER REDEFINES TORTA83F.                                       
             03 TORTA83A    PICTURE X.                                          
           02  TORTA83I  PIC X(7).                                              
           02  TAUSA83L    COMP  PIC  S9(4).                                    
           02  TAUSA83F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSA83F.                                       
             03 TAUSA83A    PICTURE X.                                          
           02  TAUSA83I  PIC X(4).                                              
           02  PLZA83L    COMP  PIC  S9(4).                                     
           02  PLZA83F    PICTURE X.                                            
           02  FILLER REDEFINES PLZA83F.                                        
             03 PLZA83A    PICTURE X.                                           
           02  PLZA83I  PIC X(5).                                               
           02  ORTA83L    COMP  PIC  S9(4).                                     
           02  ORTA83F    PICTURE X.                                            
           02  FILLER REDEFINES ORTA83F.                                        
             03 ORTA83A    PICTURE X.                                           
           02  ORTA83I  PIC X(21).                                              
           02  AUSA83L    COMP  PIC  S9(4).                                     
           02  AUSA83F    PICTURE X.                                            
           02  FILLER REDEFINES AUSA83F.                                        
             03 AUSA83A    PICTURE X.                                           
           02  AUSA83I  PIC X(3).                                               
           02  TPROD83L    COMP  PIC  S9(4).                                    
           02  TPROD83F    PICTURE X.                                           
           02  FILLER REDEFINES TPROD83F.                                       
             03 TPROD83A    PICTURE X.                                          
           02  TPROD83I  PIC X(7).                                              
           02  PRODU83L    COMP  PIC  S9(4).                                    
           02  PRODU83F    PICTURE X.                                           
           02  FILLER REDEFINES PRODU83F.                                       
             03 PRODU83A    PICTURE X.                                          
           02  PRODU83I  PIC X(2).                                              
           02  TSUMA83L    COMP  PIC  S9(4).                                    
           02  TSUMA83F    PICTURE X.                                           
           02  FILLER REDEFINES TSUMA83F.                                       
             03 TSUMA83A    PICTURE X.                                          
           02  TSUMA83I  PIC X(12).                                             
           02  SUMME83L    COMP  PIC  S9(4).                                    
           02  SUMME83F    PICTURE X.                                           
           02  FILLER REDEFINES SUMME83F.                                       
             03 SUMME83A    PICTURE X.                                          
           02  SUMME83I  PIC X(7).                                              
           02  TART83L    COMP  PIC  S9(4).                                     
           02  TART83F    PICTURE X.                                            
           02  FILLER REDEFINES TART83F.                                        
             03 TART83A    PICTURE X.                                           
           02  TART83I  PIC X(10).                                              
           02  ANART83L    COMP  PIC  S9(4).                                    
           02  ANART83F    PICTURE X.                                           
           02  FILLER REDEFINES ANART83F.                                       
             03 ANART83A    PICTURE X.                                          
           02  ANART83I  PIC X(1).                                              
           02  TAND83L    COMP  PIC  S9(4).                                     
           02  TAND83F    PICTURE X.                                            
           02  FILLER REDEFINES TAND83F.                                        
             03 TAND83A    PICTURE X.                                           
           02  TAND83I  PIC X(6).                                               
           02  ANDAT83L    COMP  PIC  S9(4).                                    
           02  ANDAT83F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT83F.                                       
             03 ANDAT83A    PICTURE X.                                          
           02  ANDAT83I  PIC X(6).                                              
           02  TERD83L    COMP  PIC  S9(4).                                     
           02  TERD83F    PICTURE X.                                            
           02  FILLER REDEFINES TERD83F.                                        
             03 TERD83A    PICTURE X.                                           
           02  TERD83I  PIC X(10).                                              
           02  ERFD83L    COMP  PIC  S9(4).                                     
           02  ERFD83F    PICTURE X.                                            
           02  FILLER REDEFINES ERFD83F.                                        
             03 ERFD83A    PICTURE X.                                           
           02  ERFD83I  PIC X(6).                                               
           02  TSTAT83L    COMP  PIC  S9(4).                                    
           02  TSTAT83F    PICTURE X.                                           
           02  FILLER REDEFINES TSTAT83F.                                       
             03 TSTAT83A    PICTURE X.                                          
           02  TSTAT83I  PIC X(7).                                              
           02  STAT83L    COMP  PIC  S9(4).                                     
           02  STAT83F    PICTURE X.                                            
           02  FILLER REDEFINES STAT83F.                                        
             03 STAT83A    PICTURE X.                                           
           02  STAT83I  PIC X(2).                                               
           02  TEING83L    COMP  PIC  S9(4).                                    
           02  TEING83F    PICTURE X.                                           
           02  FILLER REDEFINES TEING83F.                                       
             03 TEING83A    PICTURE X.                                          
           02  TEING83I  PIC X(46).                                             
           02  EING83L    COMP  PIC  S9(4).                                     
           02  EING83F    PICTURE X.                                            
           02  FILLER REDEFINES EING83F.                                        
             03 EING83A    PICTURE X.                                           
           02  EING83I  PIC X(1).                                               
           02  FEHL83L    COMP  PIC  S9(4).                                     
           02  FEHL83F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL83F.                                        
             03 FEHL83A    PICTURE X.                                           
           02  FEHL83I  PIC X(78).                                              
       01  UU315O REDEFINES UU315I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS83O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATUM83O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR83O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  GES83O  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA83O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVB83O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIR83O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNA83O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBVM83O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVM83O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNA83O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVT83O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR183O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAN83O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRE83O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZU83O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZNAME83O  PIC X(28).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVOR83O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNAME83O  PIC X(28).                                             
           02  FILLER PICTURE X(3).                                             
           02  TSTRA83O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRA83O  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPLZA83O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TORTA83O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAUSA83O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZA83O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORTA83O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSA83O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROD83O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODU83O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSUMA83O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  SUMME83O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  TART83O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART83O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAND83O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT83O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TERD83O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERFD83O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTAT83O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT83O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEING83O  PIC X(46).                                             
           02  FILLER PICTURE X(3).                                             
           02  EING83O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL83O  PIC X(78).                                              
