       01  UU597I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR3L    COMP  PIC  S9(4).                                       
           02  PNR3F    PICTURE X.                                              
           02  FILLER REDEFINES PNR3F.                                          
             03 PNR3A    PICTURE X.                                             
           02  PNR3I  PIC X(6).                                                 
           02  DAT3L    COMP  PIC  S9(4).                                       
           02  DAT3F    PICTURE X.                                              
           02  FILLER REDEFINES DAT3F.                                          
             03 DAT3A    PICTURE X.                                             
           02  DAT3I  PIC X(8).                                                 
           02  UHR3L    COMP  PIC  S9(4).                                       
           02  UHR3F    PICTURE X.                                              
           02  FILLER REDEFINES UHR3F.                                          
             03 UHR3A    PICTURE X.                                             
           02  UHR3I  PIC X(5).                                                 
           02  ZGES3L    COMP  PIC  S9(4).                                      
           02  ZGES3F    PICTURE X.                                             
           02  FILLER REDEFINES ZGES3F.                                         
             03 ZGES3A    PICTURE X.                                            
           02  ZGES3I  PIC X(2).                                                
           02  Z31L    COMP  PIC  S9(4).                                        
           02  Z31F    PICTURE X.                                               
           02  FILLER REDEFINES Z31F.                                           
             03 Z31A    PICTURE X.                                              
           02  Z31I  PIC X(60).                                                 
           02  Z32L    COMP  PIC  S9(4).                                        
           02  Z32F    PICTURE X.                                               
           02  FILLER REDEFINES Z32F.                                           
             03 Z32A    PICTURE X.                                              
           02  Z32I  PIC X(60).                                                 
           02  Z33L    COMP  PIC  S9(4).                                        
           02  Z33F    PICTURE X.                                               
           02  FILLER REDEFINES Z33F.                                           
             03 Z33A    PICTURE X.                                              
           02  Z33I  PIC X(60).                                                 
           02  Z34L    COMP  PIC  S9(4).                                        
           02  Z34F    PICTURE X.                                               
           02  FILLER REDEFINES Z34F.                                           
             03 Z34A    PICTURE X.                                              
           02  Z34I  PIC X(60).                                                 
           02  Z35L    COMP  PIC  S9(4).                                        
           02  Z35F    PICTURE X.                                               
           02  FILLER REDEFINES Z35F.                                           
             03 Z35A    PICTURE X.                                              
           02  Z35I  PIC X(60).                                                 
           02  GESN3L    COMP  PIC  S9(4).                                      
           02  GESN3F    PICTURE X.                                             
           02  FILLER REDEFINES GESN3F.                                         
             03 GESN3A    PICTURE X.                                            
           02  GESN3I  PIC X(2).                                                
           02  PRDN3L    COMP  PIC  S9(4).                                      
           02  PRDN3F    PICTURE X.                                             
           02  FILLER REDEFINES PRDN3F.                                         
             03 PRDN3A    PICTURE X.                                            
           02  PRDN3I  PIC X(2).                                                
           02  ANWN3L    COMP  PIC  S9(4).                                      
           02  ANWN3F    PICTURE X.                                             
           02  FILLER REDEFINES ANWN3F.                                         
             03 ANWN3A    PICTURE X.                                            
           02  ANWN3I  PIC X(4).                                                
           02  M3INFOL    COMP  PIC  S9(4).                                     
           02  M3INFOF    PICTURE X.                                            
           02  FILLER REDEFINES M3INFOF.                                        
             03 M3INFOA    PICTURE X.                                           
           02  M3INFOI  PIC X(79).                                              
       01  UU597O REDEFINES UU597I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR3O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT3O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZGES3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  Z31O  PIC X(60).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z32O  PIC X(60).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z33O  PIC X(60).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z34O  PIC X(60).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z35O  PIC X(60).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GESN3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRDN3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANWN3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  M3INFOO  PIC X(79).                                              
