       01  UU596I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR2L    COMP  PIC  S9(4).                                       
           02  PNR2F    PICTURE X.                                              
           02  FILLER REDEFINES PNR2F.                                          
             03 PNR2A    PICTURE X.                                             
           02  PNR2I  PIC X(7).                                                 
           02  DAT2L    COMP  PIC  S9(4).                                       
           02  DAT2F    PICTURE X.                                              
           02  FILLER REDEFINES DAT2F.                                          
             03 DAT2A    PICTURE X.                                             
           02  DAT2I  PIC X(8).                                                 
           02  UHR2L    COMP  PIC  S9(4).                                       
           02  UHR2F    PICTURE X.                                              
           02  FILLER REDEFINES UHR2F.                                          
             03 UHR2A    PICTURE X.                                             
           02  UHR2I  PIC X(5).                                                 
           02  Z1L    COMP  PIC  S9(4).                                         
           02  Z1F    PICTURE X.                                                
           02  FILLER REDEFINES Z1F.                                            
             03 Z1A    PICTURE X.                                               
           02  Z1I  PIC X(79).                                                  
           02  Z2L    COMP  PIC  S9(4).                                         
           02  Z2F    PICTURE X.                                                
           02  FILLER REDEFINES Z2F.                                            
             03 Z2A    PICTURE X.                                               
           02  Z2I  PIC X(79).                                                  
           02  Z3L    COMP  PIC  S9(4).                                         
           02  Z3F    PICTURE X.                                                
           02  FILLER REDEFINES Z3F.                                            
             03 Z3A    PICTURE X.                                               
           02  Z3I  PIC X(79).                                                  
           02  Z4L    COMP  PIC  S9(4).                                         
           02  Z4F    PICTURE X.                                                
           02  FILLER REDEFINES Z4F.                                            
             03 Z4A    PICTURE X.                                               
           02  Z4I  PIC X(79).                                                  
           02  Z5L    COMP  PIC  S9(4).                                         
           02  Z5F    PICTURE X.                                                
           02  FILLER REDEFINES Z5F.                                            
             03 Z5A    PICTURE X.                                               
           02  Z5I  PIC X(79).                                                  
           02  Z6L    COMP  PIC  S9(4).                                         
           02  Z6F    PICTURE X.                                                
           02  FILLER REDEFINES Z6F.                                            
             03 Z6A    PICTURE X.                                               
           02  Z6I  PIC X(79).                                                  
           02  Z7L    COMP  PIC  S9(4).                                         
           02  Z7F    PICTURE X.                                                
           02  FILLER REDEFINES Z7F.                                            
             03 Z7A    PICTURE X.                                               
           02  Z7I  PIC X(79).                                                  
           02  Z8L    COMP  PIC  S9(4).                                         
           02  Z8F    PICTURE X.                                                
           02  FILLER REDEFINES Z8F.                                            
             03 Z8A    PICTURE X.                                               
           02  Z8I  PIC X(79).                                                  
           02  Z9L    COMP  PIC  S9(4).                                         
           02  Z9F    PICTURE X.                                                
           02  FILLER REDEFINES Z9F.                                            
             03 Z9A    PICTURE X.                                               
           02  Z9I  PIC X(79).                                                  
           02  SATZTL    COMP  PIC  S9(4).                                      
           02  SATZTF    PICTURE X.                                             
           02  FILLER REDEFINES SATZTF.                                         
             03 SATZTA    PICTURE X.                                            
           02  SATZTI  PIC X(24).                                               
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  EGESI  PIC X(2).                                                 
           02  EPRODL    COMP  PIC  S9(4).                                      
           02  EPRODF    PICTURE X.                                             
           02  FILLER REDEFINES EPRODF.                                         
             03 EPRODA    PICTURE X.                                            
           02  EPRODI  PIC X(2).                                                
           02  EBEGINL    COMP  PIC  S9(4).                                     
           02  EBEGINF    PICTURE X.                                            
           02  FILLER REDEFINES EBEGINF.                                        
             03 EBEGINA    PICTURE X.                                           
           02  EBEGINI  PIC X(6).                                               
           02  EABRECL    COMP  PIC  S9(4).                                     
           02  EABRECF    PICTURE X.                                            
           02  FILLER REDEFINES EABRECF.                                        
             03 EABRECA    PICTURE X.                                           
           02  EABRECI  PIC X(6).                                               
           02  EFAELLL    COMP  PIC  S9(4).                                     
           02  EFAELLF    PICTURE X.                                            
           02  FILLER REDEFINES EFAELLF.                                        
             03 EFAELLA    PICTURE X.                                           
           02  EFAELLI  PIC X(6).                                               
           02  EENDEL    COMP  PIC  S9(4).                                      
           02  EENDEF    PICTURE X.                                             
           02  FILLER REDEFINES EENDEF.                                         
             03 EENDEA    PICTURE X.                                            
           02  EENDEI  PIC X(6).                                                
           02  EGRUNDL    COMP  PIC  S9(4).                                     
           02  EGRUNDF    PICTURE X.                                            
           02  FILLER REDEFINES EGRUNDF.                                        
             03 EGRUNDA    PICTURE X.                                           
           02  EGRUNDI  PIC X(7).                                               
           02  ERUECKL    COMP  PIC  S9(4).                                     
           02  ERUECKF    PICTURE X.                                            
           02  FILLER REDEFINES ERUECKF.                                        
             03 ERUECKA    PICTURE X.                                           
           02  ERUECKI  PIC X(2).                                               
           02  EVERTL    COMP  PIC  S9(4).                                      
           02  EVERTF    PICTURE X.                                             
           02  FILLER REDEFINES EVERTF.                                         
             03 EVERTA    PICTURE X.                                            
           02  EVERTI  PIC X(7).                                                
           02  ECOVERL    COMP  PIC  S9(4).                                     
           02  ECOVERF    PICTURE X.                                            
           02  FILLER REDEFINES ECOVERF.                                        
             03 ECOVERA    PICTURE X.                                           
           02  ECOVERI  PIC X(7).                                               
           02  EPROVPL    COMP  PIC  S9(4).                                     
           02  EPROVPF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVPF.                                        
             03 EPROVPA    PICTURE X.                                           
           02  EPROVPI  PIC X(10).                                              
           02  GESTL    COMP  PIC  S9(4).                                       
           02  GESTF    PICTURE X.                                              
           02  FILLER REDEFINES GESTF.                                          
             03 GESTA    PICTURE X.                                             
           02  GESTI  PIC X(23).                                                
           02  GESNEUL    COMP  PIC  S9(4).                                     
           02  GESNEUF    PICTURE X.                                            
           02  FILLER REDEFINES GESNEUF.                                        
             03 GESNEUA    PICTURE X.                                           
           02  GESNEUI  PIC X(2).                                               
           02  PRDTL    COMP  PIC  S9(4).                                       
           02  PRDTF    PICTURE X.                                              
           02  FILLER REDEFINES PRDTF.                                          
             03 PRDTA    PICTURE X.                                             
           02  PRDTI  PIC X(11).                                                
           02  PRDNEUL    COMP  PIC  S9(4).                                     
           02  PRDNEUF    PICTURE X.                                            
           02  FILLER REDEFINES PRDNEUF.                                        
             03 PRDNEUA    PICTURE X.                                           
           02  PRDNEUI  PIC X(2).                                               
           02  ANWTL    COMP  PIC  S9(4).                                       
           02  ANWTF    PICTURE X.                                              
           02  FILLER REDEFINES ANWTF.                                          
             03 ANWTA    PICTURE X.                                             
           02  ANWTI  PIC X(12).                                                
           02  ANWNEUL    COMP  PIC  S9(4).                                     
           02  ANWNEUF    PICTURE X.                                            
           02  FILLER REDEFINES ANWNEUF.                                        
             03 ANWNEUA    PICTURE X.                                           
           02  ANWNEUI  PIC X(4).                                               
           02  ABFRATL    COMP  PIC  S9(4).                                     
           02  ABFRATF    PICTURE X.                                            
           02  FILLER REDEFINES ABFRATF.                                        
             03 ABFRATA    PICTURE X.                                           
           02  ABFRATI  PIC X(25).                                              
           02  ABFRAGL    COMP  PIC  S9(4).                                     
           02  ABFRAGF    PICTURE X.                                            
           02  FILLER REDEFINES ABFRAGF.                                        
             03 ABFRAGA    PICTURE X.                                           
           02  ABFRAGI  PIC X(1).                                               
           02  M2INFOL    COMP  PIC  S9(4).                                     
           02  M2INFOF    PICTURE X.                                            
           02  FILLER REDEFINES M2INFOF.                                        
             03 M2INFOA    PICTURE X.                                           
           02  M2INFOI  PIC X(79).                                              
       01  UU596O REDEFINES UU596I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR2O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT2O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z1O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z2O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z3O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z4O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z5O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z6O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z7O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z8O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z9O  PIC X(79).                                                  
           02  FILLER PICTURE X(3).                                             
           02  SATZTO  PIC X(24).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPRODO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEGINO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABRECO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFAELLO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EENDEO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGRUNDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERUECKO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVERTO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ECOVERO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROVPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  GESTO  PIC X(23).                                                
           02  FILLER PICTURE X(3).                                             
           02  GESNEUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRDTO  PIC X(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRDNEUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANWTO  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANWNEUO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABFRATO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABFRAGO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  M2INFOO  PIC X(79).                                              
