      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   UU706S.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\UU706S.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 15:15:28   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.0   Nov 04 1995 10:04:52   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ***** VERSION   1    03.08.93 10:52:17
      ****************************************************************
      *                                                              *
      *   COPYMEMBER: MELDESATZ HOST-DATEI   (SUSIS)                 *
      *   ==========================================                 *
      *                                                              *
      *   SATZLÄNGE :   11  FEST                                     *
      *   STAND :      15.04.1993                                    *
      *                                                              *
      *   SATZAUFBAU FÜR DEN FD-EINTRAG  UU706S                      *
      ****************************************************************
      *
      *
       01  UU706S.
           05  UU706S-MA-KTO.
               10  UU706S-VBNR           PIC X(007).
               10  UU706S-PRUEF-KZ       PIC X(003).
           05  UU706S-MELD-KZ            PIC X(001).

