       01  UU913I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR1L    COMP  PIC  S9(4).                                       
           02  PNR1F    PICTURE X.                                              
           02  FILLER REDEFINES PNR1F.                                          
             03 PNR1A    PICTURE X.                                             
           02  PNR1I  PIC X(7).                                                 
           02  DAT1L    COMP  PIC  S9(4).                                       
           02  DAT1F    PICTURE X.                                              
           02  FILLER REDEFINES DAT1F.                                          
             03 DAT1A    PICTURE X.                                             
           02  DAT1I  PIC X(8).                                                 
           02  UHR1L    COMP  PIC  S9(4).                                       
           02  UHR1F    PICTURE X.                                              
           02  FILLER REDEFINES UHR1F.                                          
             03 UHR1A    PICTURE X.                                             
           02  UHR1I  PIC X(5).                                                 
           02  VBNR1L    COMP  PIC  S9(4).                                      
           02  VBNR1F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR1F.                                         
             03 VBNR1A    PICTURE X.                                            
           02  VBNR1I  PIC X(7).                                                
           02  PRZ1L    COMP  PIC  S9(4).                                       
           02  PRZ1F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ1F.                                          
             03 PRZ1A    PICTURE X.                                             
           02  PRZ1I  PIC X(1).                                                 
           02  DIR1L    COMP  PIC  S9(4).                                       
           02  DIR1F    PICTURE X.                                              
           02  FILLER REDEFINES DIR1F.                                          
             03 DIR1A    PICTURE X.                                             
           02  DIR1I  PIC X(3).                                                 
           02  AEDANZL    COMP  PIC  S9(4).                                     
           02  AEDANZF    PICTURE X.                                            
           02  FILLER REDEFINES AEDANZF.                                        
             03 AEDANZA    PICTURE X.                                           
           02  AEDANZI  PIC X(18).                                              
           02  ANREDTL    COMP  PIC  S9(4).                                     
           02  ANREDTF    PICTURE X.                                            
           02  FILLER REDEFINES ANREDTF.                                        
             03 ANREDTA    PICTURE X.                                           
           02  ANREDTI  PIC X(6).                                               
           02  AUSLTL    COMP  PIC  S9(4).                                      
           02  AUSLTF    PICTURE X.                                             
           02  FILLER REDEFINES AUSLTF.                                         
             03 AUSLTA    PICTURE X.                                            
           02  AUSLTI  PIC X(9).                                                
           02  ANREDL    COMP  PIC  S9(4).                                      
           02  ANREDF    PICTURE X.                                             
           02  FILLER REDEFINES ANREDF.                                         
             03 ANREDA    PICTURE X.                                            
           02  ANREDI  PIC X(9).                                                
           02  AUSLL    COMP  PIC  S9(4).                                       
           02  AUSLF    PICTURE X.                                              
           02  FILLER REDEFINES AUSLF.                                          
             03 AUSLA    PICTURE X.                                             
           02  AUSLI  PIC X(3).                                                 
           02  ZUNAMTL    COMP  PIC  S9(4).                                     
           02  ZUNAMTF    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAMTF.                                        
             03 ZUNAMTA    PICTURE X.                                           
           02  ZUNAMTI  PIC X(6).                                               
           02  ZUNAML    COMP  PIC  S9(4).                                      
           02  ZUNAMF    PICTURE X.                                             
           02  FILLER REDEFINES ZUNAMF.                                         
             03 ZUNAMA    PICTURE X.                                            
           02  ZUNAMI  PIC X(20).                                               
           02  VORNTL    COMP  PIC  S9(4).                                      
           02  VORNTF    PICTURE X.                                             
           02  FILLER REDEFINES VORNTF.                                         
             03 VORNTA    PICTURE X.                                            
           02  VORNTI  PIC X(7).                                                
           02  VORNL    COMP  PIC  S9(4).                                       
           02  VORNF    PICTURE X.                                              
           02  FILLER REDEFINES VORNF.                                          
             03 VORNA    PICTURE X.                                             
           02  VORNI  PIC X(20).                                                
           02  STRTL    COMP  PIC  S9(4).                                       
           02  STRTF    PICTURE X.                                              
           02  FILLER REDEFINES STRTF.                                          
             03 STRTA    PICTURE X.                                             
           02  STRTI  PIC X(7).                                                 
           02  STRL    COMP  PIC  S9(4).                                        
           02  STRF    PICTURE X.                                               
           02  FILLER REDEFINES STRF.                                           
             03 STRA    PICTURE X.                                              
           02  STRI  PIC X(20).                                                 
           02  PLZTL    COMP  PIC  S9(4).                                       
           02  PLZTF    PICTURE X.                                              
           02  FILLER REDEFINES PLZTF.                                          
             03 PLZTA    PICTURE X.                                             
           02  PLZTI  PIC X(3).                                                 
           02  ORTTL    COMP  PIC  S9(4).                                       
           02  ORTTF    PICTURE X.                                              
           02  FILLER REDEFINES ORTTF.                                          
             03 ORTTA    PICTURE X.                                             
           02  ORTTI  PIC X(7).                                                 
           02  PBTL    COMP  PIC  S9(4).                                        
           02  PBTF    PICTURE X.                                               
           02  FILLER REDEFINES PBTF.                                           
             03 PBTA    PICTURE X.                                              
           02  PBTI  PIC X(5).                                                  
           02  PLZL    COMP  PIC  S9(4).                                        
           02  PLZF    PICTURE X.                                               
           02  FILLER REDEFINES PLZF.                                           
             03 PLZA    PICTURE X.                                              
           02  PLZI  PIC X(6).                                                  
           02  ORTL    COMP  PIC  S9(4).                                        
           02  ORTF    PICTURE X.                                               
           02  FILLER REDEFINES ORTF.                                           
             03 ORTA    PICTURE X.                                              
           02  ORTI  PIC X(16).                                                 
           02  PB1L    COMP  PIC  S9(4).                                        
           02  PB1F    PICTURE X.                                               
           02  FILLER REDEFINES PB1F.                                           
             03 PB1A    PICTURE X.                                              
           02  PB1I  PIC X(3).                                                  
           02  TGEFUNL    COMP  PIC  S9(4).                                     
           02  TGEFUNF    PICTURE X.                                            
           02  FILLER REDEFINES TGEFUNF.                                        
             03 TGEFUNA    PICTURE X.                                           
           02  TGEFUNI  PIC X(9).                                               
           02  TELTL    COMP  PIC  S9(4).                                       
           02  TELTF    PICTURE X.                                              
           02  FILLER REDEFINES TELTF.                                          
             03 TELTA    PICTURE X.                                             
           02  TELTI  PIC X(6).                                                 
           02  GEFUNL    COMP  PIC  S9(4).                                      
           02  GEFUNF    PICTURE X.                                             
           02  FILLER REDEFINES GEFUNF.                                         
             03 GEFUNA    PICTURE X.                                            
           02  GEFUNI  PIC X(8).                                                
           02  TELL    COMP  PIC  S9(4).                                        
           02  TELF    PICTURE X.                                               
           02  FILLER REDEFINES TELF.                                           
             03 TELA    PICTURE X.                                              
           02  TELI  PIC X(14).                                                 
           02  AFAXNR1L    COMP  PIC  S9(4).                                    
           02  AFAXNR1F    PICTURE X.                                           
           02  FILLER REDEFINES AFAXNR1F.                                       
             03 AFAXNR1A    PICTURE X.                                          
           02  AFAXNR1I  PIC X(18).                                             
           02  EDATTL    COMP  PIC  S9(4).                                      
           02  EDATTF    PICTURE X.                                             
           02  FILLER REDEFINES EDATTF.                                         
             03 EDATTA    PICTURE X.                                            
           02  EDATTI  PIC X(8).                                                
           02  EDAT1L    COMP  PIC  S9(4).                                      
           02  EDAT1F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT1F.                                         
             03 EDAT1A    PICTURE X.                                            
           02  EDAT1I  PIC X(8).                                                
           02  EDAT2L    COMP  PIC  S9(4).                                      
           02  EDAT2F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT2F.                                         
             03 EDAT2A    PICTURE X.                                            
           02  EDAT2I  PIC X(8).                                                
           02  EDAT3L    COMP  PIC  S9(4).                                      
           02  EDAT3F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT3F.                                         
             03 EDAT3A    PICTURE X.                                            
           02  EDAT3I  PIC X(8).                                                
           02  ADATTL    COMP  PIC  S9(4).                                      
           02  ADATTF    PICTURE X.                                             
           02  FILLER REDEFINES ADATTF.                                         
             03 ADATTA    PICTURE X.                                            
           02  ADATTI  PIC X(8).                                                
           02  ADAT1L    COMP  PIC  S9(4).                                      
           02  ADAT1F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT1F.                                         
             03 ADAT1A    PICTURE X.                                            
           02  ADAT1I  PIC X(8).                                                
           02  KADAT1L    COMP  PIC  S9(4).                                     
           02  KADAT1F    PICTURE X.                                            
           02  FILLER REDEFINES KADAT1F.                                        
             03 KADAT1A    PICTURE X.                                           
           02  KADAT1I  PIC X(1).                                               
           02  ADAT2L    COMP  PIC  S9(4).                                      
           02  ADAT2F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT2F.                                         
             03 ADAT2A    PICTURE X.                                            
           02  ADAT2I  PIC X(8).                                                
           02  ADAT3L    COMP  PIC  S9(4).                                      
           02  ADAT3F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT3F.                                         
             03 ADAT3A    PICTURE X.                                            
           02  ADAT3I  PIC X(8).                                                
           02  AAUF1L    COMP  PIC  S9(4).                                      
           02  AAUF1F    PICTURE X.                                             
           02  FILLER REDEFINES AAUF1F.                                         
             03 AAUF1A    PICTURE X.                                            
           02  AAUF1I  PIC X(10).                                               
           02  AUSGTL    COMP  PIC  S9(4).                                      
           02  AUSGTF    PICTURE X.                                             
           02  FILLER REDEFINES AUSGTF.                                         
             03 AUSGTA    PICTURE X.                                            
           02  AUSGTI  PIC X(9).                                                
           02  AUSG1L    COMP  PIC  S9(4).                                      
           02  AUSG1F    PICTURE X.                                             
           02  FILLER REDEFINES AUSG1F.                                         
             03 AUSG1A    PICTURE X.                                            
           02  AUSG1I  PIC X(3).                                                
           02  AUSG2L    COMP  PIC  S9(4).                                      
           02  AUSG2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSG2F.                                         
             03 AUSG2A    PICTURE X.                                            
           02  AUSG2I  PIC X(2).                                                
           02  AUSG3L    COMP  PIC  S9(4).                                      
           02  AUSG3F    PICTURE X.                                             
           02  FILLER REDEFINES AUSG3F.                                         
             03 AUSG3A    PICTURE X.                                            
           02  AUSG3I  PIC X(2).                                                
           02  VDATTL    COMP  PIC  S9(4).                                      
           02  VDATTF    PICTURE X.                                             
           02  FILLER REDEFINES VDATTF.                                         
             03 VDATTA    PICTURE X.                                            
           02  VDATTI  PIC X(9).                                                
           02  VDAT1L    COMP  PIC  S9(4).                                      
           02  VDAT1F    PICTURE X.                                             
           02  FILLER REDEFINES VDAT1F.                                         
             03 VDAT1A    PICTURE X.                                            
           02  VDAT1I  PIC X(8).                                                
           02  VDAT2L    COMP  PIC  S9(4).                                      
           02  VDAT2F    PICTURE X.                                             
           02  FILLER REDEFINES VDAT2F.                                         
             03 VDAT2A    PICTURE X.                                            
           02  VDAT2I  PIC X(8).                                                
           02  VDAT3L    COMP  PIC  S9(4).                                      
           02  VDAT3F    PICTURE X.                                             
           02  FILLER REDEFINES VDAT3F.                                         
             03 VDAT3A    PICTURE X.                                            
           02  VDAT3I  PIC X(8).                                                
           02  PROVRL    COMP  PIC  S9(4).                                      
           02  PROVRF    PICTURE X.                                             
           02  FILLER REDEFINES PROVRF.                                         
             03 PROVRA    PICTURE X.                                            
           02  PROVRI  PIC X(5).                                                
           02  STRUKTL    COMP  PIC  S9(4).                                     
           02  STRUKTF    PICTURE X.                                            
           02  FILLER REDEFINES STRUKTF.                                        
             03 STRUKTA    PICTURE X.                                           
           02  STRUKTI  PIC X(11).                                              
           02  STRUKT1L    COMP  PIC  S9(4).                                    
           02  STRUKT1F    PICTURE X.                                           
           02  FILLER REDEFINES STRUKT1F.                                       
             03 STRUKT1A    PICTURE X.                                          
           02  STRUKT1I  PIC X(3).                                              
           02  STRUK1L    COMP  PIC  S9(4).                                     
           02  STRUK1F    PICTURE X.                                            
           02  FILLER REDEFINES STRUK1F.                                        
             03 STRUK1A    PICTURE X.                                           
           02  STRUK1I  PIC X(4).                                               
           02  VBP1L    COMP  PIC  S9(4).                                       
           02  VBP1F    PICTURE X.                                              
           02  FILLER REDEFINES VBP1F.                                          
             03 VBP1A    PICTURE X.                                             
           02  VBP1I  PIC X(2).                                                 
           02  STRUK2L    COMP  PIC  S9(4).                                     
           02  STRUK2F    PICTURE X.                                            
           02  FILLER REDEFINES STRUK2F.                                        
             03 STRUK2A    PICTURE X.                                           
           02  STRUK2I  PIC X(4).                                               
           02  VBP2L    COMP  PIC  S9(4).                                       
           02  VBP2F    PICTURE X.                                              
           02  FILLER REDEFINES VBP2F.                                          
             03 VBP2A    PICTURE X.                                             
           02  VBP2I  PIC X(2).                                                 
           02  STRUK3L    COMP  PIC  S9(4).                                     
           02  STRUK3F    PICTURE X.                                            
           02  FILLER REDEFINES STRUK3F.                                        
             03 STRUK3A    PICTURE X.                                           
           02  STRUK3I  PIC X(4).                                               
           02  VBP3L    COMP  PIC  S9(4).                                       
           02  VBP3F    PICTURE X.                                              
           02  FILLER REDEFINES VBP3F.                                          
             03 VBP3A    PICTURE X.                                             
           02  VBP3I  PIC X(2).                                                 
           02  TSEITL    COMP  PIC  S9(4).                                      
           02  TSEITF    PICTURE X.                                             
           02  FILLER REDEFINES TSEITF.                                         
             03 TSEITA    PICTURE X.                                            
           02  TSEITI  PIC X(4).                                                
           02  PROVDATL    COMP  PIC  S9(4).                                    
           02  PROVDATF    PICTURE X.                                           
           02  FILLER REDEFINES PROVDATF.                                       
             03 PROVDATA    PICTURE X.                                          
           02  PROVDATI  PIC X(8).                                              
           02  APPROV1L    COMP  PIC  S9(4).                                    
           02  APPROV1F    PICTURE X.                                           
           02  FILLER REDEFINES APPROV1F.                                       
             03 APPROV1A    PICTURE X.                                          
           02  APPROV1I  PIC X(5).                                              
           02  TAPPRV1L    COMP  PIC  S9(4).                                    
           02  TAPPRV1F    PICTURE X.                                           
           02  FILLER REDEFINES TAPPRV1F.                                       
             03 TAPPRV1A    PICTURE X.                                          
           02  TAPPRV1I  PIC X(1).                                              
           02  APPROV2L    COMP  PIC  S9(4).                                    
           02  APPROV2F    PICTURE X.                                           
           02  FILLER REDEFINES APPROV2F.                                       
             03 APPROV2A    PICTURE X.                                          
           02  APPROV2I  PIC X(5).                                              
           02  TAPPRV2L    COMP  PIC  S9(4).                                    
           02  TAPPRV2F    PICTURE X.                                           
           02  FILLER REDEFINES TAPPRV2F.                                       
             03 TAPPRV2A    PICTURE X.                                          
           02  TAPPRV2I  PIC X(1).                                              
           02  APPROV3L    COMP  PIC  S9(4).                                    
           02  APPROV3F    PICTURE X.                                           
           02  FILLER REDEFINES APPROV3F.                                       
             03 APPROV3A    PICTURE X.                                          
           02  APPROV3I  PIC X(5).                                              
           02  TAPPRV3L    COMP  PIC  S9(4).                                    
           02  TAPPRV3F    PICTURE X.                                           
           02  FILLER REDEFINES TAPPRV3F.                                       
             03 TAPPRV3A    PICTURE X.                                          
           02  TAPPRV3I  PIC X(1).                                              
           02  SCHECKL    COMP  PIC  S9(4).                                     
           02  SCHECKF    PICTURE X.                                            
           02  FILLER REDEFINES SCHECKF.                                        
             03 SCHECKA    PICTURE X.                                           
           02  SCHECKI  PIC X(4).                                               
           02  TAPSL    COMP  PIC  S9(4).                                       
           02  TAPSF    PICTURE X.                                              
           02  FILLER REDEFINES TAPSF.                                          
             03 TAPSA    PICTURE X.                                             
           02  TAPSI  PIC X(13).                                                
           02  APS1L    COMP  PIC  S9(4).                                       
           02  APS1F    PICTURE X.                                              
           02  FILLER REDEFINES APS1F.                                          
             03 APS1A    PICTURE X.                                             
           02  APS1I  PIC X(5).                                                 
           02  TAPS1L    COMP  PIC  S9(4).                                      
           02  TAPS1F    PICTURE X.                                             
           02  FILLER REDEFINES TAPS1F.                                         
             03 TAPS1A    PICTURE X.                                            
           02  TAPS1I  PIC X(1).                                                
           02  APS2L    COMP  PIC  S9(4).                                       
           02  APS2F    PICTURE X.                                              
           02  FILLER REDEFINES APS2F.                                          
             03 APS2A    PICTURE X.                                             
           02  APS2I  PIC X(5).                                                 
           02  TAPS2L    COMP  PIC  S9(4).                                      
           02  TAPS2F    PICTURE X.                                             
           02  FILLER REDEFINES TAPS2F.                                         
             03 TAPS2A    PICTURE X.                                            
           02  TAPS2I  PIC X(1).                                                
           02  APS3L    COMP  PIC  S9(4).                                       
           02  APS3F    PICTURE X.                                              
           02  FILLER REDEFINES APS3F.                                          
             03 APS3A    PICTURE X.                                             
           02  APS3I  PIC X(5).                                                 
           02  TAPS3L    COMP  PIC  S9(4).                                      
           02  TAPS3F    PICTURE X.                                             
           02  FILLER REDEFINES TAPS3F.                                         
             03 TAPS3A    PICTURE X.                                            
           02  TAPS3I  PIC X(1).                                                
           02  TTAETL    COMP  PIC  S9(4).                                      
           02  TTAETF    PICTURE X.                                             
           02  FILLER REDEFINES TTAETF.                                         
             03 TTAETA    PICTURE X.                                            
           02  TTAETI  PIC X(6).                                                
           02  TAET1L    COMP  PIC  S9(4).                                      
           02  TAET1F    PICTURE X.                                             
           02  FILLER REDEFINES TAET1F.                                         
             03 TAET1A    PICTURE X.                                            
           02  TAET1I  PIC X(4).                                                
           02  DIREK1L    COMP  PIC  S9(4).                                     
           02  DIREK1F    PICTURE X.                                            
           02  FILLER REDEFINES DIREK1F.                                        
             03 DIREK1A    PICTURE X.                                           
           02  DIREK1I  PIC X(3).                                               
           02  TAET2L    COMP  PIC  S9(4).                                      
           02  TAET2F    PICTURE X.                                             
           02  FILLER REDEFINES TAET2F.                                         
             03 TAET2A    PICTURE X.                                            
           02  TAET2I  PIC X(4).                                                
           02  DIREK2L    COMP  PIC  S9(4).                                     
           02  DIREK2F    PICTURE X.                                            
           02  FILLER REDEFINES DIREK2F.                                        
             03 DIREK2A    PICTURE X.                                           
           02  DIREK2I  PIC X(3).                                               
           02  TAET3L    COMP  PIC  S9(4).                                      
           02  TAET3F    PICTURE X.                                             
           02  FILLER REDEFINES TAET3F.                                         
             03 TAET3A    PICTURE X.                                            
           02  TAET3I  PIC X(4).                                                
           02  DIREK3L    COMP  PIC  S9(4).                                     
           02  DIREK3F    PICTURE X.                                            
           02  FILLER REDEFINES DIREK3F.                                        
             03 DIREK3A    PICTURE X.                                           
           02  DIREK3I  PIC X(3).                                               
           02  BETRTL    COMP  PIC  S9(4).                                      
           02  BETRTF    PICTURE X.                                             
           02  FILLER REDEFINES BETRTF.                                         
             03 BETRTA    PICTURE X.                                            
           02  BETRTI  PIC X(13).                                               
           02  BETR1L    COMP  PIC  S9(4).                                      
           02  BETR1F    PICTURE X.                                             
           02  FILLER REDEFINES BETR1F.                                         
             03 BETR1A    PICTURE X.                                            
           02  BETR1I  PIC X(7).                                                
           02  BPRZ1L    COMP  PIC  S9(4).                                      
           02  BPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ1F.                                         
             03 BPRZ1A    PICTURE X.                                            
           02  BPRZ1I  PIC X(1).                                                
           02  BETR2L    COMP  PIC  S9(4).                                      
           02  BETR2F    PICTURE X.                                             
           02  FILLER REDEFINES BETR2F.                                         
             03 BETR2A    PICTURE X.                                            
           02  BETR2I  PIC X(7).                                                
           02  BPRZ2L    COMP  PIC  S9(4).                                      
           02  BPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ2F.                                         
             03 BPRZ2A    PICTURE X.                                            
           02  BPRZ2I  PIC X(1).                                                
           02  BETR3L    COMP  PIC  S9(4).                                      
           02  BETR3F    PICTURE X.                                             
           02  FILLER REDEFINES BETR3F.                                         
             03 BETR3A    PICTURE X.                                            
           02  BETR3I  PIC X(7).                                                
           02  BPRZ3L    COMP  PIC  S9(4).                                      
           02  BPRZ3F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ3F.                                         
             03 BPRZ3A    PICTURE X.                                            
           02  BPRZ3I  PIC X(1).                                                
           02  ANWVBL    COMP  PIC  S9(4).                                      
           02  ANWVBF    PICTURE X.                                             
           02  FILLER REDEFINES ANWVBF.                                         
             03 ANWVBA    PICTURE X.                                            
           02  ANWVBI  PIC X(7).                                                
           02  ANWPL    COMP  PIC  S9(4).                                       
           02  ANWPF    PICTURE X.                                              
           02  FILLER REDEFINES ANWPF.                                          
             03 ANWPA    PICTURE X.                                             
           02  ANWPI  PIC X(1).                                                 
           02  TSTUFL    COMP  PIC  S9(4).                                      
           02  TSTUFF    PICTURE X.                                             
           02  FILLER REDEFINES TSTUFF.                                         
             03 TSTUFA    PICTURE X.                                            
           02  TSTUFI  PIC X(6).                                                
           02  STUF1L    COMP  PIC  S9(4).                                      
           02  STUF1F    PICTURE X.                                             
           02  FILLER REDEFINES STUF1F.                                         
             03 STUF1A    PICTURE X.                                            
           02  STUF1I  PIC X(4).                                                
           02  STUF2L    COMP  PIC  S9(4).                                      
           02  STUF2F    PICTURE X.                                             
           02  FILLER REDEFINES STUF2F.                                         
             03 STUF2A    PICTURE X.                                            
           02  STUF2I  PIC X(4).                                                
           02  STUF3L    COMP  PIC  S9(4).                                      
           02  STUF3F    PICTURE X.                                             
           02  FILLER REDEFINES STUF3F.                                         
             03 STUF3A    PICTURE X.                                            
           02  STUF3I  PIC X(4).                                                
           02  ANAMAWL    COMP  PIC  S9(4).                                     
           02  ANAMAWF    PICTURE X.                                            
           02  FILLER REDEFINES ANAMAWF.                                        
             03 ANAMAWA    PICTURE X.                                           
           02  ANAMAWI  PIC X(18).                                              
           02  TNAMEL    COMP  PIC  S9(4).                                      
           02  TNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES TNAMEF.                                         
             03 TNAMEA    PICTURE X.                                            
           02  TNAMEI  PIC X(5).                                                
           02  BNAM1L    COMP  PIC  S9(4).                                      
           02  BNAM1F    PICTURE X.                                             
           02  FILLER REDEFINES BNAM1F.                                         
             03 BNAM1A    PICTURE X.                                            
           02  BNAM1I  PIC X(9).                                                
           02  BNAM2L    COMP  PIC  S9(4).                                      
           02  BNAM2F    PICTURE X.                                             
           02  FILLER REDEFINES BNAM2F.                                         
             03 BNAM2A    PICTURE X.                                            
           02  BNAM2I  PIC X(9).                                                
           02  BNAM3L    COMP  PIC  S9(4).                                      
           02  BNAM3F    PICTURE X.                                             
           02  FILLER REDEFINES BNAM3F.                                         
             03 BNAM3A    PICTURE X.                                            
           02  BNAM3I  PIC X(9).                                                
           02  BPROVTL    COMP  PIC  S9(4).                                     
           02  BPROVTF    PICTURE X.                                            
           02  FILLER REDEFINES BPROVTF.                                        
             03 BPROVTA    PICTURE X.                                           
           02  BPROVTI  PIC X(9).                                               
           02  BPROV1L    COMP  PIC  S9(4).                                     
           02  BPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV1F.                                        
             03 BPROV1A    PICTURE X.                                           
           02  BPROV1I  PIC X(5).                                               
           02  BPRKZ1L    COMP  PIC  S9(4).                                     
           02  BPRKZ1F    PICTURE X.                                            
           02  FILLER REDEFINES BPRKZ1F.                                        
             03 BPRKZ1A    PICTURE X.                                           
           02  BPRKZ1I  PIC X(1).                                               
           02  BPROV2L    COMP  PIC  S9(4).                                     
           02  BPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV2F.                                        
             03 BPROV2A    PICTURE X.                                           
           02  BPROV2I  PIC X(5).                                               
           02  BPRKZ2L    COMP  PIC  S9(4).                                     
           02  BPRKZ2F    PICTURE X.                                            
           02  FILLER REDEFINES BPRKZ2F.                                        
             03 BPRKZ2A    PICTURE X.                                           
           02  BPRKZ2I  PIC X(1).                                               
           02  BPROV3L    COMP  PIC  S9(4).                                     
           02  BPROV3F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV3F.                                        
             03 BPROV3A    PICTURE X.                                           
           02  BPROV3I  PIC X(5).                                               
           02  BPRKZ3L    COMP  PIC  S9(4).                                     
           02  BPRKZ3F    PICTURE X.                                            
           02  FILLER REDEFINES BPRKZ3F.                                        
             03 BPRKZ3A    PICTURE X.                                           
           02  BPRKZ3I  PIC X(1).                                               
           02  NVBNR1L    COMP  PIC  S9(4).                                     
           02  NVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES NVBNR1F.                                        
             03 NVBNR1A    PICTURE X.                                           
           02  NVBNR1I  PIC X(7).                                               
           02  NMCODE1L    COMP  PIC  S9(4).                                    
           02  NMCODE1F    PICTURE X.                                           
           02  FILLER REDEFINES NMCODE1F.                                       
             03 NMCODE1A    PICTURE X.                                          
           02  NMCODE1I  PIC X(18).                                             
           02  NTRANS1L    COMP  PIC  S9(4).                                    
           02  NTRANS1F    PICTURE X.                                           
           02  FILLER REDEFINES NTRANS1F.                                       
             03 NTRANS1A    PICTURE X.                                          
           02  NTRANS1I  PIC X(4).                                              
           02  INFO11L    COMP  PIC  S9(4).                                     
           02  INFO11F    PICTURE X.                                            
           02  FILLER REDEFINES INFO11F.                                        
             03 INFO11A    PICTURE X.                                           
           02  INFO11I  PIC X(32).                                              
           02  INFO12L    COMP  PIC  S9(4).                                     
           02  INFO12F    PICTURE X.                                            
           02  FILLER REDEFINES INFO12F.                                        
             03 INFO12A    PICTURE X.                                           
           02  INFO12I  PIC X(44).                                              
           02  INFO13L    COMP  PIC  S9(4).                                     
           02  INFO13F    PICTURE X.                                            
           02  FILLER REDEFINES INFO13F.                                        
             03 INFO13A    PICTURE X.                                           
           02  INFO13I  PIC X(75).                                              
       01  UU913O REDEFINES UU913I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR1O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT1O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR1O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ1O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIR1O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AEDANZO  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANREDTO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANREDO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSLO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMTO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  VORNTO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VORNO  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  STRTO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STRO  PIC X(20).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PLZTO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORTTO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PBTO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  PLZO  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ORTO  PIC X(16).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PB1O  PIC X(3).                                                  
           02  FILLER PICTURE X(3).                                             
           02  TGEFUNO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TELTO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GEFUNO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TELO  PIC X(14).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFAXNR1O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  EDATTO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDAT1O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  EDAT2O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  EDAT3O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  ADATTO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  ADAT1O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  KADAT1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADAT2O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  ADAT3O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  AAUF1O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSGTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSG1O PIC -ZZ.                                                  
           02  FILLER PICTURE X(3).                                             
           02  AUSG2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSG3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VDATTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  VDAT1O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  VDAT2O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  VDAT3O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  PROVRO PIC ZZ9,9.                                                
           02  FILLER PICTURE X(3).                                             
           02  STRUKTO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRUKT1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRUK1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBP1O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STRUK2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBP2O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STRUK3O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBP3O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TSEITO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROVDATO PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  APPROV1O PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPPRV1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APPROV2O PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPPRV2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APPROV3O PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPPRV3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  SCHECKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAPSO  PIC X(13).                                                
           02  FILLER PICTURE X(3).                                             
           02  APS1O PIC ZZ9,9.                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPS1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APS2O PIC ZZ9,9.                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPS2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APS3O PIC ZZ9,9.                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPS3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TTAETO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAET1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  DIREK1O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAET2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  DIREK2O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAET3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  DIREK3O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETRTO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANWVBO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANWPO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TSTUFO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUF1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUF2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUF3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANAMAWO  PIC X(18).                                              
           02  FILLER PICTURE X(3).                                             
           02  TNAMEO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  BNAM1O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  BNAM2O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  BNAM3O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPROVTO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROV1O PIC ZZ9,9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROV2O PIC ZZ9,9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROV3O PIC ZZ9,9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  NVBNR1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  NMCODE1O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  NTRANS1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFO11O  PIC X(32).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFO12O  PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFO13O  PIC X(75).                                              
