       01  UU914I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRHL    COMP  PIC  S9(4).                                       
           02  PNRHF    PICTURE X.                                              
           02  FILLER REDEFINES PNRHF.                                          
             03 PNRHA    PICTURE X.                                             
           02  PNRHI  PIC X(7).                                                 
           02  DATHL    COMP  PIC  S9(4).                                       
           02  DATHF    PICTURE X.                                              
           02  FILLER REDEFINES DATHF.                                          
             03 DATHA    PICTURE X.                                             
           02  DATHI  PIC X(8).                                                 
           02  UHRHL    COMP  PIC  S9(4).                                       
           02  UHRHF    PICTURE X.                                              
           02  FILLER REDEFINES UHRHF.                                          
             03 UHRHA    PICTURE X.                                             
           02  UHRHI  PIC X(5).                                                 
           02  VBNRHL    COMP  PIC  S9(4).                                      
           02  VBNRHF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRHF.                                         
             03 VBNRHA    PICTURE X.                                            
           02  VBNRHI  PIC X(7).                                                
           02  PRZHL    COMP  PIC  S9(4).                                       
           02  PRZHF    PICTURE X.                                              
           02  FILLER REDEFINES PRZHF.                                          
             03 PRZHA    PICTURE X.                                             
           02  PRZHI  PIC X(1).                                                 
           02  DIRHL    COMP  PIC  S9(4).                                       
           02  DIRHF    PICTURE X.                                              
           02  FILLER REDEFINES DIRHF.                                          
             03 DIRHA    PICTURE X.                                             
           02  DIRHI  PIC X(3).                                                 
           02  ANREDTHL    COMP  PIC  S9(4).                                    
           02  ANREDTHF    PICTURE X.                                           
           02  FILLER REDEFINES ANREDTHF.                                       
             03 ANREDTHA    PICTURE X.                                          
           02  ANREDTHI  PIC X(6).                                              
           02  AUSLTHL    COMP  PIC  S9(4).                                     
           02  AUSLTHF    PICTURE X.                                            
           02  FILLER REDEFINES AUSLTHF.                                        
             03 AUSLTHA    PICTURE X.                                           
           02  AUSLTHI  PIC X(9).                                               
           02  ANREDHL    COMP  PIC  S9(4).                                     
           02  ANREDHF    PICTURE X.                                            
           02  FILLER REDEFINES ANREDHF.                                        
             03 ANREDHA    PICTURE X.                                           
           02  ANREDHI  PIC X(9).                                               
           02  AUSLHL    COMP  PIC  S9(4).                                      
           02  AUSLHF    PICTURE X.                                             
           02  FILLER REDEFINES AUSLHF.                                         
             03 AUSLHA    PICTURE X.                                            
           02  AUSLHI  PIC X(3).                                                
           02  ZUNAMTHL    COMP  PIC  S9(4).                                    
           02  ZUNAMTHF    PICTURE X.                                           
           02  FILLER REDEFINES ZUNAMTHF.                                       
             03 ZUNAMTHA    PICTURE X.                                          
           02  ZUNAMTHI  PIC X(6).                                              
           02  ZUNAMHL    COMP  PIC  S9(4).                                     
           02  ZUNAMHF    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAMHF.                                        
             03 ZUNAMHA    PICTURE X.                                           
           02  ZUNAMHI  PIC X(20).                                              
           02  VORNTHL    COMP  PIC  S9(4).                                     
           02  VORNTHF    PICTURE X.                                            
           02  FILLER REDEFINES VORNTHF.                                        
             03 VORNTHA    PICTURE X.                                           
           02  VORNTHI  PIC X(7).                                               
           02  VORNHL    COMP  PIC  S9(4).                                      
           02  VORNHF    PICTURE X.                                             
           02  FILLER REDEFINES VORNHF.                                         
             03 VORNHA    PICTURE X.                                            
           02  VORNHI  PIC X(20).                                               
           02  STRTHL    COMP  PIC  S9(4).                                      
           02  STRTHF    PICTURE X.                                             
           02  FILLER REDEFINES STRTHF.                                         
             03 STRTHA    PICTURE X.                                            
           02  STRTHI  PIC X(7).                                                
           02  STRHL    COMP  PIC  S9(4).                                       
           02  STRHF    PICTURE X.                                              
           02  FILLER REDEFINES STRHF.                                          
             03 STRHA    PICTURE X.                                             
           02  STRHI  PIC X(20).                                                
           02  PLZTHL    COMP  PIC  S9(4).                                      
           02  PLZTHF    PICTURE X.                                             
           02  FILLER REDEFINES PLZTHF.                                         
             03 PLZTHA    PICTURE X.                                            
           02  PLZTHI  PIC X(3).                                                
           02  ORTTHL    COMP  PIC  S9(4).                                      
           02  ORTTHF    PICTURE X.                                             
           02  FILLER REDEFINES ORTTHF.                                         
             03 ORTTHA    PICTURE X.                                            
           02  ORTTHI  PIC X(7).                                                
           02  PBTHL    COMP  PIC  S9(4).                                       
           02  PBTHF    PICTURE X.                                              
           02  FILLER REDEFINES PBTHF.                                          
             03 PBTHA    PICTURE X.                                             
           02  PBTHI  PIC X(5).                                                 
           02  PLZHL    COMP  PIC  S9(4).                                       
           02  PLZHF    PICTURE X.                                              
           02  FILLER REDEFINES PLZHF.                                          
             03 PLZHA    PICTURE X.                                             
           02  PLZHI  PIC X(6).                                                 
           02  ORTHL    COMP  PIC  S9(4).                                       
           02  ORTHF    PICTURE X.                                              
           02  FILLER REDEFINES ORTHF.                                          
             03 ORTHA    PICTURE X.                                             
           02  ORTHI  PIC X(16).                                                
           02  PB1HL    COMP  PIC  S9(4).                                       
           02  PB1HF    PICTURE X.                                              
           02  FILLER REDEFINES PB1HF.                                          
             03 PB1HA    PICTURE X.                                             
           02  PB1HI  PIC X(3).                                                 
           02  VDATTHL    COMP  PIC  S9(4).                                     
           02  VDATTHF    PICTURE X.                                            
           02  FILLER REDEFINES VDATTHF.                                        
             03 VDATTHA    PICTURE X.                                           
           02  VDATTHI  PIC X(9).                                               
           02  VDAT1HL    COMP  PIC  S9(4).                                     
           02  VDAT1HF    PICTURE X.                                            
           02  FILLER REDEFINES VDAT1HF.                                        
             03 VDAT1HA    PICTURE X.                                           
           02  VDAT1HI  PIC X(8).                                               
           02  VDAT2HL    COMP  PIC  S9(4).                                     
           02  VDAT2HF    PICTURE X.                                            
           02  FILLER REDEFINES VDAT2HF.                                        
             03 VDAT2HA    PICTURE X.                                           
           02  VDAT2HI  PIC X(8).                                               
           02  VDAT3HL    COMP  PIC  S9(4).                                     
           02  VDAT3HF    PICTURE X.                                            
           02  FILLER REDEFINES VDAT3HF.                                        
             03 VDAT3HA    PICTURE X.                                           
           02  VDAT3HI  PIC X(8).                                               
           02  STRUKTHL    COMP  PIC  S9(4).                                    
           02  STRUKTHF    PICTURE X.                                           
           02  FILLER REDEFINES STRUKTHF.                                       
             03 STRUKTHA    PICTURE X.                                          
           02  STRUKTHI  PIC X(11).                                             
           02  STRUT1HL    COMP  PIC  S9(4).                                    
           02  STRUT1HF    PICTURE X.                                           
           02  FILLER REDEFINES STRUT1HF.                                       
             03 STRUT1HA    PICTURE X.                                          
           02  STRUT1HI  PIC X(3).                                              
           02  STRUK1HL    COMP  PIC  S9(4).                                    
           02  STRUK1HF    PICTURE X.                                           
           02  FILLER REDEFINES STRUK1HF.                                       
             03 STRUK1HA    PICTURE X.                                          
           02  STRUK1HI  PIC X(4).                                              
           02  VBP1HL    COMP  PIC  S9(4).                                      
           02  VBP1HF    PICTURE X.                                             
           02  FILLER REDEFINES VBP1HF.                                         
             03 VBP1HA    PICTURE X.                                            
           02  VBP1HI  PIC X(2).                                                
           02  STRUK2HL    COMP  PIC  S9(4).                                    
           02  STRUK2HF    PICTURE X.                                           
           02  FILLER REDEFINES STRUK2HF.                                       
             03 STRUK2HA    PICTURE X.                                          
           02  STRUK2HI  PIC X(4).                                              
           02  VBP2HL    COMP  PIC  S9(4).                                      
           02  VBP2HF    PICTURE X.                                             
           02  FILLER REDEFINES VBP2HF.                                         
             03 VBP2HA    PICTURE X.                                            
           02  VBP2HI  PIC X(2).                                                
           02  STRUK3HL    COMP  PIC  S9(4).                                    
           02  STRUK3HF    PICTURE X.                                           
           02  FILLER REDEFINES STRUK3HF.                                       
             03 STRUK3HA    PICTURE X.                                          
           02  STRUK3HI  PIC X(4).                                              
           02  VBP3HL    COMP  PIC  S9(4).                                      
           02  VBP3HF    PICTURE X.                                             
           02  FILLER REDEFINES VBP3HF.                                         
             03 VBP3HA    PICTURE X.                                            
           02  VBP3HI  PIC X(2).                                                
           02  APPROH1L    COMP  PIC  S9(4).                                    
           02  APPROH1F    PICTURE X.                                           
           02  FILLER REDEFINES APPROH1F.                                       
             03 APPROH1A    PICTURE X.                                          
           02  APPROH1I  PIC X(5).                                              
           02  TAPPRH1L    COMP  PIC  S9(4).                                    
           02  TAPPRH1F    PICTURE X.                                           
           02  FILLER REDEFINES TAPPRH1F.                                       
             03 TAPPRH1A    PICTURE X.                                          
           02  TAPPRH1I  PIC X(1).                                              
           02  APPROH2L    COMP  PIC  S9(4).                                    
           02  APPROH2F    PICTURE X.                                           
           02  FILLER REDEFINES APPROH2F.                                       
             03 APPROH2A    PICTURE X.                                          
           02  APPROH2I  PIC X(5).                                              
           02  TAPPRH2L    COMP  PIC  S9(4).                                    
           02  TAPPRH2F    PICTURE X.                                           
           02  FILLER REDEFINES TAPPRH2F.                                       
             03 TAPPRH2A    PICTURE X.                                          
           02  TAPPRH2I  PIC X(1).                                              
           02  APPROH3L    COMP  PIC  S9(4).                                    
           02  APPROH3F    PICTURE X.                                           
           02  FILLER REDEFINES APPROH3F.                                       
             03 APPROH3A    PICTURE X.                                          
           02  APPROH3I  PIC X(5).                                              
           02  TAPPRH3L    COMP  PIC  S9(4).                                    
           02  TAPPRH3F    PICTURE X.                                           
           02  FILLER REDEFINES TAPPRH3F.                                       
             03 TAPPRH3A    PICTURE X.                                          
           02  TAPPRH3I  PIC X(1).                                              
           02  TAPSHL    COMP  PIC  S9(4).                                      
           02  TAPSHF    PICTURE X.                                             
           02  FILLER REDEFINES TAPSHF.                                         
             03 TAPSHA    PICTURE X.                                            
           02  TAPSHI  PIC X(13).                                               
           02  APS1HL    COMP  PIC  S9(4).                                      
           02  APS1HF    PICTURE X.                                             
           02  FILLER REDEFINES APS1HF.                                         
             03 APS1HA    PICTURE X.                                            
           02  APS1HI  PIC X(5).                                                
           02  TAPS1HL    COMP  PIC  S9(4).                                     
           02  TAPS1HF    PICTURE X.                                            
           02  FILLER REDEFINES TAPS1HF.                                        
             03 TAPS1HA    PICTURE X.                                           
           02  TAPS1HI  PIC X(1).                                               
           02  APS2HL    COMP  PIC  S9(4).                                      
           02  APS2HF    PICTURE X.                                             
           02  FILLER REDEFINES APS2HF.                                         
             03 APS2HA    PICTURE X.                                            
           02  APS2HI  PIC X(5).                                                
           02  TAPS2HL    COMP  PIC  S9(4).                                     
           02  TAPS2HF    PICTURE X.                                            
           02  FILLER REDEFINES TAPS2HF.                                        
             03 TAPS2HA    PICTURE X.                                           
           02  TAPS2HI  PIC X(1).                                               
           02  APS3HL    COMP  PIC  S9(4).                                      
           02  APS3HF    PICTURE X.                                             
           02  FILLER REDEFINES APS3HF.                                         
             03 APS3HA    PICTURE X.                                            
           02  APS3HI  PIC X(5).                                                
           02  TAPS3HL    COMP  PIC  S9(4).                                     
           02  TAPS3HF    PICTURE X.                                            
           02  FILLER REDEFINES TAPS3HF.                                        
             03 TAPS3HA    PICTURE X.                                           
           02  TAPS3HI  PIC X(1).                                               
           02  TTAETHL    COMP  PIC  S9(4).                                     
           02  TTAETHF    PICTURE X.                                            
           02  FILLER REDEFINES TTAETHF.                                        
             03 TTAETHA    PICTURE X.                                           
           02  TTAETHI  PIC X(6).                                               
           02  TAET1HL    COMP  PIC  S9(4).                                     
           02  TAET1HF    PICTURE X.                                            
           02  FILLER REDEFINES TAET1HF.                                        
             03 TAET1HA    PICTURE X.                                           
           02  TAET1HI  PIC X(4).                                               
           02  DIREK1HL    COMP  PIC  S9(4).                                    
           02  DIREK1HF    PICTURE X.                                           
           02  FILLER REDEFINES DIREK1HF.                                       
             03 DIREK1HA    PICTURE X.                                          
           02  DIREK1HI  PIC X(3).                                              
           02  TAET2HL    COMP  PIC  S9(4).                                     
           02  TAET2HF    PICTURE X.                                            
           02  FILLER REDEFINES TAET2HF.                                        
             03 TAET2HA    PICTURE X.                                           
           02  TAET2HI  PIC X(4).                                               
           02  DIREK2HL    COMP  PIC  S9(4).                                    
           02  DIREK2HF    PICTURE X.                                           
           02  FILLER REDEFINES DIREK2HF.                                       
             03 DIREK2HA    PICTURE X.                                          
           02  DIREK2HI  PIC X(3).                                              
           02  TAET3HL    COMP  PIC  S9(4).                                     
           02  TAET3HF    PICTURE X.                                            
           02  FILLER REDEFINES TAET3HF.                                        
             03 TAET3HA    PICTURE X.                                           
           02  TAET3HI  PIC X(4).                                               
           02  DIREK3HL    COMP  PIC  S9(4).                                    
           02  DIREK3HF    PICTURE X.                                           
           02  FILLER REDEFINES DIREK3HF.                                       
             03 DIREK3HA    PICTURE X.                                          
           02  DIREK3HI  PIC X(3).                                              
           02  BETRTHL    COMP  PIC  S9(4).                                     
           02  BETRTHF    PICTURE X.                                            
           02  FILLER REDEFINES BETRTHF.                                        
             03 BETRTHA    PICTURE X.                                           
           02  BETRTHI  PIC X(13).                                              
           02  BETR1HL    COMP  PIC  S9(4).                                     
           02  BETR1HF    PICTURE X.                                            
           02  FILLER REDEFINES BETR1HF.                                        
             03 BETR1HA    PICTURE X.                                           
           02  BETR1HI  PIC X(7).                                               
           02  BPRZ1HL    COMP  PIC  S9(4).                                     
           02  BPRZ1HF    PICTURE X.                                            
           02  FILLER REDEFINES BPRZ1HF.                                        
             03 BPRZ1HA    PICTURE X.                                           
           02  BPRZ1HI  PIC X(1).                                               
           02  BETR2HL    COMP  PIC  S9(4).                                     
           02  BETR2HF    PICTURE X.                                            
           02  FILLER REDEFINES BETR2HF.                                        
             03 BETR2HA    PICTURE X.                                           
           02  BETR2HI  PIC X(7).                                               
           02  BPRZ2HL    COMP  PIC  S9(4).                                     
           02  BPRZ2HF    PICTURE X.                                            
           02  FILLER REDEFINES BPRZ2HF.                                        
             03 BPRZ2HA    PICTURE X.                                           
           02  BPRZ2HI  PIC X(1).                                               
           02  BETR3HL    COMP  PIC  S9(4).                                     
           02  BETR3HF    PICTURE X.                                            
           02  FILLER REDEFINES BETR3HF.                                        
             03 BETR3HA    PICTURE X.                                           
           02  BETR3HI  PIC X(7).                                               
           02  BPRZ3HL    COMP  PIC  S9(4).                                     
           02  BPRZ3HF    PICTURE X.                                            
           02  FILLER REDEFINES BPRZ3HF.                                        
             03 BPRZ3HA    PICTURE X.                                           
           02  BPRZ3HI  PIC X(1).                                               
           02  TSTUFHL    COMP  PIC  S9(4).                                     
           02  TSTUFHF    PICTURE X.                                            
           02  FILLER REDEFINES TSTUFHF.                                        
             03 TSTUFHA    PICTURE X.                                           
           02  TSTUFHI  PIC X(6).                                               
           02  STUF1HL    COMP  PIC  S9(4).                                     
           02  STUF1HF    PICTURE X.                                            
           02  FILLER REDEFINES STUF1HF.                                        
             03 STUF1HA    PICTURE X.                                           
           02  STUF1HI  PIC X(4).                                               
           02  STUF2HL    COMP  PIC  S9(4).                                     
           02  STUF2HF    PICTURE X.                                            
           02  FILLER REDEFINES STUF2HF.                                        
             03 STUF2HA    PICTURE X.                                           
           02  STUF2HI  PIC X(4).                                               
           02  STUF3HL    COMP  PIC  S9(4).                                     
           02  STUF3HF    PICTURE X.                                            
           02  FILLER REDEFINES STUF3HF.                                        
             03 STUF3HA    PICTURE X.                                           
           02  STUF3HI  PIC X(4).                                               
           02  TNAMEHL    COMP  PIC  S9(4).                                     
           02  TNAMEHF    PICTURE X.                                            
           02  FILLER REDEFINES TNAMEHF.                                        
             03 TNAMEHA    PICTURE X.                                           
           02  TNAMEHI  PIC X(5).                                               
           02  BNAM1HL    COMP  PIC  S9(4).                                     
           02  BNAM1HF    PICTURE X.                                            
           02  FILLER REDEFINES BNAM1HF.                                        
             03 BNAM1HA    PICTURE X.                                           
           02  BNAM1HI  PIC X(9).                                               
           02  BNAM2HL    COMP  PIC  S9(4).                                     
           02  BNAM2HF    PICTURE X.                                            
           02  FILLER REDEFINES BNAM2HF.                                        
             03 BNAM2HA    PICTURE X.                                           
           02  BNAM2HI  PIC X(9).                                               
           02  BNAM3HL    COMP  PIC  S9(4).                                     
           02  BNAM3HF    PICTURE X.                                            
           02  FILLER REDEFINES BNAM3HF.                                        
             03 BNAM3HA    PICTURE X.                                           
           02  BNAM3HI  PIC X(9).                                               
           02  BPROVTHL    COMP  PIC  S9(4).                                    
           02  BPROVTHF    PICTURE X.                                           
           02  FILLER REDEFINES BPROVTHF.                                       
             03 BPROVTHA    PICTURE X.                                          
           02  BPROVTHI  PIC X(9).                                              
           02  BPROV1HL    COMP  PIC  S9(4).                                    
           02  BPROV1HF    PICTURE X.                                           
           02  FILLER REDEFINES BPROV1HF.                                       
             03 BPROV1HA    PICTURE X.                                          
           02  BPROV1HI  PIC X(5).                                              
           02  BPRKZ1HL    COMP  PIC  S9(4).                                    
           02  BPRKZ1HF    PICTURE X.                                           
           02  FILLER REDEFINES BPRKZ1HF.                                       
             03 BPRKZ1HA    PICTURE X.                                          
           02  BPRKZ1HI  PIC X(1).                                              
           02  BPROV2HL    COMP  PIC  S9(4).                                    
           02  BPROV2HF    PICTURE X.                                           
           02  FILLER REDEFINES BPROV2HF.                                       
             03 BPROV2HA    PICTURE X.                                          
           02  BPROV2HI  PIC X(5).                                              
           02  BPRKZ2HL    COMP  PIC  S9(4).                                    
           02  BPRKZ2HF    PICTURE X.                                           
           02  FILLER REDEFINES BPRKZ2HF.                                       
             03 BPRKZ2HA    PICTURE X.                                          
           02  BPRKZ2HI  PIC X(1).                                              
           02  BPROV3HL    COMP  PIC  S9(4).                                    
           02  BPROV3HF    PICTURE X.                                           
           02  FILLER REDEFINES BPROV3HF.                                       
             03 BPROV3HA    PICTURE X.                                          
           02  BPROV3HI  PIC X(5).                                              
           02  BPRKZ3HL    COMP  PIC  S9(4).                                    
           02  BPRKZ3HF    PICTURE X.                                           
           02  FILLER REDEFINES BPRKZ3HF.                                       
             03 BPRKZ3HA    PICTURE X.                                          
           02  BPRKZ3HI  PIC X(1).                                              
           02  NVBNRHL    COMP  PIC  S9(4).                                     
           02  NVBNRHF    PICTURE X.                                            
           02  FILLER REDEFINES NVBNRHF.                                        
             03 NVBNRHA    PICTURE X.                                           
           02  NVBNRHI  PIC X(7).                                               
           02  NMCODEHL    COMP  PIC  S9(4).                                    
           02  NMCODEHF    PICTURE X.                                           
           02  FILLER REDEFINES NMCODEHF.                                       
             03 NMCODEHA    PICTURE X.                                          
           02  NMCODEHI  PIC X(18).                                             
           02  NTRANSHL    COMP  PIC  S9(4).                                    
           02  NTRANSHF    PICTURE X.                                           
           02  FILLER REDEFINES NTRANSHF.                                       
             03 NTRANSHA    PICTURE X.                                          
           02  NTRANSHI  PIC X(4).                                              
           02  INFOH1L    COMP  PIC  S9(4).                                     
           02  INFOH1F    PICTURE X.                                            
           02  FILLER REDEFINES INFOH1F.                                        
             03 INFOH1A    PICTURE X.                                           
           02  INFOH1I  PIC X(32).                                              
           02  INFOH2L    COMP  PIC  S9(4).                                     
           02  INFOH2F    PICTURE X.                                            
           02  FILLER REDEFINES INFOH2F.                                        
             03 INFOH2A    PICTURE X.                                           
           02  INFOH2I  PIC X(44).                                              
           02  INFOH3L    COMP  PIC  S9(4).                                     
           02  INFOH3F    PICTURE X.                                            
           02  FILLER REDEFINES INFOH3F.                                        
             03 INFOH3A    PICTURE X.                                           
           02  INFOH3I  PIC X(75).                                              
       01  UU914O REDEFINES UU914I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRHO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATHO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHRHO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNRHO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZHO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIRHO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANREDTHO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSLTHO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREDHO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLHO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMTHO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMHO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VORNTHO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VORNHO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  STRTHO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  STRHO  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZTHO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  ORTTHO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PBTHO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PLZHO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORTHO  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  PB1HO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VDATTHO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  VDAT1HO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VDAT2HO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VDAT3HO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  STRUKTHO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  STRUT1HO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRUK1HO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBP1HO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  STRUK2HO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBP2HO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  STRUK3HO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBP3HO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  APPROH1O PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPPRH1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APPROH2O PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPPRH2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APPROH3O PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPPRH3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAPSHO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  APS1HO PIC ZZ9,9.                                                
           02  FILLER PICTURE X(3).                                             
           02  TAPS1HO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APS2HO PIC ZZ9,9.                                                
           02  FILLER PICTURE X(3).                                             
           02  TAPS2HO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APS3HO PIC ZZ9,9.                                                
           02  FILLER PICTURE X(3).                                             
           02  TAPS3HO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TTAETHO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAET1HO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIREK1HO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAET2HO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIREK2HO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAET3HO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIREK3HO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  BETRTHO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  BETR1HO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRZ1HO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR2HO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRZ2HO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR3HO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRZ3HO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTUFHO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF1HO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF2HO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF3HO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  TNAMEHO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAM1HO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAM2HO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAM3HO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROVTHO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  BPROV1HO PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ1HO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  BPROV2HO PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ2HO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  BPROV3HO PIC ZZ9,9.                                              
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ3HO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  NVBNRHO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  NMCODEHO  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  NTRANSHO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFOH1O  PIC X(32).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFOH2O  PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFOH3O  PIC X(75).                                              
