       01  UU912I.                                                              
           02  FILLER PIC X(12).                                                
           02  AWPNRL    COMP  PIC  S9(4).                                      
           02  AWPNRF    PICTURE X.                                             
           02  FILLER REDEFINES AWPNRF.                                         
             03 AWPNRA    PICTURE X.                                            
           02  AWPNRI  PIC X(7).                                                
           02  AWDATL    COMP  PIC  S9(4).                                      
           02  AWDATF    PICTURE X.                                             
           02  FILLER REDEFINES AWDATF.                                         
             03 AWDATA    PICTURE X.                                            
           02  AWDATI  PIC X(8).                                                
           02  AWUHRL    COMP  PIC  S9(4).                                      
           02  AWUHRF    PICTURE X.                                             
           02  FILLER REDEFINES AWUHRF.                                         
             03 AWUHRA    PICTURE X.                                            
           02  AWUHRI  PIC X(5).                                                
           02  AWTRAN1L    COMP  PIC  S9(4).                                    
           02  AWTRAN1F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN1F.                                       
             03 AWTRAN1A    PICTURE X.                                          
           02  AWTRAN1I  PIC X(4).                                              
           02  AWBEZ1L    COMP  PIC  S9(4).                                     
           02  AWBEZ1F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ1F.                                        
             03 AWBEZ1A    PICTURE X.                                           
           02  AWBEZ1I  PIC X(45).                                              
           02  AWSTAT1L    COMP  PIC  S9(4).                                    
           02  AWSTAT1F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT1F.                                       
             03 AWSTAT1A    PICTURE X.                                          
           02  AWSTAT1I  PIC X(12).                                             
           02  AWTRAN2L    COMP  PIC  S9(4).                                    
           02  AWTRAN2F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN2F.                                       
             03 AWTRAN2A    PICTURE X.                                          
           02  AWTRAN2I  PIC X(4).                                              
           02  AWBEZ2L    COMP  PIC  S9(4).                                     
           02  AWBEZ2F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ2F.                                        
             03 AWBEZ2A    PICTURE X.                                           
           02  AWBEZ2I  PIC X(45).                                              
           02  AWSTAT2L    COMP  PIC  S9(4).                                    
           02  AWSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT2F.                                       
             03 AWSTAT2A    PICTURE X.                                          
           02  AWSTAT2I  PIC X(12).                                             
           02  AWTRAN3L    COMP  PIC  S9(4).                                    
           02  AWTRAN3F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN3F.                                       
             03 AWTRAN3A    PICTURE X.                                          
           02  AWTRAN3I  PIC X(4).                                              
           02  AWBEZ3L    COMP  PIC  S9(4).                                     
           02  AWBEZ3F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ3F.                                        
             03 AWBEZ3A    PICTURE X.                                           
           02  AWBEZ3I  PIC X(45).                                              
           02  AWSTAT3L    COMP  PIC  S9(4).                                    
           02  AWSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT3F.                                       
             03 AWSTAT3A    PICTURE X.                                          
           02  AWSTAT3I  PIC X(12).                                             
           02  AWTRAN4L    COMP  PIC  S9(4).                                    
           02  AWTRAN4F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN4F.                                       
             03 AWTRAN4A    PICTURE X.                                          
           02  AWTRAN4I  PIC X(4).                                              
           02  AWBEZ4L    COMP  PIC  S9(4).                                     
           02  AWBEZ4F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ4F.                                        
             03 AWBEZ4A    PICTURE X.                                           
           02  AWBEZ4I  PIC X(45).                                              
           02  AWSTAT4L    COMP  PIC  S9(4).                                    
           02  AWSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT4F.                                       
             03 AWSTAT4A    PICTURE X.                                          
           02  AWSTAT4I  PIC X(12).                                             
           02  AWTRAN5L    COMP  PIC  S9(4).                                    
           02  AWTRAN5F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN5F.                                       
             03 AWTRAN5A    PICTURE X.                                          
           02  AWTRAN5I  PIC X(4).                                              
           02  AWBEZ5L    COMP  PIC  S9(4).                                     
           02  AWBEZ5F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ5F.                                        
             03 AWBEZ5A    PICTURE X.                                           
           02  AWBEZ5I  PIC X(45).                                              
           02  AWSTAT5L    COMP  PIC  S9(4).                                    
           02  AWSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT5F.                                       
             03 AWSTAT5A    PICTURE X.                                          
           02  AWSTAT5I  PIC X(12).                                             
           02  AWTRAN6L    COMP  PIC  S9(4).                                    
           02  AWTRAN6F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN6F.                                       
             03 AWTRAN6A    PICTURE X.                                          
           02  AWTRAN6I  PIC X(4).                                              
           02  AWBEZ6L    COMP  PIC  S9(4).                                     
           02  AWBEZ6F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ6F.                                        
             03 AWBEZ6A    PICTURE X.                                           
           02  AWBEZ6I  PIC X(45).                                              
           02  AWSTAT6L    COMP  PIC  S9(4).                                    
           02  AWSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT6F.                                       
             03 AWSTAT6A    PICTURE X.                                          
           02  AWSTAT6I  PIC X(12).                                             
           02  AWTRAN7L    COMP  PIC  S9(4).                                    
           02  AWTRAN7F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN7F.                                       
             03 AWTRAN7A    PICTURE X.                                          
           02  AWTRAN7I  PIC X(4).                                              
           02  AWBEZ7L    COMP  PIC  S9(4).                                     
           02  AWBEZ7F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ7F.                                        
             03 AWBEZ7A    PICTURE X.                                           
           02  AWBEZ7I  PIC X(45).                                              
           02  AWSTAT7L    COMP  PIC  S9(4).                                    
           02  AWSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT7F.                                       
             03 AWSTAT7A    PICTURE X.                                          
           02  AWSTAT7I  PIC X(12).                                             
           02  AWTRAN8L    COMP  PIC  S9(4).                                    
           02  AWTRAN8F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN8F.                                       
             03 AWTRAN8A    PICTURE X.                                          
           02  AWTRAN8I  PIC X(4).                                              
           02  AWBEZ8L    COMP  PIC  S9(4).                                     
           02  AWBEZ8F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ8F.                                        
             03 AWBEZ8A    PICTURE X.                                           
           02  AWBEZ8I  PIC X(45).                                              
           02  AWSTAT8L    COMP  PIC  S9(4).                                    
           02  AWSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT8F.                                       
             03 AWSTAT8A    PICTURE X.                                          
           02  AWSTAT8I  PIC X(12).                                             
           02  AWTRAN9L    COMP  PIC  S9(4).                                    
           02  AWTRAN9F    PICTURE X.                                           
           02  FILLER REDEFINES AWTRAN9F.                                       
             03 AWTRAN9A    PICTURE X.                                          
           02  AWTRAN9I  PIC X(4).                                              
           02  AWBEZ9L    COMP  PIC  S9(4).                                     
           02  AWBEZ9F    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZ9F.                                        
             03 AWBEZ9A    PICTURE X.                                           
           02  AWBEZ9I  PIC X(45).                                              
           02  AWSTAT9L    COMP  PIC  S9(4).                                    
           02  AWSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AWSTAT9F.                                       
             03 AWSTAT9A    PICTURE X.                                          
           02  AWSTAT9I  PIC X(12).                                             
           02  AWTRANAL    COMP  PIC  S9(4).                                    
           02  AWTRANAF    PICTURE X.                                           
           02  FILLER REDEFINES AWTRANAF.                                       
             03 AWTRANAA    PICTURE X.                                          
           02  AWTRANAI  PIC X(4).                                              
           02  AWBEZAL    COMP  PIC  S9(4).                                     
           02  AWBEZAF    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZAF.                                        
             03 AWBEZAA    PICTURE X.                                           
           02  AWBEZAI  PIC X(45).                                              
           02  AWSTATAL    COMP  PIC  S9(4).                                    
           02  AWSTATAF    PICTURE X.                                           
           02  FILLER REDEFINES AWSTATAF.                                       
             03 AWSTATAA    PICTURE X.                                          
           02  AWSTATAI  PIC X(12).                                             
           02  AWTRANBL    COMP  PIC  S9(4).                                    
           02  AWTRANBF    PICTURE X.                                           
           02  FILLER REDEFINES AWTRANBF.                                       
             03 AWTRANBA    PICTURE X.                                          
           02  AWTRANBI  PIC X(4).                                              
           02  AWBEZBL    COMP  PIC  S9(4).                                     
           02  AWBEZBF    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZBF.                                        
             03 AWBEZBA    PICTURE X.                                           
           02  AWBEZBI  PIC X(45).                                              
           02  AWSTATBL    COMP  PIC  S9(4).                                    
           02  AWSTATBF    PICTURE X.                                           
           02  FILLER REDEFINES AWSTATBF.                                       
             03 AWSTATBA    PICTURE X.                                          
           02  AWSTATBI  PIC X(12).                                             
           02  AWTRANCL    COMP  PIC  S9(4).                                    
           02  AWTRANCF    PICTURE X.                                           
           02  FILLER REDEFINES AWTRANCF.                                       
             03 AWTRANCA    PICTURE X.                                          
           02  AWTRANCI  PIC X(4).                                              
           02  AWBEZCL    COMP  PIC  S9(4).                                     
           02  AWBEZCF    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZCF.                                        
             03 AWBEZCA    PICTURE X.                                           
           02  AWBEZCI  PIC X(45).                                              
           02  AWSTATCL    COMP  PIC  S9(4).                                    
           02  AWSTATCF    PICTURE X.                                           
           02  FILLER REDEFINES AWSTATCF.                                       
             03 AWSTATCA    PICTURE X.                                          
           02  AWSTATCI  PIC X(12).                                             
           02  AWTRANDL    COMP  PIC  S9(4).                                    
           02  AWTRANDF    PICTURE X.                                           
           02  FILLER REDEFINES AWTRANDF.                                       
             03 AWTRANDA    PICTURE X.                                          
           02  AWTRANDI  PIC X(4).                                              
           02  AWBEZDL    COMP  PIC  S9(4).                                     
           02  AWBEZDF    PICTURE X.                                            
           02  FILLER REDEFINES AWBEZDF.                                        
             03 AWBEZDA    PICTURE X.                                           
           02  AWBEZDI  PIC X(45).                                              
           02  AWSTATDL    COMP  PIC  S9(4).                                    
           02  AWSTATDF    PICTURE X.                                           
           02  FILLER REDEFINES AWSTATDF.                                       
             03 AWSTATDA    PICTURE X.                                          
           02  AWSTATDI  PIC X(12).                                             
           02  INTRANSL    COMP  PIC  S9(4).                                    
           02  INTRANSF    PICTURE X.                                           
           02  FILLER REDEFINES INTRANSF.                                       
             03 INTRANSA    PICTURE X.                                          
           02  INTRANSI  PIC X(4).                                              
           02  INOBL    COMP  PIC  S9(4).                                       
           02  INOBF    PICTURE X.                                              
           02  FILLER REDEFINES INOBF.                                          
             03 INOBA    PICTURE X.                                             
           02  INOBI  PIC X(32).                                                
           02  AWFEHLL    COMP  PIC  S9(4).                                     
           02  AWFEHLF    PICTURE X.                                            
           02  FILLER REDEFINES AWFEHLF.                                        
             03 AWFEHLA    PICTURE X.                                           
           02  AWFEHLI  PIC X(79).                                              
       01  UU912O REDEFINES UU912I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AWPNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AWDATO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AWUHRO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ1O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT1O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ2O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT2O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ3O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT3O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ4O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT4O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ5O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT5O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ6O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT6O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ7O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT7O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ8O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT8O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRAN9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZ9O  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTAT9O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRANAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZAO  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTATAO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRANBO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZBO  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTATBO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRANCO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZCO  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTATCO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWTRANDO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWBEZDO  PIC X(45).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWSTATDO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  INTRANSO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  INOBO  PIC X(32).                                                
           02  FILLER PICTURE X(3).                                             
           02  AWFEHLO  PIC X(79).                                              
