       01  UU915I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR1L    COMP  PIC  S9(4).                                       
           02  PNR1F    PICTURE X.                                              
           02  FILLER REDEFINES PNR1F.                                          
             03 PNR1A    PICTURE X.                                             
           02  PNR1I  PIC X(7).                                                 
           02  DAT1L    COMP  PIC  S9(4).                                       
           02  DAT1F    PICTURE X.                                              
           02  FILLER REDEFINES DAT1F.                                          
             03 DAT1A    PICTURE X.                                             
           02  DAT1I  PIC X(8).                                                 
           02  UHR1L    COMP  PIC  S9(4).                                       
           02  UHR1F    PICTURE X.                                              
           02  FILLER REDEFINES UHR1F.                                          
             03 UHR1A    PICTURE X.                                             
           02  UHR1I  PIC X(5).                                                 
           02  VBNR1L    COMP  PIC  S9(4).                                      
           02  VBNR1F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR1F.                                         
             03 VBNR1A    PICTURE X.                                            
           02  VBNR1I  PIC X(7).                                                
           02  PRZL    COMP  PIC  S9(4).                                        
           02  PRZF    PICTURE X.                                               
           02  FILLER REDEFINES PRZF.                                           
             03 PRZA    PICTURE X.                                              
           02  PRZI  PIC X(1).                                                  
           02  DIR1L    COMP  PIC  S9(4).                                       
           02  DIR1F    PICTURE X.                                              
           02  FILLER REDEFINES DIR1F.                                          
             03 DIR1A    PICTURE X.                                             
           02  DIR1I  PIC X(3).                                                 
           02  TWVBNRL    COMP  PIC  S9(4).                                     
           02  TWVBNRF    PICTURE X.                                            
           02  FILLER REDEFINES TWVBNRF.                                        
             03 TWVBNRA    PICTURE X.                                           
           02  TWVBNRI  PIC X(17).                                              
           02  WVBNRL    COMP  PIC  S9(4).                                      
           02  WVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES WVBNRF.                                         
             03 WVBNRA    PICTURE X.                                            
           02  WVBNRI  PIC X(7).                                                
           02  WVBPRZL    COMP  PIC  S9(4).                                     
           02  WVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES WVBPRZF.                                        
             03 WVBPRZA    PICTURE X.                                           
           02  WVBPRZI  PIC X(1).                                               
           02  TANRL    COMP  PIC  S9(4).                                       
           02  TANRF    PICTURE X.                                              
           02  FILLER REDEFINES TANRF.                                          
             03 TANRA    PICTURE X.                                             
           02  TANRI  PIC X(6).                                                 
           02  TAUSLL    COMP  PIC  S9(4).                                      
           02  TAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES TAUSLF.                                         
             03 TAUSLA    PICTURE X.                                            
           02  TAUSLI  PIC X(9).                                                
           02  ANREDEL    COMP  PIC  S9(4).                                     
           02  ANREDEF    PICTURE X.                                            
           02  FILLER REDEFINES ANREDEF.                                        
             03 ANREDEA    PICTURE X.                                           
           02  ANREDEI  PIC X(9).                                               
           02  AUSLL    COMP  PIC  S9(4).                                       
           02  AUSLF    PICTURE X.                                              
           02  FILLER REDEFINES AUSLF.                                          
             03 AUSLA    PICTURE X.                                             
           02  AUSLI  PIC X(3).                                                 
           02  TZNL    COMP  PIC  S9(4).                                        
           02  TZNF    PICTURE X.                                               
           02  FILLER REDEFINES TZNF.                                           
             03 TZNA    PICTURE X.                                              
           02  TZNI  PIC X(6).                                                  
           02  ZUNAMEL    COMP  PIC  S9(4).                                     
           02  ZUNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAMEF.                                        
             03 ZUNAMEA    PICTURE X.                                           
           02  ZUNAMEI  PIC X(20).                                              
           02  TVNL    COMP  PIC  S9(4).                                        
           02  TVNF    PICTURE X.                                               
           02  FILLER REDEFINES TVNF.                                           
             03 TVNA    PICTURE X.                                              
           02  TVNI  PIC X(7).                                                  
           02  VORNAMEL    COMP  PIC  S9(4).                                    
           02  VORNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES VORNAMEF.                                       
             03 VORNAMEA    PICTURE X.                                          
           02  VORNAMEI  PIC X(20).                                             
           02  TSTRL    COMP  PIC  S9(4).                                       
           02  TSTRF    PICTURE X.                                              
           02  FILLER REDEFINES TSTRF.                                          
             03 TSTRA    PICTURE X.                                             
           02  TSTRI  PIC X(7).                                                 
           02  STRL    COMP  PIC  S9(4).                                        
           02  STRF    PICTURE X.                                               
           02  FILLER REDEFINES STRF.                                           
             03 STRA    PICTURE X.                                              
           02  STRI  PIC X(20).                                                 
           02  TPLZL    COMP  PIC  S9(4).                                       
           02  TPLZF    PICTURE X.                                              
           02  FILLER REDEFINES TPLZF.                                          
             03 TPLZA    PICTURE X.                                             
           02  TPLZI  PIC X(17).                                                
           02  PLZL    COMP  PIC  S9(4).                                        
           02  PLZF    PICTURE X.                                               
           02  FILLER REDEFINES PLZF.                                           
             03 PLZA    PICTURE X.                                              
           02  PLZI  PIC X(6).                                                  
           02  ORTL    COMP  PIC  S9(4).                                        
           02  ORTF    PICTURE X.                                               
           02  FILLER REDEFINES ORTF.                                           
             03 ORTA    PICTURE X.                                              
           02  ORTI  PIC X(16).                                                 
           02  PBL    COMP  PIC  S9(4).                                         
           02  PBF    PICTURE X.                                                
           02  FILLER REDEFINES PBF.                                            
             03 PBA    PICTURE X.                                               
           02  PBI  PIC X(1).                                                   
           02  TTEXL    COMP  PIC  S9(4).                                       
           02  TTEXF    PICTURE X.                                              
           02  FILLER REDEFINES TTEXF.                                          
             03 TTEXA    PICTURE X.                                             
           02  TTEXI  PIC X(9).                                                 
           02  TTELL    COMP  PIC  S9(4).                                       
           02  TTELF    PICTURE X.                                              
           02  FILLER REDEFINES TTELF.                                          
             03 TTELA    PICTURE X.                                             
           02  TTELI  PIC X(6).                                                 
           02  GEBFUNKL    COMP  PIC  S9(4).                                    
           02  GEBFUNKF    PICTURE X.                                           
           02  FILLER REDEFINES GEBFUNKF.                                       
             03 GEBFUNKA    PICTURE X.                                          
           02  GEBFUNKI  PIC X(6).                                              
           02  TELNRL    COMP  PIC  S9(4).                                      
           02  TELNRF    PICTURE X.                                             
           02  FILLER REDEFINES TELNRF.                                         
             03 TELNRA    PICTURE X.                                            
           02  TELNRI  PIC X(14).                                               
           02  TDATL    COMP  PIC  S9(4).                                       
           02  TDATF    PICTURE X.                                              
           02  FILLER REDEFINES TDATF.                                          
             03 TDATA    PICTURE X.                                             
           02  TDATI  PIC X(8).                                                 
           02  EDATL    COMP  PIC  S9(4).                                       
           02  EDATF    PICTURE X.                                              
           02  FILLER REDEFINES EDATF.                                          
             03 EDATA    PICTURE X.                                             
           02  EDATI  PIC X(6).                                                 
           02  TPRL    COMP  PIC  S9(4).                                        
           02  TPRF    PICTURE X.                                               
           02  FILLER REDEFINES TPRF.                                           
             03 TPRA    PICTURE X.                                              
           02  TPRI  PIC X(17).                                                 
           02  PRUECKL    COMP  PIC  S9(4).                                     
           02  PRUECKF    PICTURE X.                                            
           02  FILLER REDEFINES PRUECKF.                                        
             03 PRUECKA    PICTURE X.                                           
           02  PRUECKI  PIC X(5).                                               
           02  TSSTL    COMP  PIC  S9(4).                                       
           02  TSSTF    PICTURE X.                                              
           02  FILLER REDEFINES TSSTF.                                          
             03 TSSTA    PICTURE X.                                             
           02  TSSTI  PIC X(11).                                                
           02  SSTUFEL    COMP  PIC  S9(4).                                     
           02  SSTUFEF    PICTURE X.                                            
           02  FILLER REDEFINES SSTUFEF.                                        
             03 SSTUFEA    PICTURE X.                                           
           02  SSTUFEI  PIC X(4).                                               
           02  TAPSL    COMP  PIC  S9(4).                                       
           02  TAPSF    PICTURE X.                                              
           02  FILLER REDEFINES TAPSF.                                          
             03 TAPSA    PICTURE X.                                             
           02  TAPSI  PIC X(9).                                                 
           02  APSATZL    COMP  PIC  S9(4).                                     
           02  APSATZF    PICTURE X.                                            
           02  FILLER REDEFINES APSATZF.                                        
             03 APSATZA    PICTURE X.                                           
           02  APSATZI  PIC X(5).                                               
           02  TPROZ1L    COMP  PIC  S9(4).                                     
           02  TPROZ1F    PICTURE X.                                            
           02  FILLER REDEFINES TPROZ1F.                                        
             03 TPROZ1A    PICTURE X.                                           
           02  TPROZ1I  PIC X(1).                                               
           02  TBVL    COMP  PIC  S9(4).                                        
           02  TBVF    PICTURE X.                                               
           02  FILLER REDEFINES TBVF.                                           
             03 TBVA    PICTURE X.                                              
           02  TBVI  PIC X(13).                                                 
           02  BVBNRL    COMP  PIC  S9(4).                                      
           02  BVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES BVBNRF.                                         
             03 BVBNRA    PICTURE X.                                            
           02  BVBNRI  PIC X(7).                                                
           02  BPRZL    COMP  PIC  S9(4).                                       
           02  BPRZF    PICTURE X.                                              
           02  FILLER REDEFINES BPRZF.                                          
             03 BPRZA    PICTURE X.                                             
           02  BPRZI  PIC X(1).                                                 
           02  TAPRL    COMP  PIC  S9(4).                                       
           02  TAPRF    PICTURE X.                                              
           02  FILLER REDEFINES TAPRF.                                          
             03 TAPRA    PICTURE X.                                             
           02  TAPRI  PIC X(9).                                                 
           02  APROVL    COMP  PIC  S9(4).                                      
           02  APROVF    PICTURE X.                                             
           02  FILLER REDEFINES APROVF.                                         
             03 APROVA    PICTURE X.                                            
           02  APROVI  PIC X(5).                                                
           02  TPROZ2L    COMP  PIC  S9(4).                                     
           02  TPROZ2F    PICTURE X.                                            
           02  FILLER REDEFINES TPROZ2F.                                        
             03 TPROZ2A    PICTURE X.                                           
           02  TPROZ2I  PIC X(1).                                               
           02  TEXTL    COMP  PIC  S9(4).                                       
           02  TEXTF    PICTURE X.                                              
           02  FILLER REDEFINES TEXTF.                                          
             03 TEXTA    PICTURE X.                                             
           02  TEXTI  PIC X(21).                                                
           02  PRUEFL    COMP  PIC  S9(4).                                      
           02  PRUEFF    PICTURE X.                                             
           02  FILLER REDEFINES PRUEFF.                                         
             03 PRUEFA    PICTURE X.                                            
           02  PRUEFI  PIC X(1).                                                
           02  FTEXT1L    COMP  PIC  S9(4).                                     
           02  FTEXT1F    PICTURE X.                                            
           02  FILLER REDEFINES FTEXT1F.                                        
             03 FTEXT1A    PICTURE X.                                           
           02  FTEXT1I  PIC X(79).                                              
       01  UU915O REDEFINES UU915I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR1O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT1O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR1O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DIR1O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TWVBNRO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  WVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  WVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TANRO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAUSLO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANREDEO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TZNO  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMEO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VORNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TSTRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STRO  PIC X(20).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TPLZO  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZO  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ORTO  PIC X(16).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PBO  PIC X(1).                                                   
           02  FILLER PICTURE X(3).                                             
           02  TTEXO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TTELO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GEBFUNKO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TELNRO  PIC X(14).                                               
           02  FILLER PICTURE X(3).                                             
           02  TDATO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EDATO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TPRO  PIC X(17).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRUECKO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSSTO  PIC X(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  SSTUFEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAPSO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APSATZO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROZ1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBVO  PIC X(13).                                                 
           02  FILLER PICTURE X(3).                                             
           02  BVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPRO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APROVO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPROZ2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEXTO  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRUEFO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FTEXT1O  PIC X(79).                                              
