       01  UU923I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS7L    COMP  PIC  S9(4).                                      
           02  PERS7F    PICTURE X.                                             
           02  FILLER REDEFINES PERS7F.                                         
             03 PERS7A    PICTURE X.                                            
           02  PERS7I  PIC X(7).                                                
           02  DATUM7L    COMP  PIC  S9(4).                                     
           02  DATUM7F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM7F.                                        
             03 DATUM7A    PICTURE X.                                           
           02  DATUM7I  PIC X(8).                                               
           02  UHR7L    COMP  PIC  S9(4).                                       
           02  UHR7F    PICTURE X.                                              
           02  FILLER REDEFINES UHR7F.                                          
             03 UHR7A    PICTURE X.                                             
           02  UHR7I  PIC X(5).                                                 
           02  VBNR7L    COMP  PIC  S9(4).                                      
           02  VBNR7F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR7F.                                         
             03 VBNR7A    PICTURE X.                                            
           02  VBNR7I  PIC X(7).                                                
           02  PRZVB7L    COMP  PIC  S9(4).                                     
           02  PRZVB7F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB7F.                                        
             03 PRZVB7A    PICTURE X.                                           
           02  PRZVB7I  PIC X(1).                                               
           02  DIR7L    COMP  PIC  S9(4).                                       
           02  DIR7F    PICTURE X.                                              
           02  FILLER REDEFINES DIR7F.                                          
             03 DIR7A    PICTURE X.                                             
           02  DIR7I  PIC X(3).                                                 
           02  VBNA7L    COMP  PIC  S9(4).                                      
           02  VBNA7F    PICTURE X.                                             
           02  FILLER REDEFINES VBNA7F.                                         
             03 VBNA7A    PICTURE X.                                            
           02  VBNA7I  PIC X(20).                                               
           02  VBNRVM7L    COMP  PIC  S9(4).                                    
           02  VBNRVM7F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM7F.                                       
             03 VBNRVM7A    PICTURE X.                                          
           02  VBNRVM7I  PIC X(7).                                              
           02  PRZVM7L    COMP  PIC  S9(4).                                     
           02  PRZVM7F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM7F.                                        
             03 PRZVM7A    PICTURE X.                                           
           02  PRZVM7I  PIC X(1).                                               
           02  VMNA7L    COMP  PIC  S9(4).                                      
           02  VMNA7F    PICTURE X.                                             
           02  FILLER REDEFINES VMNA7F.                                         
             03 VMNA7A    PICTURE X.                                            
           02  VMNA7I  PIC X(20).                                               
           02  TAN7L    COMP  PIC  S9(4).                                       
           02  TAN7F    PICTURE X.                                              
           02  FILLER REDEFINES TAN7F.                                          
             03 TAN7A    PICTURE X.                                             
           02  TAN7I  PIC X(6).                                                 
           02  ANREDE7L    COMP  PIC  S9(4).                                    
           02  ANREDE7F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE7F.                                       
             03 ANREDE7A    PICTURE X.                                          
           02  ANREDE7I  PIC X(9).                                              
           02  TZU7L    COMP  PIC  S9(4).                                       
           02  TZU7F    PICTURE X.                                              
           02  FILLER REDEFINES TZU7F.                                          
             03 TZU7A    PICTURE X.                                             
           02  TZU7I  PIC X(6).                                                 
           02  ZNAME7L    COMP  PIC  S9(4).                                     
           02  ZNAME7F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME7F.                                        
             03 ZNAME7A    PICTURE X.                                           
           02  ZNAME7I  PIC X(26).                                              
           02  TVOR7L    COMP  PIC  S9(4).                                      
           02  TVOR7F    PICTURE X.                                             
           02  FILLER REDEFINES TVOR7F.                                         
             03 TVOR7A    PICTURE X.                                            
           02  TVOR7I  PIC X(7).                                                
           02  VNAME7L    COMP  PIC  S9(4).                                     
           02  VNAME7F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME7F.                                        
             03 VNAME7A    PICTURE X.                                           
           02  VNAME7I  PIC X(26).                                              
           02  TSTR7L    COMP  PIC  S9(4).                                      
           02  TSTR7F    PICTURE X.                                             
           02  FILLER REDEFINES TSTR7F.                                         
             03 TSTR7A    PICTURE X.                                            
           02  TSTR7I  PIC X(7).                                                
           02  STR7L    COMP  PIC  S9(4).                                       
           02  STR7F    PICTURE X.                                              
           02  FILLER REDEFINES STR7F.                                          
             03 STR7A    PICTURE X.                                             
           02  STR7I  PIC X(26).                                                
           02  TPLZ7L    COMP  PIC  S9(4).                                      
           02  TPLZ7F    PICTURE X.                                             
           02  FILLER REDEFINES TPLZ7F.                                         
             03 TPLZ7A    PICTURE X.                                            
           02  TPLZ7I  PIC X(3).                                                
           02  TORT7L    COMP  PIC  S9(4).                                      
           02  TORT7F    PICTURE X.                                             
           02  FILLER REDEFINES TORT7F.                                         
             03 TORT7A    PICTURE X.                                            
           02  TORT7I  PIC X(7).                                                
           02  TAUSL7L    COMP  PIC  S9(4).                                     
           02  TAUSL7F    PICTURE X.                                            
           02  FILLER REDEFINES TAUSL7F.                                        
             03 TAUSL7A    PICTURE X.                                           
           02  TAUSL7I  PIC X(4).                                               
           02  PLZ7L    COMP  PIC  S9(4).                                       
           02  PLZ7F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ7F.                                          
             03 PLZ7A    PICTURE X.                                             
           02  PLZ7I  PIC X(5).                                                 
           02  ORT7L    COMP  PIC  S9(4).                                       
           02  ORT7F    PICTURE X.                                              
           02  FILLER REDEFINES ORT7F.                                          
             03 ORT7A    PICTURE X.                                             
           02  ORT7I  PIC X(21).                                                
           02  AUSL7L    COMP  PIC  S9(4).                                      
           02  AUSL7F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL7F.                                         
             03 AUSL7A    PICTURE X.                                            
           02  AUSL7I  PIC X(3).                                                
           02  TPROD7L    COMP  PIC  S9(4).                                     
           02  TPROD7F    PICTURE X.                                            
           02  FILLER REDEFINES TPROD7F.                                        
             03 TPROD7A    PICTURE X.                                           
           02  TPROD7I  PIC X(7).                                               
           02  PROD7L    COMP  PIC  S9(4).                                      
           02  PROD7F    PICTURE X.                                             
           02  FILLER REDEFINES PROD7F.                                         
             03 PROD7A    PICTURE X.                                            
           02  PROD7I  PIC X(2).                                                
           02  TDARL7L    COMP  PIC  S9(4).                                     
           02  TDARL7F    PICTURE X.                                            
           02  FILLER REDEFINES TDARL7F.                                        
             03 TDARL7A    PICTURE X.                                           
           02  TDARL7I  PIC X(11).                                              
           02  DARL7L    COMP  PIC  S9(4).                                      
           02  DARL7F    PICTURE X.                                             
           02  FILLER REDEFINES DARL7F.                                         
             03 DARL7A    PICTURE X.                                            
           02  DARL7I  PIC X(7).                                                
           02  TART7L    COMP  PIC  S9(4).                                      
           02  TART7F    PICTURE X.                                             
           02  FILLER REDEFINES TART7F.                                         
             03 TART7A    PICTURE X.                                            
           02  TART7I  PIC X(10).                                               
           02  ANART7L    COMP  PIC  S9(4).                                     
           02  ANART7F    PICTURE X.                                            
           02  FILLER REDEFINES ANART7F.                                        
             03 ANART7A    PICTURE X.                                           
           02  ANART7I  PIC X(1).                                               
           02  TAND7L    COMP  PIC  S9(4).                                      
           02  TAND7F    PICTURE X.                                             
           02  FILLER REDEFINES TAND7F.                                         
             03 TAND7A    PICTURE X.                                            
           02  TAND7I  PIC X(17).                                               
           02  ANDAT7L    COMP  PIC  S9(4).                                     
           02  ANDAT7F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT7F.                                        
             03 ANDAT7A    PICTURE X.                                           
           02  ANDAT7I  PIC X(6).                                               
           02  TERD7L    COMP  PIC  S9(4).                                      
           02  TERD7F    PICTURE X.                                             
           02  FILLER REDEFINES TERD7F.                                         
             03 TERD7A    PICTURE X.                                            
           02  TERD7I  PIC X(17).                                               
           02  ERFDAT7L    COMP  PIC  S9(4).                                    
           02  ERFDAT7F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT7F.                                       
             03 ERFDAT7A    PICTURE X.                                          
           02  ERFDAT7I  PIC X(6).                                              
           02  TSTT7L    COMP  PIC  S9(4).                                      
           02  TSTT7F    PICTURE X.                                             
           02  FILLER REDEFINES TSTT7F.                                         
             03 TSTT7A    PICTURE X.                                            
           02  TSTT7I  PIC X(17).                                               
           02  STTDAT7L    COMP  PIC  S9(4).                                    
           02  STTDAT7F    PICTURE X.                                           
           02  FILLER REDEFINES STTDAT7F.                                       
             03 STTDAT7A    PICTURE X.                                          
           02  STTDAT7I  PIC X(6).                                              
           02  TSTAT7L    COMP  PIC  S9(4).                                     
           02  TSTAT7F    PICTURE X.                                            
           02  FILLER REDEFINES TSTAT7F.                                        
             03 TSTAT7A    PICTURE X.                                           
           02  TSTAT7I  PIC X(17).                                              
           02  STATUS7L    COMP  PIC  S9(4).                                    
           02  STATUS7F    PICTURE X.                                           
           02  FILLER REDEFINES STATUS7F.                                       
             03 STATUS7A    PICTURE X.                                          
           02  STATUS7I  PIC X(2).                                              
           02  TEING7L    COMP  PIC  S9(4).                                     
           02  TEING7F    PICTURE X.                                            
           02  FILLER REDEFINES TEING7F.                                        
             03 TEING7A    PICTURE X.                                           
           02  TEING7I  PIC X(46).                                              
           02  EING7L    COMP  PIC  S9(4).                                      
           02  EING7F    PICTURE X.                                             
           02  FILLER REDEFINES EING7F.                                         
             03 EING7A    PICTURE X.                                            
           02  EING7I  PIC X(1).                                                
           02  FEHLER7L    COMP  PIC  S9(4).                                    
           02  FEHLER7F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER7F.                                       
             03 FEHLER7A    PICTURE X.                                          
           02  FEHLER7I  PIC X(78).                                             
       01  UU923O REDEFINES UU923I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM7O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR7O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB7O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIR7O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNA7O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM7O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM7O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VMNA7O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAN7O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANREDE7O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZU7O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZNAME7O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVOR7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNAME7O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTR7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  STR7O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPLZ7O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TORT7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAUSL7O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ7O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT7O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL7O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPROD7O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD7O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TDARL7O  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  DARL7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TART7O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANART7O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAND7O  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT7O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TERD7O  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT7O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTT7O  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  STTDAT7O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTAT7O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  STATUS7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEING7O  PIC X(46).                                              
           02  FILLER PICTURE X(3).                                             
           02  EING7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FEHLER7O  PIC X(78).                                             
