       01  UU926I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERSAL    COMP  PIC  S9(4).                                      
           02  PERSAF    PICTURE X.                                             
           02  FILLER REDEFINES PERSAF.                                         
             03 PERSAA    PICTURE X.                                            
           02  PERSAI  PIC X(7).                                                
           02  DATUMAL    COMP  PIC  S9(4).                                     
           02  DATUMAF    PICTURE X.                                            
           02  FILLER REDEFINES DATUMAF.                                        
             03 DATUMAA    PICTURE X.                                           
           02  DATUMAI  PIC X(8).                                               
           02  UHRAL    COMP  PIC  S9(4).                                       
           02  UHRAF    PICTURE X.                                              
           02  FILLER REDEFINES UHRAF.                                          
             03 UHRAA    PICTURE X.                                             
           02  UHRAI  PIC X(5).                                                 
           02  VBNRAL    COMP  PIC  S9(4).                                      
           02  VBNRAF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRAF.                                         
             03 VBNRAA    PICTURE X.                                            
           02  VBNRAI  PIC X(7).                                                
           02  GESAL    COMP  PIC  S9(4).                                       
           02  GESAF    PICTURE X.                                              
           02  FILLER REDEFINES GESAF.                                          
             03 GESAA    PICTURE X.                                             
           02  GESAI  PIC X(2).                                                 
           02  TVNRAL    COMP  PIC  S9(4).                                      
           02  TVNRAF    PICTURE X.                                             
           02  FILLER REDEFINES TVNRAF.                                         
             03 TVNRAA    PICTURE X.                                            
           02  TVNRAI  PIC X(15).                                               
           02  VNRAL    COMP  PIC  S9(4).                                       
           02  VNRAF    PICTURE X.                                              
           02  FILLER REDEFINES VNRAF.                                          
             03 VNRAA    PICTURE X.                                             
           02  VNRAI  PIC X(15).                                                
           02  VBNR11L    COMP  PIC  S9(4).                                     
           02  VBNR11F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR11F.                                        
             03 VBNR11A    PICTURE X.                                           
           02  VBNR11I  PIC X(7).                                               
           02  PRZ11L    COMP  PIC  S9(4).                                      
           02  PRZ11F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ11F.                                         
             03 PRZ11A    PICTURE X.                                            
           02  PRZ11I  PIC X(1).                                                
           02  STUFE11L    COMP  PIC  S9(4).                                    
           02  STUFE11F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE11F.                                       
             03 STUFE11A    PICTURE X.                                          
           02  STUFE11I  PIC X(4).                                              
           02  PROV11L    COMP  PIC  S9(4).                                     
           02  PROV11F    PICTURE X.                                            
           02  FILLER REDEFINES PROV11F.                                        
             03 PROV11A    PICTURE X.                                           
           02  PROV11I  PIC X(5).                                               
           02  NAME1L    COMP  PIC  S9(4).                                      
           02  NAME1F    PICTURE X.                                             
           02  FILLER REDEFINES NAME1F.                                         
             03 NAME1A    PICTURE X.                                            
           02  NAME1I  PIC X(15).                                               
           02  VBNR12L    COMP  PIC  S9(4).                                     
           02  VBNR12F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR12F.                                        
             03 VBNR12A    PICTURE X.                                           
           02  VBNR12I  PIC X(7).                                               
           02  PRZ12L    COMP  PIC  S9(4).                                      
           02  PRZ12F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ12F.                                         
             03 PRZ12A    PICTURE X.                                            
           02  PRZ12I  PIC X(1).                                                
           02  PROV12L    COMP  PIC  S9(4).                                     
           02  PROV12F    PICTURE X.                                            
           02  FILLER REDEFINES PROV12F.                                        
             03 PROV12A    PICTURE X.                                           
           02  PROV12I  PIC X(5).                                               
           02  VBNR21L    COMP  PIC  S9(4).                                     
           02  VBNR21F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR21F.                                        
             03 VBNR21A    PICTURE X.                                           
           02  VBNR21I  PIC X(7).                                               
           02  PRZ21L    COMP  PIC  S9(4).                                      
           02  PRZ21F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ21F.                                         
             03 PRZ21A    PICTURE X.                                            
           02  PRZ21I  PIC X(1).                                                
           02  STUFE21L    COMP  PIC  S9(4).                                    
           02  STUFE21F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE21F.                                       
             03 STUFE21A    PICTURE X.                                          
           02  STUFE21I  PIC X(4).                                              
           02  PROV21L    COMP  PIC  S9(4).                                     
           02  PROV21F    PICTURE X.                                            
           02  FILLER REDEFINES PROV21F.                                        
             03 PROV21A    PICTURE X.                                           
           02  PROV21I  PIC X(5).                                               
           02  NAME2L    COMP  PIC  S9(4).                                      
           02  NAME2F    PICTURE X.                                             
           02  FILLER REDEFINES NAME2F.                                         
             03 NAME2A    PICTURE X.                                            
           02  NAME2I  PIC X(15).                                               
           02  VBNR22L    COMP  PIC  S9(4).                                     
           02  VBNR22F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR22F.                                        
             03 VBNR22A    PICTURE X.                                           
           02  VBNR22I  PIC X(7).                                               
           02  PRZ22L    COMP  PIC  S9(4).                                      
           02  PRZ22F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ22F.                                         
             03 PRZ22A    PICTURE X.                                            
           02  PRZ22I  PIC X(1).                                                
           02  PROV22L    COMP  PIC  S9(4).                                     
           02  PROV22F    PICTURE X.                                            
           02  FILLER REDEFINES PROV22F.                                        
             03 PROV22A    PICTURE X.                                           
           02  PROV22I  PIC X(5).                                               
           02  VBNR31L    COMP  PIC  S9(4).                                     
           02  VBNR31F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR31F.                                        
             03 VBNR31A    PICTURE X.                                           
           02  VBNR31I  PIC X(7).                                               
           02  PRZ31L    COMP  PIC  S9(4).                                      
           02  PRZ31F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ31F.                                         
             03 PRZ31A    PICTURE X.                                            
           02  PRZ31I  PIC X(1).                                                
           02  STUFE31L    COMP  PIC  S9(4).                                    
           02  STUFE31F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE31F.                                       
             03 STUFE31A    PICTURE X.                                          
           02  STUFE31I  PIC X(4).                                              
           02  PROV31L    COMP  PIC  S9(4).                                     
           02  PROV31F    PICTURE X.                                            
           02  FILLER REDEFINES PROV31F.                                        
             03 PROV31A    PICTURE X.                                           
           02  PROV31I  PIC X(5).                                               
           02  NAME3L    COMP  PIC  S9(4).                                      
           02  NAME3F    PICTURE X.                                             
           02  FILLER REDEFINES NAME3F.                                         
             03 NAME3A    PICTURE X.                                            
           02  NAME3I  PIC X(15).                                               
           02  VBNR32L    COMP  PIC  S9(4).                                     
           02  VBNR32F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR32F.                                        
             03 VBNR32A    PICTURE X.                                           
           02  VBNR32I  PIC X(7).                                               
           02  PRZ32L    COMP  PIC  S9(4).                                      
           02  PRZ32F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ32F.                                         
             03 PRZ32A    PICTURE X.                                            
           02  PRZ32I  PIC X(1).                                                
           02  PROV32L    COMP  PIC  S9(4).                                     
           02  PROV32F    PICTURE X.                                            
           02  FILLER REDEFINES PROV32F.                                        
             03 PROV32A    PICTURE X.                                           
           02  PROV32I  PIC X(5).                                               
           02  VBNR41L    COMP  PIC  S9(4).                                     
           02  VBNR41F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR41F.                                        
             03 VBNR41A    PICTURE X.                                           
           02  VBNR41I  PIC X(7).                                               
           02  PRZ41L    COMP  PIC  S9(4).                                      
           02  PRZ41F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ41F.                                         
             03 PRZ41A    PICTURE X.                                            
           02  PRZ41I  PIC X(1).                                                
           02  STUFE41L    COMP  PIC  S9(4).                                    
           02  STUFE41F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE41F.                                       
             03 STUFE41A    PICTURE X.                                          
           02  STUFE41I  PIC X(4).                                              
           02  PROV41L    COMP  PIC  S9(4).                                     
           02  PROV41F    PICTURE X.                                            
           02  FILLER REDEFINES PROV41F.                                        
             03 PROV41A    PICTURE X.                                           
           02  PROV41I  PIC X(5).                                               
           02  NAME4L    COMP  PIC  S9(4).                                      
           02  NAME4F    PICTURE X.                                             
           02  FILLER REDEFINES NAME4F.                                         
             03 NAME4A    PICTURE X.                                            
           02  NAME4I  PIC X(15).                                               
           02  VBNR42L    COMP  PIC  S9(4).                                     
           02  VBNR42F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR42F.                                        
             03 VBNR42A    PICTURE X.                                           
           02  VBNR42I  PIC X(7).                                               
           02  PRZ42L    COMP  PIC  S9(4).                                      
           02  PRZ42F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ42F.                                         
             03 PRZ42A    PICTURE X.                                            
           02  PRZ42I  PIC X(1).                                                
           02  PROV42L    COMP  PIC  S9(4).                                     
           02  PROV42F    PICTURE X.                                            
           02  FILLER REDEFINES PROV42F.                                        
             03 PROV42A    PICTURE X.                                           
           02  PROV42I  PIC X(5).                                               
           02  VBNR51L    COMP  PIC  S9(4).                                     
           02  VBNR51F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR51F.                                        
             03 VBNR51A    PICTURE X.                                           
           02  VBNR51I  PIC X(7).                                               
           02  PRZ51L    COMP  PIC  S9(4).                                      
           02  PRZ51F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ51F.                                         
             03 PRZ51A    PICTURE X.                                            
           02  PRZ51I  PIC X(1).                                                
           02  STUFE51L    COMP  PIC  S9(4).                                    
           02  STUFE51F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE51F.                                       
             03 STUFE51A    PICTURE X.                                          
           02  STUFE51I  PIC X(4).                                              
           02  PROV51L    COMP  PIC  S9(4).                                     
           02  PROV51F    PICTURE X.                                            
           02  FILLER REDEFINES PROV51F.                                        
             03 PROV51A    PICTURE X.                                           
           02  PROV51I  PIC X(5).                                               
           02  NAME5L    COMP  PIC  S9(4).                                      
           02  NAME5F    PICTURE X.                                             
           02  FILLER REDEFINES NAME5F.                                         
             03 NAME5A    PICTURE X.                                            
           02  NAME5I  PIC X(15).                                               
           02  VBNR52L    COMP  PIC  S9(4).                                     
           02  VBNR52F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR52F.                                        
             03 VBNR52A    PICTURE X.                                           
           02  VBNR52I  PIC X(7).                                               
           02  PRZ52L    COMP  PIC  S9(4).                                      
           02  PRZ52F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ52F.                                         
             03 PRZ52A    PICTURE X.                                            
           02  PRZ52I  PIC X(1).                                                
           02  PROV52L    COMP  PIC  S9(4).                                     
           02  PROV52F    PICTURE X.                                            
           02  FILLER REDEFINES PROV52F.                                        
             03 PROV52A    PICTURE X.                                           
           02  PROV52I  PIC X(5).                                               
           02  VBNR61L    COMP  PIC  S9(4).                                     
           02  VBNR61F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR61F.                                        
             03 VBNR61A    PICTURE X.                                           
           02  VBNR61I  PIC X(7).                                               
           02  PRZ61L    COMP  PIC  S9(4).                                      
           02  PRZ61F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ61F.                                         
             03 PRZ61A    PICTURE X.                                            
           02  PRZ61I  PIC X(1).                                                
           02  STUFE61L    COMP  PIC  S9(4).                                    
           02  STUFE61F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE61F.                                       
             03 STUFE61A    PICTURE X.                                          
           02  STUFE61I  PIC X(4).                                              
           02  PROV61L    COMP  PIC  S9(4).                                     
           02  PROV61F    PICTURE X.                                            
           02  FILLER REDEFINES PROV61F.                                        
             03 PROV61A    PICTURE X.                                           
           02  PROV61I  PIC X(5).                                               
           02  NAME6L    COMP  PIC  S9(4).                                      
           02  NAME6F    PICTURE X.                                             
           02  FILLER REDEFINES NAME6F.                                         
             03 NAME6A    PICTURE X.                                            
           02  NAME6I  PIC X(15).                                               
           02  VBNR62L    COMP  PIC  S9(4).                                     
           02  VBNR62F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR62F.                                        
             03 VBNR62A    PICTURE X.                                           
           02  VBNR62I  PIC X(7).                                               
           02  PRZ62L    COMP  PIC  S9(4).                                      
           02  PRZ62F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ62F.                                         
             03 PRZ62A    PICTURE X.                                            
           02  PRZ62I  PIC X(1).                                                
           02  PROV62L    COMP  PIC  S9(4).                                     
           02  PROV62F    PICTURE X.                                            
           02  FILLER REDEFINES PROV62F.                                        
             03 PROV62A    PICTURE X.                                           
           02  PROV62I  PIC X(5).                                               
           02  VBNR71L    COMP  PIC  S9(4).                                     
           02  VBNR71F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR71F.                                        
             03 VBNR71A    PICTURE X.                                           
           02  VBNR71I  PIC X(7).                                               
           02  PRZ71L    COMP  PIC  S9(4).                                      
           02  PRZ71F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ71F.                                         
             03 PRZ71A    PICTURE X.                                            
           02  PRZ71I  PIC X(1).                                                
           02  STUFE71L    COMP  PIC  S9(4).                                    
           02  STUFE71F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE71F.                                       
             03 STUFE71A    PICTURE X.                                          
           02  STUFE71I  PIC X(4).                                              
           02  PROV71L    COMP  PIC  S9(4).                                     
           02  PROV71F    PICTURE X.                                            
           02  FILLER REDEFINES PROV71F.                                        
             03 PROV71A    PICTURE X.                                           
           02  PROV71I  PIC X(5).                                               
           02  NAME7L    COMP  PIC  S9(4).                                      
           02  NAME7F    PICTURE X.                                             
           02  FILLER REDEFINES NAME7F.                                         
             03 NAME7A    PICTURE X.                                            
           02  NAME7I  PIC X(15).                                               
           02  VBNR72L    COMP  PIC  S9(4).                                     
           02  VBNR72F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR72F.                                        
             03 VBNR72A    PICTURE X.                                           
           02  VBNR72I  PIC X(7).                                               
           02  PRZ72L    COMP  PIC  S9(4).                                      
           02  PRZ72F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ72F.                                         
             03 PRZ72A    PICTURE X.                                            
           02  PRZ72I  PIC X(1).                                                
           02  PROV72L    COMP  PIC  S9(4).                                     
           02  PROV72F    PICTURE X.                                            
           02  FILLER REDEFINES PROV72F.                                        
             03 PROV72A    PICTURE X.                                           
           02  PROV72I  PIC X(5).                                               
           02  VBNR81L    COMP  PIC  S9(4).                                     
           02  VBNR81F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR81F.                                        
             03 VBNR81A    PICTURE X.                                           
           02  VBNR81I  PIC X(7).                                               
           02  PRZ81L    COMP  PIC  S9(4).                                      
           02  PRZ81F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ81F.                                         
             03 PRZ81A    PICTURE X.                                            
           02  PRZ81I  PIC X(1).                                                
           02  STUFE81L    COMP  PIC  S9(4).                                    
           02  STUFE81F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE81F.                                       
             03 STUFE81A    PICTURE X.                                          
           02  STUFE81I  PIC X(4).                                              
           02  PROV81L    COMP  PIC  S9(4).                                     
           02  PROV81F    PICTURE X.                                            
           02  FILLER REDEFINES PROV81F.                                        
             03 PROV81A    PICTURE X.                                           
           02  PROV81I  PIC X(5).                                               
           02  NAME8L    COMP  PIC  S9(4).                                      
           02  NAME8F    PICTURE X.                                             
           02  FILLER REDEFINES NAME8F.                                         
             03 NAME8A    PICTURE X.                                            
           02  NAME8I  PIC X(15).                                               
           02  VBNR82L    COMP  PIC  S9(4).                                     
           02  VBNR82F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR82F.                                        
             03 VBNR82A    PICTURE X.                                           
           02  VBNR82I  PIC X(7).                                               
           02  PRZ82L    COMP  PIC  S9(4).                                      
           02  PRZ82F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ82F.                                         
             03 PRZ82A    PICTURE X.                                            
           02  PRZ82I  PIC X(1).                                                
           02  PROV82L    COMP  PIC  S9(4).                                     
           02  PROV82F    PICTURE X.                                            
           02  FILLER REDEFINES PROV82F.                                        
             03 PROV82A    PICTURE X.                                           
           02  PROV82I  PIC X(5).                                               
           02  VBNR91L    COMP  PIC  S9(4).                                     
           02  VBNR91F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR91F.                                        
             03 VBNR91A    PICTURE X.                                           
           02  VBNR91I  PIC X(7).                                               
           02  PRZ91L    COMP  PIC  S9(4).                                      
           02  PRZ91F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ91F.                                         
             03 PRZ91A    PICTURE X.                                            
           02  PRZ91I  PIC X(1).                                                
           02  STUFE91L    COMP  PIC  S9(4).                                    
           02  STUFE91F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE91F.                                       
             03 STUFE91A    PICTURE X.                                          
           02  STUFE91I  PIC X(4).                                              
           02  PROV91L    COMP  PIC  S9(4).                                     
           02  PROV91F    PICTURE X.                                            
           02  FILLER REDEFINES PROV91F.                                        
             03 PROV91A    PICTURE X.                                           
           02  PROV91I  PIC X(5).                                               
           02  NAME9L    COMP  PIC  S9(4).                                      
           02  NAME9F    PICTURE X.                                             
           02  FILLER REDEFINES NAME9F.                                         
             03 NAME9A    PICTURE X.                                            
           02  NAME9I  PIC X(15).                                               
           02  VBNR92L    COMP  PIC  S9(4).                                     
           02  VBNR92F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR92F.                                        
             03 VBNR92A    PICTURE X.                                           
           02  VBNR92I  PIC X(7).                                               
           02  PRZ92L    COMP  PIC  S9(4).                                      
           02  PRZ92F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ92F.                                         
             03 PRZ92A    PICTURE X.                                            
           02  PRZ92I  PIC X(1).                                                
           02  PROV92L    COMP  PIC  S9(4).                                     
           02  PROV92F    PICTURE X.                                            
           02  FILLER REDEFINES PROV92F.                                        
             03 PROV92A    PICTURE X.                                           
           02  PROV92I  PIC X(5).                                               
           02  VBNR01L    COMP  PIC  S9(4).                                     
           02  VBNR01F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR01F.                                        
             03 VBNR01A    PICTURE X.                                           
           02  VBNR01I  PIC X(7).                                               
           02  PRZ01L    COMP  PIC  S9(4).                                      
           02  PRZ01F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ01F.                                         
             03 PRZ01A    PICTURE X.                                            
           02  PRZ01I  PIC X(1).                                                
           02  STUFE01L    COMP  PIC  S9(4).                                    
           02  STUFE01F    PICTURE X.                                           
           02  FILLER REDEFINES STUFE01F.                                       
             03 STUFE01A    PICTURE X.                                          
           02  STUFE01I  PIC X(4).                                              
           02  PROV01L    COMP  PIC  S9(4).                                     
           02  PROV01F    PICTURE X.                                            
           02  FILLER REDEFINES PROV01F.                                        
             03 PROV01A    PICTURE X.                                           
           02  PROV01I  PIC X(5).                                               
           02  NAME0L    COMP  PIC  S9(4).                                      
           02  NAME0F    PICTURE X.                                             
           02  FILLER REDEFINES NAME0F.                                         
             03 NAME0A    PICTURE X.                                            
           02  NAME0I  PIC X(15).                                               
           02  VBNR02L    COMP  PIC  S9(4).                                     
           02  VBNR02F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR02F.                                        
             03 VBNR02A    PICTURE X.                                           
           02  VBNR02I  PIC X(7).                                               
           02  PRZ02L    COMP  PIC  S9(4).                                      
           02  PRZ02F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ02F.                                         
             03 PRZ02A    PICTURE X.                                            
           02  PRZ02I  PIC X(1).                                                
           02  PROV02L    COMP  PIC  S9(4).                                     
           02  PROV02F    PICTURE X.                                            
           02  FILLER REDEFINES PROV02F.                                        
             03 PROV02A    PICTURE X.                                           
           02  PROV02I  PIC X(5).                                               
           02  AVBNR1L    COMP  PIC  S9(4).                                     
           02  AVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR1F.                                        
             03 AVBNR1A    PICTURE X.                                           
           02  AVBNR1I  PIC X(7).                                               
           02  APRZ1L    COMP  PIC  S9(4).                                      
           02  APRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES APRZ1F.                                         
             03 APRZ1A    PICTURE X.                                            
           02  APRZ1I  PIC X(1).                                                
           02  ASTUFE1L    COMP  PIC  S9(4).                                    
           02  ASTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE1F.                                       
             03 ASTUFE1A    PICTURE X.                                          
           02  ASTUFE1I  PIC X(4).                                              
           02  APROV1L    COMP  PIC  S9(4).                                     
           02  APROV1F    PICTURE X.                                            
           02  FILLER REDEFINES APROV1F.                                        
             03 APROV1A    PICTURE X.                                           
           02  APROV1I  PIC X(5).                                               
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(15).                                               
           02  AVBNR2L    COMP  PIC  S9(4).                                     
           02  AVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR2F.                                        
             03 AVBNR2A    PICTURE X.                                           
           02  AVBNR2I  PIC X(7).                                               
           02  APRZ2L    COMP  PIC  S9(4).                                      
           02  APRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES APRZ2F.                                         
             03 APRZ2A    PICTURE X.                                            
           02  APRZ2I  PIC X(1).                                                
           02  APROV2L    COMP  PIC  S9(4).                                     
           02  APROV2F    PICTURE X.                                            
           02  FILLER REDEFINES APROV2F.                                        
             03 APROV2A    PICTURE X.                                           
           02  APROV2I  PIC X(5).                                               
           02  BVBNR1L    COMP  PIC  S9(4).                                     
           02  BVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES BVBNR1F.                                        
             03 BVBNR1A    PICTURE X.                                           
           02  BVBNR1I  PIC X(7).                                               
           02  BPRZ1L    COMP  PIC  S9(4).                                      
           02  BPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ1F.                                         
             03 BPRZ1A    PICTURE X.                                            
           02  BPRZ1I  PIC X(1).                                                
           02  BSTUFE1L    COMP  PIC  S9(4).                                    
           02  BSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES BSTUFE1F.                                       
             03 BSTUFE1A    PICTURE X.                                          
           02  BSTUFE1I  PIC X(4).                                              
           02  BPROV1L    COMP  PIC  S9(4).                                     
           02  BPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV1F.                                        
             03 BPROV1A    PICTURE X.                                           
           02  BPROV1I  PIC X(5).                                               
           02  BNAMEL    COMP  PIC  S9(4).                                      
           02  BNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES BNAMEF.                                         
             03 BNAMEA    PICTURE X.                                            
           02  BNAMEI  PIC X(15).                                               
           02  BVBNR2L    COMP  PIC  S9(4).                                     
           02  BVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES BVBNR2F.                                        
             03 BVBNR2A    PICTURE X.                                           
           02  BVBNR2I  PIC X(7).                                               
           02  BPRZ2L    COMP  PIC  S9(4).                                      
           02  BPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ2F.                                         
             03 BPRZ2A    PICTURE X.                                            
           02  BPRZ2I  PIC X(1).                                                
           02  BPROV2L    COMP  PIC  S9(4).                                     
           02  BPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV2F.                                        
             03 BPROV2A    PICTURE X.                                           
           02  BPROV2I  PIC X(5).                                               
           02  CVBNR1L    COMP  PIC  S9(4).                                     
           02  CVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES CVBNR1F.                                        
             03 CVBNR1A    PICTURE X.                                           
           02  CVBNR1I  PIC X(7).                                               
           02  CPRZ1L    COMP  PIC  S9(4).                                      
           02  CPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES CPRZ1F.                                         
             03 CPRZ1A    PICTURE X.                                            
           02  CPRZ1I  PIC X(1).                                                
           02  CSTUFE1L    COMP  PIC  S9(4).                                    
           02  CSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES CSTUFE1F.                                       
             03 CSTUFE1A    PICTURE X.                                          
           02  CSTUFE1I  PIC X(4).                                              
           02  CPROV1L    COMP  PIC  S9(4).                                     
           02  CPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES CPROV1F.                                        
             03 CPROV1A    PICTURE X.                                           
           02  CPROV1I  PIC X(5).                                               
           02  CNAMEL    COMP  PIC  S9(4).                                      
           02  CNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES CNAMEF.                                         
             03 CNAMEA    PICTURE X.                                            
           02  CNAMEI  PIC X(15).                                               
           02  CVBNR2L    COMP  PIC  S9(4).                                     
           02  CVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES CVBNR2F.                                        
             03 CVBNR2A    PICTURE X.                                           
           02  CVBNR2I  PIC X(7).                                               
           02  CPRZ2L    COMP  PIC  S9(4).                                      
           02  CPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES CPRZ2F.                                         
             03 CPRZ2A    PICTURE X.                                            
           02  CPRZ2I  PIC X(1).                                                
           02  CPROV2L    COMP  PIC  S9(4).                                     
           02  CPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES CPROV2F.                                        
             03 CPROV2A    PICTURE X.                                           
           02  CPROV2I  PIC X(5).                                               
           02  DVBNR1L    COMP  PIC  S9(4).                                     
           02  DVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES DVBNR1F.                                        
             03 DVBNR1A    PICTURE X.                                           
           02  DVBNR1I  PIC X(7).                                               
           02  DPRZ1L    COMP  PIC  S9(4).                                      
           02  DPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES DPRZ1F.                                         
             03 DPRZ1A    PICTURE X.                                            
           02  DPRZ1I  PIC X(1).                                                
           02  DSTUFE1L    COMP  PIC  S9(4).                                    
           02  DSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES DSTUFE1F.                                       
             03 DSTUFE1A    PICTURE X.                                          
           02  DSTUFE1I  PIC X(4).                                              
           02  DPROV1L    COMP  PIC  S9(4).                                     
           02  DPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES DPROV1F.                                        
             03 DPROV1A    PICTURE X.                                           
           02  DPROV1I  PIC X(5).                                               
           02  DNAMEL    COMP  PIC  S9(4).                                      
           02  DNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES DNAMEF.                                         
             03 DNAMEA    PICTURE X.                                            
           02  DNAMEI  PIC X(15).                                               
           02  DVBNR2L    COMP  PIC  S9(4).                                     
           02  DVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES DVBNR2F.                                        
             03 DVBNR2A    PICTURE X.                                           
           02  DVBNR2I  PIC X(7).                                               
           02  DPRZ2L    COMP  PIC  S9(4).                                      
           02  DPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES DPRZ2F.                                         
             03 DPRZ2A    PICTURE X.                                            
           02  DPRZ2I  PIC X(1).                                                
           02  DPROV2L    COMP  PIC  S9(4).                                     
           02  DPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES DPROV2F.                                        
             03 DPROV2A    PICTURE X.                                           
           02  DPROV2I  PIC X(5).                                               
           02  EVBNR1L    COMP  PIC  S9(4).                                     
           02  EVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR1F.                                        
             03 EVBNR1A    PICTURE X.                                           
           02  EVBNR1I  PIC X(7).                                               
           02  EPRZ1L    COMP  PIC  S9(4).                                      
           02  EPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES EPRZ1F.                                         
             03 EPRZ1A    PICTURE X.                                            
           02  EPRZ1I  PIC X(1).                                                
           02  ESTUFE1L    COMP  PIC  S9(4).                                    
           02  ESTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES ESTUFE1F.                                       
             03 ESTUFE1A    PICTURE X.                                          
           02  ESTUFE1I  PIC X(4).                                              
           02  EPROV1L    COMP  PIC  S9(4).                                     
           02  EPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV1F.                                        
             03 EPROV1A    PICTURE X.                                           
           02  EPROV1I  PIC X(5).                                               
           02  ENAMEL    COMP  PIC  S9(4).                                      
           02  ENAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ENAMEF.                                         
             03 ENAMEA    PICTURE X.                                            
           02  ENAMEI  PIC X(15).                                               
           02  EVBNR2L    COMP  PIC  S9(4).                                     
           02  EVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR2F.                                        
             03 EVBNR2A    PICTURE X.                                           
           02  EVBNR2I  PIC X(7).                                               
           02  EPRZ2L    COMP  PIC  S9(4).                                      
           02  EPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EPRZ2F.                                         
             03 EPRZ2A    PICTURE X.                                            
           02  EPRZ2I  PIC X(1).                                                
           02  EPROV2L    COMP  PIC  S9(4).                                     
           02  EPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV2F.                                        
             03 EPROV2A    PICTURE X.                                           
           02  EPROV2I  PIC X(5).                                               
           02  FVBNR1L    COMP  PIC  S9(4).                                     
           02  FVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES FVBNR1F.                                        
             03 FVBNR1A    PICTURE X.                                           
           02  FVBNR1I  PIC X(7).                                               
           02  FPRZ1L    COMP  PIC  S9(4).                                      
           02  FPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES FPRZ1F.                                         
             03 FPRZ1A    PICTURE X.                                            
           02  FPRZ1I  PIC X(1).                                                
           02  FSTUFE1L    COMP  PIC  S9(4).                                    
           02  FSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES FSTUFE1F.                                       
             03 FSTUFE1A    PICTURE X.                                          
           02  FSTUFE1I  PIC X(4).                                              
           02  FPROV1L    COMP  PIC  S9(4).                                     
           02  FPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES FPROV1F.                                        
             03 FPROV1A    PICTURE X.                                           
           02  FPROV1I  PIC X(5).                                               
           02  FNAMEL    COMP  PIC  S9(4).                                      
           02  FNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES FNAMEF.                                         
             03 FNAMEA    PICTURE X.                                            
           02  FNAMEI  PIC X(15).                                               
           02  FVBNR2L    COMP  PIC  S9(4).                                     
           02  FVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES FVBNR2F.                                        
             03 FVBNR2A    PICTURE X.                                           
           02  FVBNR2I  PIC X(7).                                               
           02  FPRZ2L    COMP  PIC  S9(4).                                      
           02  FPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES FPRZ2F.                                         
             03 FPRZ2A    PICTURE X.                                            
           02  FPRZ2I  PIC X(1).                                                
           02  FPROV2L    COMP  PIC  S9(4).                                     
           02  FPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES FPROV2F.                                        
             03 FPROV2A    PICTURE X.                                           
           02  FPROV2I  PIC X(5).                                               
           02  GVBNR1L    COMP  PIC  S9(4).                                     
           02  GVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES GVBNR1F.                                        
             03 GVBNR1A    PICTURE X.                                           
           02  GVBNR1I  PIC X(7).                                               
           02  GPRZ1L    COMP  PIC  S9(4).                                      
           02  GPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES GPRZ1F.                                         
             03 GPRZ1A    PICTURE X.                                            
           02  GPRZ1I  PIC X(1).                                                
           02  GSTUFE1L    COMP  PIC  S9(4).                                    
           02  GSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES GSTUFE1F.                                       
             03 GSTUFE1A    PICTURE X.                                          
           02  GSTUFE1I  PIC X(4).                                              
           02  GPROV1L    COMP  PIC  S9(4).                                     
           02  GPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES GPROV1F.                                        
             03 GPROV1A    PICTURE X.                                           
           02  GPROV1I  PIC X(5).                                               
           02  GNAMEL    COMP  PIC  S9(4).                                      
           02  GNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES GNAMEF.                                         
             03 GNAMEA    PICTURE X.                                            
           02  GNAMEI  PIC X(15).                                               
           02  GVBNR2L    COMP  PIC  S9(4).                                     
           02  GVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES GVBNR2F.                                        
             03 GVBNR2A    PICTURE X.                                           
           02  GVBNR2I  PIC X(7).                                               
           02  GPRZ2L    COMP  PIC  S9(4).                                      
           02  GPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES GPRZ2F.                                         
             03 GPRZ2A    PICTURE X.                                            
           02  GPRZ2I  PIC X(1).                                                
           02  GPROV2L    COMP  PIC  S9(4).                                     
           02  GPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES GPROV2F.                                        
             03 GPROV2A    PICTURE X.                                           
           02  GPROV2I  PIC X(5).                                               
           02  HVBNR1L    COMP  PIC  S9(4).                                     
           02  HVBNR1F    PICTURE X.                                            
           02  FILLER REDEFINES HVBNR1F.                                        
             03 HVBNR1A    PICTURE X.                                           
           02  HVBNR1I  PIC X(7).                                               
           02  HPRZ1L    COMP  PIC  S9(4).                                      
           02  HPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES HPRZ1F.                                         
             03 HPRZ1A    PICTURE X.                                            
           02  HPRZ1I  PIC X(1).                                                
           02  HSTUFE1L    COMP  PIC  S9(4).                                    
           02  HSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES HSTUFE1F.                                       
             03 HSTUFE1A    PICTURE X.                                          
           02  HSTUFE1I  PIC X(4).                                              
           02  HPROV1L    COMP  PIC  S9(4).                                     
           02  HPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES HPROV1F.                                        
             03 HPROV1A    PICTURE X.                                           
           02  HPROV1I  PIC X(5).                                               
           02  HNAMEL    COMP  PIC  S9(4).                                      
           02  HNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES HNAMEF.                                         
             03 HNAMEA    PICTURE X.                                            
           02  HNAMEI  PIC X(15).                                               
           02  HVBNR2L    COMP  PIC  S9(4).                                     
           02  HVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES HVBNR2F.                                        
             03 HVBNR2A    PICTURE X.                                           
           02  HVBNR2I  PIC X(7).                                               
           02  HPRZ2L    COMP  PIC  S9(4).                                      
           02  HPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES HPRZ2F.                                         
             03 HPRZ2A    PICTURE X.                                            
           02  HPRZ2I  PIC X(1).                                                
           02  HPROV2L    COMP  PIC  S9(4).                                     
           02  HPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES HPROV2F.                                        
             03 HPROV2A    PICTURE X.                                           
           02  HPROV2I  PIC X(5).                                               
           02  TEINGAL    COMP  PIC  S9(4).                                     
           02  TEINGAF    PICTURE X.                                            
           02  FILLER REDEFINES TEINGAF.                                        
             03 TEINGAA    PICTURE X.                                           
           02  TEINGAI  PIC X(25).                                              
           02  EINGAL    COMP  PIC  S9(4).                                      
           02  EINGAF    PICTURE X.                                             
           02  FILLER REDEFINES EINGAF.                                         
             03 EINGAA    PICTURE X.                                            
           02  EINGAI  PIC X(1).                                                
           02  FEHLERAL    COMP  PIC  S9(4).                                    
           02  FEHLERAF    PICTURE X.                                           
           02  FILLER REDEFINES FEHLERAF.                                       
             03 FEHLERAA    PICTURE X.                                          
           02  FEHLERAI  PIC X(78).                                             
       01  UU926O REDEFINES UU926I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERSAO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUMAO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHRAO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNRAO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  GESAO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TVNRAO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRAO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR11O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ11O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE11O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV11O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME1O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR12O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ12O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV12O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR21O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ21O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE21O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV21O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR22O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ22O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV22O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR31O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ31O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE31O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV31O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME3O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR32O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ32O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV32O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR41O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ41O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE41O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV41O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR42O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ42O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV42O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR51O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ51O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE51O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV51O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR52O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ52O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV52O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR61O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ61O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE61O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV61O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME6O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR62O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ62O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV62O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR71O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ71O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE71O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV71O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME7O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR72O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ72O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV72O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR81O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ81O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE81O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV81O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME8O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR82O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ82O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV82O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR91O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ91O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE91O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV91O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME9O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR92O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ92O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV92O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR01O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ01O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE01O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROV01O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME0O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR02O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ02O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROV02O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  APRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  BVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  BSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  BPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  BVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  CVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  CPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  CSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  CPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  CNAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  CVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  CPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  CPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  DVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  DSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  DPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  DNAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  DVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  DPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  ENAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  FVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  FPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  FNAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  FVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  FPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  GVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  GPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  GSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  GPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  GNAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  GVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  GPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  HVBNR1O PIC Z(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  HPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  HSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  HPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  HNAMEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  HVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  HPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  HPROV2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEINGAO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  EINGAO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FEHLERAO  PIC X(78).                                             
