       01  UU945I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  V0219L    COMP  PIC  S9(4).                                      
           02  V0219F    PICTURE X.                                             
           02  FILLER REDEFINES V0219F.                                         
             03 V0219A    PICTURE X.                                            
           02  V0219I  PIC X(14).                                               
           02  GESL    COMP  PIC  S9(4).                                        
           02  GESF    PICTURE X.                                               
           02  FILLER REDEFINES GESF.                                           
             03 GESA    PICTURE X.                                              
           02  GESI  PIC X(8).                                                  
           02  TRENN1L    COMP  PIC  S9(4).                                     
           02  TRENN1F    PICTURE X.                                            
           02  FILLER REDEFINES TRENN1F.                                        
             03 TRENN1A    PICTURE X.                                           
           02  TRENN1I  PIC X(3).                                               
           02  PRODL    COMP  PIC  S9(4).                                       
           02  PRODF    PICTURE X.                                              
           02  FILLER REDEFINES PRODF.                                          
             03 PRODA    PICTURE X.                                             
           02  PRODI  PIC X(14).                                                
           02  BAL    COMP  PIC  S9(4).                                         
           02  BAF    PICTURE X.                                                
           02  FILLER REDEFINES BAF.                                            
             03 BAA    PICTURE X.                                               
           02  BAI  PIC X(6).                                                   
           02  BADATL    COMP  PIC  S9(4).                                      
           02  BADATF    PICTURE X.                                             
           02  FILLER REDEFINES BADATF.                                         
             03 BADATA    PICTURE X.                                            
           02  BADATI  PIC X(8).                                                
           02  VNRL    COMP  PIC  S9(4).                                        
           02  VNRF    PICTURE X.                                               
           02  FILLER REDEFINES VNRF.                                           
             03 VNRA    PICTURE X.                                              
           02  VNRI  PIC X(16).                                                 
           02  BATEXTL    COMP  PIC  S9(4).                                     
           02  BATEXTF    PICTURE X.                                            
           02  FILLER REDEFINES BATEXTF.                                        
             03 BATEXTA    PICTURE X.                                           
           02  BATEXTI  PIC X(20).                                              
           02  BEGL    COMP  PIC  S9(4).                                        
           02  BEGF    PICTURE X.                                               
           02  FILLER REDEFINES BEGF.                                           
             03 BEGA    PICTURE X.                                              
           02  BEGI  PIC X(8).                                                  
           02  ABLL    COMP  PIC  S9(4).                                        
           02  ABLF    PICTURE X.                                               
           02  FILLER REDEFINES ABLF.                                           
             03 ABLA    PICTURE X.                                              
           02  ABLI  PIC X(8).                                                  
           02  SUMMEL    COMP  PIC  S9(4).                                      
           02  SUMMEF    PICTURE X.                                             
           02  FILLER REDEFINES SUMMEF.                                         
             03 SUMMEA    PICTURE X.                                            
           02  SUMMEI  PIC X(13).                                               
           02  SUMME2L    COMP  PIC  S9(4).                                     
           02  SUMME2F    PICTURE X.                                            
           02  FILLER REDEFINES SUMME2F.                                        
             03 SUMME2A    PICTURE X.                                           
           02  SUMME2I  PIC X(13).                                              
           02  SUMME3L    COMP  PIC  S9(4).                                     
           02  SUMME3F    PICTURE X.                                            
           02  FILLER REDEFINES SUMME3F.                                        
             03 SUMME3A    PICTURE X.                                           
           02  SUMME3I  PIC X(13).                                              
           02  BEITRL    COMP  PIC  S9(4).                                      
           02  BEITRF    PICTURE X.                                             
           02  FILLER REDEFINES BEITRF.                                         
             03 BEITRA    PICTURE X.                                            
           02  BEITRI  PIC X(12).                                               
           02  BEITR2L    COMP  PIC  S9(4).                                     
           02  BEITR2F    PICTURE X.                                            
           02  FILLER REDEFINES BEITR2F.                                        
             03 BEITR2A    PICTURE X.                                           
           02  BEITR2I  PIC X(12).                                              
           02  BEITR3L    COMP  PIC  S9(4).                                     
           02  BEITR3F    PICTURE X.                                            
           02  FILLER REDEFINES BEITR3F.                                        
             03 BEITR3A    PICTURE X.                                           
           02  BEITR3I  PIC X(12).                                              
           02  NAMEL    COMP  PIC  S9(4).                                       
           02  NAMEF    PICTURE X.                                              
           02  FILLER REDEFINES NAMEF.                                          
             03 NAMEA    PICTURE X.                                             
           02  NAMEI  PIC X(60).                                                
           02  STRL    COMP  PIC  S9(4).                                        
           02  STRF    PICTURE X.                                               
           02  FILLER REDEFINES STRF.                                           
             03 STRA    PICTURE X.                                              
           02  STRI  PIC X(26).                                                 
           02  ZEITUNGL    COMP  PIC  S9(4).                                    
           02  ZEITUNGF    PICTURE X.                                           
           02  FILLER REDEFINES ZEITUNGF.                                       
             03 ZEITUNGA    PICTURE X.                                          
           02  ZEITUNGI  PIC X(1).                                              
           02  APLZORTL    COMP  PIC  S9(4).                                    
           02  APLZORTF    PICTURE X.                                           
           02  FILLER REDEFINES APLZORTF.                                       
             03 APLZORTA    PICTURE X.                                          
           02  APLZORTI  PIC X(31).                                             
           02  GEBDL    COMP  PIC  S9(4).                                       
           02  GEBDF    PICTURE X.                                              
           02  FILLER REDEFINES GEBDF.                                          
             03 GEBDA    PICTURE X.                                             
           02  GEBDI  PIC X(8).                                                 
           02  TKDNRL    COMP  PIC  S9(4).                                      
           02  TKDNRF    PICTURE X.                                             
           02  FILLER REDEFINES TKDNRF.                                         
             03 TKDNRA    PICTURE X.                                            
           02  TKDNRI  PIC X(11).                                               
           02  TPRZL    COMP  PIC  S9(4).                                       
           02  TPRZF    PICTURE X.                                              
           02  FILLER REDEFINES TPRZF.                                          
             03 TPRZA    PICTURE X.                                             
           02  TPRZI  PIC X(3).                                                 
           02  KDNRL    COMP  PIC  S9(4).                                       
           02  KDNRF    PICTURE X.                                              
           02  FILLER REDEFINES KDNRF.                                          
             03 KDNRA    PICTURE X.                                             
           02  KDNRI  PIC X(7).                                                 
           02  PRZL    COMP  PIC  S9(4).                                        
           02  PRZF    PICTURE X.                                               
           02  FILLER REDEFINES PRZF.                                           
             03 PRZA    PICTURE X.                                              
           02  PRZI  PIC X(2).                                                  
           02  NKDNRL    COMP  PIC  S9(4).                                      
           02  NKDNRF    PICTURE X.                                             
           02  FILLER REDEFINES NKDNRF.                                         
             03 NKDNRA    PICTURE X.                                            
           02  NKDNRI  PIC X(7).                                                
           02  NPRZL    COMP  PIC  S9(4).                                       
           02  NPRZF    PICTURE X.                                              
           02  FILLER REDEFINES NPRZF.                                          
             03 NPRZA    PICTURE X.                                             
           02  NPRZI  PIC X(2).                                                 
           02  TAVML    COMP  PIC  S9(4).                                       
           02  TAVMF    PICTURE X.                                              
           02  FILLER REDEFINES TAVMF.                                          
             03 TAVMA    PICTURE X.                                             
           02  TAVMI  PIC X(16).                                                
           02  AVML    COMP  PIC  S9(4).                                        
           02  AVMF    PICTURE X.                                               
           02  FILLER REDEFINES AVMF.                                           
             03 AVMA    PICTURE X.                                              
           02  AVMI  PIC X(7).                                                  
           02  AVPRZL    COMP  PIC  S9(4).                                      
           02  AVPRZF    PICTURE X.                                             
           02  FILLER REDEFINES AVPRZF.                                         
             03 AVPRZA    PICTURE X.                                            
           02  AVPRZI  PIC X(1).                                                
           02  AVMSTL    COMP  PIC  S9(4).                                      
           02  AVMSTF    PICTURE X.                                             
           02  FILLER REDEFINES AVMSTF.                                         
             03 AVMSTA    PICTURE X.                                            
           02  AVMSTI  PIC X(1).                                                
           02  NAVML    COMP  PIC  S9(4).                                       
           02  NAVMF    PICTURE X.                                              
           02  FILLER REDEFINES NAVMF.                                          
             03 NAVMA    PICTURE X.                                             
           02  NAVMI  PIC X(7).                                                 
           02  NAVMPRZL    COMP  PIC  S9(4).                                    
           02  NAVMPRZF    PICTURE X.                                           
           02  FILLER REDEFINES NAVMPRZF.                                       
             03 NAVMPRZA    PICTURE X.                                          
           02  NAVMPRZI  PIC X(1).                                              
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  TVBNRI  PIC X(16).                                               
           02  VBNRL    COMP  PIC  S9(4).                                       
           02  VBNRF    PICTURE X.                                              
           02  FILLER REDEFINES VBNRF.                                          
             03 VBNRA    PICTURE X.                                             
           02  VBNRI  PIC X(7).                                                 
           02  VBPRZL    COMP  PIC  S9(4).                                      
           02  VBPRZF    PICTURE X.                                             
           02  FILLER REDEFINES VBPRZF.                                         
             03 VBPRZA    PICTURE X.                                            
           02  VBPRZI  PIC X(1).                                                
           02  TRENN2L    COMP  PIC  S9(4).                                     
           02  TRENN2F    PICTURE X.                                            
           02  FILLER REDEFINES TRENN2F.                                        
             03 TRENN2A    PICTURE X.                                           
           02  TRENN2I  PIC X(2).                                               
           02  DIRL    COMP  PIC  S9(4).                                        
           02  DIRF    PICTURE X.                                               
           02  FILLER REDEFINES DIRF.                                           
             03 DIRA    PICTURE X.                                              
           02  DIRI  PIC X(3).                                                  
           02  VBNR1L    COMP  PIC  S9(4).                                      
           02  VBNR1F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR1F.                                         
             03 VBNR1A    PICTURE X.                                            
           02  VBNR1I  PIC X(7).                                                
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  NVBNRL    COMP  PIC  S9(4).                                      
           02  NVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES NVBNRF.                                         
             03 NVBNRA    PICTURE X.                                            
           02  NVBNRI  PIC X(7).                                                
           02  NVBPRZL    COMP  PIC  S9(4).                                     
           02  NVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES NVBPRZF.                                        
             03 NVBPRZA    PICTURE X.                                           
           02  NVBPRZI  PIC X(1).                                               
           02  TGUELTL    COMP  PIC  S9(4).                                     
           02  TGUELTF    PICTURE X.                                            
           02  FILLER REDEFINES TGUELTF.                                        
             03 TGUELTA    PICTURE X.                                           
           02  TGUELTI  PIC X(16).                                              
           02  GUELTL    COMP  PIC  S9(4).                                      
           02  GUELTF    PICTURE X.                                             
           02  FILLER REDEFINES GUELTF.                                         
             03 GUELTA    PICTURE X.                                            
           02  GUELTI  PIC X(8).                                                
           02  GUELT1L    COMP  PIC  S9(4).                                     
           02  GUELT1F    PICTURE X.                                            
           02  FILLER REDEFINES GUELT1F.                                        
             03 GUELT1A    PICTURE X.                                           
           02  GUELT1I  PIC X(8).                                               
           02  GUELT2L    COMP  PIC  S9(4).                                     
           02  GUELT2F    PICTURE X.                                            
           02  FILLER REDEFINES GUELT2F.                                        
             03 GUELT2A    PICTURE X.                                           
           02  GUELT2I  PIC X(8).                                               
           02  GUELT3L    COMP  PIC  S9(4).                                     
           02  GUELT3F    PICTURE X.                                            
           02  FILLER REDEFINES GUELT3F.                                        
             03 GUELT3A    PICTURE X.                                           
           02  GUELT3I  PIC X(8).                                               
           02  NGUELTL    COMP  PIC  S9(4).                                     
           02  NGUELTF    PICTURE X.                                            
           02  FILLER REDEFINES NGUELTF.                                        
             03 NGUELTA    PICTURE X.                                           
           02  NGUELTI  PIC X(6).                                               
           02  BEARBL    COMP  PIC  S9(4).                                      
           02  BEARBF    PICTURE X.                                             
           02  FILLER REDEFINES BEARBF.                                         
             03 BEARBA    PICTURE X.                                            
           02  BEARBI  PIC X(8).                                                
           02  BEARB1L    COMP  PIC  S9(4).                                     
           02  BEARB1F    PICTURE X.                                            
           02  FILLER REDEFINES BEARB1F.                                        
             03 BEARB1A    PICTURE X.                                           
           02  BEARB1I  PIC X(8).                                               
           02  BEARB2L    COMP  PIC  S9(4).                                     
           02  BEARB2F    PICTURE X.                                            
           02  FILLER REDEFINES BEARB2F.                                        
             03 BEARB2A    PICTURE X.                                           
           02  BEARB2I  PIC X(8).                                               
           02  BEARB3L    COMP  PIC  S9(4).                                     
           02  BEARB3F    PICTURE X.                                            
           02  FILLER REDEFINES BEARB3F.                                        
             03 BEARB3A    PICTURE X.                                           
           02  BEARB3I  PIC X(8).                                               
           02  HTEXTL    COMP  PIC  S9(4).                                      
           02  HTEXTF    PICTURE X.                                             
           02  FILLER REDEFINES HTEXTF.                                         
             03 HTEXTA    PICTURE X.                                            
           02  HTEXTI  PIC X(79).                                               
           02  IDNRL    COMP  PIC  S9(4).                                       
           02  IDNRF    PICTURE X.                                              
           02  FILLER REDEFINES IDNRF.                                          
             03 IDNRA    PICTURE X.                                             
           02  IDNRI  PIC X(7).                                                 
           02  IPRZL    COMP  PIC  S9(4).                                       
           02  IPRZF    PICTURE X.                                              
           02  FILLER REDEFINES IPRZF.                                          
             03 IPRZA    PICTURE X.                                             
           02  IPRZI  PIC X(2).                                                 
           02  TEXTL    COMP  PIC  S9(4).                                       
           02  TEXTF    PICTURE X.                                              
           02  FILLER REDEFINES TEXTF.                                          
             03 TEXTA    PICTURE X.                                             
           02  TEXTI  PIC X(20).                                                
           02  JNL    COMP  PIC  S9(4).                                         
           02  JNF    PICTURE X.                                                
           02  FILLER REDEFINES JNF.                                            
             03 JNA    PICTURE X.                                               
           02  JNI  PIC X(1).                                                   
           02  V2201L    COMP  PIC  S9(4).                                      
           02  V2201F    PICTURE X.                                             
           02  FILLER REDEFINES V2201F.                                         
             03 V2201A    PICTURE X.                                            
           02  V2201I  PIC X(13).                                               
           02  V2216L    COMP  PIC  S9(4).                                      
           02  V2216F    PICTURE X.                                             
           02  FILLER REDEFINES V2216F.                                         
             03 V2216A    PICTURE X.                                            
           02  V2216I  PIC X(13).                                               
           02  NGESL    COMP  PIC  S9(4).                                       
           02  NGESF    PICTURE X.                                              
           02  FILLER REDEFINES NGESF.                                          
             03 NGESA    PICTURE X.                                             
           02  NGESI  PIC X(2).                                                 
           02  V2233L    COMP  PIC  S9(4).                                      
           02  V2233F    PICTURE X.                                             
           02  FILLER REDEFINES V2233F.                                         
             03 V2233A    PICTURE X.                                            
           02  V2233I  PIC X(13).                                               
           02  NVNRL    COMP  PIC  S9(4).                                       
           02  NVNRF    PICTURE X.                                              
           02  FILLER REDEFINES NVNRF.                                          
             03 NVNRA    PICTURE X.                                             
           02  NVNRI  PIC 9(15).                                                
           02  FTEXTL    COMP  PIC  S9(4).                                      
           02  FTEXTF    PICTURE X.                                             
           02  FILLER REDEFINES FTEXTF.                                         
             03 FTEXTA    PICTURE X.                                            
           02  FTEXTI  PIC X(79).                                               
           02  V2401L    COMP  PIC  S9(4).                                      
           02  V2401F    PICTURE X.                                             
           02  FILLER REDEFINES V2401F.                                         
             03 V2401A    PICTURE X.                                            
           02  V2401I  PIC X(79).                                               
       01  UU945O REDEFINES UU945I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  V0219O  PIC X(14).                                               
           02  FILLER PICTURE X(3).                                             
           02  GESO  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  TRENN1O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRODO  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  BAO  PIC X(6).                                                   
           02  FILLER PICTURE X(3).                                             
           02  BADATO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNRO  PIC X(16).                                                 
           02  FILLER PICTURE X(3).                                             
           02  BATEXTO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEGO  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ABLO  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  SUMMEO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  SUMME2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  SUMME3O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITRO  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEITR2O  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEITR3O  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  NAMEO  PIC X(60).                                                
           02  FILLER PICTURE X(3).                                             
           02  STRO  PIC X(26).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZEITUNGO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLZORTO  PIC X(31).                                             
           02  FILLER PICTURE X(3).                                             
           02  GEBDO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TKDNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPRZO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  KDNRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZO  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NKDNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NPRZO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAVMO  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AVPRZO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMSTO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  NAVMO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  NAVMPRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVBNRO  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBPRZO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TRENN2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIRO  PIC X(3).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TGUELTO  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  GUELTO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  GUELT1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  GUELT2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  GUELT3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  NGUELTO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEARBO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  BEARB1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEARB2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEARB3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  HTEXTO  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  IDNRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IPRZO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TEXTO  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  JNO  PIC X(1).                                                   
           02  FILLER PICTURE X(3).                                             
           02  V2201O  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2216O  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  NGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  V2233O  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  NVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  FTEXTO  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2401O  PIC X(79).                                               
