       01  UU954I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR3L    COMP  PIC  S9(4).                                       
           02  PNR3F    PICTURE X.                                              
           02  FILLER REDEFINES PNR3F.                                          
             03 PNR3A    PICTURE X.                                             
           02  PNR3I  PIC X(7).                                                 
           02  DAT3L    COMP  PIC  S9(4).                                       
           02  DAT3F    PICTURE X.                                              
           02  FILLER REDEFINES DAT3F.                                          
             03 DAT3A    PICTURE X.                                             
           02  DAT3I  PIC X(8).                                                 
           02  UHR3L    COMP  PIC  S9(4).                                       
           02  UHR3F    PICTURE X.                                              
           02  FILLER REDEFINES UHR3F.                                          
             03 UHR3A    PICTURE X.                                             
           02  UHR3I  PIC X(5).                                                 
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  PRZ3L    COMP  PIC  S9(4).                                       
           02  PRZ3F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ3F.                                          
             03 PRZ3A    PICTURE X.                                             
           02  PRZ3I  PIC X(1).                                                 
           02  DIR3L    COMP  PIC  S9(4).                                       
           02  DIR3F    PICTURE X.                                              
           02  FILLER REDEFINES DIR3F.                                          
             03 DIR3A    PICTURE X.                                             
           02  DIR3I  PIC X(3).                                                 
           02  ZUNAM3L    COMP  PIC  S9(4).                                     
           02  ZUNAM3F    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAM3F.                                        
             03 ZUNAM3A    PICTURE X.                                           
           02  ZUNAM3I  PIC X(20).                                              
           02  VNAM3L    COMP  PIC  S9(4).                                      
           02  VNAM3F    PICTURE X.                                             
           02  FILLER REDEFINES VNAM3F.                                         
             03 VNAM3A    PICTURE X.                                            
           02  VNAM3I  PIC X(10).                                               
           02  VORSEMTL    COMP  PIC  S9(4).                                    
           02  VORSEMTF    PICTURE X.                                           
           02  FILLER REDEFINES VORSEMTF.                                       
             03 VORSEMTA    PICTURE X.                                          
           02  VORSEMTI  PIC X(6).                                              
           02  VORSEML    COMP  PIC  S9(4).                                     
           02  VORSEMF    PICTURE X.                                            
           02  FILLER REDEFINES VORSEMF.                                        
             03 VORSEMA    PICTURE X.                                           
           02  VORSEMI  PIC X(5).                                               
           02  VORSEMEL    COMP  PIC  S9(4).                                    
           02  VORSEMEF    PICTURE X.                                           
           02  FILLER REDEFINES VORSEMEF.                                       
             03 VORSEMEA    PICTURE X.                                          
           02  VORSEMEI  PIC X(4).                                              
           02  GAPRUETL    COMP  PIC  S9(4).                                    
           02  GAPRUETF    PICTURE X.                                           
           02  FILLER REDEFINES GAPRUETF.                                       
             03 GAPRUETA    PICTURE X.                                          
           02  GAPRUETI  PIC X(7).                                              
           02  GAPRUEL    COMP  PIC  S9(4).                                     
           02  GAPRUEF    PICTURE X.                                            
           02  FILLER REDEFINES GAPRUEF.                                        
             03 GAPRUEA    PICTURE X.                                           
           02  GAPRUEI  PIC X(5).                                               
           02  GAPRUEEL    COMP  PIC  S9(4).                                    
           02  GAPRUEEF    PICTURE X.                                           
           02  FILLER REDEFINES GAPRUEEF.                                       
             03 GAPRUEEA    PICTURE X.                                          
           02  GAPRUEEI  PIC X(4).                                              
           02  BDVPRUTL    COMP  PIC  S9(4).                                    
           02  BDVPRUTF    PICTURE X.                                           
           02  FILLER REDEFINES BDVPRUTF.                                       
             03 BDVPRUTA    PICTURE X.                                          
           02  BDVPRUTI  PIC X(8).                                              
           02  BDVPRUL    COMP  PIC  S9(4).                                     
           02  BDVPRUF    PICTURE X.                                            
           02  FILLER REDEFINES BDVPRUF.                                        
             03 BDVPRUA    PICTURE X.                                           
           02  BDVPRUI  PIC X(5).                                               
           02  MITGLL    COMP  PIC  S9(4).                                      
           02  MITGLF    PICTURE X.                                             
           02  FILLER REDEFINES MITGLF.                                         
             03 MITGLA    PICTURE X.                                            
           02  MITGLI  PIC X(4).                                                
           02  BDVPRUEL    COMP  PIC  S9(4).                                    
           02  BDVPRUEF    PICTURE X.                                           
           02  FILLER REDEFINES BDVPRUEF.                                       
             03 BDVPRUEA    PICTURE X.                                          
           02  BDVPRUEI  PIC X(4).                                              
           02  MITGLTL    COMP  PIC  S9(4).                                     
           02  MITGLTF    PICTURE X.                                            
           02  FILLER REDEFINES MITGLTF.                                        
             03 MITGLTA    PICTURE X.                                           
           02  MITGLTI  PIC X(5).                                               
           02  MITGLEL    COMP  PIC  S9(4).                                     
           02  MITGLEF    PICTURE X.                                            
           02  FILLER REDEFINES MITGLEF.                                        
             03 MITGLEA    PICTURE X.                                           
           02  MITGLEI  PIC X(4).                                               
           02  RAUT1TL    COMP  PIC  S9(4).                                     
           02  RAUT1TF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT1TF.                                        
             03 RAUT1TA    PICTURE X.                                           
           02  RAUT1TI  PIC X(12).                                              
           02  RAUT11L    COMP  PIC  S9(4).                                     
           02  RAUT11F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT11F.                                        
             03 RAUT11A    PICTURE X.                                           
           02  RAUT11I  PIC X(5).                                               
           02  RAUT12L    COMP  PIC  S9(4).                                     
           02  RAUT12F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT12F.                                        
             03 RAUT12A    PICTURE X.                                           
           02  RAUT12I  PIC X(5).                                               
           02  RAUT1EL    COMP  PIC  S9(4).                                     
           02  RAUT1EF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT1EF.                                        
             03 RAUT1EA    PICTURE X.                                           
           02  RAUT1EI  PIC X(4).                                               
           02  RAUT2TL    COMP  PIC  S9(4).                                     
           02  RAUT2TF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT2TF.                                        
             03 RAUT2TA    PICTURE X.                                           
           02  RAUT2TI  PIC X(12).                                              
           02  RAUT21L    COMP  PIC  S9(4).                                     
           02  RAUT21F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT21F.                                        
             03 RAUT21A    PICTURE X.                                           
           02  RAUT21I  PIC X(5).                                               
           02  RAUT22L    COMP  PIC  S9(4).                                     
           02  RAUT22F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT22F.                                        
             03 RAUT22A    PICTURE X.                                           
           02  RAUT22I  PIC X(5).                                               
           02  RAUT2EL    COMP  PIC  S9(4).                                     
           02  RAUT2EF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT2EF.                                        
             03 RAUT2EA    PICTURE X.                                           
           02  RAUT2EI  PIC X(4).                                               
           02  RAUT3TL    COMP  PIC  S9(4).                                     
           02  RAUT3TF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT3TF.                                        
             03 RAUT3TA    PICTURE X.                                           
           02  RAUT3TI  PIC X(12).                                              
           02  RAUT31L    COMP  PIC  S9(4).                                     
           02  RAUT31F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT31F.                                        
             03 RAUT31A    PICTURE X.                                           
           02  RAUT31I  PIC X(5).                                               
           02  RAUT32L    COMP  PIC  S9(4).                                     
           02  RAUT32F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT32F.                                        
             03 RAUT32A    PICTURE X.                                           
           02  RAUT32I  PIC X(5).                                               
           02  RAUT3EL    COMP  PIC  S9(4).                                     
           02  RAUT3EF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT3EF.                                        
             03 RAUT3EA    PICTURE X.                                           
           02  RAUT3EI  PIC X(4).                                               
           02  RAUT4TL    COMP  PIC  S9(4).                                     
           02  RAUT4TF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT4TF.                                        
             03 RAUT4TA    PICTURE X.                                           
           02  RAUT4TI  PIC X(12).                                              
           02  RAUT41L    COMP  PIC  S9(4).                                     
           02  RAUT41F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT41F.                                        
             03 RAUT41A    PICTURE X.                                           
           02  RAUT41I  PIC X(5).                                               
           02  RAUT42L    COMP  PIC  S9(4).                                     
           02  RAUT42F    PICTURE X.                                            
           02  FILLER REDEFINES RAUT42F.                                        
             03 RAUT42A    PICTURE X.                                           
           02  RAUT42I  PIC X(5).                                               
           02  RAUT4EL    COMP  PIC  S9(4).                                     
           02  RAUT4EF    PICTURE X.                                            
           02  FILLER REDEFINES RAUT4EF.                                        
             03 RAUT4EA    PICTURE X.                                           
           02  RAUT4EI  PIC X(4).                                               
           02  GABVONTL    COMP  PIC  S9(4).                                    
           02  GABVONTF    PICTURE X.                                           
           02  FILLER REDEFINES GABVONTF.                                       
             03 GABVONTA    PICTURE X.                                          
           02  GABVONTI  PIC X(14).                                             
           02  GABVONL    COMP  PIC  S9(4).                                     
           02  GABVONF    PICTURE X.                                            
           02  FILLER REDEFINES GABVONF.                                        
             03 GABVONA    PICTURE X.                                           
           02  GABVONI  PIC X(5).                                               
           02  GABPRFTL    COMP  PIC  S9(4).                                    
           02  GABPRFTF    PICTURE X.                                           
           02  FILLER REDEFINES GABPRFTF.                                       
             03 GABPRFTA    PICTURE X.                                          
           02  GABPRFTI  PIC X(5).                                              
           02  GABVONEL    COMP  PIC  S9(4).                                    
           02  GABVONEF    PICTURE X.                                           
           02  FILLER REDEFINES GABVONEF.                                       
             03 GABVONEA    PICTURE X.                                          
           02  GABVONEI  PIC X(4).                                              
           02  GABPRFEL    COMP  PIC  S9(4).                                    
           02  GABPRFEF    PICTURE X.                                           
           02  FILLER REDEFINES GABPRFEF.                                       
             03 GABPRFEA    PICTURE X.                                          
           02  GABPRFEI  PIC X(4).                                              
           02  CORELL3L    COMP  PIC  S9(4).                                    
           02  CORELL3F    PICTURE X.                                           
           02  FILLER REDEFINES CORELL3F.                                       
             03 CORELL3A    PICTURE X.                                          
           02  CORELL3I  PIC X(21).                                             
           02  CORELL    COMP  PIC  S9(4).                                      
           02  CORELF    PICTURE X.                                             
           02  FILLER REDEFINES CORELF.                                         
             03 CORELA    PICTURE X.                                            
           02  CORELI  PIC X(5).                                                
           02  CORELEL    COMP  PIC  S9(4).                                     
           02  CORELEF    PICTURE X.                                            
           02  FILLER REDEFINES CORELEF.                                        
             03 CORELEA    PICTURE X.                                           
           02  CORELEI  PIC X(4).                                               
           02  KOFFERL    COMP  PIC  S9(4).                                     
           02  KOFFERF    PICTURE X.                                            
           02  FILLER REDEFINES KOFFERF.                                        
             03 KOFFERA    PICTURE X.                                           
           02  KOFFERI  PIC X(13).                                              
           02  KOFFER1L    COMP  PIC  S9(4).                                    
           02  KOFFER1F    PICTURE X.                                           
           02  FILLER REDEFINES KOFFER1F.                                       
             03 KOFFER1A    PICTURE X.                                          
           02  KOFFER1I  PIC X(5).                                              
           02  KOFFER2L    COMP  PIC  S9(4).                                    
           02  KOFFER2F    PICTURE X.                                           
           02  FILLER REDEFINES KOFFER2F.                                       
             03 KOFFER2A    PICTURE X.                                          
           02  KOFFER2I  PIC X(5).                                              
           02  KOFFE1L    COMP  PIC  S9(4).                                     
           02  KOFFE1F    PICTURE X.                                            
           02  FILLER REDEFINES KOFFE1F.                                        
             03 KOFFE1A    PICTURE X.                                           
           02  KOFFE1I  PIC X(4).                                               
           02  KOFFE2L    COMP  PIC  S9(4).                                     
           02  KOFFE2F    PICTURE X.                                            
           02  FILLER REDEFINES KOFFE2F.                                        
             03 KOFFE2A    PICTURE X.                                           
           02  KOFFE2I  PIC X(4).                                               
           02  VBHANDTL    COMP  PIC  S9(4).                                    
           02  VBHANDTF    PICTURE X.                                           
           02  FILLER REDEFINES VBHANDTF.                                       
             03 VBHANDTA    PICTURE X.                                          
           02  VBHANDTI  PIC X(17).                                             
           02  VBHANDOL    COMP  PIC  S9(4).                                    
           02  VBHANDOF    PICTURE X.                                           
           02  FILLER REDEFINES VBHANDOF.                                       
             03 VBHANDOA    PICTURE X.                                          
           02  VBHANDOI  PIC X(1).                                              
           02  VBHANDEL    COMP  PIC  S9(4).                                    
           02  VBHANDEF    PICTURE X.                                           
           02  FILLER REDEFINES VBHANDEF.                                       
             03 VBHANDEA    PICTURE X.                                          
           02  VBHANDEI  PIC X(1).                                              
           02  PRUEF3TL    COMP  PIC  S9(4).                                    
           02  PRUEF3TF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF3TF.                                       
             03 PRUEF3TA    PICTURE X.                                          
           02  PRUEF3TI  PIC X(22).                                             
           02  PRUEF3EL    COMP  PIC  S9(4).                                    
           02  PRUEF3EF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF3EF.                                       
             03 PRUEF3EA    PICTURE X.                                          
           02  PRUEF3EI  PIC X(1).                                              
           02  FEHL3L    COMP  PIC  S9(4).                                      
           02  FEHL3F    PICTURE X.                                             
           02  FILLER REDEFINES FEHL3F.                                         
             03 FEHL3A    PICTURE X.                                            
           02  FEHL3I  PIC X(75).                                               
       01  UU954O REDEFINES UU954I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR3O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT3O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIR3O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZUNAM3O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAM3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VORSEMTO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  VORSEMO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  VORSEMEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  GAPRUETO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  GAPRUEO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  GAPRUEEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  BDVPRUTO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  BDVPRUO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  MITGLO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  BDVPRUEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  MITGLTO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  MITGLEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT1TO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  RAUT11O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT12O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT1EO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT2TO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  RAUT21O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT22O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT2EO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT3TO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  RAUT31O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT32O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT3EO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT4TO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  RAUT41O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT42O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT4EO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  GABVONTO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  GABVONO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  GABPRFTO PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  GABVONEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  GABPRFEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  CORELL3O  PIC X(21).                                             
           02  FILLER PICTURE X(3).                                             
           02  CORELO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  CORELEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  KOFFERO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  KOFFER1O PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  KOFFER2O PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  KOFFE1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  KOFFE2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBHANDTO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBHANDOO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBHANDEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRUEF3TO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEF3EO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHL3O  PIC X(75).                                               
