       01  UU953I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR2L    COMP  PIC  S9(4).                                       
           02  PNR2F    PICTURE X.                                              
           02  FILLER REDEFINES PNR2F.                                          
             03 PNR2A    PICTURE X.                                             
           02  PNR2I  PIC X(7).                                                 
           02  DAT2L    COMP  PIC  S9(4).                                       
           02  DAT2F    PICTURE X.                                              
           02  FILLER REDEFINES DAT2F.                                          
             03 DAT2A    PICTURE X.                                             
           02  DAT2I  PIC X(8).                                                 
           02  UHR2L    COMP  PIC  S9(4).                                       
           02  UHR2F    PICTURE X.                                              
           02  FILLER REDEFINES UHR2F.                                          
             03 UHR2A    PICTURE X.                                             
           02  UHR2I  PIC X(5).                                                 
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  PRZ2L    COMP  PIC  S9(4).                                       
           02  PRZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ2F.                                          
             03 PRZ2A    PICTURE X.                                             
           02  PRZ2I  PIC X(1).                                                 
           02  DIR2L    COMP  PIC  S9(4).                                       
           02  DIR2F    PICTURE X.                                              
           02  FILLER REDEFINES DIR2F.                                          
             03 DIR2A    PICTURE X.                                             
           02  DIR2I  PIC X(3).                                                 
           02  ZUNAM2L    COMP  PIC  S9(4).                                     
           02  ZUNAM2F    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAM2F.                                        
             03 ZUNAM2A    PICTURE X.                                           
           02  ZUNAM2I  PIC X(20).                                              
           02  VORNAM2L    COMP  PIC  S9(4).                                    
           02  VORNAM2F    PICTURE X.                                           
           02  FILLER REDEFINES VORNAM2F.                                       
             03 VORNAM2A    PICTURE X.                                          
           02  VORNAM2I  PIC X(10).                                             
           02  STR2TL    COMP  PIC  S9(4).                                      
           02  STR2TF    PICTURE X.                                             
           02  FILLER REDEFINES STR2TF.                                         
             03 STR2TA    PICTURE X.                                            
           02  STR2TI  PIC X(7).                                                
           02  AUSL2TL    COMP  PIC  S9(4).                                     
           02  AUSL2TF    PICTURE X.                                            
           02  FILLER REDEFINES AUSL2TF.                                        
             03 AUSL2TA    PICTURE X.                                           
           02  AUSL2TI  PIC X(4).                                               
           02  STR2L    COMP  PIC  S9(4).                                       
           02  STR2F    PICTURE X.                                              
           02  FILLER REDEFINES STR2F.                                          
             03 STR2A    PICTURE X.                                             
           02  STR2I  PIC X(20).                                                
           02  AUSL2L    COMP  PIC  S9(4).                                      
           02  AUSL2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL2F.                                         
             03 AUSL2A    PICTURE X.                                            
           02  AUSL2I  PIC X(3).                                                
           02  STR2EL    COMP  PIC  S9(4).                                      
           02  STR2EF    PICTURE X.                                             
           02  FILLER REDEFINES STR2EF.                                         
             03 STR2EA    PICTURE X.                                            
           02  STR2EI  PIC X(20).                                               
           02  AUSL2EL    COMP  PIC  S9(4).                                     
           02  AUSL2EF    PICTURE X.                                            
           02  FILLER REDEFINES AUSL2EF.                                        
             03 AUSL2EA    PICTURE X.                                           
           02  AUSL2EI  PIC X(3).                                               
           02  PLZ2TL    COMP  PIC  S9(4).                                      
           02  PLZ2TF    PICTURE X.                                             
           02  FILLER REDEFINES PLZ2TF.                                         
             03 PLZ2TA    PICTURE X.                                            
           02  PLZ2TI  PIC X(17).                                               
           02  PLZ2L    COMP  PIC  S9(4).                                       
           02  PLZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ2F.                                          
             03 PLZ2A    PICTURE X.                                             
           02  PLZ2I  PIC X(6).                                                 
           02  ORT2L    COMP  PIC  S9(4).                                       
           02  ORT2F    PICTURE X.                                              
           02  FILLER REDEFINES ORT2F.                                          
             03 ORT2A    PICTURE X.                                             
           02  ORT2I  PIC X(16).                                                
           02  PB2L    COMP  PIC  S9(4).                                        
           02  PB2F    PICTURE X.                                               
           02  FILLER REDEFINES PB2F.                                           
             03 PB2A    PICTURE X.                                              
           02  PB2I.                                                            
             03  KLAMMLI  PIC X(1).                                             
             03  PBI  PIC X(1).                                                 
             03  KLAMMRI  PIC X(1).                                             
           02  PLZ2EL    COMP  PIC  S9(4).                                      
           02  PLZ2EF    PICTURE X.                                             
           02  FILLER REDEFINES PLZ2EF.                                         
             03 PLZ2EA    PICTURE X.                                            
           02  PLZ2EI  PIC X(6).                                                
           02  ORT2EL    COMP  PIC  S9(4).                                      
           02  ORT2EF    PICTURE X.                                             
           02  FILLER REDEFINES ORT2EF.                                         
             03 ORT2EA    PICTURE X.                                            
           02  ORT2EI  PIC X(16).                                               
           02  PB2EL    COMP  PIC  S9(4).                                       
           02  PB2EF    PICTURE X.                                              
           02  FILLER REDEFINES PB2EF.                                          
             03 PB2EA    PICTURE X.                                             
           02  PB2EI  PIC X(1).                                                 
           02  TEL2TL    COMP  PIC  S9(4).                                      
           02  TEL2TF    PICTURE X.                                             
           02  FILLER REDEFINES TEL2TF.                                         
             03 TEL2TA    PICTURE X.                                            
           02  TEL2TI  PIC X(6).                                                
           02  TEL2L    COMP  PIC  S9(4).                                       
           02  TEL2F    PICTURE X.                                              
           02  FILLER REDEFINES TEL2F.                                          
             03 TEL2A    PICTURE X.                                             
           02  TEL2I  PIC X(14).                                                
           02  TEL2EL    COMP  PIC  S9(4).                                      
           02  TEL2EF    PICTURE X.                                             
           02  FILLER REDEFINES TEL2EF.                                         
             03 TEL2EA    PICTURE X.                                            
           02  TEL2EI  PIC X(14).                                               
           02  INSTTL    COMP  PIC  S9(4).                                      
           02  INSTTF    PICTURE X.                                             
           02  FILLER REDEFINES INSTTF.                                         
             03 INSTTA    PICTURE X.                                            
           02  INSTTI  PIC X(12).                                               
           02  INSTL    COMP  PIC  S9(4).                                       
           02  INSTF    PICTURE X.                                              
           02  FILLER REDEFINES INSTF.                                          
             03 INSTA    PICTURE X.                                             
           02  INSTI  PIC X(22).                                                
           02  INSTEL    COMP  PIC  S9(4).                                      
           02  INSTEF    PICTURE X.                                             
           02  FILLER REDEFINES INSTEF.                                         
             03 INSTEA    PICTURE X.                                            
           02  INSTEI  PIC X(22).                                               
           02  BLZTL    COMP  PIC  S9(4).                                       
           02  BLZTF    PICTURE X.                                              
           02  FILLER REDEFINES BLZTF.                                          
             03 BLZTA    PICTURE X.                                             
           02  BLZTI  PIC X(14).                                                
           02  BLZL    COMP  PIC  S9(4).                                        
           02  BLZF    PICTURE X.                                               
           02  FILLER REDEFINES BLZF.                                           
             03 BLZA    PICTURE X.                                              
           02  BLZI  PIC X(8).                                                  
           02  KTONRL    COMP  PIC  S9(4).                                      
           02  KTONRF    PICTURE X.                                             
           02  FILLER REDEFINES KTONRF.                                         
             03 KTONRA    PICTURE X.                                            
           02  KTONRI  PIC X(11).                                               
           02  BLZEL    COMP  PIC  S9(4).                                       
           02  BLZEF    PICTURE X.                                              
           02  FILLER REDEFINES BLZEF.                                          
             03 BLZEA    PICTURE X.                                             
           02  BLZEI  PIC X(8).                                                 
           02  KTONREL    COMP  PIC  S9(4).                                     
           02  KTONREF    PICTURE X.                                            
           02  FILLER REDEFINES KTONREF.                                        
             03 KTONREA    PICTURE X.                                           
           02  KTONREI  PIC X(10).                                              
           02  KTOINHTL    COMP  PIC  S9(4).                                    
           02  KTOINHTF    PICTURE X.                                           
           02  FILLER REDEFINES KTOINHTF.                                       
             03 KTOINHTA    PICTURE X.                                          
           02  KTOINHTI  PIC X(13).                                             
           02  KTOINHL    COMP  PIC  S9(4).                                     
           02  KTOINHF    PICTURE X.                                            
           02  FILLER REDEFINES KTOINHF.                                        
             03 KTOINHA    PICTURE X.                                           
           02  KTOINHI  PIC X(25).                                              
           02  KTOINHEL    COMP  PIC  S9(4).                                    
           02  KTOINHEF    PICTURE X.                                           
           02  FILLER REDEFINES KTOINHEF.                                       
             03 KTOINHEA    PICTURE X.                                          
           02  KTOINHEI  PIC X(25).                                             
           02  VBPCNT1L    COMP  PIC  S9(4).                                    
           02  VBPCNT1F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNT1F.                                       
             03 VBPCNT1A    PICTURE X.                                          
           02  VBPCNT1I  PIC X(7).                                              
           02  VBPCNT2L    COMP  PIC  S9(4).                                    
           02  VBPCNT2F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNT2F.                                       
             03 VBPCNT2A    PICTURE X.                                          
           02  VBPCNT2I  PIC X(7).                                              
           02  VBPCNT3L    COMP  PIC  S9(4).                                    
           02  VBPCNT3F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNT3F.                                       
             03 VBPCNT3A    PICTURE X.                                          
           02  VBPCNT3I  PIC X(7).                                              
           02  VBPCNR1L    COMP  PIC  S9(4).                                    
           02  VBPCNR1F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNR1F.                                       
             03 VBPCNR1A    PICTURE X.                                          
           02  VBPCNR1I  PIC X(5).                                              
           02  VBPCNR2L    COMP  PIC  S9(4).                                    
           02  VBPCNR2F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNR2F.                                       
             03 VBPCNR2A    PICTURE X.                                          
           02  VBPCNR2I  PIC X(5).                                              
           02  VBPCNR3L    COMP  PIC  S9(4).                                    
           02  VBPCNR3F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNR3F.                                       
             03 VBPCNR3A    PICTURE X.                                          
           02  VBPCNR3I  PIC X(7).                                              
           02  VBPCNE1L    COMP  PIC  S9(4).                                    
           02  VBPCNE1F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNE1F.                                       
             03 VBPCNE1A    PICTURE X.                                          
           02  VBPCNE1I  PIC X(5).                                              
           02  VBPCNE2L    COMP  PIC  S9(4).                                    
           02  VBPCNE2F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNE2F.                                       
             03 VBPCNE2A    PICTURE X.                                          
           02  VBPCNE2I  PIC X(5).                                              
           02  VBPCNE3L    COMP  PIC  S9(4).                                    
           02  VBPCNE3F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNE3F.                                       
             03 VBPCNE3A    PICTURE X.                                          
           02  VBPCNE3I  PIC X(5).                                              
           02  PC3KZTL    COMP  PIC  S9(4).                                     
           02  PC3KZTF    PICTURE X.                                            
           02  FILLER REDEFINES PC3KZTF.                                        
             03 PC3KZTA    PICTURE X.                                           
           02  PC3KZTI  PIC X(1).                                               
           02  VBPC3KZL    COMP  PIC  S9(4).                                    
           02  VBPC3KZF    PICTURE X.                                           
           02  FILLER REDEFINES VBPC3KZF.                                       
             03 VBPC3KZA    PICTURE X.                                          
           02  VBPC3KZI  PIC X(1).                                              
           02  VBPCNT4L    COMP  PIC  S9(4).                                    
           02  VBPCNT4F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNT4F.                                       
             03 VBPCNT4A    PICTURE X.                                          
           02  VBPCNT4I  PIC X(7).                                              
           02  VBPCNR4L    COMP  PIC  S9(4).                                    
           02  VBPCNR4F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNR4F.                                       
             03 VBPCNR4A    PICTURE X.                                          
           02  VBPCNR4I  PIC X(5).                                              
           02  VBPCNE4L    COMP  PIC  S9(4).                                    
           02  VBPCNE4F    PICTURE X.                                           
           02  FILLER REDEFINES VBPCNE4F.                                       
             03 VBPCNE4A    PICTURE X.                                          
           02  VBPCNE4I  PIC X(5).                                              
           02  VBSEITTL    COMP  PIC  S9(4).                                    
           02  VBSEITTF    PICTURE X.                                           
           02  FILLER REDEFINES VBSEITTF.                                       
             03 VBSEITTA    PICTURE X.                                          
           02  VBSEITTI  PIC X(7).                                              
           02  VBSEITL    COMP  PIC  S9(4).                                     
           02  VBSEITF    PICTURE X.                                            
           02  FILLER REDEFINES VBSEITF.                                        
             03 VBSEITA    PICTURE X.                                           
           02  VBSEITI  PIC X(8).                                               
           02  VBSEITEL    COMP  PIC  S9(4).                                    
           02  VBSEITEF    PICTURE X.                                           
           02  FILLER REDEFINES VBSEITEF.                                       
             03 VBSEITEA    PICTURE X.                                          
           02  VBSEITEI  PIC X(6).                                              
           02  VERTRTL    COMP  PIC  S9(4).                                     
           02  VERTRTF    PICTURE X.                                            
           02  FILLER REDEFINES VERTRTF.                                        
             03 VERTRTA    PICTURE X.                                           
           02  VERTRTI  PIC X(14).                                              
           02  VERTRL    COMP  PIC  S9(4).                                      
           02  VERTRF    PICTURE X.                                             
           02  FILLER REDEFINES VERTRF.                                         
             03 VERTRA    PICTURE X.                                            
           02  VERTRI.                                                          
             03  VERTR1I  PIC X(8).                                             
             03  VERTRKI  PIC X(1).                                             
           02  VERTR2L    COMP  PIC  S9(4).                                     
           02  VERTR2F    PICTURE X.                                            
           02  FILLER REDEFINES VERTR2F.                                        
             03 VERTR2A    PICTURE X.                                           
           02  VERTR2I  PIC X(8).                                               
           02  VERTR1EL    COMP  PIC  S9(4).                                    
           02  VERTR1EF    PICTURE X.                                           
           02  FILLER REDEFINES VERTR1EF.                                       
             03 VERTR1EA    PICTURE X.                                          
           02  VERTR1EI  PIC X(6).                                              
           02  VERTR2EL    COMP  PIC  S9(4).                                    
           02  VERTR2EF    PICTURE X.                                           
           02  FILLER REDEFINES VERTR2EF.                                       
             03 VERTR2EA    PICTURE X.                                          
           02  VERTR2EI  PIC X(6).                                              
           02  BESCHRL    COMP  PIC  S9(4).                                     
           02  BESCHRF    PICTURE X.                                            
           02  FILLER REDEFINES BESCHRF.                                        
             03 BESCHRA    PICTURE X.                                           
           02  BESCHRI  PIC X(15).                                              
           02  BESCHR1L    COMP  PIC  S9(4).                                    
           02  BESCHR1F    PICTURE X.                                           
           02  FILLER REDEFINES BESCHR1F.                                       
             03 BESCHR1A    PICTURE X.                                          
           02  BESCHR1I  PIC X(20).                                             
           02  BESCHR2L    COMP  PIC  S9(4).                                    
           02  BESCHR2F    PICTURE X.                                           
           02  FILLER REDEFINES BESCHR2F.                                       
             03 BESCHR2A    PICTURE X.                                          
           02  BESCHR2I  PIC X(20).                                             
           02  ZUVERTL    COMP  PIC  S9(4).                                     
           02  ZUVERTF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERTF.                                        
             03 ZUVERTA    PICTURE X.                                           
           02  ZUVERTI  PIC X(13).                                              
           02  ZUVER1L    COMP  PIC  S9(4).                                     
           02  ZUVER1F    PICTURE X.                                            
           02  FILLER REDEFINES ZUVER1F.                                        
             03 ZUVER1A    PICTURE X.                                           
           02  ZUVER1I  PIC X(2).                                               
           02  ZUVER2L    COMP  PIC  S9(4).                                     
           02  ZUVER2F    PICTURE X.                                            
           02  FILLER REDEFINES ZUVER2F.                                        
             03 ZUVER2A    PICTURE X.                                           
           02  ZUVER2I  PIC X(8).                                               
           02  ZUVERBL    COMP  PIC  S9(4).                                     
           02  ZUVERBF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERBF.                                        
             03 ZUVERBA    PICTURE X.                                           
           02  ZUVERBI  PIC X(1).                                               
           02  ZUVER3L    COMP  PIC  S9(4).                                     
           02  ZUVER3F    PICTURE X.                                            
           02  FILLER REDEFINES ZUVER3F.                                        
             03 ZUVER3A    PICTURE X.                                           
           02  ZUVER3I  PIC X(2).                                               
           02  ZUVERVL    COMP  PIC  S9(4).                                     
           02  ZUVERVF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERVF.                                        
             03 ZUVERVA    PICTURE X.                                           
           02  ZUVERVI  PIC X(1).                                               
           02  ZUVKTXL    COMP  PIC  S9(4).                                     
           02  ZUVKTXF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVKTXF.                                        
             03 ZUVKTXA    PICTURE X.                                           
           02  ZUVKTXI  PIC X(2).                                               
           02  ZUVERKL    COMP  PIC  S9(4).                                     
           02  ZUVERKF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERKF.                                        
             03 ZUVERKA    PICTURE X.                                           
           02  ZUVERKI  PIC X(2).                                               
           02  ZUVER1EL    COMP  PIC  S9(4).                                    
           02  ZUVER1EF    PICTURE X.                                           
           02  FILLER REDEFINES ZUVER1EF.                                       
             03 ZUVER1EA    PICTURE X.                                          
           02  ZUVER1EI  PIC X(2).                                              
           02  ZUVER2EL    COMP  PIC  S9(4).                                    
           02  ZUVER2EF    PICTURE X.                                           
           02  FILLER REDEFINES ZUVER2EF.                                       
             03 ZUVER2EA    PICTURE X.                                          
           02  ZUVER2EI  PIC X(6).                                              
           02  ZUVER3EL    COMP  PIC  S9(4).                                    
           02  ZUVER3EF    PICTURE X.                                           
           02  FILLER REDEFINES ZUVER3EF.                                       
             03 ZUVER3EA    PICTURE X.                                          
           02  ZUVER3EI  PIC X(2).                                              
           02  ZUVERVEL    COMP  PIC  S9(4).                                    
           02  ZUVERVEF    PICTURE X.                                           
           02  FILLER REDEFINES ZUVERVEF.                                       
             03 ZUVERVEA    PICTURE X.                                          
           02  ZUVERVEI  PIC X(1).                                              
           02  ZUVERKEL    COMP  PIC  S9(4).                                    
           02  ZUVERKEF    PICTURE X.                                           
           02  FILLER REDEFINES ZUVERKEF.                                       
             03 ZUVERKEA    PICTURE X.                                          
           02  ZUVERKEI  PIC X(2).                                              
           02  NADELTL    COMP  PIC  S9(4).                                     
           02  NADELTF    PICTURE X.                                            
           02  FILLER REDEFINES NADELTF.                                        
             03 NADELTA    PICTURE X.                                           
           02  NADELTI  PIC X(14).                                              
           02  NADELL    COMP  PIC  S9(4).                                      
           02  NADELF    PICTURE X.                                             
           02  FILLER REDEFINES NADELF.                                         
             03 NADELA    PICTURE X.                                            
           02  NADELI  PIC X(3).                                                
           02  NADELEL    COMP  PIC  S9(4).                                     
           02  NADELEF    PICTURE X.                                            
           02  FILLER REDEFINES NADELEF.                                        
             03 NADELEA    PICTURE X.                                           
           02  NADELEI  PIC X(3).                                               
           02  GUHRL    COMP  PIC  S9(4).                                       
           02  GUHRF    PICTURE X.                                              
           02  FILLER REDEFINES GUHRF.                                          
             03 GUHRA    PICTURE X.                                             
           02  GUHRI  PIC X(8).                                                 
           02  GUHR1L    COMP  PIC  S9(4).                                      
           02  GUHR1F    PICTURE X.                                             
           02  FILLER REDEFINES GUHR1F.                                         
             03 GUHR1A    PICTURE X.                                            
           02  GUHR1I  PIC X(5).                                                
           02  GUHR2L    COMP  PIC  S9(4).                                      
           02  GUHR2F    PICTURE X.                                             
           02  FILLER REDEFINES GUHR2F.                                         
             03 GUHR2A    PICTURE X.                                            
           02  GUHR2I  PIC X(4).                                                
           02  GPENL    COMP  PIC  S9(4).                                       
           02  GPENF    PICTURE X.                                              
           02  FILLER REDEFINES GPENF.                                          
             03 GPENA    PICTURE X.                                             
           02  GPENI  PIC X(18).                                                
           02  GPENNRL    COMP  PIC  S9(4).                                     
           02  GPENNRF    PICTURE X.                                            
           02  FILLER REDEFINES GPENNRF.                                        
             03 GPENNRA    PICTURE X.                                           
           02  GPENNRI  PIC X(2).                                               
           02  GPENDATL    COMP  PIC  S9(4).                                    
           02  GPENDATF    PICTURE X.                                           
           02  FILLER REDEFINES GPENDATF.                                       
             03 GPENDATA    PICTURE X.                                          
           02  GPENDATI  PIC X(5).                                              
           02  GPENNR1L    COMP  PIC  S9(4).                                    
           02  GPENNR1F    PICTURE X.                                           
           02  FILLER REDEFINES GPENNR1F.                                       
             03 GPENNR1A    PICTURE X.                                          
           02  GPENNR1I  PIC X(2).                                              
           02  GPEND1L    COMP  PIC  S9(4).                                     
           02  GPEND1F    PICTURE X.                                            
           02  FILLER REDEFINES GPEND1F.                                        
             03 GPEND1A    PICTURE X.                                           
           02  GPEND1I  PIC X(4).                                               
           02  SCHUFTL    COMP  PIC  S9(4).                                     
           02  SCHUFTF    PICTURE X.                                            
           02  FILLER REDEFINES SCHUFTF.                                        
             03 SCHUFTA    PICTURE X.                                           
           02  SCHUFTI  PIC X(11).                                              
           02  SCHUF1L    COMP  PIC  S9(4).                                     
           02  SCHUF1F    PICTURE X.                                            
           02  FILLER REDEFINES SCHUF1F.                                        
             03 SCHUF1A    PICTURE X.                                           
           02  SCHUF1I  PIC X(8).                                               
           02  SCHUF2L    COMP  PIC  S9(4).                                     
           02  SCHUF2F    PICTURE X.                                            
           02  FILLER REDEFINES SCHUF2F.                                        
             03 SCHUF2A    PICTURE X.                                           
           02  SCHUF2I  PIC X(10).                                              
           02  SCHUF1EL    COMP  PIC  S9(4).                                    
           02  SCHUF1EF    PICTURE X.                                           
           02  FILLER REDEFINES SCHUF1EF.                                       
             03 SCHUF1EA    PICTURE X.                                          
           02  SCHUF1EI  PIC X(6).                                              
           02  SCHUF2EL    COMP  PIC  S9(4).                                    
           02  SCHUF2EF    PICTURE X.                                           
           02  FILLER REDEFINES SCHUF2EF.                                       
             03 SCHUF2EA    PICTURE X.                                          
           02  SCHUF2EI  PIC X(10).                                             
           02  GEWOTL    COMP  PIC  S9(4).                                      
           02  GEWOTF    PICTURE X.                                             
           02  FILLER REDEFINES GEWOTF.                                         
             03 GEWOTA    PICTURE X.                                            
           02  GEWOTI  PIC X(9).                                                
           02  DARLTL    COMP  PIC  S9(4).                                      
           02  DARLTF    PICTURE X.                                             
           02  FILLER REDEFINES DARLTF.                                         
             03 DARLTA    PICTURE X.                                            
           02  DARLTI  PIC X(7).                                                
           02  AFOTL    COMP  PIC  S9(4).                                       
           02  AFOTF    PICTURE X.                                              
           02  FILLER REDEFINES AFOTF.                                          
             03 AFOTA    PICTURE X.                                             
           02  AFOTI  PIC X(7).                                                 
           02  GEWOL    COMP  PIC  S9(4).                                       
           02  GEWOF    PICTURE X.                                              
           02  FILLER REDEFINES GEWOF.                                          
             03 GEWOA    PICTURE X.                                             
           02  GEWOI  PIC X(8).                                                 
           02  DARLL    COMP  PIC  S9(4).                                       
           02  DARLF    PICTURE X.                                              
           02  FILLER REDEFINES DARLF.                                          
             03 DARLA    PICTURE X.                                             
           02  DARLI  PIC X(4).                                                 
           02  AFOL    COMP  PIC  S9(4).                                        
           02  AFOF    PICTURE X.                                               
           02  FILLER REDEFINES AFOF.                                           
             03 AFOA    PICTURE X.                                              
           02  AFOI  PIC X(4).                                                  
           02  GEWOEL    COMP  PIC  S9(4).                                      
           02  GEWOEF    PICTURE X.                                             
           02  FILLER REDEFINES GEWOEF.                                         
             03 GEWOEA    PICTURE X.                                            
           02  GEWOEI  PIC X(6).                                                
           02  DARLEL    COMP  PIC  S9(4).                                      
           02  DARLEF    PICTURE X.                                             
           02  FILLER REDEFINES DARLEF.                                         
             03 DARLEA    PICTURE X.                                            
           02  DARLEI  PIC X(4).                                                
           02  AFOEL    COMP  PIC  S9(4).                                       
           02  AFOEF    PICTURE X.                                              
           02  FILLER REDEFINES AFOEF.                                          
             03 AFOEA    PICTURE X.                                             
           02  AFOEI  PIC X(4).                                                 
           02  PRUEF2TL    COMP  PIC  S9(4).                                    
           02  PRUEF2TF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF2TF.                                       
             03 PRUEF2TA    PICTURE X.                                          
           02  PRUEF2TI  PIC X(22).                                             
           02  PRUEF2EL    COMP  PIC  S9(4).                                    
           02  PRUEF2EF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF2EF.                                       
             03 PRUEF2EA    PICTURE X.                                          
           02  PRUEF2EI  PIC X(1).                                              
           02  FEHL2L    COMP  PIC  S9(4).                                      
           02  FEHL2F    PICTURE X.                                             
           02  FILLER REDEFINES FEHL2F.                                         
             03 FEHL2A    PICTURE X.                                            
           02  FEHL2I  PIC X(75).                                               
       01  UU953O REDEFINES UU953I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR2O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT2O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIR2O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZUNAM2O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VORNAM2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  STR2TO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL2TO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  STR2O  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  STR2EO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSL2EO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ2TO  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ2O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT2O  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  PB2O.                                                            
             03  KLAMMLO  PIC X(1).                                             
             03  PBO  PIC X(1).                                                 
             03  KLAMMRO  PIC X(1).                                             
           02  FILLER PICTURE X(3).                                             
           02  PLZ2EO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ORT2EO  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  PB2EO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TEL2TO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEL2O  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEL2EO  PIC X(14).                                               
           02  FILLER PICTURE X(3).                                             
           02  INSTTO  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  INSTO  PIC X(22).                                                
           02  FILLER PICTURE X(3).                                             
           02  INSTEO  PIC X(22).                                               
           02  FILLER PICTURE X(3).                                             
           02  BLZTO  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  BLZO PIC Z(8).                                                   
           02  FILLER PICTURE X(3).                                             
           02  KTONRO PIC Z(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  BLZEO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  KTONREO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  KTOINHTO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  KTOINHO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  KTOINHEO  PIC X(25).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBPCNT1O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNT2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNT3O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNR1O PIC Z(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBPCNR2O PIC Z(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBPCNR3O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNE1O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNE2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNE3O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  PC3KZTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBPC3KZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNT4O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNR4O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPCNE4O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBSEITTO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBSEITO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VBSEITEO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERTRTO  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERTRO.                                                          
             03  VERTR1O PIC 99.99.99.                                          
             03  VERTRKO  PIC X(1).                                             
           02  FILLER PICTURE X(3).                                             
           02  VERTR2O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VERTR1EO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERTR2EO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  BESCHRO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  BESCHR1O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  BESCHR2O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ZUVERTO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUVER1O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVER2O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  ZUVERBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVER3O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVERVO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVKTXO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVERKO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVER1EO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUVER2EO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUVER3EO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUVERVEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUVERKEO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  NADELTO  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  NADELO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  NADELEO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  GUHRO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GUHR1O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  GUHR2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  GPENO  PIC X(18).                                                
           02  FILLER PICTURE X(3).                                             
           02  GPENNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  GPENDATO PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  GPENNR1O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  GPEND1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  SCHUFTO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  SCHUF1O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  SCHUF2O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  SCHUF1EO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  SCHUF2EO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  GEWOTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  DARLTO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFOTO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GEWOO PIC 99.99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  DARLO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFOO  PIC X(4).                                                  
           02  FILLER PICTURE X(3).                                             
           02  GEWOEO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  DARLEO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFOEO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRUEF2TO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEF2EO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHL2O  PIC X(75).                                               
