       01  UU955I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR4L    COMP  PIC  S9(4).                                       
           02  PNR4F    PICTURE X.                                              
           02  FILLER REDEFINES PNR4F.                                          
             03 PNR4A    PICTURE X.                                             
           02  PNR4I  PIC X(7).                                                 
           02  DAT4L    COMP  PIC  S9(4).                                       
           02  DAT4F    PICTURE X.                                              
           02  FILLER REDEFINES DAT4F.                                          
             03 DAT4A    PICTURE X.                                             
           02  DAT4I  PIC X(8).                                                 
           02  UHR4L    COMP  PIC  S9(4).                                       
           02  UHR4F    PICTURE X.                                              
           02  FILLER REDEFINES UHR4F.                                          
             03 UHR4A    PICTURE X.                                             
           02  UHR4I  PIC X(5).                                                 
           02  VBNR4L    COMP  PIC  S9(4).                                      
           02  VBNR4F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR4F.                                         
             03 VBNR4A    PICTURE X.                                            
           02  VBNR4I  PIC X(7).                                                
           02  PRZ4L    COMP  PIC  S9(4).                                       
           02  PRZ4F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ4F.                                          
             03 PRZ4A    PICTURE X.                                             
           02  PRZ4I  PIC X(1).                                                 
           02  DIR4L    COMP  PIC  S9(4).                                       
           02  DIR4F    PICTURE X.                                              
           02  FILLER REDEFINES DIR4F.                                          
             03 DIR4A    PICTURE X.                                             
           02  DIR4I  PIC X(3).                                                 
           02  ZUNAM4L    COMP  PIC  S9(4).                                     
           02  ZUNAM4F    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAM4F.                                        
             03 ZUNAM4A    PICTURE X.                                           
           02  ZUNAM4I  PIC X(20).                                              
           02  VNAM4L    COMP  PIC  S9(4).                                      
           02  VNAM4F    PICTURE X.                                             
           02  FILLER REDEFINES VNAM4F.                                         
             03 VNAM4A    PICTURE X.                                            
           02  VNAM4I  PIC X(10).                                               
           02  FAPABTL    COMP  PIC  S9(4).                                     
           02  FAPABTF    PICTURE X.                                            
           02  FILLER REDEFINES FAPABTF.                                        
             03 FAPABTA    PICTURE X.                                           
           02  FAPABTI  PIC X(6).                                               
           02  FAPSTUTL    COMP  PIC  S9(4).                                    
           02  FAPSTUTF    PICTURE X.                                           
           02  FILLER REDEFINES FAPSTUTF.                                       
             03 FAPSTUTA    PICTURE X.                                          
           02  FAPSTUTI  PIC X(5).                                              
           02  FAPAB1L    COMP  PIC  S9(4).                                     
           02  FAPAB1F    PICTURE X.                                            
           02  FILLER REDEFINES FAPAB1F.                                        
             03 FAPAB1A    PICTURE X.                                           
           02  FAPAB1I  PIC X(5).                                               
           02  FAPSTU1L    COMP  PIC  S9(4).                                    
           02  FAPSTU1F    PICTURE X.                                           
           02  FILLER REDEFINES FAPSTU1F.                                       
             03 FAPSTU1A    PICTURE X.                                          
           02  FAPSTU1I  PIC X(1).                                              
           02  FAPAB2L    COMP  PIC  S9(4).                                     
           02  FAPAB2F    PICTURE X.                                            
           02  FILLER REDEFINES FAPAB2F.                                        
             03 FAPAB2A    PICTURE X.                                           
           02  FAPAB2I  PIC X(5).                                               
           02  FAPSTU2L    COMP  PIC  S9(4).                                    
           02  FAPSTU2F    PICTURE X.                                           
           02  FILLER REDEFINES FAPSTU2F.                                       
             03 FAPSTU2A    PICTURE X.                                          
           02  FAPSTU2I  PIC X(1).                                              
           02  FAPAB3L    COMP  PIC  S9(4).                                     
           02  FAPAB3F    PICTURE X.                                            
           02  FILLER REDEFINES FAPAB3F.                                        
             03 FAPAB3A    PICTURE X.                                           
           02  FAPAB3I  PIC X(5).                                               
           02  FAPSTU3L    COMP  PIC  S9(4).                                    
           02  FAPSTU3F    PICTURE X.                                           
           02  FILLER REDEFINES FAPSTU3F.                                       
             03 FAPSTU3A    PICTURE X.                                          
           02  FAPSTU3I  PIC X(1).                                              
           02  FAPAB4L    COMP  PIC  S9(4).                                     
           02  FAPAB4F    PICTURE X.                                            
           02  FILLER REDEFINES FAPAB4F.                                        
             03 FAPAB4A    PICTURE X.                                           
           02  FAPAB4I  PIC X(5).                                               
           02  FAPSTU4L    COMP  PIC  S9(4).                                    
           02  FAPSTU4F    PICTURE X.                                           
           02  FILLER REDEFINES FAPSTU4F.                                       
             03 FAPSTU4A    PICTURE X.                                          
           02  FAPSTU4I  PIC X(1).                                              
           02  FAPABEL    COMP  PIC  S9(4).                                     
           02  FAPABEF    PICTURE X.                                            
           02  FILLER REDEFINES FAPABEF.                                        
             03 FAPABEA    PICTURE X.                                           
           02  FAPABEI  PIC X(4).                                               
           02  FAPSTUEL    COMP  PIC  S9(4).                                    
           02  FAPSTUEF    PICTURE X.                                           
           02  FILLER REDEFINES FAPSTUEF.                                       
             03 FAPSTUEA    PICTURE X.                                          
           02  FAPSTUEI  PIC X(1).                                              
           02  FAPVERTL    COMP  PIC  S9(4).                                    
           02  FAPVERTF    PICTURE X.                                           
           02  FILLER REDEFINES FAPVERTF.                                       
             03 FAPVERTA    PICTURE X.                                          
           02  FAPVERTI  PIC X(11).                                             
           02  FAPVERDL    COMP  PIC  S9(4).                                    
           02  FAPVERDF    PICTURE X.                                           
           02  FILLER REDEFINES FAPVERDF.                                       
             03 FAPVERDA    PICTURE X.                                          
           02  FAPVERDI  PIC X(10).                                             
           02  FAPVERNL    COMP  PIC  S9(4).                                    
           02  FAPVERNF    PICTURE X.                                           
           02  FILLER REDEFINES FAPVERNF.                                       
             03 FAPVERNA    PICTURE X.                                          
           02  FAPVERNI  PIC X(10).                                             
           02  VSWZUSTL    COMP  PIC  S9(4).                                    
           02  VSWZUSTF    PICTURE X.                                           
           02  FILLER REDEFINES VSWZUSTF.                                       
             03 VSWZUSTA    PICTURE X.                                          
           02  VSWZUSTI  PIC X(14).                                             
           02  VSWZUSL    COMP  PIC  S9(4).                                     
           02  VSWZUSF    PICTURE X.                                            
           02  FILLER REDEFINES VSWZUSF.                                        
             03 VSWZUSA    PICTURE X.                                           
           02  VSWZUSI  PIC X(8).                                               
           02  VSWZUSEL    COMP  PIC  S9(4).                                    
           02  VSWZUSEF    PICTURE X.                                           
           02  FILLER REDEFINES VSWZUSEF.                                       
             03 VSWZUSEA    PICTURE X.                                          
           02  VSWZUSEI  PIC X(6).                                              
           02  VSWGRTL    COMP  PIC  S9(4).                                     
           02  VSWGRTF    PICTURE X.                                            
           02  FILLER REDEFINES VSWGRTF.                                        
             03 VSWGRTA    PICTURE X.                                           
           02  VSWGRTI  PIC X(12).                                              
           02  VSWGRL    COMP  PIC  S9(4).                                      
           02  VSWGRF    PICTURE X.                                             
           02  FILLER REDEFINES VSWGRF.                                         
             03 VSWGRA    PICTURE X.                                            
           02  VSWGRI  PIC X(8).                                                
           02  GRVSUL    COMP  PIC  S9(4).                                      
           02  GRVSUF    PICTURE X.                                             
           02  FILLER REDEFINES GRVSUF.                                         
             03 GRVSUA    PICTURE X.                                            
           02  GRVSUI  PIC X(6).                                                
           02  VSWGREL    COMP  PIC  S9(4).                                     
           02  VSWGREF    PICTURE X.                                            
           02  FILLER REDEFINES VSWGREF.                                        
             03 VSWGREA    PICTURE X.                                           
           02  VSWGREI  PIC X(2).                                               
           02  GRVSUTL    COMP  PIC  S9(4).                                     
           02  GRVSUTF    PICTURE X.                                            
           02  FILLER REDEFINES GRVSUTF.                                        
             03 GRVSUTA    PICTURE X.                                           
           02  GRVSUTI  PIC X(3).                                               
           02  GRVSUEL    COMP  PIC  S9(4).                                     
           02  GRVSUEF    PICTURE X.                                            
           02  FILLER REDEFINES GRVSUEF.                                        
             03 GRVSUEA    PICTURE X.                                           
           02  GRVSUEI  PIC X(6).                                               
           02  GKZTL    COMP  PIC  S9(4).                                       
           02  GKZTF    PICTURE X.                                              
           02  FILLER REDEFINES GKZTF.                                          
             03 GKZTA    PICTURE X.                                             
           02  GKZTI  PIC X(2).                                                 
           02  GKZL    COMP  PIC  S9(4).                                        
           02  GKZF    PICTURE X.                                               
           02  FILLER REDEFINES GKZF.                                           
             03 GKZA    PICTURE X.                                              
           02  GKZI  PIC X(2).                                                  
           02  ZVKZTL    COMP  PIC  S9(4).                                      
           02  ZVKZTF    PICTURE X.                                             
           02  FILLER REDEFINES ZVKZTF.                                         
             03 ZVKZTA    PICTURE X.                                            
           02  ZVKZTI  PIC X(4).                                                
           02  ZVKZL    COMP  PIC  S9(4).                                       
           02  ZVKZF    PICTURE X.                                              
           02  FILLER REDEFINES ZVKZF.                                          
             03 ZVKZA    PICTURE X.                                             
           02  ZVKZI  PIC X(5).                                                 
           02  GVSNRTL    COMP  PIC  S9(4).                                     
           02  GVSNRTF    PICTURE X.                                            
           02  FILLER REDEFINES GVSNRTF.                                        
             03 GVSNRTA    PICTURE X.                                           
           02  GVSNRTI  PIC X(4).                                               
           02  GVSNRL    COMP  PIC  S9(4).                                      
           02  GVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES GVSNRF.                                         
             03 GVSNRA    PICTURE X.                                            
           02  GVSNRI  PIC X(10).                                               
           02  GKZEL    COMP  PIC  S9(4).                                       
           02  GKZEF    PICTURE X.                                              
           02  FILLER REDEFINES GKZEF.                                          
             03 GKZEA    PICTURE X.                                             
           02  GKZEI  PIC X(2).                                                 
           02  ZVKZEL    COMP  PIC  S9(4).                                      
           02  ZVKZEF    PICTURE X.                                             
           02  FILLER REDEFINES ZVKZEF.                                         
             03 ZVKZEA    PICTURE X.                                            
           02  ZVKZEI  PIC X(4).                                                
           02  GVSNREL    COMP  PIC  S9(4).                                     
           02  GVSNREF    PICTURE X.                                            
           02  FILLER REDEFINES GVSNREF.                                        
             03 GVSNREA    PICTURE X.                                           
           02  GVSNREI  PIC X(10).                                              
           02  VSWZUTL    COMP  PIC  S9(4).                                     
           02  VSWZUTF    PICTURE X.                                            
           02  FILLER REDEFINES VSWZUTF.                                        
             03 VSWZUTA    PICTURE X.                                           
           02  VSWZUTI  PIC X(13).                                              
           02  VSWZUL    COMP  PIC  S9(4).                                      
           02  VSWZUF    PICTURE X.                                             
           02  FILLER REDEFINES VSWZUF.                                         
             03 VSWZUA    PICTURE X.                                            
           02  VSWZUI  PIC X(8).                                                
           02  ZUVSUL    COMP  PIC  S9(4).                                      
           02  ZUVSUF    PICTURE X.                                             
           02  FILLER REDEFINES ZUVSUF.                                         
             03 ZUVSUA    PICTURE X.                                            
           02  ZUVSUI  PIC X(6).                                                
           02  VSWZUEL    COMP  PIC  S9(4).                                     
           02  VSWZUEF    PICTURE X.                                            
           02  FILLER REDEFINES VSWZUEF.                                        
             03 VSWZUEA    PICTURE X.                                           
           02  VSWZUEI  PIC X(2).                                               
           02  ZUVSUTL    COMP  PIC  S9(4).                                     
           02  ZUVSUTF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVSUTF.                                        
             03 ZUVSUTA    PICTURE X.                                           
           02  ZUVSUTI  PIC X(3).                                               
           02  ZUVSUEL    COMP  PIC  S9(4).                                     
           02  ZUVSUEF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVSUEF.                                        
             03 ZUVSUEA    PICTURE X.                                           
           02  ZUVSUEI  PIC X(6).                                               
           02  ZVVSNRTL    COMP  PIC  S9(4).                                    
           02  ZVVSNRTF    PICTURE X.                                           
           02  FILLER REDEFINES ZVVSNRTF.                                       
             03 ZVVSNRTA    PICTURE X.                                          
           02  ZVVSNRTI  PIC X(4).                                              
           02  ZVVSNRL    COMP  PIC  S9(4).                                     
           02  ZVVSNRF    PICTURE X.                                            
           02  FILLER REDEFINES ZVVSNRF.                                        
             03 ZVVSNRA    PICTURE X.                                           
           02  ZVVSNRI  PIC X(10).                                              
           02  ZVVSNREL    COMP  PIC  S9(4).                                    
           02  ZVVSNREF    PICTURE X.                                           
           02  FILLER REDEFINES ZVVSNREF.                                       
             03 ZVVSNREA    PICTURE X.                                          
           02  ZVVSNREI  PIC X(10).                                             
           02  AKZTL    COMP  PIC  S9(4).                                       
           02  AKZTF    PICTURE X.                                              
           02  FILLER REDEFINES AKZTF.                                          
             03 AKZTA    PICTURE X.                                             
           02  AKZTI  PIC X(2).                                                 
           02  AKZL    COMP  PIC  S9(4).                                        
           02  AKZF    PICTURE X.                                               
           02  FILLER REDEFINES AKZF.                                           
             03 AKZA    PICTURE X.                                              
           02  AKZI  PIC X(2).                                                  
           02  IGDATTL    COMP  PIC  S9(4).                                     
           02  IGDATTF    PICTURE X.                                            
           02  FILLER REDEFINES IGDATTF.                                        
             03 IGDATTA    PICTURE X.                                           
           02  IGDATTI  PIC X(14).                                              
           02  IGDATL    COMP  PIC  S9(4).                                      
           02  IGDATF    PICTURE X.                                             
           02  FILLER REDEFINES IGDATF.                                         
             03 IGDATA    PICTURE X.                                            
           02  IGDATI  PIC X(5).                                                
           02  AKZEL    COMP  PIC  S9(4).                                       
           02  AKZEF    PICTURE X.                                              
           02  FILLER REDEFINES AKZEF.                                          
             03 AKZEA    PICTURE X.                                             
           02  AKZEI  PIC X(2).                                                 
           02  IGDATEL    COMP  PIC  S9(4).                                     
           02  IGDATEF    PICTURE X.                                            
           02  FILLER REDEFINES IGDATEF.                                        
             03 IGDATEA    PICTURE X.                                           
           02  IGDATEI  PIC X(4).                                               
           02  VSWGESTL    COMP  PIC  S9(4).                                    
           02  VSWGESTF    PICTURE X.                                           
           02  FILLER REDEFINES VSWGESTF.                                       
             03 VSWGESTA    PICTURE X.                                          
           02  VSWGESTI  PIC X(13).                                             
           02  VSWGESL    COMP  PIC  S9(4).                                     
           02  VSWGESF    PICTURE X.                                            
           02  FILLER REDEFINES VSWGESF.                                        
             03 VSWGESA    PICTURE X.                                           
           02  VSWGESI  PIC X(6).                                               
           02  VSWGESEL    COMP  PIC  S9(4).                                    
           02  VSWGESEF    PICTURE X.                                           
           02  FILLER REDEFINES VSWGESEF.                                       
             03 VSWGESEA    PICTURE X.                                          
           02  VSWGESEI  PIC X(6).                                              
           02  VSWLZTL    COMP  PIC  S9(4).                                     
           02  VSWLZTF    PICTURE X.                                            
           02  FILLER REDEFINES VSWLZTF.                                        
             03 VSWLZTA    PICTURE X.                                           
           02  VSWLZTI  PIC X(14).                                              
           02  VSWLZ1L    COMP  PIC  S9(4).                                     
           02  VSWLZ1F    PICTURE X.                                            
           02  FILLER REDEFINES VSWLZ1F.                                        
             03 VSWLZ1A    PICTURE X.                                           
           02  VSWLZ1I  PIC X(6).                                               
           02  VSWLZ2L    COMP  PIC  S9(4).                                     
           02  VSWLZ2F    PICTURE X.                                            
           02  FILLER REDEFINES VSWLZ2F.                                        
             03 VSWLZ2A    PICTURE X.                                           
           02  VSWLZ2I  PIC X(6).                                               
           02  VSWLZ3L    COMP  PIC  S9(4).                                     
           02  VSWLZ3F    PICTURE X.                                            
           02  FILLER REDEFINES VSWLZ3F.                                        
             03 VSWLZ3A    PICTURE X.                                           
           02  VSWLZ3I  PIC X(6).                                               
           02  VSWLZEL    COMP  PIC  S9(4).                                     
           02  VSWLZEF    PICTURE X.                                            
           02  FILLER REDEFINES VSWLZEF.                                        
             03 VSWLZEA    PICTURE X.                                           
           02  VSWLZEI  PIC X(6).                                               
           02  VSWAMTL    COMP  PIC  S9(4).                                     
           02  VSWAMTF    PICTURE X.                                            
           02  FILLER REDEFINES VSWAMTF.                                        
             03 VSWAMTA    PICTURE X.                                           
           02  VSWAMTI  PIC X(2).                                               
           02  VSWAM1L    COMP  PIC  S9(4).                                     
           02  VSWAM1F    PICTURE X.                                            
           02  FILLER REDEFINES VSWAM1F.                                        
             03 VSWAM1A    PICTURE X.                                           
           02  VSWAM1I  PIC X(5).                                               
           02  VSWAM2L    COMP  PIC  S9(4).                                     
           02  VSWAM2F    PICTURE X.                                            
           02  FILLER REDEFINES VSWAM2F.                                        
             03 VSWAM2A    PICTURE X.                                           
           02  VSWAM2I  PIC X(5).                                               
           02  VSWAM3L    COMP  PIC  S9(4).                                     
           02  VSWAM3F    PICTURE X.                                            
           02  FILLER REDEFINES VSWAM3F.                                        
             03 VSWAM3A    PICTURE X.                                           
           02  VSWAM3I  PIC X(5).                                               
           02  VSWAMEL    COMP  PIC  S9(4).                                     
           02  VSWAMEF    PICTURE X.                                            
           02  FILLER REDEFINES VSWAMEF.                                        
             03 VSWAMEA    PICTURE X.                                           
           02  VSWAMEI  PIC X(4).                                               
           02  BANKV2TL    COMP  PIC  S9(4).                                    
           02  BANKV2TF    PICTURE X.                                           
           02  FILLER REDEFINES BANKV2TF.                                       
             03 BANKV2TA    PICTURE X.                                          
           02  BANKV2TI  PIC X(38).                                             
           02  INST2TL    COMP  PIC  S9(4).                                     
           02  INST2TF    PICTURE X.                                            
           02  FILLER REDEFINES INST2TF.                                        
             03 INST2TA    PICTURE X.                                           
           02  INST2TI  PIC X(12).                                              
           02  INST2L    COMP  PIC  S9(4).                                      
           02  INST2F    PICTURE X.                                             
           02  FILLER REDEFINES INST2F.                                         
             03 INST2A    PICTURE X.                                            
           02  INST2I  PIC X(22).                                               
           02  INST2EL    COMP  PIC  S9(4).                                     
           02  INST2EF    PICTURE X.                                            
           02  FILLER REDEFINES INST2EF.                                        
             03 INST2EA    PICTURE X.                                           
           02  INST2EI  PIC X(22).                                              
           02  BLZ2TL    COMP  PIC  S9(4).                                      
           02  BLZ2TF    PICTURE X.                                             
           02  FILLER REDEFINES BLZ2TF.                                         
             03 BLZ2TA    PICTURE X.                                            
           02  BLZ2TI  PIC X(3).                                                
           02  KONTO2TL    COMP  PIC  S9(4).                                    
           02  KONTO2TF    PICTURE X.                                           
           02  FILLER REDEFINES KONTO2TF.                                       
             03 KONTO2TA    PICTURE X.                                          
           02  KONTO2TI  PIC X(8).                                              
           02  BLZ2L    COMP  PIC  S9(4).                                       
           02  BLZ2F    PICTURE X.                                              
           02  FILLER REDEFINES BLZ2F.                                          
             03 BLZ2A    PICTURE X.                                             
           02  BLZ2I  PIC X(8).                                                 
           02  KONTO2L    COMP  PIC  S9(4).                                     
           02  KONTO2F    PICTURE X.                                            
           02  FILLER REDEFINES KONTO2F.                                        
             03 KONTO2A    PICTURE X.                                           
           02  KONTO2I  PIC X(10).                                              
           02  BLZ2EL    COMP  PIC  S9(4).                                      
           02  BLZ2EF    PICTURE X.                                             
           02  FILLER REDEFINES BLZ2EF.                                         
             03 BLZ2EA    PICTURE X.                                            
           02  BLZ2EI  PIC X(8).                                                
           02  KONTO2EL    COMP  PIC  S9(4).                                    
           02  KONTO2EF    PICTURE X.                                           
           02  FILLER REDEFINES KONTO2EF.                                       
             03 KONTO2EA    PICTURE X.                                          
           02  KONTO2EI  PIC X(10).                                             
           02  KTOIN2TL    COMP  PIC  S9(4).                                    
           02  KTOIN2TF    PICTURE X.                                           
           02  FILLER REDEFINES KTOIN2TF.                                       
             03 KTOIN2TA    PICTURE X.                                          
           02  KTOIN2TI  PIC X(13).                                             
           02  KTOIN2L    COMP  PIC  S9(4).                                     
           02  KTOIN2F    PICTURE X.                                            
           02  FILLER REDEFINES KTOIN2F.                                        
             03 KTOIN2A    PICTURE X.                                           
           02  KTOIN2I  PIC X(25).                                              
           02  KTOIN2EL    COMP  PIC  S9(4).                                    
           02  KTOIN2EF    PICTURE X.                                           
           02  FILLER REDEFINES KTOIN2EF.                                       
             03 KTOIN2EA    PICTURE X.                                          
           02  KTOIN2EI  PIC X(25).                                             
           02  PRUEF4TL    COMP  PIC  S9(4).                                    
           02  PRUEF4TF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF4TF.                                       
             03 PRUEF4TA    PICTURE X.                                          
           02  PRUEF4TI  PIC X(22).                                             
           02  PRUEF4EL    COMP  PIC  S9(4).                                    
           02  PRUEF4EF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF4EF.                                       
             03 PRUEF4EA    PICTURE X.                                          
           02  PRUEF4EI  PIC X(1).                                              
           02  FEHL4L    COMP  PIC  S9(4).                                      
           02  FEHL4F    PICTURE X.                                             
           02  FILLER REDEFINES FEHL4F.                                         
             03 FEHL4A    PICTURE X.                                            
           02  FEHL4I  PIC X(75).                                               
       01  UU955O REDEFINES UU955I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR4O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT4O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR4O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIR4O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZUNAM4O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAM4O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPABTO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPSTUTO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPAB1O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPSTU1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPAB2O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPSTU2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPAB3O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPSTU3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPAB4O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPSTU4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPABEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  FAPSTUEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPVERTO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FAPVERDO PIC Z(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  FAPVERNO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  VSWZUSTO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  VSWZUSO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  VSWZUSEO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  VSWGRTO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  VSWGRO PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  GRVSUO PIC Z(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VSWGREO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  GRVSUTO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  GRVSUEO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  GKZTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GKZO  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ZVKZTO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZVKZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GVSNRTO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  GVSNRO PIC Z(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  GKZEO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZVKZEO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  GVSNREO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  VSWZUTO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  VSWZUO PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  ZUVSUO PIC Z(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VSWZUEO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVSUTO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVSUEO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZVVSNRTO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZVVSNRO PIC Z(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZVVSNREO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKZTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AKZO  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  IGDATTO  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  IGDATO PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  AKZEO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IGDATEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  VSWGESTO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  VSWGESO PIC Z(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  VSWGESEO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  VSWLZTO  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  VSWLZ1O PIC Z(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  VSWLZ2O PIC Z(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  VSWLZ3O PIC Z(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  VSWLZEO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  VSWAMTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  VSWAM1O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  VSWAM2O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  VSWAM3O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  VSWAMEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  BANKV2TO  PIC X(38).                                             
           02  FILLER PICTURE X(3).                                             
           02  INST2TO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  INST2O  PIC X(22).                                               
           02  FILLER PICTURE X(3).                                             
           02  INST2EO  PIC X(22).                                              
           02  FILLER PICTURE X(3).                                             
           02  BLZ2TO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  KONTO2TO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  BLZ2O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  KONTO2O PIC Z(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  BLZ2EO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  KONTO2EO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  KTOIN2TO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  KTOIN2O  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  KTOIN2EO  PIC X(25).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEF4TO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEF4EO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHL4O  PIC X(75).                                               
