       01  UU956I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR2L    COMP  PIC  S9(4).                                       
           02  PNR2F    PICTURE X.                                              
           02  FILLER REDEFINES PNR2F.                                          
             03 PNR2A    PICTURE X.                                             
           02  PNR2I  PIC X(7).                                                 
           02  DAT2L    COMP  PIC  S9(4).                                       
           02  DAT2F    PICTURE X.                                              
           02  FILLER REDEFINES DAT2F.                                          
             03 DAT2A    PICTURE X.                                             
           02  DAT2I  PIC X(8).                                                 
           02  UHR2L    COMP  PIC  S9(4).                                       
           02  UHR2F    PICTURE X.                                              
           02  FILLER REDEFINES UHR2F.                                          
             03 UHR2A    PICTURE X.                                             
           02  UHR2I  PIC X(5).                                                 
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  PRZ2L    COMP  PIC  S9(4).                                       
           02  PRZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ2F.                                          
             03 PRZ2A    PICTURE X.                                             
           02  PRZ2I  PIC X(1).                                                 
           02  DIR2L    COMP  PIC  S9(4).                                       
           02  DIR2F    PICTURE X.                                              
           02  FILLER REDEFINES DIR2F.                                          
             03 DIR2A    PICTURE X.                                             
           02  DIR2I  PIC X(3).                                                 
           02  ZUNAM2L    COMP  PIC  S9(4).                                     
           02  ZUNAM2F    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAM2F.                                        
             03 ZUNAM2A    PICTURE X.                                           
           02  ZUNAM2I  PIC X(20).                                              
           02  VORNAM2L    COMP  PIC  S9(4).                                    
           02  VORNAM2F    PICTURE X.                                           
           02  FILLER REDEFINES VORNAM2F.                                       
             03 VORNAM2A    PICTURE X.                                          
           02  VORNAM2I  PIC X(10).                                             
           02  STR2TL    COMP  PIC  S9(4).                                      
           02  STR2TF    PICTURE X.                                             
           02  FILLER REDEFINES STR2TF.                                         
             03 STR2TA    PICTURE X.                                            
           02  STR2TI  PIC X(7).                                                
           02  AUSL2TL    COMP  PIC  S9(4).                                     
           02  AUSL2TF    PICTURE X.                                            
           02  FILLER REDEFINES AUSL2TF.                                        
             03 AUSL2TA    PICTURE X.                                           
           02  AUSL2TI  PIC X(4).                                               
           02  STR2L    COMP  PIC  S9(4).                                       
           02  STR2F    PICTURE X.                                              
           02  FILLER REDEFINES STR2F.                                          
             03 STR2A    PICTURE X.                                             
           02  STR2I  PIC X(20).                                                
           02  AUSL2L    COMP  PIC  S9(4).                                      
           02  AUSL2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL2F.                                         
             03 AUSL2A    PICTURE X.                                            
           02  AUSL2I  PIC X(3).                                                
           02  PLZ2TL    COMP  PIC  S9(4).                                      
           02  PLZ2TF    PICTURE X.                                             
           02  FILLER REDEFINES PLZ2TF.                                         
             03 PLZ2TA    PICTURE X.                                            
           02  PLZ2TI  PIC X(17).                                               
           02  PLZ2L    COMP  PIC  S9(4).                                       
           02  PLZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ2F.                                          
             03 PLZ2A    PICTURE X.                                             
           02  PLZ2I  PIC X(6).                                                 
           02  ORT2L    COMP  PIC  S9(4).                                       
           02  ORT2F    PICTURE X.                                              
           02  FILLER REDEFINES ORT2F.                                          
             03 ORT2A    PICTURE X.                                             
           02  ORT2I  PIC X(16).                                                
           02  PB2L    COMP  PIC  S9(4).                                        
           02  PB2F    PICTURE X.                                               
           02  FILLER REDEFINES PB2F.                                           
             03 PB2A    PICTURE X.                                              
           02  PB2I  PIC X(3).                                                  
           02  TEL2TL    COMP  PIC  S9(4).                                      
           02  TEL2TF    PICTURE X.                                             
           02  FILLER REDEFINES TEL2TF.                                         
             03 TEL2TA    PICTURE X.                                            
           02  TEL2TI  PIC X(6).                                                
           02  TEL2L    COMP  PIC  S9(4).                                       
           02  TEL2F    PICTURE X.                                              
           02  FILLER REDEFINES TEL2F.                                          
             03 TEL2A    PICTURE X.                                             
           02  TEL2I  PIC X(14).                                                
           02  AFAXNR2L    COMP  PIC  S9(4).                                    
           02  AFAXNR2F    PICTURE X.                                           
           02  FILLER REDEFINES AFAXNR2F.                                       
             03 AFAXNR2A    PICTURE X.                                          
           02  AFAXNR2I  PIC X(20).                                             
           02  INSTTL    COMP  PIC  S9(4).                                      
           02  INSTTF    PICTURE X.                                             
           02  FILLER REDEFINES INSTTF.                                         
             03 INSTTA    PICTURE X.                                            
           02  INSTTI  PIC X(12).                                               
           02  INSTL    COMP  PIC  S9(4).                                       
           02  INSTF    PICTURE X.                                              
           02  FILLER REDEFINES INSTF.                                          
             03 INSTA    PICTURE X.                                             
           02  INSTI  PIC X(22).                                                
           02  BLZTL    COMP  PIC  S9(4).                                       
           02  BLZTF    PICTURE X.                                              
           02  FILLER REDEFINES BLZTF.                                          
             03 BLZTA    PICTURE X.                                             
           02  BLZTI  PIC X(14).                                                
           02  BLZL    COMP  PIC  S9(4).                                        
           02  BLZF    PICTURE X.                                               
           02  FILLER REDEFINES BLZF.                                           
             03 BLZA    PICTURE X.                                              
           02  BLZI  PIC X(8).                                                  
           02  KTONRL    COMP  PIC  S9(4).                                      
           02  KTONRF    PICTURE X.                                             
           02  FILLER REDEFINES KTONRF.                                         
             03 KTONRA    PICTURE X.                                            
           02  KTONRI  PIC X(11).                                               
           02  ABVSCHUL    COMP  PIC  S9(4).                                    
           02  ABVSCHUF    PICTURE X.                                           
           02  FILLER REDEFINES ABVSCHUF.                                       
             03 ABVSCHUA    PICTURE X.                                          
           02  ABVSCHUI  PIC X(14).                                             
           02  KTOINHTL    COMP  PIC  S9(4).                                    
           02  KTOINHTF    PICTURE X.                                           
           02  FILLER REDEFINES KTOINHTF.                                       
             03 KTOINHTA    PICTURE X.                                          
           02  KTOINHTI  PIC X(13).                                             
           02  KTOINHL    COMP  PIC  S9(4).                                     
           02  KTOINHF    PICTURE X.                                            
           02  FILLER REDEFINES KTOINHF.                                        
             03 KTOINHA    PICTURE X.                                           
           02  KTOINHI  PIC X(25).                                              
           02  PCNRT1L    COMP  PIC  S9(4).                                     
           02  PCNRT1F    PICTURE X.                                            
           02  FILLER REDEFINES PCNRT1F.                                        
             03 PCNRT1A    PICTURE X.                                           
           02  PCNRT1I  PIC X(7).                                               
           02  PCNRT2L    COMP  PIC  S9(4).                                     
           02  PCNRT2F    PICTURE X.                                            
           02  FILLER REDEFINES PCNRT2F.                                        
             03 PCNRT2A    PICTURE X.                                           
           02  PCNRT2I  PIC X(7).                                               
           02  PCNRT3L    COMP  PIC  S9(4).                                     
           02  PCNRT3F    PICTURE X.                                            
           02  FILLER REDEFINES PCNRT3F.                                        
             03 PCNRT3A    PICTURE X.                                           
           02  PCNRT3I  PIC X(7).                                               
           02  PCNR1L    COMP  PIC  S9(4).                                      
           02  PCNR1F    PICTURE X.                                             
           02  FILLER REDEFINES PCNR1F.                                         
             03 PCNR1A    PICTURE X.                                            
           02  PCNR1I  PIC X(5).                                                
           02  PCNR2L    COMP  PIC  S9(4).                                      
           02  PCNR2F    PICTURE X.                                             
           02  FILLER REDEFINES PCNR2F.                                         
             03 PCNR2A    PICTURE X.                                            
           02  PCNR2I  PIC X(5).                                                
           02  PCNR3L    COMP  PIC  S9(4).                                      
           02  PCNR3F    PICTURE X.                                             
           02  FILLER REDEFINES PCNR3F.                                         
             03 PCNR3A    PICTURE X.                                            
           02  PCNR3I  PIC X(7).                                                
           02  PCNRT4L    COMP  PIC  S9(4).                                     
           02  PCNRT4F    PICTURE X.                                            
           02  FILLER REDEFINES PCNRT4F.                                        
             03 PCNRT4A    PICTURE X.                                           
           02  PCNRT4I  PIC X(7).                                               
           02  PCNR4L    COMP  PIC  S9(4).                                      
           02  PCNR4F    PICTURE X.                                             
           02  FILLER REDEFINES PCNR4F.                                         
             03 PCNR4A    PICTURE X.                                            
           02  PCNR4I  PIC X(7).                                                
           02  VBSEITTL    COMP  PIC  S9(4).                                    
           02  VBSEITTF    PICTURE X.                                           
           02  FILLER REDEFINES VBSEITTF.                                       
             03 VBSEITTA    PICTURE X.                                          
           02  VBSEITTI  PIC X(7).                                              
           02  VBSEITL    COMP  PIC  S9(4).                                     
           02  VBSEITF    PICTURE X.                                            
           02  FILLER REDEFINES VBSEITF.                                        
             03 VBSEITA    PICTURE X.                                           
           02  VBSEITI  PIC X(8).                                               
           02  ANLAGB1L    COMP  PIC  S9(4).                                    
           02  ANLAGB1F    PICTURE X.                                           
           02  FILLER REDEFINES ANLAGB1F.                                       
             03 ANLAGB1A    PICTURE X.                                          
           02  ANLAGB1I  PIC X(8).                                              
           02  ANLAGB2L    COMP  PIC  S9(4).                                    
           02  ANLAGB2F    PICTURE X.                                           
           02  FILLER REDEFINES ANLAGB2F.                                       
             03 ANLAGB2A    PICTURE X.                                          
           02  ANLAGB2I  PIC X(7).                                              
           02  ANLAGB3L    COMP  PIC  S9(4).                                    
           02  ANLAGB3F    PICTURE X.                                           
           02  FILLER REDEFINES ANLAGB3F.                                       
             03 ANLAGB3A    PICTURE X.                                          
           02  ANLAGB3I  PIC X(3).                                              
           02  ANLAGB4L    COMP  PIC  S9(4).                                    
           02  ANLAGB4F    PICTURE X.                                           
           02  FILLER REDEFINES ANLAGB4F.                                       
             03 ANLAGB4A    PICTURE X.                                          
           02  ANLAGB4I  PIC X(7).                                              
           02  VERTRTL    COMP  PIC  S9(4).                                     
           02  VERTRTF    PICTURE X.                                            
           02  FILLER REDEFINES VERTRTF.                                        
             03 VERTRTA    PICTURE X.                                           
           02  VERTRTI  PIC X(14).                                              
           02  VERT1L    COMP  PIC  S9(4).                                      
           02  VERT1F    PICTURE X.                                             
           02  FILLER REDEFINES VERT1F.                                         
             03 VERT1A    PICTURE X.                                            
           02  VERT1I.                                                          
             03  VERTR1I  PIC X(8).                                             
             03  VERTZ1I  PIC X(3).                                             
           02  VERTNEUL    COMP  PIC  S9(4).                                    
           02  VERTNEUF    PICTURE X.                                           
           02  FILLER REDEFINES VERTNEUF.                                       
             03 VERTNEUA    PICTURE X.                                          
           02  VERTNEUI  PIC X(3).                                              
           02  VERT2L    COMP  PIC  S9(4).                                      
           02  VERT2F    PICTURE X.                                             
           02  FILLER REDEFINES VERT2F.                                         
             03 VERT2A    PICTURE X.                                            
           02  VERT2I.                                                          
             03  VERTR2I  PIC X(8).                                             
             03  VERTZ2I  PIC X(3).                                             
           02  BESCHRL    COMP  PIC  S9(4).                                     
           02  BESCHRF    PICTURE X.                                            
           02  FILLER REDEFINES BESCHRF.                                        
             03 BESCHRA    PICTURE X.                                           
           02  BESCHRI  PIC X(15).                                              
           02  BESCHR1L    COMP  PIC  S9(4).                                    
           02  BESCHR1F    PICTURE X.                                           
           02  FILLER REDEFINES BESCHR1F.                                       
             03 BESCHR1A    PICTURE X.                                          
           02  BESCHR1I  PIC X(20).                                             
           02  ZUVERTL    COMP  PIC  S9(4).                                     
           02  ZUVERTF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERTF.                                        
             03 ZUVERTA    PICTURE X.                                           
           02  ZUVERTI  PIC X(9).                                               
           02  ZUVER1L    COMP  PIC  S9(4).                                     
           02  ZUVER1F    PICTURE X.                                            
           02  FILLER REDEFINES ZUVER1F.                                        
             03 ZUVER1A    PICTURE X.                                           
           02  ZUVER1I  PIC X(2).                                               
           02  ZUVER2L    COMP  PIC  S9(4).                                     
           02  ZUVER2F    PICTURE X.                                            
           02  FILLER REDEFINES ZUVER2F.                                        
             03 ZUVER2A    PICTURE X.                                           
           02  ZUVER2I  PIC X(8).                                               
           02  ZUVERBL    COMP  PIC  S9(4).                                     
           02  ZUVERBF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERBF.                                        
             03 ZUVERBA    PICTURE X.                                           
           02  ZUVERBI  PIC X(1).                                               
           02  ZUVER3L    COMP  PIC  S9(4).                                     
           02  ZUVER3F    PICTURE X.                                            
           02  FILLER REDEFINES ZUVER3F.                                        
             03 ZUVER3A    PICTURE X.                                           
           02  ZUVER3I  PIC X(2).                                               
           02  ZUVERVL    COMP  PIC  S9(4).                                     
           02  ZUVERVF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERVF.                                        
             03 ZUVERVA    PICTURE X.                                           
           02  ZUVERVI  PIC X(1).                                               
           02  ZUVKTXL    COMP  PIC  S9(4).                                     
           02  ZUVKTXF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVKTXF.                                        
             03 ZUVKTXA    PICTURE X.                                           
           02  ZUVKTXI  PIC X(2).                                               
           02  ZUVERKL    COMP  PIC  S9(4).                                     
           02  ZUVERKF    PICTURE X.                                            
           02  FILLER REDEFINES ZUVERKF.                                        
             03 ZUVERKA    PICTURE X.                                           
           02  ZUVERKI  PIC X(2).                                               
           02  KUENDBTL    COMP  PIC  S9(4).                                    
           02  KUENDBTF    PICTURE X.                                           
           02  FILLER REDEFINES KUENDBTF.                                       
             03 KUENDBTA    PICTURE X.                                          
           02  KUENDBTI  PIC X(18).                                             
           02  KUENDBL    COMP  PIC  S9(4).                                     
           02  KUENDBF    PICTURE X.                                            
           02  FILLER REDEFINES KUENDBF.                                        
             03 KUENDBA    PICTURE X.                                           
           02  KUENDBI  PIC X(1).                                               
           02  SCHUFTL    COMP  PIC  S9(4).                                     
           02  SCHUFTF    PICTURE X.                                            
           02  FILLER REDEFINES SCHUFTF.                                        
             03 SCHUFTA    PICTURE X.                                           
           02  SCHUFTI  PIC X(11).                                              
           02  SCHUF1L    COMP  PIC  S9(4).                                     
           02  SCHUF1F    PICTURE X.                                            
           02  FILLER REDEFINES SCHUF1F.                                        
             03 SCHUF1A    PICTURE X.                                           
           02  SCHUF1I  PIC X(8).                                               
           02  FUEHZGL    COMP  PIC  S9(4).                                     
           02  FUEHZGF    PICTURE X.                                            
           02  FILLER REDEFINES FUEHZGF.                                        
             03 FUEHZGA    PICTURE X.                                           
           02  FUEHZGI  PIC X(8).                                               
           02  GEWSCHL    COMP  PIC  S9(4).                                     
           02  GEWSCHF    PICTURE X.                                            
           02  FILLER REDEFINES GEWSCHF.                                        
             03 GEWSCHA    PICTURE X.                                           
           02  GEWSCHI  PIC X(79).                                              
           02  NVBNR2L    COMP  PIC  S9(4).                                     
           02  NVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES NVBNR2F.                                        
             03 NVBNR2A    PICTURE X.                                           
           02  NVBNR2I  PIC X(7).                                               
           02  NMCODE2L    COMP  PIC  S9(4).                                    
           02  NMCODE2F    PICTURE X.                                           
           02  FILLER REDEFINES NMCODE2F.                                       
             03 NMCODE2A    PICTURE X.                                          
           02  NMCODE2I  PIC X(18).                                             
           02  NTRANS2L    COMP  PIC  S9(4).                                    
           02  NTRANS2F    PICTURE X.                                           
           02  FILLER REDEFINES NTRANS2F.                                       
             03 NTRANS2A    PICTURE X.                                          
           02  NTRANS2I  PIC X(4).                                              
           02  INFO2L    COMP  PIC  S9(4).                                      
           02  INFO2F    PICTURE X.                                             
           02  FILLER REDEFINES INFO2F.                                         
             03 INFO2A    PICTURE X.                                            
           02  INFO2I  PIC X(75).                                               
       01  UU956O REDEFINES UU956I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR2O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT2O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIR2O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZUNAM2O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VORNAM2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  STR2TO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL2TO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  STR2O  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ2TO  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ2O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT2O  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  PB2O  PIC X(3).                                                  
           02  FILLER PICTURE X(3).                                             
           02  TEL2TO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEL2O  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFAXNR2O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  INSTTO  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  INSTO  PIC X(22).                                                
           02  FILLER PICTURE X(3).                                             
           02  BLZTO  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  BLZO PIC Z(8).                                                   
           02  FILLER PICTURE X(3).                                             
           02  KTONRO PIC Z(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  ABVSCHUO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  KTOINHTO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  KTOINHO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  PCNRT1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PCNRT2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PCNRT3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PCNR1O PIC Z(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PCNR2O PIC Z(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PCNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PCNRT4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PCNR4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBSEITTO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBSEITO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  ANLAGB1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANLAGB2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANLAGB3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANLAGB4O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERTRTO  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERT1O.                                                          
             03  VERTR1O PIC 99.99.99.                                          
             03  VERTZ1O  PIC X(3).                                             
           02  FILLER PICTURE X(3).                                             
           02  VERTNEUO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  VERT2O.                                                          
             03  VERTR2O  PIC X(8).                                             
             03  VERTZ2O  PIC X(3).                                             
           02  FILLER PICTURE X(3).                                             
           02  BESCHRO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  BESCHR1O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ZUVERTO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVER1O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVER2O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  ZUVERBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVER3O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVERVO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVKTXO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUVERKO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  KUENDBTO  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  KUENDBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  SCHUFTO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  SCHUF1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  FUEHZGO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  GEWSCHO  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  NVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  NMCODE2O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  NTRANS2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFO2O  PIC X(75).                                               
