       01  UU963I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR1L    COMP  PIC  S9(4).                                       
           02  PNR1F    PICTURE X.                                              
           02  FILLER REDEFINES PNR1F.                                          
             03 PNR1A    PICTURE X.                                             
           02  PNR1I  PIC X(7).                                                 
           02  DATUM1L    COMP  PIC  S9(4).                                     
           02  DATUM1F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM1F.                                        
             03 DATUM1A    PICTURE X.                                           
           02  DATUM1I  PIC X(8).                                               
           02  UHR1L    COMP  PIC  S9(4).                                       
           02  UHR1F    PICTURE X.                                              
           02  FILLER REDEFINES UHR1F.                                          
             03 UHR1A    PICTURE X.                                             
           02  UHR1I  PIC X(5).                                                 
           02  VBNRL    COMP  PIC  S9(4).                                       
           02  VBNRF    PICTURE X.                                              
           02  FILLER REDEFINES VBNRF.                                          
             03 VBNRA    PICTURE X.                                             
           02  VBNRI  PIC X(7).                                                 
           02  MONATL    COMP  PIC  S9(4).                                      
           02  MONATF    PICTURE X.                                             
           02  FILLER REDEFINES MONATF.                                         
             03 MONATA    PICTURE X.                                            
           02  MONATI  PIC X(5).                                                
           02  AKTIONL    COMP  PIC  S9(4).                                     
           02  AKTIONF    PICTURE X.                                            
           02  FILLER REDEFINES AKTIONF.                                        
             03 AKTIONA    PICTURE X.                                           
           02  AKTIONI  PIC X(2).                                               
           02  NAME1L    COMP  PIC  S9(4).                                      
           02  NAME1F    PICTURE X.                                             
           02  FILLER REDEFINES NAME1F.                                         
             03 NAME1A    PICTURE X.                                            
           02  NAME1I  PIC X(10).                                               
           02  VBNR1L    COMP  PIC  S9(4).                                      
           02  VBNR1F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR1F.                                         
             03 VBNR1A    PICTURE X.                                            
           02  VBNR1I  PIC X(7).                                                
           02  SOLL1L    COMP  PIC  S9(4).                                      
           02  SOLL1F    PICTURE X.                                             
           02  FILLER REDEFINES SOLL1F.                                         
             03 SOLL1A    PICTURE X.                                            
           02  SOLL1I  PIC X(4).                                                
           02  SGSMO1L    COMP  PIC  S9(4).                                     
           02  SGSMO1F    PICTURE X.                                            
           02  FILLER REDEFINES SGSMO1F.                                        
             03 SGSMO1A    PICTURE X.                                           
           02  SGSMO1I  PIC X(7).                                               
           02  SGSH1L    COMP  PIC  S9(4).                                      
           02  SGSH1F    PICTURE X.                                             
           02  FILLER REDEFINES SGSH1F.                                         
             03 SGSH1A    PICTURE X.                                            
           02  SGSH1I  PIC X(7).                                                
           02  SEIMO1L    COMP  PIC  S9(4).                                     
           02  SEIMO1F    PICTURE X.                                            
           02  FILLER REDEFINES SEIMO1F.                                        
             03 SEIMO1A    PICTURE X.                                           
           02  SEIMO1I  PIC X(7).                                               
           02  SEIH1L    COMP  PIC  S9(4).                                      
           02  SEIH1F    PICTURE X.                                             
           02  FILLER REDEFINES SEIH1F.                                         
             03 SEIH1A    PICTURE X.                                            
           02  SEIH1I  PIC X(7).                                                
           02  SGRMO1L    COMP  PIC  S9(4).                                     
           02  SGRMO1F    PICTURE X.                                            
           02  FILLER REDEFINES SGRMO1F.                                        
             03 SGRMO1A    PICTURE X.                                           
           02  SGRMO1I  PIC X(7).                                               
           02  SGRH1L    COMP  PIC  S9(4).                                      
           02  SGRH1F    PICTURE X.                                             
           02  FILLER REDEFINES SGRH1F.                                         
             03 SGRH1A    PICTURE X.                                            
           02  SGRH1I  PIC X(7).                                                
           02  IST1L    COMP  PIC  S9(4).                                       
           02  IST1F    PICTURE X.                                              
           02  FILLER REDEFINES IST1F.                                          
             03 IST1A    PICTURE X.                                             
           02  IST1I  PIC X(4).                                                 
           02  IGSMO1L    COMP  PIC  S9(4).                                     
           02  IGSMO1F    PICTURE X.                                            
           02  FILLER REDEFINES IGSMO1F.                                        
             03 IGSMO1A    PICTURE X.                                           
           02  IGSMO1I  PIC X(7).                                               
           02  IGSH1L    COMP  PIC  S9(4).                                      
           02  IGSH1F    PICTURE X.                                             
           02  FILLER REDEFINES IGSH1F.                                         
             03 IGSH1A    PICTURE X.                                            
           02  IGSH1I  PIC X(7).                                                
           02  IEIMO1L    COMP  PIC  S9(4).                                     
           02  IEIMO1F    PICTURE X.                                            
           02  FILLER REDEFINES IEIMO1F.                                        
             03 IEIMO1A    PICTURE X.                                           
           02  IEIMO1I  PIC X(7).                                               
           02  IEIH1L    COMP  PIC  S9(4).                                      
           02  IEIH1F    PICTURE X.                                             
           02  FILLER REDEFINES IEIH1F.                                         
             03 IEIH1A    PICTURE X.                                            
           02  IEIH1I  PIC X(7).                                                
           02  IGRMO1L    COMP  PIC  S9(4).                                     
           02  IGRMO1F    PICTURE X.                                            
           02  FILLER REDEFINES IGRMO1F.                                        
             03 IGRMO1A    PICTURE X.                                           
           02  IGRMO1I  PIC X(7).                                               
           02  IGRH1L    COMP  PIC  S9(4).                                      
           02  IGRH1F    PICTURE X.                                             
           02  FILLER REDEFINES IGRH1F.                                         
             03 IGRH1A    PICTURE X.                                            
           02  IGRH1I  PIC X(7).                                                
           02  PROZ1L    COMP  PIC  S9(4).                                      
           02  PROZ1F    PICTURE X.                                             
           02  FILLER REDEFINES PROZ1F.                                         
             03 PROZ1A    PICTURE X.                                            
           02  PROZ1I  PIC X(4).                                                
           02  PGSMO1L    COMP  PIC  S9(4).                                     
           02  PGSMO1F    PICTURE X.                                            
           02  FILLER REDEFINES PGSMO1F.                                        
             03 PGSMO1A    PICTURE X.                                           
           02  PGSMO1I  PIC X(7).                                               
           02  PGSH1L    COMP  PIC  S9(4).                                      
           02  PGSH1F    PICTURE X.                                             
           02  FILLER REDEFINES PGSH1F.                                         
             03 PGSH1A    PICTURE X.                                            
           02  PGSH1I  PIC X(7).                                                
           02  PEIMO1L    COMP  PIC  S9(4).                                     
           02  PEIMO1F    PICTURE X.                                            
           02  FILLER REDEFINES PEIMO1F.                                        
             03 PEIMO1A    PICTURE X.                                           
           02  PEIMO1I  PIC X(7).                                               
           02  PEIH1L    COMP  PIC  S9(4).                                      
           02  PEIH1F    PICTURE X.                                             
           02  FILLER REDEFINES PEIH1F.                                         
             03 PEIH1A    PICTURE X.                                            
           02  PEIH1I  PIC X(7).                                                
           02  PGRMO1L    COMP  PIC  S9(4).                                     
           02  PGRMO1F    PICTURE X.                                            
           02  FILLER REDEFINES PGRMO1F.                                        
             03 PGRMO1A    PICTURE X.                                           
           02  PGRMO1I  PIC X(7).                                               
           02  PGRH1L    COMP  PIC  S9(4).                                      
           02  PGRH1F    PICTURE X.                                             
           02  FILLER REDEFINES PGRH1F.                                         
             03 PGRH1A    PICTURE X.                                            
           02  PGRH1I  PIC X(7).                                                
           02  NAME2L    COMP  PIC  S9(4).                                      
           02  NAME2F    PICTURE X.                                             
           02  FILLER REDEFINES NAME2F.                                         
             03 NAME2A    PICTURE X.                                            
           02  NAME2I  PIC X(10).                                               
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  SOLL2L    COMP  PIC  S9(4).                                      
           02  SOLL2F    PICTURE X.                                             
           02  FILLER REDEFINES SOLL2F.                                         
             03 SOLL2A    PICTURE X.                                            
           02  SOLL2I  PIC X(4).                                                
           02  SGSMO2L    COMP  PIC  S9(4).                                     
           02  SGSMO2F    PICTURE X.                                            
           02  FILLER REDEFINES SGSMO2F.                                        
             03 SGSMO2A    PICTURE X.                                           
           02  SGSMO2I  PIC X(7).                                               
           02  SGSH2L    COMP  PIC  S9(4).                                      
           02  SGSH2F    PICTURE X.                                             
           02  FILLER REDEFINES SGSH2F.                                         
             03 SGSH2A    PICTURE X.                                            
           02  SGSH2I  PIC X(7).                                                
           02  SEIMO2L    COMP  PIC  S9(4).                                     
           02  SEIMO2F    PICTURE X.                                            
           02  FILLER REDEFINES SEIMO2F.                                        
             03 SEIMO2A    PICTURE X.                                           
           02  SEIMO2I  PIC X(7).                                               
           02  SEIH2L    COMP  PIC  S9(4).                                      
           02  SEIH2F    PICTURE X.                                             
           02  FILLER REDEFINES SEIH2F.                                         
             03 SEIH2A    PICTURE X.                                            
           02  SEIH2I  PIC X(7).                                                
           02  SGRMO2L    COMP  PIC  S9(4).                                     
           02  SGRMO2F    PICTURE X.                                            
           02  FILLER REDEFINES SGRMO2F.                                        
             03 SGRMO2A    PICTURE X.                                           
           02  SGRMO2I  PIC X(7).                                               
           02  SGRH2L    COMP  PIC  S9(4).                                      
           02  SGRH2F    PICTURE X.                                             
           02  FILLER REDEFINES SGRH2F.                                         
             03 SGRH2A    PICTURE X.                                            
           02  SGRH2I  PIC X(7).                                                
           02  IST2L    COMP  PIC  S9(4).                                       
           02  IST2F    PICTURE X.                                              
           02  FILLER REDEFINES IST2F.                                          
             03 IST2A    PICTURE X.                                             
           02  IST2I  PIC X(4).                                                 
           02  IGSMO2L    COMP  PIC  S9(4).                                     
           02  IGSMO2F    PICTURE X.                                            
           02  FILLER REDEFINES IGSMO2F.                                        
             03 IGSMO2A    PICTURE X.                                           
           02  IGSMO2I  PIC X(7).                                               
           02  IGSH2L    COMP  PIC  S9(4).                                      
           02  IGSH2F    PICTURE X.                                             
           02  FILLER REDEFINES IGSH2F.                                         
             03 IGSH2A    PICTURE X.                                            
           02  IGSH2I  PIC X(7).                                                
           02  IEIMO2L    COMP  PIC  S9(4).                                     
           02  IEIMO2F    PICTURE X.                                            
           02  FILLER REDEFINES IEIMO2F.                                        
             03 IEIMO2A    PICTURE X.                                           
           02  IEIMO2I  PIC X(7).                                               
           02  IEIH2L    COMP  PIC  S9(4).                                      
           02  IEIH2F    PICTURE X.                                             
           02  FILLER REDEFINES IEIH2F.                                         
             03 IEIH2A    PICTURE X.                                            
           02  IEIH2I  PIC X(7).                                                
           02  IGRMO2L    COMP  PIC  S9(4).                                     
           02  IGRMO2F    PICTURE X.                                            
           02  FILLER REDEFINES IGRMO2F.                                        
             03 IGRMO2A    PICTURE X.                                           
           02  IGRMO2I  PIC X(7).                                               
           02  IGRH2L    COMP  PIC  S9(4).                                      
           02  IGRH2F    PICTURE X.                                             
           02  FILLER REDEFINES IGRH2F.                                         
             03 IGRH2A    PICTURE X.                                            
           02  IGRH2I  PIC X(7).                                                
           02  PROZ2L    COMP  PIC  S9(4).                                      
           02  PROZ2F    PICTURE X.                                             
           02  FILLER REDEFINES PROZ2F.                                         
             03 PROZ2A    PICTURE X.                                            
           02  PROZ2I  PIC X(4).                                                
           02  PGSMO2L    COMP  PIC  S9(4).                                     
           02  PGSMO2F    PICTURE X.                                            
           02  FILLER REDEFINES PGSMO2F.                                        
             03 PGSMO2A    PICTURE X.                                           
           02  PGSMO2I  PIC X(7).                                               
           02  PGSH2L    COMP  PIC  S9(4).                                      
           02  PGSH2F    PICTURE X.                                             
           02  FILLER REDEFINES PGSH2F.                                         
             03 PGSH2A    PICTURE X.                                            
           02  PGSH2I  PIC X(7).                                                
           02  PEIMO2L    COMP  PIC  S9(4).                                     
           02  PEIMO2F    PICTURE X.                                            
           02  FILLER REDEFINES PEIMO2F.                                        
             03 PEIMO2A    PICTURE X.                                           
           02  PEIMO2I  PIC X(7).                                               
           02  PEIH2L    COMP  PIC  S9(4).                                      
           02  PEIH2F    PICTURE X.                                             
           02  FILLER REDEFINES PEIH2F.                                         
             03 PEIH2A    PICTURE X.                                            
           02  PEIH2I  PIC X(7).                                                
           02  PGRMO2L    COMP  PIC  S9(4).                                     
           02  PGRMO2F    PICTURE X.                                            
           02  FILLER REDEFINES PGRMO2F.                                        
             03 PGRMO2A    PICTURE X.                                           
           02  PGRMO2I  PIC X(7).                                               
           02  PGRH2L    COMP  PIC  S9(4).                                      
           02  PGRH2F    PICTURE X.                                             
           02  FILLER REDEFINES PGRH2F.                                         
             03 PGRH2A    PICTURE X.                                            
           02  PGRH2I  PIC X(7).                                                
           02  NAME3L    COMP  PIC  S9(4).                                      
           02  NAME3F    PICTURE X.                                             
           02  FILLER REDEFINES NAME3F.                                         
             03 NAME3A    PICTURE X.                                            
           02  NAME3I  PIC X(10).                                               
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  SOLL3L    COMP  PIC  S9(4).                                      
           02  SOLL3F    PICTURE X.                                             
           02  FILLER REDEFINES SOLL3F.                                         
             03 SOLL3A    PICTURE X.                                            
           02  SOLL3I  PIC X(4).                                                
           02  SGSMO3L    COMP  PIC  S9(4).                                     
           02  SGSMO3F    PICTURE X.                                            
           02  FILLER REDEFINES SGSMO3F.                                        
             03 SGSMO3A    PICTURE X.                                           
           02  SGSMO3I  PIC X(7).                                               
           02  SGSH3L    COMP  PIC  S9(4).                                      
           02  SGSH3F    PICTURE X.                                             
           02  FILLER REDEFINES SGSH3F.                                         
             03 SGSH3A    PICTURE X.                                            
           02  SGSH3I  PIC X(7).                                                
           02  SEIMO3L    COMP  PIC  S9(4).                                     
           02  SEIMO3F    PICTURE X.                                            
           02  FILLER REDEFINES SEIMO3F.                                        
             03 SEIMO3A    PICTURE X.                                           
           02  SEIMO3I  PIC X(7).                                               
           02  SEIH3L    COMP  PIC  S9(4).                                      
           02  SEIH3F    PICTURE X.                                             
           02  FILLER REDEFINES SEIH3F.                                         
             03 SEIH3A    PICTURE X.                                            
           02  SEIH3I  PIC X(7).                                                
           02  SGRMO3L    COMP  PIC  S9(4).                                     
           02  SGRMO3F    PICTURE X.                                            
           02  FILLER REDEFINES SGRMO3F.                                        
             03 SGRMO3A    PICTURE X.                                           
           02  SGRMO3I  PIC X(7).                                               
           02  SGRH3L    COMP  PIC  S9(4).                                      
           02  SGRH3F    PICTURE X.                                             
           02  FILLER REDEFINES SGRH3F.                                         
             03 SGRH3A    PICTURE X.                                            
           02  SGRH3I  PIC X(7).                                                
           02  IST3L    COMP  PIC  S9(4).                                       
           02  IST3F    PICTURE X.                                              
           02  FILLER REDEFINES IST3F.                                          
             03 IST3A    PICTURE X.                                             
           02  IST3I  PIC X(4).                                                 
           02  IGSMO3L    COMP  PIC  S9(4).                                     
           02  IGSMO3F    PICTURE X.                                            
           02  FILLER REDEFINES IGSMO3F.                                        
             03 IGSMO3A    PICTURE X.                                           
           02  IGSMO3I  PIC X(7).                                               
           02  IGSH3L    COMP  PIC  S9(4).                                      
           02  IGSH3F    PICTURE X.                                             
           02  FILLER REDEFINES IGSH3F.                                         
             03 IGSH3A    PICTURE X.                                            
           02  IGSH3I  PIC X(7).                                                
           02  IEIMO3L    COMP  PIC  S9(4).                                     
           02  IEIMO3F    PICTURE X.                                            
           02  FILLER REDEFINES IEIMO3F.                                        
             03 IEIMO3A    PICTURE X.                                           
           02  IEIMO3I  PIC X(7).                                               
           02  IEIH3L    COMP  PIC  S9(4).                                      
           02  IEIH3F    PICTURE X.                                             
           02  FILLER REDEFINES IEIH3F.                                         
             03 IEIH3A    PICTURE X.                                            
           02  IEIH3I  PIC X(7).                                                
           02  IGRMO3L    COMP  PIC  S9(4).                                     
           02  IGRMO3F    PICTURE X.                                            
           02  FILLER REDEFINES IGRMO3F.                                        
             03 IGRMO3A    PICTURE X.                                           
           02  IGRMO3I  PIC X(7).                                               
           02  IGRH3L    COMP  PIC  S9(4).                                      
           02  IGRH3F    PICTURE X.                                             
           02  FILLER REDEFINES IGRH3F.                                         
             03 IGRH3A    PICTURE X.                                            
           02  IGRH3I  PIC X(7).                                                
           02  PROZ3L    COMP  PIC  S9(4).                                      
           02  PROZ3F    PICTURE X.                                             
           02  FILLER REDEFINES PROZ3F.                                         
             03 PROZ3A    PICTURE X.                                            
           02  PROZ3I  PIC X(4).                                                
           02  PGSMO3L    COMP  PIC  S9(4).                                     
           02  PGSMO3F    PICTURE X.                                            
           02  FILLER REDEFINES PGSMO3F.                                        
             03 PGSMO3A    PICTURE X.                                           
           02  PGSMO3I  PIC X(7).                                               
           02  PGSH3L    COMP  PIC  S9(4).                                      
           02  PGSH3F    PICTURE X.                                             
           02  FILLER REDEFINES PGSH3F.                                         
             03 PGSH3A    PICTURE X.                                            
           02  PGSH3I  PIC X(7).                                                
           02  PEIMO3L    COMP  PIC  S9(4).                                     
           02  PEIMO3F    PICTURE X.                                            
           02  FILLER REDEFINES PEIMO3F.                                        
             03 PEIMO3A    PICTURE X.                                           
           02  PEIMO3I  PIC X(7).                                               
           02  PEIH3L    COMP  PIC  S9(4).                                      
           02  PEIH3F    PICTURE X.                                             
           02  FILLER REDEFINES PEIH3F.                                         
             03 PEIH3A    PICTURE X.                                            
           02  PEIH3I  PIC X(7).                                                
           02  PGRMO3L    COMP  PIC  S9(4).                                     
           02  PGRMO3F    PICTURE X.                                            
           02  FILLER REDEFINES PGRMO3F.                                        
             03 PGRMO3A    PICTURE X.                                           
           02  PGRMO3I  PIC X(7).                                               
           02  PGRH3L    COMP  PIC  S9(4).                                      
           02  PGRH3F    PICTURE X.                                             
           02  FILLER REDEFINES PGRH3F.                                         
             03 PGRH3A    PICTURE X.                                            
           02  PGRH3I  PIC X(7).                                                
           02  NAME4L    COMP  PIC  S9(4).                                      
           02  NAME4F    PICTURE X.                                             
           02  FILLER REDEFINES NAME4F.                                         
             03 NAME4A    PICTURE X.                                            
           02  NAME4I  PIC X(10).                                               
           02  VBNR4L    COMP  PIC  S9(4).                                      
           02  VBNR4F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR4F.                                         
             03 VBNR4A    PICTURE X.                                            
           02  VBNR4I  PIC X(7).                                                
           02  SOLL4L    COMP  PIC  S9(4).                                      
           02  SOLL4F    PICTURE X.                                             
           02  FILLER REDEFINES SOLL4F.                                         
             03 SOLL4A    PICTURE X.                                            
           02  SOLL4I  PIC X(4).                                                
           02  SGSMO4L    COMP  PIC  S9(4).                                     
           02  SGSMO4F    PICTURE X.                                            
           02  FILLER REDEFINES SGSMO4F.                                        
             03 SGSMO4A    PICTURE X.                                           
           02  SGSMO4I  PIC X(7).                                               
           02  SGSH4L    COMP  PIC  S9(4).                                      
           02  SGSH4F    PICTURE X.                                             
           02  FILLER REDEFINES SGSH4F.                                         
             03 SGSH4A    PICTURE X.                                            
           02  SGSH4I  PIC X(7).                                                
           02  SEIMO4L    COMP  PIC  S9(4).                                     
           02  SEIMO4F    PICTURE X.                                            
           02  FILLER REDEFINES SEIMO4F.                                        
             03 SEIMO4A    PICTURE X.                                           
           02  SEIMO4I  PIC X(7).                                               
           02  SEIH4L    COMP  PIC  S9(4).                                      
           02  SEIH4F    PICTURE X.                                             
           02  FILLER REDEFINES SEIH4F.                                         
             03 SEIH4A    PICTURE X.                                            
           02  SEIH4I  PIC X(7).                                                
           02  SGRMO4L    COMP  PIC  S9(4).                                     
           02  SGRMO4F    PICTURE X.                                            
           02  FILLER REDEFINES SGRMO4F.                                        
             03 SGRMO4A    PICTURE X.                                           
           02  SGRMO4I  PIC X(7).                                               
           02  SGRH4L    COMP  PIC  S9(4).                                      
           02  SGRH4F    PICTURE X.                                             
           02  FILLER REDEFINES SGRH4F.                                         
             03 SGRH4A    PICTURE X.                                            
           02  SGRH4I  PIC X(7).                                                
           02  IST4L    COMP  PIC  S9(4).                                       
           02  IST4F    PICTURE X.                                              
           02  FILLER REDEFINES IST4F.                                          
             03 IST4A    PICTURE X.                                             
           02  IST4I  PIC X(4).                                                 
           02  IGSMO4L    COMP  PIC  S9(4).                                     
           02  IGSMO4F    PICTURE X.                                            
           02  FILLER REDEFINES IGSMO4F.                                        
             03 IGSMO4A    PICTURE X.                                           
           02  IGSMO4I  PIC X(7).                                               
           02  IGSH4L    COMP  PIC  S9(4).                                      
           02  IGSH4F    PICTURE X.                                             
           02  FILLER REDEFINES IGSH4F.                                         
             03 IGSH4A    PICTURE X.                                            
           02  IGSH4I  PIC X(7).                                                
           02  IEIMO4L    COMP  PIC  S9(4).                                     
           02  IEIMO4F    PICTURE X.                                            
           02  FILLER REDEFINES IEIMO4F.                                        
             03 IEIMO4A    PICTURE X.                                           
           02  IEIMO4I  PIC X(7).                                               
           02  IEIH4L    COMP  PIC  S9(4).                                      
           02  IEIH4F    PICTURE X.                                             
           02  FILLER REDEFINES IEIH4F.                                         
             03 IEIH4A    PICTURE X.                                            
           02  IEIH4I  PIC X(7).                                                
           02  IGRMO4L    COMP  PIC  S9(4).                                     
           02  IGRMO4F    PICTURE X.                                            
           02  FILLER REDEFINES IGRMO4F.                                        
             03 IGRMO4A    PICTURE X.                                           
           02  IGRMO4I  PIC X(7).                                               
           02  IGRH4L    COMP  PIC  S9(4).                                      
           02  IGRH4F    PICTURE X.                                             
           02  FILLER REDEFINES IGRH4F.                                         
             03 IGRH4A    PICTURE X.                                            
           02  IGRH4I  PIC X(7).                                                
           02  PROZ4L    COMP  PIC  S9(4).                                      
           02  PROZ4F    PICTURE X.                                             
           02  FILLER REDEFINES PROZ4F.                                         
             03 PROZ4A    PICTURE X.                                            
           02  PROZ4I  PIC X(4).                                                
           02  PGSMO4L    COMP  PIC  S9(4).                                     
           02  PGSMO4F    PICTURE X.                                            
           02  FILLER REDEFINES PGSMO4F.                                        
             03 PGSMO4A    PICTURE X.                                           
           02  PGSMO4I  PIC X(7).                                               
           02  PGSH4L    COMP  PIC  S9(4).                                      
           02  PGSH4F    PICTURE X.                                             
           02  FILLER REDEFINES PGSH4F.                                         
             03 PGSH4A    PICTURE X.                                            
           02  PGSH4I  PIC X(7).                                                
           02  PEIMO4L    COMP  PIC  S9(4).                                     
           02  PEIMO4F    PICTURE X.                                            
           02  FILLER REDEFINES PEIMO4F.                                        
             03 PEIMO4A    PICTURE X.                                           
           02  PEIMO4I  PIC X(7).                                               
           02  PEIH4L    COMP  PIC  S9(4).                                      
           02  PEIH4F    PICTURE X.                                             
           02  FILLER REDEFINES PEIH4F.                                         
             03 PEIH4A    PICTURE X.                                            
           02  PEIH4I  PIC X(7).                                                
           02  PGRMO4L    COMP  PIC  S9(4).                                     
           02  PGRMO4F    PICTURE X.                                            
           02  FILLER REDEFINES PGRMO4F.                                        
             03 PGRMO4A    PICTURE X.                                           
           02  PGRMO4I  PIC X(7).                                               
           02  PGRH4L    COMP  PIC  S9(4).                                      
           02  PGRH4F    PICTURE X.                                             
           02  FILLER REDEFINES PGRH4F.                                         
             03 PGRH4A    PICTURE X.                                            
           02  PGRH4I  PIC X(7).                                                
           02  NAME5L    COMP  PIC  S9(4).                                      
           02  NAME5F    PICTURE X.                                             
           02  FILLER REDEFINES NAME5F.                                         
             03 NAME5A    PICTURE X.                                            
           02  NAME5I  PIC X(10).                                               
           02  VBNR5L    COMP  PIC  S9(4).                                      
           02  VBNR5F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR5F.                                         
             03 VBNR5A    PICTURE X.                                            
           02  VBNR5I  PIC X(7).                                                
           02  SOLL5L    COMP  PIC  S9(4).                                      
           02  SOLL5F    PICTURE X.                                             
           02  FILLER REDEFINES SOLL5F.                                         
             03 SOLL5A    PICTURE X.                                            
           02  SOLL5I  PIC X(4).                                                
           02  SGSMO5L    COMP  PIC  S9(4).                                     
           02  SGSMO5F    PICTURE X.                                            
           02  FILLER REDEFINES SGSMO5F.                                        
             03 SGSMO5A    PICTURE X.                                           
           02  SGSMO5I  PIC X(7).                                               
           02  SGSH5L    COMP  PIC  S9(4).                                      
           02  SGSH5F    PICTURE X.                                             
           02  FILLER REDEFINES SGSH5F.                                         
             03 SGSH5A    PICTURE X.                                            
           02  SGSH5I  PIC X(7).                                                
           02  SEIMO5L    COMP  PIC  S9(4).                                     
           02  SEIMO5F    PICTURE X.                                            
           02  FILLER REDEFINES SEIMO5F.                                        
             03 SEIMO5A    PICTURE X.                                           
           02  SEIMO5I  PIC X(7).                                               
           02  SEIH5L    COMP  PIC  S9(4).                                      
           02  SEIH5F    PICTURE X.                                             
           02  FILLER REDEFINES SEIH5F.                                         
             03 SEIH5A    PICTURE X.                                            
           02  SEIH5I  PIC X(7).                                                
           02  SGRMO5L    COMP  PIC  S9(4).                                     
           02  SGRMO5F    PICTURE X.                                            
           02  FILLER REDEFINES SGRMO5F.                                        
             03 SGRMO5A    PICTURE X.                                           
           02  SGRMO5I  PIC X(7).                                               
           02  SGRH5L    COMP  PIC  S9(4).                                      
           02  SGRH5F    PICTURE X.                                             
           02  FILLER REDEFINES SGRH5F.                                         
             03 SGRH5A    PICTURE X.                                            
           02  SGRH5I  PIC X(7).                                                
           02  IST5L    COMP  PIC  S9(4).                                       
           02  IST5F    PICTURE X.                                              
           02  FILLER REDEFINES IST5F.                                          
             03 IST5A    PICTURE X.                                             
           02  IST5I  PIC X(4).                                                 
           02  IGSMO5L    COMP  PIC  S9(4).                                     
           02  IGSMO5F    PICTURE X.                                            
           02  FILLER REDEFINES IGSMO5F.                                        
             03 IGSMO5A    PICTURE X.                                           
           02  IGSMO5I  PIC X(7).                                               
           02  IGSH5L    COMP  PIC  S9(4).                                      
           02  IGSH5F    PICTURE X.                                             
           02  FILLER REDEFINES IGSH5F.                                         
             03 IGSH5A    PICTURE X.                                            
           02  IGSH5I  PIC X(7).                                                
           02  IEIMO5L    COMP  PIC  S9(4).                                     
           02  IEIMO5F    PICTURE X.                                            
           02  FILLER REDEFINES IEIMO5F.                                        
             03 IEIMO5A    PICTURE X.                                           
           02  IEIMO5I  PIC X(7).                                               
           02  IEIH5L    COMP  PIC  S9(4).                                      
           02  IEIH5F    PICTURE X.                                             
           02  FILLER REDEFINES IEIH5F.                                         
             03 IEIH5A    PICTURE X.                                            
           02  IEIH5I  PIC X(7).                                                
           02  IGRMO5L    COMP  PIC  S9(4).                                     
           02  IGRMO5F    PICTURE X.                                            
           02  FILLER REDEFINES IGRMO5F.                                        
             03 IGRMO5A    PICTURE X.                                           
           02  IGRMO5I  PIC X(7).                                               
           02  IGRH5L    COMP  PIC  S9(4).                                      
           02  IGRH5F    PICTURE X.                                             
           02  FILLER REDEFINES IGRH5F.                                         
             03 IGRH5A    PICTURE X.                                            
           02  IGRH5I  PIC X(7).                                                
           02  PROZ5L    COMP  PIC  S9(4).                                      
           02  PROZ5F    PICTURE X.                                             
           02  FILLER REDEFINES PROZ5F.                                         
             03 PROZ5A    PICTURE X.                                            
           02  PROZ5I  PIC X(4).                                                
           02  PGSMO5L    COMP  PIC  S9(4).                                     
           02  PGSMO5F    PICTURE X.                                            
           02  FILLER REDEFINES PGSMO5F.                                        
             03 PGSMO5A    PICTURE X.                                           
           02  PGSMO5I  PIC X(7).                                               
           02  PGSH5L    COMP  PIC  S9(4).                                      
           02  PGSH5F    PICTURE X.                                             
           02  FILLER REDEFINES PGSH5F.                                         
             03 PGSH5A    PICTURE X.                                            
           02  PGSH5I  PIC X(7).                                                
           02  PEIMO5L    COMP  PIC  S9(4).                                     
           02  PEIMO5F    PICTURE X.                                            
           02  FILLER REDEFINES PEIMO5F.                                        
             03 PEIMO5A    PICTURE X.                                           
           02  PEIMO5I  PIC X(7).                                               
           02  PEIH5L    COMP  PIC  S9(4).                                      
           02  PEIH5F    PICTURE X.                                             
           02  FILLER REDEFINES PEIH5F.                                         
             03 PEIH5A    PICTURE X.                                            
           02  PEIH5I  PIC X(7).                                                
           02  PGRMO5L    COMP  PIC  S9(4).                                     
           02  PGRMO5F    PICTURE X.                                            
           02  FILLER REDEFINES PGRMO5F.                                        
             03 PGRMO5A    PICTURE X.                                           
           02  PGRMO5I  PIC X(7).                                               
           02  PGRH5L    COMP  PIC  S9(4).                                      
           02  PGRH5F    PICTURE X.                                             
           02  FILLER REDEFINES PGRH5F.                                         
             03 PGRH5A    PICTURE X.                                            
           02  PGRH5I  PIC X(7).                                                
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  EVBNRI  PIC X(7).                                                
           02  EMMJJL    COMP  PIC  S9(4).                                      
           02  EMMJJF    PICTURE X.                                             
           02  FILLER REDEFINES EMMJJF.                                         
             03 EMMJJA    PICTURE X.                                            
           02  EMMJJI  PIC X(4).                                                
           02  ESCHLL    COMP  PIC  S9(4).                                      
           02  ESCHLF    PICTURE X.                                             
           02  FILLER REDEFINES ESCHLF.                                         
             03 ESCHLA    PICTURE X.                                            
           02  ESCHLI  PIC X(2).                                                
           02  ETRANSL    COMP  PIC  S9(4).                                     
           02  ETRANSF    PICTURE X.                                            
           02  FILLER REDEFINES ETRANSF.                                        
             03 ETRANSA    PICTURE X.                                           
           02  ETRANSI  PIC X(4).                                               
           02  HINWEISL    COMP  PIC  S9(4).                                    
           02  HINWEISF    PICTURE X.                                           
           02  FILLER REDEFINES HINWEISF.                                       
             03 HINWEISA    PICTURE X.                                          
           02  HINWEISI  PIC X(78).                                             
       01  UU963O REDEFINES UU963I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR1O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUM1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR1O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  MONATO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AKTIONO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME1O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SOLL1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGSMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGSH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SEIMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SEIH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGRMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGRH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IST1O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IGSMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGSH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IEIMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IEIH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IGRMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGRH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROZ1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGSMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGSH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PEIMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PEIH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGRMO1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGRH1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NAME2O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SOLL2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGSMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGSH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SEIMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SEIH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGRMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGRH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IST2O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IGSMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGSH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IEIMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IEIH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IGRMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGRH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROZ2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGSMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGSH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PEIMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PEIH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGRMO2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGRH2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NAME3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SOLL3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGSMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGSH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SEIMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SEIH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGRMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGRH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IST3O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IGSMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGSH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IEIMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IEIH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IGRMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGRH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROZ3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGSMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGSH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PEIMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PEIH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGRMO3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGRH3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NAME4O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SOLL4O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGSMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGSH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SEIMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SEIH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGRMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGRH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IST4O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IGSMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGSH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IEIMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IEIH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IGRMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGRH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROZ4O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGSMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGSH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PEIMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PEIH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGRMO4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGRH4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NAME5O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SOLL5O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGSMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGSH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SEIMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SEIH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  SGRMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  SGRH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IST5O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  IGSMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGSH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IEIMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IEIH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  IGRMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  IGRH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROZ5O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGSMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGSH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PEIMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PEIH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGRMO5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PGRH5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EMMJJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESCHLO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  ETRANSO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  HINWEISO  PIC X(78).                                             
