       01  UU960I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATEL    COMP  PIC  S9(4).                                       
           02  DATEF    PICTURE X.                                              
           02  FILLER REDEFINES DATEF.                                          
             03 DATEA    PICTURE X.                                             
           02  DATEI  PIC X(8).                                                 
           02  ZEITL    COMP  PIC  S9(4).                                       
           02  ZEITF    PICTURE X.                                              
           02  FILLER REDEFINES ZEITF.                                          
             03 ZEITA    PICTURE X.                                             
           02  ZEITI  PIC X(5).                                                 
           02  UEBTEXAL    COMP  PIC  S9(4).                                    
           02  UEBTEXAF    PICTURE X.                                           
           02  FILLER REDEFINES UEBTEXAF.                                       
             03 UEBTEXAA    PICTURE X.                                          
           02  UEBTEXAI  PIC X(58).                                             
           02  UEBTEXBL    COMP  PIC  S9(4).                                    
           02  UEBTEXBF    PICTURE X.                                           
           02  FILLER REDEFINES UEBTEXBF.                                       
             03 UEBTEXBA    PICTURE X.                                          
           02  UEBTEXBI  PIC X(58).                                             
           02  ST11L    COMP  PIC  S9(4).                                       
           02  ST11F    PICTURE X.                                              
           02  FILLER REDEFINES ST11F.                                          
             03 ST11A    PICTURE X.                                             
           02  ST11I  PIC X(6).                                                 
           02  SB11L    COMP  PIC  S9(4).                                       
           02  SB11F    PICTURE X.                                              
           02  FILLER REDEFINES SB11F.                                          
             03 SB11A    PICTURE X.                                             
           02  SB11I  PIC X(9).                                                 
           02  AE11L    COMP  PIC  S9(4).                                       
           02  AE11F    PICTURE X.                                              
           02  FILLER REDEFINES AE11F.                                          
             03 AE11A    PICTURE X.                                             
           02  AE11I  PIC X(7).                                                 
           02  ST121L    COMP  PIC  S9(4).                                      
           02  ST121F    PICTURE X.                                             
           02  FILLER REDEFINES ST121F.                                         
             03 ST121A    PICTURE X.                                            
           02  ST121I  PIC X(6).                                                
           02  SB121L    COMP  PIC  S9(4).                                      
           02  SB121F    PICTURE X.                                             
           02  FILLER REDEFINES SB121F.                                         
             03 SB121A    PICTURE X.                                            
           02  SB121I  PIC X(9).                                                
           02  AE121L    COMP  PIC  S9(4).                                      
           02  AE121F    PICTURE X.                                             
           02  FILLER REDEFINES AE121F.                                         
             03 AE121A    PICTURE X.                                            
           02  AE121I  PIC X(7).                                                
           02  ST21L    COMP  PIC  S9(4).                                       
           02  ST21F    PICTURE X.                                              
           02  FILLER REDEFINES ST21F.                                          
             03 ST21A    PICTURE X.                                             
           02  ST21I  PIC X(6).                                                 
           02  SB21L    COMP  PIC  S9(4).                                       
           02  SB21F    PICTURE X.                                              
           02  FILLER REDEFINES SB21F.                                          
             03 SB21A    PICTURE X.                                             
           02  SB21I  PIC X(9).                                                 
           02  AE21L    COMP  PIC  S9(4).                                       
           02  AE21F    PICTURE X.                                              
           02  FILLER REDEFINES AE21F.                                          
             03 AE21A    PICTURE X.                                             
           02  AE21I  PIC X(7).                                                 
           02  ST141L    COMP  PIC  S9(4).                                      
           02  ST141F    PICTURE X.                                             
           02  FILLER REDEFINES ST141F.                                         
             03 ST141A    PICTURE X.                                            
           02  ST141I  PIC X(6).                                                
           02  SB141L    COMP  PIC  S9(4).                                      
           02  SB141F    PICTURE X.                                             
           02  FILLER REDEFINES SB141F.                                         
             03 SB141A    PICTURE X.                                            
           02  SB141I  PIC X(9).                                                
           02  AE141L    COMP  PIC  S9(4).                                      
           02  AE141F    PICTURE X.                                             
           02  FILLER REDEFINES AE141F.                                         
             03 AE141A    PICTURE X.                                            
           02  AE141I  PIC X(7).                                                
           02  ST31L    COMP  PIC  S9(4).                                       
           02  ST31F    PICTURE X.                                              
           02  FILLER REDEFINES ST31F.                                          
             03 ST31A    PICTURE X.                                             
           02  ST31I  PIC X(6).                                                 
           02  SB31L    COMP  PIC  S9(4).                                       
           02  SB31F    PICTURE X.                                              
           02  FILLER REDEFINES SB31F.                                          
             03 SB31A    PICTURE X.                                             
           02  SB31I  PIC X(9).                                                 
           02  AE31L    COMP  PIC  S9(4).                                       
           02  AE31F    PICTURE X.                                              
           02  FILLER REDEFINES AE31F.                                          
             03 AE31A    PICTURE X.                                             
           02  AE31I  PIC X(7).                                                 
           02  ST151L    COMP  PIC  S9(4).                                      
           02  ST151F    PICTURE X.                                             
           02  FILLER REDEFINES ST151F.                                         
             03 ST151A    PICTURE X.                                            
           02  ST151I  PIC X(6).                                                
           02  SB151L    COMP  PIC  S9(4).                                      
           02  SB151F    PICTURE X.                                             
           02  FILLER REDEFINES SB151F.                                         
             03 SB151A    PICTURE X.                                            
           02  SB151I  PIC X(9).                                                
           02  AE151L    COMP  PIC  S9(4).                                      
           02  AE151F    PICTURE X.                                             
           02  FILLER REDEFINES AE151F.                                         
             03 AE151A    PICTURE X.                                            
           02  AE151I  PIC X(7).                                                
           02  ST41L    COMP  PIC  S9(4).                                       
           02  ST41F    PICTURE X.                                              
           02  FILLER REDEFINES ST41F.                                          
             03 ST41A    PICTURE X.                                             
           02  ST41I  PIC X(6).                                                 
           02  SB41L    COMP  PIC  S9(4).                                       
           02  SB41F    PICTURE X.                                              
           02  FILLER REDEFINES SB41F.                                          
             03 SB41A    PICTURE X.                                             
           02  SB41I  PIC X(9).                                                 
           02  AE41L    COMP  PIC  S9(4).                                       
           02  AE41F    PICTURE X.                                              
           02  FILLER REDEFINES AE41F.                                          
             03 AE41A    PICTURE X.                                             
           02  AE41I  PIC X(7).                                                 
           02  TX161L    COMP  PIC  S9(4).                                      
           02  TX161F    PICTURE X.                                             
           02  FILLER REDEFINES TX161F.                                         
             03 TX161A    PICTURE X.                                            
           02  TX161I  PIC X(12).                                               
           02  ST161L    COMP  PIC  S9(4).                                      
           02  ST161F    PICTURE X.                                             
           02  FILLER REDEFINES ST161F.                                         
             03 ST161A    PICTURE X.                                            
           02  ST161I  PIC X(6).                                                
           02  SB161L    COMP  PIC  S9(4).                                      
           02  SB161F    PICTURE X.                                             
           02  FILLER REDEFINES SB161F.                                         
             03 SB161A    PICTURE X.                                            
           02  SB161I  PIC X(9).                                                
           02  AE161L    COMP  PIC  S9(4).                                      
           02  AE161F    PICTURE X.                                             
           02  FILLER REDEFINES AE161F.                                         
             03 AE161A    PICTURE X.                                            
           02  AE161I  PIC X(7).                                                
           02  ST51L    COMP  PIC  S9(4).                                       
           02  ST51F    PICTURE X.                                              
           02  FILLER REDEFINES ST51F.                                          
             03 ST51A    PICTURE X.                                             
           02  ST51I  PIC X(6).                                                 
           02  SB51L    COMP  PIC  S9(4).                                       
           02  SB51F    PICTURE X.                                              
           02  FILLER REDEFINES SB51F.                                          
             03 SB51A    PICTURE X.                                             
           02  SB51I  PIC X(9).                                                 
           02  AE51L    COMP  PIC  S9(4).                                       
           02  AE51F    PICTURE X.                                              
           02  FILLER REDEFINES AE51F.                                          
             03 AE51A    PICTURE X.                                             
           02  AE51I  PIC X(7).                                                 
           02  TX171L    COMP  PIC  S9(4).                                      
           02  TX171F    PICTURE X.                                             
           02  FILLER REDEFINES TX171F.                                         
             03 TX171A    PICTURE X.                                            
           02  TX171I  PIC X(12).                                               
           02  ST171L    COMP  PIC  S9(4).                                      
           02  ST171F    PICTURE X.                                             
           02  FILLER REDEFINES ST171F.                                         
             03 ST171A    PICTURE X.                                            
           02  ST171I  PIC X(6).                                                
           02  SB171L    COMP  PIC  S9(4).                                      
           02  SB171F    PICTURE X.                                             
           02  FILLER REDEFINES SB171F.                                         
             03 SB171A    PICTURE X.                                            
           02  SB171I  PIC X(9).                                                
           02  AE171L    COMP  PIC  S9(4).                                      
           02  AE171F    PICTURE X.                                             
           02  FILLER REDEFINES AE171F.                                         
             03 AE171A    PICTURE X.                                            
           02  AE171I  PIC X(7).                                                
           02  ST61L    COMP  PIC  S9(4).                                       
           02  ST61F    PICTURE X.                                              
           02  FILLER REDEFINES ST61F.                                          
             03 ST61A    PICTURE X.                                             
           02  ST61I  PIC X(6).                                                 
           02  SB61L    COMP  PIC  S9(4).                                       
           02  SB61F    PICTURE X.                                              
           02  FILLER REDEFINES SB61F.                                          
             03 SB61A    PICTURE X.                                             
           02  SB61I  PIC X(9).                                                 
           02  AE61L    COMP  PIC  S9(4).                                       
           02  AE61F    PICTURE X.                                              
           02  FILLER REDEFINES AE61F.                                          
             03 AE61A    PICTURE X.                                             
           02  AE61I  PIC X(7).                                                 
           02  TX131L    COMP  PIC  S9(4).                                      
           02  TX131F    PICTURE X.                                             
           02  FILLER REDEFINES TX131F.                                         
             03 TX131A    PICTURE X.                                            
           02  TX131I  PIC X(12).                                               
           02  ST131L    COMP  PIC  S9(4).                                      
           02  ST131F    PICTURE X.                                             
           02  FILLER REDEFINES ST131F.                                         
             03 ST131A    PICTURE X.                                            
           02  ST131I  PIC X(6).                                                
           02  SB131L    COMP  PIC  S9(4).                                      
           02  SB131F    PICTURE X.                                             
           02  FILLER REDEFINES SB131F.                                         
             03 SB131A    PICTURE X.                                            
           02  SB131I  PIC X(9).                                                
           02  AE131L    COMP  PIC  S9(4).                                      
           02  AE131F    PICTURE X.                                             
           02  FILLER REDEFINES AE131F.                                         
             03 AE131A    PICTURE X.                                            
           02  AE131I  PIC X(7).                                                
           02  ST71L    COMP  PIC  S9(4).                                       
           02  ST71F    PICTURE X.                                              
           02  FILLER REDEFINES ST71F.                                          
             03 ST71A    PICTURE X.                                             
           02  ST71I  PIC X(6).                                                 
           02  SB71L    COMP  PIC  S9(4).                                       
           02  SB71F    PICTURE X.                                              
           02  FILLER REDEFINES SB71F.                                          
             03 SB71A    PICTURE X.                                             
           02  SB71I  PIC X(9).                                                 
           02  AE71L    COMP  PIC  S9(4).                                       
           02  AE71F    PICTURE X.                                              
           02  FILLER REDEFINES AE71F.                                          
             03 AE71A    PICTURE X.                                             
           02  AE71I  PIC X(7).                                                 
           02  ST12L    COMP  PIC  S9(4).                                       
           02  ST12F    PICTURE X.                                              
           02  FILLER REDEFINES ST12F.                                          
             03 ST12A    PICTURE X.                                             
           02  ST12I  PIC X(6).                                                 
           02  SB12L    COMP  PIC  S9(4).                                       
           02  SB12F    PICTURE X.                                              
           02  FILLER REDEFINES SB12F.                                          
             03 SB12A    PICTURE X.                                             
           02  SB12I  PIC X(9).                                                 
           02  AE12L    COMP  PIC  S9(4).                                       
           02  AE12F    PICTURE X.                                              
           02  FILLER REDEFINES AE12F.                                          
             03 AE12A    PICTURE X.                                             
           02  AE12I  PIC X(7).                                                 
           02  ST81L    COMP  PIC  S9(4).                                       
           02  ST81F    PICTURE X.                                              
           02  FILLER REDEFINES ST81F.                                          
             03 ST81A    PICTURE X.                                             
           02  ST81I  PIC X(6).                                                 
           02  SB81L    COMP  PIC  S9(4).                                       
           02  SB81F    PICTURE X.                                              
           02  FILLER REDEFINES SB81F.                                          
             03 SB81A    PICTURE X.                                             
           02  SB81I  PIC X(9).                                                 
           02  AE81L    COMP  PIC  S9(4).                                       
           02  AE81F    PICTURE X.                                              
           02  FILLER REDEFINES AE81F.                                          
             03 AE81A    PICTURE X.                                             
           02  AE81I  PIC X(7).                                                 
           02  ST91L    COMP  PIC  S9(4).                                       
           02  ST91F    PICTURE X.                                              
           02  FILLER REDEFINES ST91F.                                          
             03 ST91A    PICTURE X.                                             
           02  ST91I  PIC X(6).                                                 
           02  SB91L    COMP  PIC  S9(4).                                       
           02  SB91F    PICTURE X.                                              
           02  FILLER REDEFINES SB91F.                                          
             03 SB91A    PICTURE X.                                             
           02  SB91I  PIC X(9).                                                 
           02  AE91L    COMP  PIC  S9(4).                                       
           02  AE91F    PICTURE X.                                              
           02  FILLER REDEFINES AE91F.                                          
             03 AE91A    PICTURE X.                                             
           02  AE91I  PIC X(7).                                                 
           02  TX132L    COMP  PIC  S9(4).                                      
           02  TX132F    PICTURE X.                                             
           02  FILLER REDEFINES TX132F.                                         
             03 TX132A    PICTURE X.                                            
           02  TX132I  PIC X(12).                                               
           02  ST132L    COMP  PIC  S9(4).                                      
           02  ST132F    PICTURE X.                                             
           02  FILLER REDEFINES ST132F.                                         
             03 ST132A    PICTURE X.                                            
           02  ST132I  PIC X(6).                                                
           02  SB132L    COMP  PIC  S9(4).                                      
           02  SB132F    PICTURE X.                                             
           02  FILLER REDEFINES SB132F.                                         
             03 SB132A    PICTURE X.                                            
           02  SB132I  PIC X(9).                                                
           02  AE132L    COMP  PIC  S9(4).                                      
           02  AE132F    PICTURE X.                                             
           02  FILLER REDEFINES AE132F.                                         
             03 AE132A    PICTURE X.                                            
           02  AE132I  PIC X(7).                                                
           02  ST103L    COMP  PIC  S9(4).                                      
           02  ST103F    PICTURE X.                                             
           02  FILLER REDEFINES ST103F.                                         
             03 ST103A    PICTURE X.                                            
           02  ST103I  PIC X(6).                                                
           02  SB103L    COMP  PIC  S9(4).                                      
           02  SB103F    PICTURE X.                                             
           02  FILLER REDEFINES SB103F.                                         
             03 SB103A    PICTURE X.                                            
           02  SB103I  PIC X(9).                                                
           02  AE103L    COMP  PIC  S9(4).                                      
           02  AE103F    PICTURE X.                                             
           02  FILLER REDEFINES AE103F.                                         
             03 AE103A    PICTURE X.                                            
           02  AE103I  PIC X(7).                                                
           02  TX122L    COMP  PIC  S9(4).                                      
           02  TX122F    PICTURE X.                                             
           02  FILLER REDEFINES TX122F.                                         
             03 TX122A    PICTURE X.                                            
           02  TX122I  PIC X(12).                                               
           02  ST122L    COMP  PIC  S9(4).                                      
           02  ST122F    PICTURE X.                                             
           02  FILLER REDEFINES ST122F.                                         
             03 ST122A    PICTURE X.                                            
           02  ST122I  PIC X(6).                                                
           02  SB122L    COMP  PIC  S9(4).                                      
           02  SB122F    PICTURE X.                                             
           02  FILLER REDEFINES SB122F.                                         
             03 SB122A    PICTURE X.                                            
           02  SB122I  PIC X(9).                                                
           02  AE122L    COMP  PIC  S9(4).                                      
           02  AE122F    PICTURE X.                                             
           02  FILLER REDEFINES AE122F.                                         
             03 AE122A    PICTURE X.                                            
           02  AE122I  PIC X(7).                                                
           02  ST105L    COMP  PIC  S9(4).                                      
           02  ST105F    PICTURE X.                                             
           02  FILLER REDEFINES ST105F.                                         
             03 ST105A    PICTURE X.                                            
           02  ST105I  PIC X(6).                                                
           02  SB105L    COMP  PIC  S9(4).                                      
           02  SB105F    PICTURE X.                                             
           02  FILLER REDEFINES SB105F.                                         
             03 SB105A    PICTURE X.                                            
           02  SB105I  PIC X(9).                                                
           02  AE105L    COMP  PIC  S9(4).                                      
           02  AE105F    PICTURE X.                                             
           02  FILLER REDEFINES AE105F.                                         
             03 AE105A    PICTURE X.                                            
           02  AE105I  PIC X(7).                                                
           02  ST262L    COMP  PIC  S9(4).                                      
           02  ST262F    PICTURE X.                                             
           02  FILLER REDEFINES ST262F.                                         
             03 ST262A    PICTURE X.                                            
           02  ST262I  PIC X(6).                                                
           02  SB262L    COMP  PIC  S9(4).                                      
           02  SB262F    PICTURE X.                                             
           02  FILLER REDEFINES SB262F.                                         
             03 SB262A    PICTURE X.                                            
           02  SB262I  PIC X(9).                                                
           02  AE262L    COMP  PIC  S9(4).                                      
           02  AE262F    PICTURE X.                                             
           02  FILLER REDEFINES AE262F.                                         
             03 AE262A    PICTURE X.                                            
           02  AE262I  PIC X(7).                                                
           02  ST22L    COMP  PIC  S9(4).                                       
           02  ST22F    PICTURE X.                                              
           02  FILLER REDEFINES ST22F.                                          
             03 ST22A    PICTURE X.                                             
           02  ST22I  PIC X(6).                                                 
           02  SB22L    COMP  PIC  S9(4).                                       
           02  SB22F    PICTURE X.                                              
           02  FILLER REDEFINES SB22F.                                          
             03 SB22A    PICTURE X.                                             
           02  SB22I  PIC X(9).                                                 
           02  AE22L    COMP  PIC  S9(4).                                       
           02  AE22F    PICTURE X.                                              
           02  FILLER REDEFINES AE22F.                                          
             03 AE22A    PICTURE X.                                             
           02  AE22I  PIC X(7).                                                 
           02  ST261L    COMP  PIC  S9(4).                                      
           02  ST261F    PICTURE X.                                             
           02  FILLER REDEFINES ST261F.                                         
             03 ST261A    PICTURE X.                                            
           02  ST261I  PIC X(6).                                                
           02  SB261L    COMP  PIC  S9(4).                                      
           02  SB261F    PICTURE X.                                             
           02  FILLER REDEFINES SB261F.                                         
             03 SB261A    PICTURE X.                                            
           02  SB261I  PIC X(9).                                                
           02  AE261L    COMP  PIC  S9(4).                                      
           02  AE261F    PICTURE X.                                             
           02  FILLER REDEFINES AE261F.                                         
             03 AE261A    PICTURE X.                                            
           02  AE261I  PIC X(7).                                                
           02  TX42L    COMP  PIC  S9(4).                                       
           02  TX42F    PICTURE X.                                              
           02  FILLER REDEFINES TX42F.                                          
             03 TX42A    PICTURE X.                                             
           02  TX42I  PIC X(12).                                                
           02  ST42L    COMP  PIC  S9(4).                                       
           02  ST42F    PICTURE X.                                              
           02  FILLER REDEFINES ST42F.                                          
             03 ST42A    PICTURE X.                                             
           02  ST42I  PIC X(6).                                                 
           02  SB42L    COMP  PIC  S9(4).                                       
           02  SB42F    PICTURE X.                                              
           02  FILLER REDEFINES SB42F.                                          
             03 SB42A    PICTURE X.                                             
           02  SB42I  PIC X(9).                                                 
           02  AE42L    COMP  PIC  S9(4).                                       
           02  AE42F    PICTURE X.                                              
           02  FILLER REDEFINES AE42F.                                          
             03 AE42A    PICTURE X.                                             
           02  AE42I  PIC X(7).                                                 
           02  ST162L    COMP  PIC  S9(4).                                      
           02  ST162F    PICTURE X.                                             
           02  FILLER REDEFINES ST162F.                                         
             03 ST162A    PICTURE X.                                            
           02  ST162I  PIC X(6).                                                
           02  SB162L    COMP  PIC  S9(4).                                      
           02  SB162F    PICTURE X.                                             
           02  FILLER REDEFINES SB162F.                                         
             03 SB162A    PICTURE X.                                            
           02  SB162I  PIC X(9).                                                
           02  AE162L    COMP  PIC  S9(4).                                      
           02  AE162F    PICTURE X.                                             
           02  FILLER REDEFINES AE162F.                                         
             03 AE162A    PICTURE X.                                            
           02  AE162I  PIC X(7).                                                
           02  TX142L    COMP  PIC  S9(4).                                      
           02  TX142F    PICTURE X.                                             
           02  FILLER REDEFINES TX142F.                                         
             03 TX142A    PICTURE X.                                            
           02  TX142I  PIC X(12).                                               
           02  ST142L    COMP  PIC  S9(4).                                      
           02  ST142F    PICTURE X.                                             
           02  FILLER REDEFINES ST142F.                                         
             03 ST142A    PICTURE X.                                            
           02  ST142I  PIC X(6).                                                
           02  SB142L    COMP  PIC  S9(4).                                      
           02  SB142F    PICTURE X.                                             
           02  FILLER REDEFINES SB142F.                                         
             03 SB142A    PICTURE X.                                            
           02  SB142I  PIC X(9).                                                
           02  AE142L    COMP  PIC  S9(4).                                      
           02  AE142F    PICTURE X.                                             
           02  FILLER REDEFINES AE142F.                                         
             03 AE142A    PICTURE X.                                            
           02  AE142I  PIC X(7).                                                
           02  ST182L    COMP  PIC  S9(4).                                      
           02  ST182F    PICTURE X.                                             
           02  FILLER REDEFINES ST182F.                                         
             03 ST182A    PICTURE X.                                            
           02  ST182I  PIC X(6).                                                
           02  SB182L    COMP  PIC  S9(4).                                      
           02  SB182F    PICTURE X.                                             
           02  FILLER REDEFINES SB182F.                                         
             03 SB182A    PICTURE X.                                            
           02  SB182I  PIC X(9).                                                
           02  AE182L    COMP  PIC  S9(4).                                      
           02  AE182F    PICTURE X.                                             
           02  FILLER REDEFINES AE182F.                                         
             03 AE182A    PICTURE X.                                            
           02  AE182I  PIC X(7).                                                
           02  TX62L    COMP  PIC  S9(4).                                       
           02  TX62F    PICTURE X.                                              
           02  FILLER REDEFINES TX62F.                                          
             03 TX62A    PICTURE X.                                             
           02  TX62I  PIC X(12).                                                
           02  ST62L    COMP  PIC  S9(4).                                       
           02  ST62F    PICTURE X.                                              
           02  FILLER REDEFINES ST62F.                                          
             03 ST62A    PICTURE X.                                             
           02  ST62I  PIC X(6).                                                 
           02  SB62L    COMP  PIC  S9(4).                                       
           02  SB62F    PICTURE X.                                              
           02  FILLER REDEFINES SB62F.                                          
             03 SB62A    PICTURE X.                                             
           02  SB62I  PIC X(9).                                                 
           02  AE62L    COMP  PIC  S9(4).                                       
           02  AE62F    PICTURE X.                                              
           02  FILLER REDEFINES AE62F.                                          
             03 AE62A    PICTURE X.                                             
           02  AE62I  PIC X(7).                                                 
           02  ST231L    COMP  PIC  S9(4).                                      
           02  ST231F    PICTURE X.                                             
           02  FILLER REDEFINES ST231F.                                         
             03 ST231A    PICTURE X.                                            
           02  ST231I  PIC X(6).                                                
           02  SB231L    COMP  PIC  S9(4).                                      
           02  SB231F    PICTURE X.                                             
           02  FILLER REDEFINES SB231F.                                         
             03 SB231A    PICTURE X.                                            
           02  SB231I  PIC X(9).                                                
           02  AE231L    COMP  PIC  S9(4).                                      
           02  AE231F    PICTURE X.                                             
           02  FILLER REDEFINES AE231F.                                         
             03 AE231A    PICTURE X.                                            
           02  AE231I  PIC X(7).                                                
           02  TX104L    COMP  PIC  S9(4).                                      
           02  TX104F    PICTURE X.                                             
           02  FILLER REDEFINES TX104F.                                         
             03 TX104A    PICTURE X.                                            
           02  TX104I  PIC X(12).                                               
           02  ST104L    COMP  PIC  S9(4).                                      
           02  ST104F    PICTURE X.                                             
           02  FILLER REDEFINES ST104F.                                         
             03 ST104A    PICTURE X.                                            
           02  ST104I  PIC X(6).                                                
           02  SB104L    COMP  PIC  S9(4).                                      
           02  SB104F    PICTURE X.                                             
           02  FILLER REDEFINES SB104F.                                         
             03 SB104A    PICTURE X.                                            
           02  SB104I  PIC X(9).                                                
           02  AE104L    COMP  PIC  S9(4).                                      
           02  AE104F    PICTURE X.                                             
           02  FILLER REDEFINES AE104F.                                         
             03 AE104A    PICTURE X.                                            
           02  AE104I  PIC X(7).                                                
           02  ST241L    COMP  PIC  S9(4).                                      
           02  ST241F    PICTURE X.                                             
           02  FILLER REDEFINES ST241F.                                         
             03 ST241A    PICTURE X.                                            
           02  ST241I  PIC X(6).                                                
           02  SB241L    COMP  PIC  S9(4).                                      
           02  SB241F    PICTURE X.                                             
           02  FILLER REDEFINES SB241F.                                         
             03 SB241A    PICTURE X.                                            
           02  SB241I  PIC X(9).                                                
           02  AE241L    COMP  PIC  S9(4).                                      
           02  AE241F    PICTURE X.                                             
           02  FILLER REDEFINES AE241F.                                         
             03 AE241A    PICTURE X.                                            
           02  AE241I  PIC X(7).                                                
           02  TX106L    COMP  PIC  S9(4).                                      
           02  TX106F    PICTURE X.                                             
           02  FILLER REDEFINES TX106F.                                         
             03 TX106A    PICTURE X.                                            
           02  TX106I  PIC X(12).                                               
           02  ST106L    COMP  PIC  S9(4).                                      
           02  ST106F    PICTURE X.                                             
           02  FILLER REDEFINES ST106F.                                         
             03 ST106A    PICTURE X.                                            
           02  ST106I  PIC X(6).                                                
           02  SB106L    COMP  PIC  S9(4).                                      
           02  SB106F    PICTURE X.                                             
           02  FILLER REDEFINES SB106F.                                         
             03 SB106A    PICTURE X.                                            
           02  SB106I  PIC X(9).                                                
           02  AE106L    COMP  PIC  S9(4).                                      
           02  AE106F    PICTURE X.                                             
           02  FILLER REDEFINES AE106F.                                         
             03 AE106A    PICTURE X.                                            
           02  AE106I  PIC X(7).                                                
           02  ST222L    COMP  PIC  S9(4).                                      
           02  ST222F    PICTURE X.                                             
           02  FILLER REDEFINES ST222F.                                         
             03 ST222A    PICTURE X.                                            
           02  ST222I  PIC X(6).                                                
           02  SB222L    COMP  PIC  S9(4).                                      
           02  SB222F    PICTURE X.                                             
           02  FILLER REDEFINES SB222F.                                         
             03 SB222A    PICTURE X.                                            
           02  SB222I  PIC X(9).                                                
           02  AE222L    COMP  PIC  S9(4).                                      
           02  AE222F    PICTURE X.                                             
           02  FILLER REDEFINES AE222F.                                         
             03 AE222A    PICTURE X.                                            
           02  AE222I  PIC X(7).                                                
           02  TX112L    COMP  PIC  S9(4).                                      
           02  TX112F    PICTURE X.                                             
           02  FILLER REDEFINES TX112F.                                         
             03 TX112A    PICTURE X.                                            
           02  TX112I  PIC X(12).                                               
           02  ST112L    COMP  PIC  S9(4).                                      
           02  ST112F    PICTURE X.                                             
           02  FILLER REDEFINES ST112F.                                         
             03 ST112A    PICTURE X.                                            
           02  ST112I  PIC X(6).                                                
           02  SB112L    COMP  PIC  S9(4).                                      
           02  SB112F    PICTURE X.                                             
           02  FILLER REDEFINES SB112F.                                         
             03 SB112A    PICTURE X.                                            
           02  SB112I  PIC X(9).                                                
           02  AE112L    COMP  PIC  S9(4).                                      
           02  AE112F    PICTURE X.                                             
           02  FILLER REDEFINES AE112F.                                         
             03 AE112A    PICTURE X.                                            
           02  AE112I  PIC X(7).                                                
           02  ST192L    COMP  PIC  S9(4).                                      
           02  ST192F    PICTURE X.                                             
           02  FILLER REDEFINES ST192F.                                         
             03 ST192A    PICTURE X.                                            
           02  ST192I  PIC X(6).                                                
           02  AE192L    COMP  PIC  S9(4).                                      
           02  AE192F    PICTURE X.                                             
           02  FILLER REDEFINES AE192F.                                         
             03 AE192A    PICTURE X.                                            
           02  AE192I  PIC X(7).                                                
           02  VBDNRL    COMP  PIC  S9(4).                                      
           02  VBDNRF    PICTURE X.                                             
           02  FILLER REDEFINES VBDNRF.                                         
             03 VBDNRA    PICTURE X.                                            
           02  VBDNRI  PIC X(7).                                                
           02  DATML    COMP  PIC  S9(4).                                       
           02  DATMF    PICTURE X.                                              
           02  FILLER REDEFINES DATMF.                                          
             03 DATMA    PICTURE X.                                             
           02  DATMI  PIC X(4).                                                 
           02  TRANSL    COMP  PIC  S9(4).                                      
           02  TRANSF    PICTURE X.                                             
           02  FILLER REDEFINES TRANSF.                                         
             03 TRANSA    PICTURE X.                                            
           02  TRANSI  PIC X(4).                                                
           02  TEXT1L    COMP  PIC  S9(4).                                      
           02  TEXT1F    PICTURE X.                                             
           02  FILLER REDEFINES TEXT1F.                                         
             03 TEXT1A    PICTURE X.                                            
           02  TEXT1I  PIC X(79).                                               
       01  UU960O REDEFINES UU960I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATEO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZEITO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UEBTEXAO  PIC X(58).                                             
           02  FILLER PICTURE X(3).                                             
           02  UEBTEXBO  PIC X(58).                                             
           02  FILLER PICTURE X(3).                                             
           02  ST11O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB11O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE11O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST121O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB121O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE121O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST21O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB21O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE21O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST141O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB141O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE141O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST31O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB31O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE31O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST151O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB151O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE151O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST41O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB41O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE41O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TX161O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST161O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB161O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE161O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST51O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB51O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE51O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TX171O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST171O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB171O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE171O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST61O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB61O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE61O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TX131O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST131O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB131O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE131O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST71O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB71O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE71O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST12O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB12O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE12O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST81O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB81O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE81O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST91O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB91O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE91O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TX132O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST132O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB132O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE132O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST103O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB103O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE103O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX122O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST122O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB122O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE122O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST105O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB105O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE105O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST262O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB262O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE262O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST22O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB22O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE22O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST261O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB261O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE261O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX42O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST42O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB42O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE42O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST162O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB162O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE162O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX142O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST142O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB142O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE142O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST182O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB182O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE182O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX62O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST62O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  SB62O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AE62O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ST231O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB231O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE231O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX104O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST104O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB104O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE104O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST241O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB241O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE241O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX106O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST106O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB106O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE106O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST222O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB222O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE222O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TX112O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ST112O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  SB112O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE112O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ST192O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE192O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBDNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATMO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TRANSO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEXT1O  PIC X(79).                                               
