       01  UU970I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS5L    COMP  PIC  S9(4).                                      
           02  PERS5F    PICTURE X.                                             
           02  FILLER REDEFINES PERS5F.                                         
             03 PERS5A    PICTURE X.                                            
           02  PERS5I  PIC X(7).                                                
           02  DATUM5L    COMP  PIC  S9(4).                                     
           02  DATUM5F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM5F.                                        
             03 DATUM5A    PICTURE X.                                           
           02  DATUM5I  PIC X(8).                                               
           02  UHR5L    COMP  PIC  S9(4).                                       
           02  UHR5F    PICTURE X.                                              
           02  FILLER REDEFINES UHR5F.                                          
             03 UHR5A    PICTURE X.                                             
           02  UHR5I  PIC X(5).                                                 
           02  VBNR5L    COMP  PIC  S9(4).                                      
           02  VBNR5F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR5F.                                         
             03 VBNR5A    PICTURE X.                                            
           02  VBNR5I  PIC X(7).                                                
           02  TVNR5L    COMP  PIC  S9(4).                                      
           02  TVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES TVNR5F.                                         
             03 TVNR5A    PICTURE X.                                            
           02  TVNR5I  PIC X(10).                                               
           02  VNR5L    COMP  PIC  S9(4).                                       
           02  VNR5F    PICTURE X.                                              
           02  FILLER REDEFINES VNR5F.                                          
             03 VNR5A    PICTURE X.                                             
           02  VNR5I  PIC X(8).                                                 
           02  TAN5L    COMP  PIC  S9(4).                                       
           02  TAN5F    PICTURE X.                                              
           02  FILLER REDEFINES TAN5F.                                          
             03 TAN5A    PICTURE X.                                             
           02  TAN5I  PIC X(6).                                                 
           02  ANREDE5L    COMP  PIC  S9(4).                                    
           02  ANREDE5F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE5F.                                       
             03 ANREDE5A    PICTURE X.                                          
           02  ANREDE5I  PIC X(9).                                              
           02  TZU5L    COMP  PIC  S9(4).                                       
           02  TZU5F    PICTURE X.                                              
           02  FILLER REDEFINES TZU5F.                                          
             03 TZU5A    PICTURE X.                                             
           02  TZU5I  PIC X(6).                                                 
           02  ZNAME5L    COMP  PIC  S9(4).                                     
           02  ZNAME5F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME5F.                                        
             03 ZNAME5A    PICTURE X.                                           
           02  ZNAME5I  PIC X(20).                                              
           02  TVOR5L    COMP  PIC  S9(4).                                      
           02  TVOR5F    PICTURE X.                                             
           02  FILLER REDEFINES TVOR5F.                                         
             03 TVOR5A    PICTURE X.                                            
           02  TVOR5I  PIC X(7).                                                
           02  VNAME5L    COMP  PIC  S9(4).                                     
           02  VNAME5F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME5F.                                        
             03 VNAME5A    PICTURE X.                                           
           02  VNAME5I  PIC X(20).                                              
           02  TSTR5L    COMP  PIC  S9(4).                                      
           02  TSTR5F    PICTURE X.                                             
           02  FILLER REDEFINES TSTR5F.                                         
             03 TSTR5A    PICTURE X.                                            
           02  TSTR5I  PIC X(7).                                                
           02  STR5L    COMP  PIC  S9(4).                                       
           02  STR5F    PICTURE X.                                              
           02  FILLER REDEFINES STR5F.                                          
             03 STR5A    PICTURE X.                                             
           02  STR5I  PIC X(20).                                                
           02  TPLZ5L    COMP  PIC  S9(4).                                      
           02  TPLZ5F    PICTURE X.                                             
           02  FILLER REDEFINES TPLZ5F.                                         
             03 TPLZ5A    PICTURE X.                                            
           02  TPLZ5I  PIC X(3).                                                
           02  TORT5L    COMP  PIC  S9(4).                                      
           02  TORT5F    PICTURE X.                                             
           02  FILLER REDEFINES TORT5F.                                         
             03 TORT5A    PICTURE X.                                            
           02  TORT5I  PIC X(3).                                                
           02  TAUSL5L    COMP  PIC  S9(4).                                     
           02  TAUSL5F    PICTURE X.                                            
           02  FILLER REDEFINES TAUSL5F.                                        
             03 TAUSL5A    PICTURE X.                                           
           02  TAUSL5I  PIC X(4).                                               
           02  PLZ5L    COMP  PIC  S9(4).                                       
           02  PLZ5F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ5F.                                          
             03 PLZ5A    PICTURE X.                                             
           02  PLZ5I  PIC X(5).                                                 
           02  ORT5L    COMP  PIC  S9(4).                                       
           02  ORT5F    PICTURE X.                                              
           02  FILLER REDEFINES ORT5F.                                          
             03 ORT5A    PICTURE X.                                             
           02  ORT5I  PIC X(20).                                                
           02  AUSL5L    COMP  PIC  S9(4).                                      
           02  AUSL5F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL5F.                                         
             03 AUSL5A    PICTURE X.                                            
           02  AUSL5I  PIC X(3).                                                
           02  TART5L    COMP  PIC  S9(4).                                      
           02  TART5F    PICTURE X.                                             
           02  FILLER REDEFINES TART5F.                                         
             03 TART5A    PICTURE X.                                            
           02  TART5I  PIC X(10).                                               
           02  ANART5L    COMP  PIC  S9(4).                                     
           02  ANART5F    PICTURE X.                                            
           02  FILLER REDEFINES ANART5F.                                        
             03 ANART5A    PICTURE X.                                           
           02  ANART5I  PIC X(1).                                               
           02  TAND5L    COMP  PIC  S9(4).                                      
           02  TAND5F    PICTURE X.                                             
           02  FILLER REDEFINES TAND5F.                                         
             03 TAND5A    PICTURE X.                                            
           02  TAND5I  PIC X(6).                                                
           02  ANDAT5L    COMP  PIC  S9(4).                                     
           02  ANDAT5F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT5F.                                        
             03 ANDAT5A    PICTURE X.                                           
           02  ANDAT5I  PIC X(6).                                               
           02  TERD5L    COMP  PIC  S9(4).                                      
           02  TERD5F    PICTURE X.                                             
           02  FILLER REDEFINES TERD5F.                                         
             03 TERD5A    PICTURE X.                                            
           02  TERD5I  PIC X(10).                                               
           02  ERFDAT5L    COMP  PIC  S9(4).                                    
           02  ERFDAT5F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT5F.                                       
             03 ERFDAT5A    PICTURE X.                                          
           02  ERFDAT5I  PIC X(6).                                              
           02  TSTAT5L    COMP  PIC  S9(4).                                     
           02  TSTAT5F    PICTURE X.                                            
           02  FILLER REDEFINES TSTAT5F.                                        
             03 TSTAT5A    PICTURE X.                                           
           02  TSTAT5I  PIC X(7).                                               
           02  STATUS5L    COMP  PIC  S9(4).                                    
           02  STATUS5F    PICTURE X.                                           
           02  FILLER REDEFINES STATUS5F.                                       
             03 STATUS5A    PICTURE X.                                          
           02  STATUS5I  PIC X(2).                                              
           02  TEING5L    COMP  PIC  S9(4).                                     
           02  TEING5F    PICTURE X.                                            
           02  FILLER REDEFINES TEING5F.                                        
             03 TEING5A    PICTURE X.                                           
           02  TEING5I  PIC X(46).                                              
           02  EING5L    COMP  PIC  S9(4).                                      
           02  EING5F    PICTURE X.                                             
           02  FILLER REDEFINES EING5F.                                         
             03 EING5A    PICTURE X.                                            
           02  EING5I  PIC X(1).                                                
           02  FEHLER5L    COMP  PIC  S9(4).                                    
           02  FEHLER5F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER5F.                                       
             03 FEHLER5A    PICTURE X.                                          
           02  FEHLER5I  PIC X(78).                                             
       01  UU970O REDEFINES UU970I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM5O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR5O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVNR5O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR5O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAN5O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANREDE5O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZU5O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZNAME5O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVOR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNAME5O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  STR5O  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPLZ5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TORT5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAUSL5O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ5O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT5O  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TART5O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANART5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAND5O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANDAT5O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TERD5O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT5O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTAT5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  STATUS5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEING5O  PIC X(46).                                              
           02  FILLER PICTURE X(3).                                             
           02  EING5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FEHLER5O  PIC X(78).                                             
