       01  UU973I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR73L    COMP  PIC  S9(4).                                      
           02  PNR73F    PICTURE X.                                             
           02  FILLER REDEFINES PNR73F.                                         
             03 PNR73A    PICTURE X.                                            
           02  PNR73I  PIC X(7).                                                
           02  DATUM73L    COMP  PIC  S9(4).                                    
           02  DATUM73F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM73F.                                       
             03 DATUM73A    PICTURE X.                                          
           02  DATUM73I  PIC X(8).                                              
           02  UHR73L    COMP  PIC  S9(4).                                      
           02  UHR73F    PICTURE X.                                             
           02  FILLER REDEFINES UHR73F.                                         
             03 UHR73A    PICTURE X.                                            
           02  UHR73I  PIC X(5).                                                
           02  GES73L    COMP  PIC  S9(4).                                      
           02  GES73F    PICTURE X.                                             
           02  FILLER REDEFINES GES73F.                                         
             03 GES73A    PICTURE X.                                            
           02  GES73I  PIC X(2).                                                
           02  KENU73L    COMP  PIC  S9(4).                                     
           02  KENU73F    PICTURE X.                                            
           02  FILLER REDEFINES KENU73F.                                        
             03 KENU73A    PICTURE X.                                           
           02  KENU73I  PIC X(4).                                               
           02  VNR73L    COMP  PIC  S9(4).                                      
           02  VNR73F    PICTURE X.                                             
           02  FILLER REDEFINES VNR73F.                                         
             03 VNR73A    PICTURE X.                                            
           02  VNR73I  PIC X(15).                                               
           02  KENZ73L    COMP  PIC  S9(4).                                     
           02  KENZ73F    PICTURE X.                                            
           02  FILLER REDEFINES KENZ73F.                                        
             03 KENZ73A    PICTURE X.                                           
           02  KENZ73I  PIC X(4).                                               
           02  AUS173L    COMP  PIC  S9(4).                                     
           02  AUS173F    PICTURE X.                                            
           02  FILLER REDEFINES AUS173F.                                        
             03 AUS173A    PICTURE X.                                           
           02  AUS173I  PIC X(1).                                               
           02  ZEIL173L    COMP  PIC  S9(4).                                    
           02  ZEIL173F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL173F.                                       
             03 ZEIL173A    PICTURE X.                                          
           02  ZEIL173I  PIC X(71).                                             
           02  AUS273L    COMP  PIC  S9(4).                                     
           02  AUS273F    PICTURE X.                                            
           02  FILLER REDEFINES AUS273F.                                        
             03 AUS273A    PICTURE X.                                           
           02  AUS273I  PIC X(1).                                               
           02  ZEIL273L    COMP  PIC  S9(4).                                    
           02  ZEIL273F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL273F.                                       
             03 ZEIL273A    PICTURE X.                                          
           02  ZEIL273I  PIC X(71).                                             
           02  AUS373L    COMP  PIC  S9(4).                                     
           02  AUS373F    PICTURE X.                                            
           02  FILLER REDEFINES AUS373F.                                        
             03 AUS373A    PICTURE X.                                           
           02  AUS373I  PIC X(1).                                               
           02  ZEIL373L    COMP  PIC  S9(4).                                    
           02  ZEIL373F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL373F.                                       
             03 ZEIL373A    PICTURE X.                                          
           02  ZEIL373I  PIC X(71).                                             
           02  AUS473L    COMP  PIC  S9(4).                                     
           02  AUS473F    PICTURE X.                                            
           02  FILLER REDEFINES AUS473F.                                        
             03 AUS473A    PICTURE X.                                           
           02  AUS473I  PIC X(1).                                               
           02  ZEIL473L    COMP  PIC  S9(4).                                    
           02  ZEIL473F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL473F.                                       
             03 ZEIL473A    PICTURE X.                                          
           02  ZEIL473I  PIC X(71).                                             
           02  AUS573L    COMP  PIC  S9(4).                                     
           02  AUS573F    PICTURE X.                                            
           02  FILLER REDEFINES AUS573F.                                        
             03 AUS573A    PICTURE X.                                           
           02  AUS573I  PIC X(1).                                               
           02  ZEIL573L    COMP  PIC  S9(4).                                    
           02  ZEIL573F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL573F.                                       
             03 ZEIL573A    PICTURE X.                                          
           02  ZEIL573I  PIC X(71).                                             
           02  AUS673L    COMP  PIC  S9(4).                                     
           02  AUS673F    PICTURE X.                                            
           02  FILLER REDEFINES AUS673F.                                        
             03 AUS673A    PICTURE X.                                           
           02  AUS673I  PIC X(1).                                               
           02  ZEIL673L    COMP  PIC  S9(4).                                    
           02  ZEIL673F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL673F.                                       
             03 ZEIL673A    PICTURE X.                                          
           02  ZEIL673I  PIC X(71).                                             
           02  AUS773L    COMP  PIC  S9(4).                                     
           02  AUS773F    PICTURE X.                                            
           02  FILLER REDEFINES AUS773F.                                        
             03 AUS773A    PICTURE X.                                           
           02  AUS773I  PIC X(1).                                               
           02  ZEIL773L    COMP  PIC  S9(4).                                    
           02  ZEIL773F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL773F.                                       
             03 ZEIL773A    PICTURE X.                                          
           02  ZEIL773I  PIC X(71).                                             
           02  AUS873L    COMP  PIC  S9(4).                                     
           02  AUS873F    PICTURE X.                                            
           02  FILLER REDEFINES AUS873F.                                        
             03 AUS873A    PICTURE X.                                           
           02  AUS873I  PIC X(1).                                               
           02  ZEIL873L    COMP  PIC  S9(4).                                    
           02  ZEIL873F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL873F.                                       
             03 ZEIL873A    PICTURE X.                                          
           02  ZEIL873I  PIC X(71).                                             
           02  AUS973L    COMP  PIC  S9(4).                                     
           02  AUS973F    PICTURE X.                                            
           02  FILLER REDEFINES AUS973F.                                        
             03 AUS973A    PICTURE X.                                           
           02  AUS973I  PIC X(1).                                               
           02  ZEIL973L    COMP  PIC  S9(4).                                    
           02  ZEIL973F    PICTURE X.                                           
           02  FILLER REDEFINES ZEIL973F.                                       
             03 ZEIL973A    PICTURE X.                                          
           02  ZEIL973I  PIC X(71).                                             
           02  AUSA73L    COMP  PIC  S9(4).                                     
           02  AUSA73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSA73F.                                        
             03 AUSA73A    PICTURE X.                                           
           02  AUSA73I  PIC X(1).                                               
           02  ZEILA73L    COMP  PIC  S9(4).                                    
           02  ZEILA73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILA73F.                                       
             03 ZEILA73A    PICTURE X.                                          
           02  ZEILA73I  PIC X(71).                                             
           02  AUSB73L    COMP  PIC  S9(4).                                     
           02  AUSB73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSB73F.                                        
             03 AUSB73A    PICTURE X.                                           
           02  AUSB73I  PIC X(1).                                               
           02  ZEILB73L    COMP  PIC  S9(4).                                    
           02  ZEILB73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILB73F.                                       
             03 ZEILB73A    PICTURE X.                                          
           02  ZEILB73I  PIC X(71).                                             
           02  AUSC73L    COMP  PIC  S9(4).                                     
           02  AUSC73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSC73F.                                        
             03 AUSC73A    PICTURE X.                                           
           02  AUSC73I  PIC X(1).                                               
           02  ZEILC73L    COMP  PIC  S9(4).                                    
           02  ZEILC73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILC73F.                                       
             03 ZEILC73A    PICTURE X.                                          
           02  ZEILC73I  PIC X(71).                                             
           02  AUSD73L    COMP  PIC  S9(4).                                     
           02  AUSD73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSD73F.                                        
             03 AUSD73A    PICTURE X.                                           
           02  AUSD73I  PIC X(1).                                               
           02  ZEILD73L    COMP  PIC  S9(4).                                    
           02  ZEILD73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILD73F.                                       
             03 ZEILD73A    PICTURE X.                                          
           02  ZEILD73I  PIC X(71).                                             
           02  AUSE73L    COMP  PIC  S9(4).                                     
           02  AUSE73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSE73F.                                        
             03 AUSE73A    PICTURE X.                                           
           02  AUSE73I  PIC X(1).                                               
           02  ZEILE73L    COMP  PIC  S9(4).                                    
           02  ZEILE73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILE73F.                                       
             03 ZEILE73A    PICTURE X.                                          
           02  ZEILE73I  PIC X(71).                                             
           02  AUSF73L    COMP  PIC  S9(4).                                     
           02  AUSF73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSF73F.                                        
             03 AUSF73A    PICTURE X.                                           
           02  AUSF73I  PIC X(1).                                               
           02  ZEILF73L    COMP  PIC  S9(4).                                    
           02  ZEILF73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILF73F.                                       
             03 ZEILF73A    PICTURE X.                                          
           02  ZEILF73I  PIC X(71).                                             
           02  AUSG73L    COMP  PIC  S9(4).                                     
           02  AUSG73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSG73F.                                        
             03 AUSG73A    PICTURE X.                                           
           02  AUSG73I  PIC X(1).                                               
           02  ZEILG73L    COMP  PIC  S9(4).                                    
           02  ZEILG73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILG73F.                                       
             03 ZEILG73A    PICTURE X.                                          
           02  ZEILG73I  PIC X(71).                                             
           02  AUSH73L    COMP  PIC  S9(4).                                     
           02  AUSH73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSH73F.                                        
             03 AUSH73A    PICTURE X.                                           
           02  AUSH73I  PIC X(1).                                               
           02  ZEILH73L    COMP  PIC  S9(4).                                    
           02  ZEILH73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILH73F.                                       
             03 ZEILH73A    PICTURE X.                                          
           02  ZEILH73I  PIC X(71).                                             
           02  AUSI73L    COMP  PIC  S9(4).                                     
           02  AUSI73F    PICTURE X.                                            
           02  FILLER REDEFINES AUSI73F.                                        
             03 AUSI73A    PICTURE X.                                           
           02  AUSI73I  PIC X(1).                                               
           02  ZEILI73L    COMP  PIC  S9(4).                                    
           02  ZEILI73F    PICTURE X.                                           
           02  FILLER REDEFINES ZEILI73F.                                       
             03 ZEILI73A    PICTURE X.                                          
           02  ZEILI73I  PIC X(71).                                             
           02  FEHL73L    COMP  PIC  S9(4).                                     
           02  FEHL73F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL73F.                                        
             03 FEHL73A    PICTURE X.                                           
           02  FEHL73I  PIC X(78).                                              
       01  UU973O REDEFINES UU973I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR73O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM73O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR73O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  GES73O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  KENU73O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR73O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  KENZ73O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUS173O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL173O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS273O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL273O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS373O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL373O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS473O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL473O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS573O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL573O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS673O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL673O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS773O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL773O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS873O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL873O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUS973O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEIL973O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSA73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILA73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSB73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILB73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSC73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILC73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSD73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILD73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSE73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILE73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSF73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILF73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSG73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILG73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSH73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILH73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUSI73O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZEILI73O  PIC X(71).                                             
           02  FILLER PICTURE X(3).                                             
           02  FEHL73O  PIC X(78).                                              
