       01  UU998I.                                                              
           02  FILLER PIC X(12).                                                
       01  UU998O REDEFINES UU998I.                                             
           02  FILLER PIC X(12).                                                
