       01  UU997I.                                                              
           02  FILLER PIC X(12).                                                
       01  UU997O REDEFINES UU997I.                                             
           02  FILLER PIC X(12).                                                
