      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   Wuki0829.CPY  $
      *    $Revision:   2.6  $
      *
      *    $Log:   L:/MF/CPY/Wuki0829.CPv  $
      *
      *   Rev 2.6   Jun 11 2003 17:07:48   t13ex27
      *AKI00351 - DB-Änderung für Fix 41
      *
      *   Rev 2.5   25 Jul 2001 10:33:54   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-ITEMBT.
           10 IBTID                       PIC X(13).
           10 IBTVBNR                     PIC S9(9) COMP.
           10 IBTPCVON                    PIC S9(9) COMP.
           10 IBTPCNACH                   PIC S9(9) COMP.
           10 TIMESTAMP                   PIC X(026).
           10 NIL-TIMESTAMP               PIC X(01).
      *****************************************************************
