      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  07.04.2009
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2009 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0439.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/WUKI0439.CPv  $
      *
      *   Rev 2.1   28 Apr 2009 11:07:02   t13ex27
      *AKI00812: DB-Änderung für Rel. 4.52
      *
      *   Rev 2.0   07 Apr 2009 16:42:12   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-TCKI0439.
           10 LVTLVART                    PIC  S9(4) COMP.
           10 LVTTARIF                    PIC  X(15).
           10 LVTPRODUKTID                PIC  S9(4) COMP.
           10 LVTSTVD0067_KTY             PIC  S9(4) COMP.
           10 NIL-LVTSTVD0067_KTY         PIC X(01).
           10 LVTSTVD0067_KNR             PIC  S9(15)V COMP-3.
           10 NIL-LVTSTVD0067_KNR         PIC X(01).
