      *****************************************************************         
        05  WU-WUKI0382.                                                        
           10 LPVVERTRAGSID                 PIC  X(0013).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 LPVPRODUKTID                  PIC S9(4) COMP.                     
           10 LPVSTVD0067-KTY               PIC S9(4) COMP.                     
           10 NIL-LPVSTVD0067-KTY           PIC  X(01).                         
           10 LPVSTVD0067-KNR               PIC S9(15)V COMP-3.                 
           10 NIL-LPVSTVD0067-KNR           PIC  X(01).                         
           10 LPVPRODKLAS-KTY               PIC S9(4) COMP.                     
           10 LPVPRODKLAS-KNR               PIC S9(15)V COMP-3.                 
           10 LPVGSMTTAR-BEZ                PIC  X(0025).                       
           10 LPVWERBEBEZ-KTY               PIC S9(4) COMP.                     
           10 LPVWERBEBEZ-KNR               PIC S9(15)V COMP-3.                 
           10 LPVRNTBEZUG-KZN               PIC  X(0001).                       
           10 NIL-LPVRNTBEZUG-KZN           PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 LPVBAV-KZN                    PIC  X(0001).                       
           10 LPVVZUST-D-KTY                PIC S9(4) COMP.                     
           10 LPVVZUST-D-KNR                PIC S9(4) COMP.                     
           10 LPVVZUST-D-DAT                PIC  X(010).                        
           10 NIL-LPVVZUST-D-DAT            PIC  X(01).                         
