      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  04.06.2003
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2003 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0084.CPY  $
      *    $Revision:   2.4  $
      *
      *    $Log:   L:/mf/CPY/WUKI0084.CPv  $
      *
      *   Rev 2.4   Nov 09 2015 17:05:04   t13ex78
      *AKI01382: CoC neue KÜ, Blacklist, Completefunktion ect. - St
      *andard-OZP für TCKI0084 
      *
      *   Rev 2.3   Nov 09 2015 16:50:52   t13ex78
      *AKI01382: CoC neue KÜ, Blacklist, Completefunktion ect. - St
      *andard-OZP für TCKI0084
      *
      *   Rev 2.2   Oct 28 2015 09:19:02   t13ex78
      *AKI01382: CoC neue KÜ, Blacklist, Completefunktion ect. - St
      *andard-OZP für TCKI0084
      *
      *   Rev 2.1   Jun 11 2003 13:08:14   t13ex27
      *AKI00351 - DB-Änderung für Fix 41
      *
      *   Rev 2.0   Jun 04 2003 16:59:14   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-KUEBLACKLIST.
           10 KUBPERSONENID                 PIC  X(0013).
           10 KUBVBID                       PIC  X(0013).
           10 KUBTICKETID                   PIC S9(18)V COMP-3.
           10 LETZTEAENDERUNG               PIC  X(0026).
 
 

