      *****************************************************************         
        05  WU-WUKI0550.                                                        
           10 G48-DKVERTRAGSNR              PIC  X(0015).                       
           10 G48-DKKONTOUNR                PIC  X(0002).                       
           10 G48-DKWAEHRUNG                PIC  X(0003).                       
           10 G48-DKKARTENNR                PIC  X(0013).                       
           10 G48-DKKARTENART               PIC  X(0003).                       
           10 G48-DKGUELTIGBIS              PIC  X(0004).                       
           10 G48-DKDELKZ                   PIC  X(0001).                       
           10 G48-DKINHNAME1                PIC  X(0027).                       
           10 G48-DKINHNAME2                PIC  X(0027).                       
           10 G48-DKNFCFAEHIG               PIC  X(0001).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 LETZTERAENDERER               PIC  X(0010).                       
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 G48-DKNFCSTATUS               PIC  X(0001).                       
