      *****************************************************************         
        05  WU-WUKI0443.                                                        
           10 KPEVERTRAGSID                 PIC  X(0013).                       
           10 KPEPERSONLFDNR                PIC S9(4) COMP.                     
           10 KPEPRODUKTID                  PIC S9(4) COMP.                     
           10 KPEANREDE-KTY                 PIC S9(4) COMP.                     
           10 KPEANREDE-KNR                 PIC S9(4) COMP.                     
           10 KPENACHNAME                   PIC  X(0030).                       
           10 NIL-KPENACHNAME               PIC  X(01).                         
           10 KPEVORNAME                    PIC  X(0030).                       
           10 NIL-KPEVORNAME                PIC  X(01).                         
           10 KPEGEBDATUM                   PIC  X(010).                        
           10 NIL-KPEGEBDATUM               PIC  X(01).                         
           10 KPEPERSONENID                 PIC  X(0013).                       
           10 NIL-KPEPERSONENID             PIC  X(01).                         
           10 KPEADRESSEID                  PIC  X(0013).                       
           10 NIL-KPEADRESSEID              PIC  X(01).                         
           10 KPEBEGINNDATUM                PIC  X(010).                        
           10 NIL-KPEBEGINNDATUM            PIC  X(01).                         
           10 KPEENDEDATUM                  PIC  X(010).                        
           10 NIL-KPEENDEDATUM              PIC  X(01).                         
           10 KPEPERSONENNUMMER             PIC S9(4) COMP.                     
           10 NIL-KPEPERSONENNUMMER         PIC  X(01).                         
           10 KPEGESCHSTID-KTY              PIC S9(4) COMP.                     
           10 KPEGESCHSTID-KNR              PIC S9(4) COMP.                     
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 NIL-LETZTEAENDERUNG           PIC  X(01).                         
           10 KPEVORVENDDATUM               PIC  X(010).                        
           10 NIL-KPEVORVENDDATUM           PIC  X(01).                         
           10 KPEVORVGES-KTY                PIC S9(4) COMP.                     
           10 NIL-KPEVORVGES-KTY            PIC  X(01).                         
           10 KPEVORVGES-KNR                PIC S9(15)V COMP-3.                 
           10 NIL-KPEVORVGES-KNR            PIC  X(01).                         
           10 KPEVORVKUENDKZ                PIC  X(0001).                       
           10 NIL-KPEVORVKUENDKZ            PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 KPEALTRUECKSTELLG             PIC S9(7)V9(2) COMP-3.              
           10 NIL-KPEALTRUECKSTELLG         PIC  X(01).                         
           10 KPEBEITRAGSVORTEIL            PIC S9(7)V9(2) COMP-3.              
           10 NIL-KPEBEITRAGSVORTEIL        PIC  X(01).                         
           10 KPESTAND                      PIC  X(010).                        
           10 NIL-KPESTAND                  PIC  X(01).                         
