      *****************************************************************         
        05  WU-WUKI0077.                                                        
           10 VERTRAGSID                    PIC  X(0013).                       
           10 KDULAUFENDENUMMER             PIC S9(4) COMP.                     
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 VBALTID                       PIC  X(0013).                       
           10 VBALTROLLENKZ                 PIC  X(0001).                       
           10 VBNEUID                       PIC  X(0013).                       
           10 VBNEUROLLENKZ                 PIC  X(0001).                       
           10 DTAERLEDIGTKZ                 PIC  X(0001).                       
           10 KDUEBERTRAGUNGSART            PIC  X(0001).                       
           10 KDUGUELTIGABDAT               PIC  X(010).                        
           10 KDUBEARBEITER                 PIC  X(0030).                       
           10 KDUEIGENVERMKZ                PIC  X(0001).                       
           10 KDUKKVLID                     PIC  X(0013).                       
           10 NIL-KDUKKVLID                 PIC  X(01).                         
           10 KDUTICKETID                   PIC S9(18)V COMP-3.                 
           10 NIL-KDUTICKETID               PIC  X(01).                         
           10 KDUWIDERSPRUCH                PIC  X(0001).                       
           10 NIL-KDUWIDERSPRUCH            PIC  X(01).                         
           10 KDUWARTEZEITKZ                PIC  X(0001).                       
           10 NIL-KDUWARTEZEITKZ            PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
