      *---------------------------------------------------------------* 
      *    Standard f?r alle Objekte unter PVCS                         
      *            Datum   :  November 1995                             
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT                    
      *---------------------------------------------------------------* 
      *                                                                 
      *---------------------------------------------------------------* 
      *    Copyright 1995 ATLAS Dienstleistungs GmbH                    
      *---------------------------------------------------------------* 
      *    $Workfile:   WUKI0032.CPY  $                                         

      *    $Revision:   2.1  $                                          
      *                                                                 
      *    $Log:   L:/mf/CPY/WUKI0032.CPv  $                            
      *
      *   Rev 2.1   Sep 29 2010 10:50:58   t13ex14
      *AKI00966: DVAG Österreich: DB-Objekte
      *                                                                 
      *   Rev 1.1   25 Mar 1998 18:24:10   P13SP13                      
      *Neuerstellung                                                    
      *                                                                 
      *   Rev 1.0   Apr 18 1997 10:03:24   P13PVCS                      
      *Initial revision.                                                
      *                                                                 
      *---------------------------------------------------------------* 
      ******************************************************************
      * COBOL DECLARATION FOR TABLE                                    *
      ******************************************************************
        05  WU-LAND.                                                    
           10 LANDINTERNATKZ                PIC  X(0003).               
           10 LANDTEXT                      PIC  X(0030).               
           10 LANDISOKZ                     PIC  X(0002).               
