      *****************************************************************         
        05  WU-WUKI0517.                                                        
           10 G11VVERTRAGSNR                PIC  X(0015).                       
           10 G11VMANDANT                   PIC S9(9) COMP.                     
           10 G11VAENDKZ                    PIC  X(0002).                       
           10 G11VPIN                       PIC  X(0009).                       
           10 G11VPINPRUEF                  PIC  X(0002).                       
           10 G11VBEGINN                    PIC  X(0008).                       
           10 G11VABLAUF                    PIC  X(0008).                       
           10 G11VZUSTAND                   PIC  X(0001).                       
           10 G11VZAHLWEISE                 PIC  X(0001).                       
           10 G11VBEITRAG                   PIC S9(8)V9(2) COMP-3.              
           10 G11VABSCHLVBNR                PIC S9(9) COMP.                     
           10 G11VAENDDAT                   PIC  X(0008).                       
           10 G11VLETZTAEND                 PIC  X(0008).                       
           10 G11VZAHLART                   PIC  X(0001).                       
           10 G11STORNODAT                  PIC  X(0008).                       
           10 G11VBUENDKZ                   PIC  X(0001).                       
           10 G11VWAEHRKZ                   PIC  X(0003).                       
           10 G11VZWSCHL                    PIC  X(0002).                       
           10 G11VZWSCHLTXT                 PIC  X(0003).                       
           10 G11VLSVSCOR                   PIC  X(0001).                       
           10 G11VAMTKZ                     PIC  X(0012).                       
           10 G11VAKZARTKNR                 PIC  X(0001).                       
           10 G11VSAISONKZ                  PIC  X(0001).                       
           10 G11VSAISONBEG                 PIC  X(0002).                       
           10 G11VSAISONEND                 PIC  X(0002).                       
           10 G11VZULDATUM                  PIC  X(0008).                       
           10 G11VERSTZULDAT                PIC  X(0008).                       
           10 G11VFZGARTKNR                 PIC  X(0003).                       
           10 G11VFZGVERWKNR                PIC  X(0003).                       
           10 G11VNAESPEZKNR                PIC  X(0003).                       
           10 G11VWAGNISKZ                  PIC  X(0003).                       
           10 G11VWAGNISTXT                 PIC  X(0025).                       
           10 G11VHERSTNR                   PIC  X(0004).                       
           10 G11VHERSTTXT                  PIC  X(0025).                       
           10 G11VFZGMODELL                 PIC  X(0050).                       
           10 G11VKFZTYP                    PIC  X(0003).                       
           10 G11VFAHRZGID                  PIC  X(0020).                       
           10 G11VKFZLEISTKZ                PIC  X(0001).                       
           10 G11KFZLEISTUNG                PIC S9(5)V9(2) COMP-3.              
           10 G11VPLATZ                     PIC  X(0003).                       
           10 G11VGESGEWICHT                PIC S9(7)V COMP-3.                  
           10 G11VKFZKW                     PIC S9(4)V COMP-3.                  
           10 G11VNUTZL                     PIC S9(7)V COMP-3.                  
           10 G11VNEUWERT                   PIC S9(7)V COMP-3.                  
           10 G11VJAHRKMLEIST               PIC S9(7)V COMP-3.                  
           10 G11VKMSTAAKT                  PIC S9(7)V COMP-3.                  
           10 G11VKMSTAAKTDAT               PIC  X(0008).                       
           10 G11VPAKETTYP                  PIC  X(0004).                       
           10 G11VPAKETTEXT                 PIC  X(0150).                       
           10 G11VFAHRER                    PIC  X(0010).                       
           10 G11VGEBDATFAH                 PIC  X(0010).                       
           10 G11FALTERMAX                  PIC  X(0002).                       
           10 G11VALTERGRPKNR               PIC  X(0004).                       
           10 G11VBEGLFAHR                  PIC  X(0002).                       
           10 G11BEGLFAHRTXT                PIC  X(0010).                       
           10 G11VFZGHALTER                 PIC  X(0002).                       
           10 G11VFZHGHALTTXT               PIC  X(0010).                       
           10 G11VFZGHALTNAME               PIC  X(0040).                       
           10 G11VFZGHALTVNAME              PIC  X(0040).                       
           10 G11VFZGNUTZ                   PIC  X(0010).                       
           10 G11VFZGABSTELL                PIC  X(0010).                       
           10 G11VFZGAUFBAU                 PIC  X(0004).                       
           10 G11VFAHRGEBIET                PIC  X(0010).                       
           10 G11VFSCHEINDAT                PIC  X(0010).                       
           10 G11VWOHNEIGEN                 PIC  X(0010).                       
           10 G11VBRANCHE                   PIC  X(0060).                       
           10 G11VTELEMATIK                 PIC S9(14)V COMP-3.                 
           10 G11VSCOREWERT                 PIC S9(3)V COMP-3.                  
           10 G11VSCOREDAT                  PIC  X(0008).                       
           10 G11VTARAUSW                   PIC  X(0001).                       
           10 G11VWERKBIND                  PIC  X(0001).                       
           10 G11VDAKH                      PIC  X(0002).                       
           10 G11VRKLKH                     PIC  X(0004).                       
           10 G11VTYPKLKH                   PIC  X(0002).                       
           10 G11VBEITRKHZW                 PIC S9(8)V9(2) COMP-3.              
           10 G11VDAKF                      PIC  X(0002).                       
           10 G11VRKLKF                     PIC  X(0004).                       
           10 G11VTYPKLKF                   PIC  X(0002).                       
           10 G11VSBVK                      PIC S9(8)V9(2) COMP-3.              
           10 G11VSBTK                      PIC S9(8)V9(2) COMP-3.              
           10 G11VBEITRKFZW                 PIC S9(8)V9(2) COMP-3.              
           10 G11VLEASING                   PIC  X(0001).                       
           10 G11VSCHUTZBR                  PIC  X(0010).                       
           10 G11VCOCDAT                    PIC  X(0008).                       
           10 G11VCOCKZ                     PIC  X(0001).                       
           10 G11VSFRTAB.                                                       
             49 G11VSFRTAB-LEN              PIC S9(4) COMP.                     
             49 G11VSFRTAB-TEXT             PIC X(30).                          
           10 G11VVERSBED.                                                      
             49 G11VVERSBED-LEN             PIC S9(4) COMP.                     
             49 G11VVERSBED-TEXT            PIC X(63).                          
           10 G11VTARIFBEZ.                                                     
             49 G11VTARIFBEZ-LEN            PIC S9(4) COMP.                     
             49 G11VTARIFBEZ-TEXT           PIC X(21).                          
           10 G11VKSMVERTR.                                                     
             49 G11VKSMVERTR-LEN            PIC S9(4) COMP.                     
             49 G11VKSMVERTR-TEXT           PIC X(464).                         
           10 G11VBESVEREIN.                                                    
             49 G11VBESVEREIN-LEN           PIC S9(4) COMP.                     
             49 G11VBESVEREIN-TEXT          PIC X(750).                         
           10 G11VSONDERAUS.                                                    
             49 G11VSONDERAUS-LEN           PIC S9(4) COMP.                     
             49 G11VSONDERAUS-TEXT          PIC X(240).                         
           10 G11VZUNACH.                                                       
             49 G11VZUNACH-LEN              PIC S9(4) COMP.                     
             49 G11VZUNACH-TEXT             PIC X(925).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 G11VELEKTROKZ                 PIC  X(0001).                       
           10 G11VFIRMENNR                  PIC  X(0006).                       
           10 NIL-G11VFIRMENNR              PIC  X(01).                         
