      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  05.06.2003
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2003 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0733.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/WUKI0733.CPv  $
      *
      *   Rev 2.1   Jun 11 2003 13:14:52   t13ex27
      *AKI00351 - DB-Änderung für Fix 41
      *
      *   Rev 2.0   Jun 05 2003 10:10:40   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-SELPUBLOCINST.
           10 SPLID                       PIC X(13).
           10 SPLTARGETVBN                PIC S9(9) COMP.
           10 SPLSANID                    PIC X(13).
           10 NIL-SPLSANID                PIC X(01).
           10 SPLSTATUS                   PIC X(1).
      *****************************************************************
