        05  WU-WUKI0385.                                                        
           10 LPZVERTRAGSID                 PIC  X(0013).                       
           10 LPZLFDNR                      PIC S9(4) COMP.                     
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 LETZTERAENDERER               PIC  X(0010).                       
           10 LPZGEVO                       PIC  X(0020).                       
           10 LPZDATUM                      PIC  X(010).                        
           10 LPZBETRAG                     PIC S9(11)V9(2) COMP-3.             
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
