      *****************************************************************
        05  WU-WUKI0554.
           10 G48BFVNR                      PIC  X(0015).
           10 G48BFUKTONR                   PIC  X(0002).
           10 G48BFWAEHRUNG                 PIC  X(0003).
           10 G48BFOEFDAT                   PIC  X(0008).
           10 G48BFENDEDAT                  PIC  X(0008).
           10 G48BFDARLEHEN                 PIC S9(12)V9(2) COMP-3.
           10 G48BFKREDITZUSDAT             PIC  X(0008).
           10 G48BFKREDITAUSDAT             PIC  X(0008).
           10 G48BFENDEZINSDAT              PIC  X(0008).
           10 G48BFAKTUSALDO                PIC S9(12)V9(2) COMP-3.
           10 G48BFENDEZRFREI               PIC  X(0008).
           10 G48BFTILGUNGSART              PIC  X(0001).
           10 G48BFTILGUNGPROZ              PIC S9(2)V9(4) COMP-3.
           10 G48BFTILGUNGPROD              PIC  X(0010).
           10 G48BFTILGUNGBEITR             PIC S9(12)V9(2) COMP-3.
           10 G48BFSOLLZINS                 PIC S9(2)V9(4) COMP-3.
           10 G48BFUEBERZINS                PIC S9(2)V9(4) COMP-3.
           10 G48BFZAHLUNGSW                PIC  X(0001).
           10 G48BFANNUITAET                PIC S9(12)V9(2) COMP-3.
           10 G48BFRATEANT                  PIC S9(12)V9(2) COMP-3.
           10 G48BFZINSANT                  PIC S9(12)V9(2) COMP-3.
           10 G48BFDELKZ                    PIC  X(0001).
           10 G48BFIBAN                     PIC  X(0034).
           10 G48BFBIC                      PIC  X(0011).
           10 G48BFMANDREF                  PIC  X(0035).
           10 G48BFNNAMEBZ                  PIC  X(0028).
           10 G48BFIBANBF                   PIC  X(0034).
           10 G48BFZINSART                  PIC  X(0002).
           10 G48BFORWORDKZ                 PIC  X(0001).
           10 G48BFPIN                      PIC S9(9) COMP.
           10 G48BFVOLLAUSZDAT              PIC  X(0008).
           10 LETZTERAENDERER               PIC  X(0010).
           10 LETZTEAENDERUNG               PIC  X(0026).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).
           10 DCOP                          PIC  X(0001).
           10 NIL-DCOP                      PIC  X(01).
           10 G48BFFAELLIGDAT               PIC  X(0008).