      *****************************************************************
        05  WU-WUKI0330.
           10 LTSVERTRAGSID                 PIC  X(0013).
           10 LTSVERSTARLFDNR               PIC S9(4) COMP.
           10 LTSZAHLDYNERHOEH              PIC S9(4) COMP.
           10 LTSTTNR                       PIC S9(4) COMP.
           10 LTSDATDYNERHOEH               PIC  X(010).
           10 NIL-LTSDATDYNERHOEH           PIC  X(01).
           10 LTSSCHICHTBEITR               PIC S9(11)V9(2) COMP-3.
           10 NIL-LTSSCHICHTBEITR           PIC  X(01).
           10 LTSWKZ                        PIC  X(0001).
           10 LTSVERSSUMME                  PIC S9(11)V9(2) COMP-3.
           10 NIL-LTSVERSSUMME              PIC  X(01).
           10 LTSTARBEZEICHNUNG             PIC  X(0015).
           10 NIL-LTSTARBEZEICHNUNG         PIC  X(01).
           10 LTSBEITRZUSTID                PIC  X(0004).
           10 NIL-LTSBEITRZUSTID            PIC  X(01).
           10 LTSVERTRZUSTANDID             PIC S9(4) COMP.
           10 NIL-LTSVERTRZUSTANDID         PIC  X(01).
           10 LTSVERTRZUSTANDDAT            PIC  X(010).
           10 NIL-LTSVERTRZUSTANDDAT        PIC  X(01).
           10 LETZTEAENDERUNG               PIC  X(0026).
           10 NIL-LETZTEAENDERUNG           PIC  X(01).
           10 LTSSCHICHTZUGARTID            PIC  X(0001).
           10 LTSTTYPBEITR                  PIC S9(11)V9(2) COMP-3.
           10 NIL-LTSTTYPBEITR              PIC  X(01).
           10 LTSDEPZINSUEBANT              PIC S9(3)V9(2) COMP-3.
           10 NIL-LTSDEPZINSUEBANT          PIC  X(01).
           10 LTSRNTSCHL                    PIC  X(0001).
           10 NIL-LTSRNTSCHL                PIC  X(01).
           10 LTSRNTSCHLDAT                 PIC  X(010).
           10 NIL-LTSRNTSCHLDAT             PIC  X(01).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).
           10 DCOP                          PIC  X(0001).
           10 NIL-DCOP                      PIC  X(01).
           10 LTSBTGRUEKZNPFL               PIC  X(0001).
           10 LTSKLBERHAUSSCHL              PIC  X(0001).
           10 LTSRABSTUFE                   PIC  X(0003).
           10 NIL-LTSRABSTUFE               PIC  X(01).
