      *****************************************************************         
        05  WU-WUKI0488.                                                        
           10 G79VERTRAGSNR                 PIC  X(0015).                       
           10 G79MANDANT                    PIC S9(9) COMP.                     
           10 G79ISIN                       PIC  X(0012).                       
           10 G79STATUS                     PIC  X(0001).                       
           10 G79VRTRGBEGINN                PIC  X(0008).                       
           10 G79VRTRGENDE                  PIC  X(0008).                       
           10 G79ABSCHLVBNR                 PIC S9(9) COMP.                     
           10 G79KUNDENDATEN.                                                   
             49 G79KUNDENDATEN-LEN          PIC S9(4) COMP.                     
             49 G79KUNDENDATEN-TEXT         PIC X(382).                         
           10 G79SPARRATE                   PIC S9(7)V9(2) COMP-3.              
           10 G79ZAHLUNGSART                PIC  X(0001).                       
           10 G79ABBUCHTERMIN               PIC  X(0001).                       
           10 G79IBAN                       PIC  X(0034).                       
           10 G79BIC                        PIC  X(0011).                       
           10 G79ABWNAME                    PIC  X(0040).                       
           10 G79ENDEAUSDAT                 PIC  X(0008).                       
           10 G79RATESCHLDAT                PIC  X(0008).                       
           10 G79BESTANDGRAMM               PIC S9(7)V9(4) COMP-3.              
           10 G79BESTANDEURO                PIC S9(7)V9(2) COMP-3.              
           10 G79BUCHUNGSDAT                PIC  X(0008).                       
           10 G79RUECKGRAMM                 PIC S9(4)V9(2) COMP-3.              
           10 G79SUMMEEIN                   PIC S9(7)V9(2) COMP-3.              
           10 G79SUMMEAUS                   PIC S9(7)V9(2) COMP-3.              
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 G79RABATT                     PIC  X(0001).                       
           10 G79KNDRABATT                  PIC  X(0001).                       
           10 G79KUNDENIDEXT                PIC S9(9) COMP.                     
           10 G79FLATRATE                   PIC  X(0001).                       
           10 G79RATEOEFFDAT                PIC  X(0008).                       
           10 G79DYNAMIK                    PIC S9(3)V9(2) COMP-3.              
           10 G79SPARRATEID                 PIC S9(9) COMP.                     
           10 G79SPARRATELFDNR              PIC S9(4) COMP.                     
           10 G79KUMAUSLIEF1                PIC S9(9) COMP.                     
           10 G79KUMAUSLIEF2                PIC S9(9) COMP.                     
           10 G79KUMAUSLIEF3                PIC S9(9) COMP.                     
