      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  16/07/14
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0433.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/WUKI0433.CPv  $
      *
      *   Rev 2.2   Mar 02 2015 16:24:06   t13ex27
      *AKI01315: Masch. Verarbeitung von Fonds- und Paletteninforma
      *tionen-DB-Änderung und OZPs
      *
      *   Rev 2.1   Sep 01 2014 10:36:14   t13ex27
      *AKI01315: Masch. Verarbeitung von Fonds- und Paletteninforma
      *tionen-DB-Änderung und OZPs
      *
      *   Rev 2.0   Jul 16 2014 16:01:02   T13EX27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-LEBENFONDSBEZ.
           10 LFBFONDSKUERZEL               PIC  X(0002).
           10 LFBFONDSBEZEICH               PIC  X(0050).
           10 LFBWKN                        PIC  X(0006).
           10 NIL-LFBWKN                    PIC  X(01).
           10 LFBISIN                       PIC  X(0012).
           10 NIL-LFBISIN                   PIC  X(01).
           10 LFBGUELTIGAB                  PIC  X(010).
           10 LFBGUELTIGBIS                 PIC  X(010).

