      *****************************************************************         
        05  WU-WUKI0559.                                                        
           10 GVZVERTRAGSID                 PIC  X(0013).                       
           10 GVZKUNDENIDEXT                PIC S9(9) COMP.                     
           10 NIL-GVZKUNDENIDEXT            PIC  X(01).                         
           10 GVZFLATRATE                   PIC  X(0001).                       
           10 NIL-GVZFLATRATE               PIC  X(01).                         
           10 GVZKNDRABATT                  PIC S9(3)V9(2) COMP-3.              
           10 NIL-GVZKNDRABATT              PIC  X(01).                         
           10 GVZKUMAUSLIEFGB               PIC S9(9) COMP.                     
           10 NIL-GVZKUMAUSLIEFGB           PIC  X(01).                         
           10 GVZKUMAUSLIEFGM               PIC S9(9) COMP.                     
           10 NIL-GVZKUMAUSLIEFGM           PIC  X(01).                         
           10 GVZKUMAUSLIEFSBB              PIC S9(9) COMP.                     
           10 NIL-GVZKUMAUSLIEFSBB          PIC  X(01).                         
           10 GVZKUMAUSLIEFSBZ              PIC S9(9) COMP.                     
           10 NIL-GVZKUMAUSLIEFSBZ          PIC  X(01).                         
           10 GVZKUMAUSLIEFSM               PIC S9(9) COMP.                     
           10 NIL-GVZKUMAUSLIEFSM           PIC  X(01).                         
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
