      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  05.11.2018
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2018 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0518.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/WUKI0518.CPv  $
      *
      *   Rev 2.2   Jan 22 2019 14:38:08   t13ex78
      *AKI01641: OZPs & Copies
      *
      *   Rev 2.1   Dec 19 2018 09:38:52   t13ex78
      *AKI01641: OZPs & Copies
      *
      *   Rev 2.0   Nov 05 2018 08:52:38   t13ae31
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WUKI0518.
           10 G11KDSPARTE                   PIC  X(0003).
           10 G11KDVERTRAGSNR               PIC  X(0015).
           10 G11KDROLLE                    PIC S9(4) COMP.
           10 G11KDAENDKZ                   PIC S9(4) COMP.
           10 G11KDNACHNAME                 PIC  X(0040).
           10 G11KDVORNAME                  PIC  X(0030).
           10 G11KDGEBDAT                   PIC  X(0008).
           10 G11KDANREDEKZ                 PIC  X(0002).
           10 G11KDGESCHLECHT               PIC  X(0001).
           10 G11KDSTRASSE                  PIC  X(0045).
           10 G11KDPOSTFACH                 PIC  X(0045).
           10 G11KDPLZ                      PIC  X(0009).
           10 G11KDORT                      PIC  X(0040).
           10 G11KDLKZ                      PIC  X(0003).
           10 G11KDIBAN                     PIC  X(0034).
           10 G11KDBIC                      PIC  X(0011).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).
           10 DCOP                          PIC  X(0001).
           10 NIL-DCOP                      PIC  X(01).
 

