      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  23/02/18
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0490.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/WUKI0490.CPv  $
      *
      *   Rev 2.1   Jun 11 2018 14:37:42   t13ex27
      *AKI01570: FW - Generali-Partnergesellschaften-E/A/A-Kunden
      *
      *   Rev 2.0   Feb 23 2018 15:10:27   T13EX27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WUKI0490.
           10 GENKGESELLSCHID               PIC  X(0002).
           10 GENKVNR                       PIC  X(0015).
           10 GENKEZPNR                     PIC S9(4) COMP.
           10 GENKROLLE                     PIC  X(0002).
           10 GENKLFDNR                     PIC S9(4) COMP.
           10 GENKVERARB-KZN                PIC  X(0001).
           10 GENKNACHNAME                  PIC  X(0040).
           10 GENKNACHNAME2                 PIC  X(0040).
           10 GENKVORNAME                   PIC  X(0030).
           10 GENKGEBDAT                    PIC  X(0008).
           10 GENKANREDE                    PIC  X(0002).
           10 GENKGESCHLECHT                PIC  X(0001).
           10 GENKSTRASSE                   PIC  X(0045).
           10 GENKPLZ                       PIC  X(0015).
           10 GENKORT                       PIC  X(0030).
           10 GENKAUSL-KZN                  PIC  X(0003).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).

