      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  21/09/16
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0480.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/WUKI0480.CPv  $
      *
      *   Rev 2.2   Dec 19 2016 13:17:08   t13ac20
      *AKI01466: Standard OZP
      *
      *   Rev 2.1   Dec 07 2016 10:52:52   t13ac20
      *AKI01466: Standard OZP
      *
      *   Rev 2.0   Sep 21 2016 13:35:08   T13AC20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WUKI0480.
           10 G51PVERTRAGSNR                PIC  X(0015).
           10 G51PLFDNR                     PIC S9(4) COMP.
           10 G51PSTATUS                    PIC  X(0001).
           10 G51PVERSART                   PIC  X(0001).
           10 G51PVRTRGBEGINN               PIC  X(0008).
           10 G51PVRTRGENDE                 PIC  X(0008).
           10 G51PNACHNAME                  PIC  X(0030).
           10 G51PVORNAME                   PIC  X(0030).
           10 G51PGEBDAT                    PIC  X(0008).
           10 G51PANREDE                    PIC S9(4) COMP.
           10 G51PGESCHLECHT                PIC  X(0001).
           10 G51PABRECHKZ                  PIC  X(0001).
           10 G51PZUSRAHMEN                 PIC  X(0001).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).

