      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0609.CPY  $
      *    $Revision:   2.6  $
      *
      *    $Log:   L:/mf/CPY/WUKI0609.CPv  $
      *
      *   Rev 2.6   Jun 11 2003 13:14:08   t13ex27
      *AKI00351 - DB-Änderung für Fix 41
      *
      *   Rev 2.5   25 Jul 2001 10:33:38   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-BENUTZER.
           10 BENMITAROLLENID             PIC X(13).
           10 BENMITAROLLENKZ             PIC X(1).
           10 RACFID                      PIC X(8).
           10 NIL-RACFID                  PIC X(01).
           10 BENKENNWORT                 PIC X(15).
           10 NIL-BENKENNWORT             PIC X(01).
           10 BENART                      PIC X(1).
           10 NIL-BENART                  PIC X(01).
           10 LETZTEAENDERUNG             PIC X(026).
           10 NIL-LETZTEAENDERUNG         PIC X(01).
           10 BENVWKENNWORT               PIC X(15).
           10 NIL-BENVWKENNWORT           PIC X(01).
      *****************************************************************
