      *****************************************************************         
        05  WU-WUKI0378.                                                        
           10 KRTVERTRAGSID                 PIC  X(0013).                       
           10 KRTVERSTARLFDNR               PIC S9(4) COMP.                     
           10 KRTTARIFART-KNR               PIC S9(4) COMP.                     
           10 KRTDATABGANGVERTR             PIC  X(010).                        
           10 NIL-KRTDATABGANGVERTR         PIC  X(01).                         
           10 KRTDATZUGANGVERTR             PIC  X(010).                        
           10 NIL-KRTDATZUGANGVERTR         PIC  X(01).                         
           10 KRTMONATSBEITRAG              PIC S9(9)V9(2) COMP-3.              
           10 NIL-KRTMONATSBEITRAG          PIC  X(01).                         
           10 KRTMONBEITRWKZ                PIC  X(0001).                       
           10 KRTSELBSTBETEILIG             PIC S9(9)V9(2) COMP-3.              
           10 NIL-KRTSELBSTBETEILIG         PIC  X(01).                         
           10 KRTSELBSTBETWKZ               PIC  X(0001).                       
           10 KRTTARIFNAMEN                 PIC  X(0008).                       
           10 KRTRISIKOZUSCHLAG             PIC  X(0010).                       
           10 KRTVERSLEISTUNG               PIC S9(9)V9(2) COMP-3.              
           10 NIL-KRTVERSLEISTUNG           PIC  X(01).                         
           10 KRTVERSLSTWKZ                 PIC  X(0001).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 NIL-LETZTEAENDERUNG           PIC  X(01).                         
           10 KRTANWARTSCHAFT               PIC  X(0002).                       
           10 NIL-KRTANWARTSCHAFT           PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 KRTBE-REDUK-BTG               PIC S9(9)V9(2) COMP-3.              
           10 KRT-ANZ-TAR-DUP               PIC S9(4) COMP.                     
           10 KRTTARIFART-KTY               PIC S9(4) COMP.                     
