      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0080.CPY  $
      *    $Revision:   2.6  $
      *
      *    $Log:   L:/mf/CPY/WUKI0080.CPv  $
      *
      *   Rev 2.6   Jun 11 2003 13:08:02   t13ex27
      *AKI00351 - DB-Änderung für Fix 41
      *
      *   Rev 2.5   25 Jul 2001 10:33:08   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-HAUSHALT.
           10 HAUSHALTID                  PIC X(13).
           10 HHBETREUERID                PIC X(13).
           10 NIL-HHBETREUERID            PIC X(01).
           10 HHBETREUERROLLE             PIC X(1).
           10 NIL-HHBETREUERROLLE         PIC X(01).
           10 HHKUNDENAKTEVER             PIC X(1).
      *****************************************************************
