      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0333.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/WUKI0333.CPv  $
      *
      *   Rev 2.1   Mar 01 2017 15:26:38   t13ex27
      *AKI01490: Tabelle Produkt aufräumen
      *
      *   Rev 1.1   09 May 1998 14:13:56   P13SP99
      *Neuerstellung
      *
      *   Rev 1.0   Apr 18 1997 10:08:48   P13PVCS
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ******************************************************************
      * COBOL DECLARATION FOR TABLE                                    *
      ******************************************************************
        05  WU-WUKI0333.
           10 PRODUKTID                     PIC S9(4) COMP.
           10 PRODUKTTEXT                   PIC  X(0072).

