      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  28/01/15
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0475.CPY  $
      *    $Revision:   2.3  $
      *
      *    $Log:   L:/mf/CPY/WUKI0475.CPv  $
      *
      *   Rev 2.3   Mar 13 2018 08:26:12   t13ex27
      *AKI01572: FW-Gesellschaft DV(G90)
      *
      *   Rev 2.2   Sep 02 2015 15:11:08   t13ex73
      *AKI01342: DVM G90 Erstellung - Verarbeitung Copybooks
      *
      *   Rev 2.1   Jul 09 2015 10:47:08   t13ex73
      *AKI01342: DVM G90 Erstellung - Verarbeitung Copybooks
      *
      *   Rev 2.0   Jan 28 2015 12:11:14   T13EX73
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-G90KSDSKUNDE.
           10 G90KVERTRAGSNR                PIC  X(0015).
           10 G90KMANDANT                   PIC S9(9) COMP.
           10 G90KAENDKZ                    PIC  X(0002).
           10 G90KGESID                     PIC S9(4) COMP.
           10 G90KRECHTSFORM                PIC S9(4) COMP.
           10 G90KANREDE                    PIC S9(4) COMP.
           10 G90KVORNAME                   PIC  X(0030).
           10 G90KNACHNAME                  PIC  X(0030).
           10 G90KGRUENDDAT                 PIC  X(010).
           10 G90KINHABER                   PIC  X(0100).
           10 G90KSTRASSE                   PIC  X(0040).
           10 G90KPLZ                       PIC S9(9) COMP.
           10 G90KORT                       PIC  X(0040).
           10 G90KPFPOSTFACH                PIC S9(9) COMP.
           10 G90KPFPLZ                     PIC S9(9) COMP.
           10 G90KPFORT                     PIC  X(0040).
           10 G90KTELNR                     PIC  X(0030).
           10 G90KMOBILNR                   PIC  X(0030).
           10 G90KFAXNR                     PIC  X(0030).
           10 G90KAPTITEL                   PIC S9(4) COMP.
           10 G90KAPANREDE                  PIC S9(4) COMP.
           10 G90KAPVORNAME                 PIC  X(0030).
           10 G90KAPNACHNAME                PIC  X(0030).
           10 G90KAPGEBDAT                  PIC  X(010).
           10 G90KAPEMAIL                   PIC  X(0128).
           10 G90KAPFUNKTION                PIC  X(0050).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).


