      *****************************************************************         
        05  WU-WUKI0314.                                                        
           10 GHBVERTRAGSID                 PIC  X(0013).                       
           10 GHBGUTHABPRODLFDNR            PIC S9(4) COMP.                     
           10 GHBFONDID                     PIC S9(4) COMP.                     
           10 GHBGHALFDNR                   PIC S9(4) COMP.                     
           10 GHBBUCHUNGLFDNR               PIC S9(4) COMP.                     
           10 GHBBETRAGLETZTBUCH            PIC S9(9)V9(2) COMP-3.              
           10 NIL-GHBBETRAGLETZTBUCH        PIC  X(01).                         
           10 GHBBETRLBUWKZ                 PIC  X(0001).                       
           10 GHBBUCHUNGSDATUM              PIC  X(010).                        
           10 NIL-GHBBUCHUNGSDATUM          PIC  X(01).                         
           10 GHBGUTHABENANT                PIC S9(7)V9(4) COMP-3.              
           10 NIL-GHBGUTHABENANT            PIC  X(01).                         
           10 GHBKZFINHLETZTBUID            PIC S9(4) COMP.                     
           10 NIL-GHBKZFINHLETZTBUID        PIC  X(01).                         
           10 GHBSTEUBETRLETZTBU            PIC S9(9)V9(2) COMP-3.              
           10 NIL-GHBSTEUBETRLETZTBU        PIC  X(01).                         
           10 GHBSTLETZTBUWKZ               PIC  X(0001).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 NIL-LETZTEAENDERUNG           PIC  X(01).                         
           10 GHBNETTOBETRAG                PIC S9(9)V9(2) COMP-3.              
           10 GHBNETTOBETWKZ                PIC  X(0001).                       
           10 GHBGEBBETRAG                  PIC S9(9)V9(2) COMP-3.              
           10 NIL-GHBGEBBETRAG              PIC  X(01).                         
           10 GHBGEBSCHLUESSEL              PIC S9(4) COMP.                     
           10 NIL-GHBGEBSCHLUESSEL          PIC  X(01).                         
           10 GHBGEBTEXT                    PIC  X(0020).                       
           10 NIL-GHBGEBTEXT                PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
