      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  09/10/14
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0470.CPY  $
      *    $Revision:   2.6  $
      *
      *    $Log:   L:/mf/CPY/WUKI0470.CPv  $
      *
      *   Rev 2.6   Mar 17 2015 14:39:02   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank - Co
      *pies
      *
      *   Rev 2.5   Mar 11 2015 12:29:26   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.4   Mar 09 2015 11:18:14   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.3   Mar 02 2015 10:54:14   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.2   Feb 25 2015 11:44:58   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.1   Jan 13 2015 13:09:22   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.0   Oct 9 2014 12:45:46   T13EX78
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-G68_VERTRAG.
           10 G68VVERTRAGSNR                PIC  X(0015).
           10 G68VSTATUS                    PIC  X(0001).
           10 G68VMANDANT                   PIC S9(9) COMP.
           10 G68VABSCHLVBNR                PIC S9(9) COMP.
           10 G68VVRTRGBEGINN               PIC  X(010).
           10 G68VVRTRGENDE                 PIC  X(010).
           10 NIL-G68VVRTRGENDE             PIC  X(01).
           10 G68VDSSPERRE                  PIC  X(0001).
           10 G68VDSSPERRDATUM              PIC  X(010).
           10 NIL-G68VDSSPERRDATUM          PIC  X(01).
           10 ZUGANG                        PIC  X(026).
           10 VON                           PIC  X(026).
           10 BIS                           PIC  X(026).
 
 
 
 
 

