       01  BAN0033I.                                                            
           02  FILLER PIC X(12).                                                
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(11).                                               
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AVBPRZL    COMP  PIC  S9(4).                                     
           02  AVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVBPRZF.                                        
             03 AVBPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBPRZI  PIC X(1).                                               
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADIRI  PIC X(3).                                                 
           02  AVBNAMEL    COMP  PIC  S9(4).                                    
           02  AVBNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAMEF.                                       
             03 AVBNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNAMEI  PIC X(20).                                             
           02  TVORSCL    COMP  PIC  S9(4).                                     
           02  TVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES TVORSCF.                                        
             03 TVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVORSCI  PIC X(7).                                               
           02  AVORSCL    COMP  PIC  S9(4).                                     
           02  AVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES AVORSCF.                                        
             03 AVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVORSCI  PIC X(17).                                              
           02  TVMNRL    COMP  PIC  S9(4).                                      
           02  TVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVMNRF.                                         
             03 TVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVMNRI  PIC X(11).                                               
           02  AVMNRL    COMP  PIC  S9(4).                                      
           02  AVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVMNRF.                                         
             03 AVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVMNRI  PIC X(7).                                                
           02  AVMPRZL    COMP  PIC  S9(4).                                     
           02  AVMPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVMPRZF.                                        
             03 AVMPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVMPRZI  PIC X(1).                                               
           02  AVMNAMEL    COMP  PIC  S9(4).                                    
           02  AVMNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVMNAMEF.                                       
             03 AVMNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVMNAMEI  PIC X(20).                                             
           02  TVBZEIL    COMP  PIC  S9(4).                                     
           02  TVBZEIF    PICTURE X.                                            
           02  FILLER REDEFINES TVBZEIF.                                        
             03 TVBZEIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVBZEII  PIC X(13).                                              
           02  AVBZEIL    COMP  PIC  S9(4).                                     
           02  AVBZEIF    PICTURE X.                                            
           02  FILLER REDEFINES AVBZEIF.                                        
             03 AVBZEIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBZEII  PIC X(7).                                               
           02  TPINL    COMP  PIC  S9(4).                                       
           02  TPINF    PICTURE X.                                              
           02  FILLER REDEFINES TPINF.                                          
             03 TPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPINI  PIC X(10).                                                
           02  EPIN81L    COMP  PIC  S9(4).                                     
           02  EPIN81F    PICTURE X.                                            
           02  FILLER REDEFINES EPIN81F.                                        
             03 EPIN81A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPIN81I  PIC X(8).                                               
           02  EPINPRL    COMP  PIC  S9(4).                                     
           02  EPINPRF    PICTURE X.                                            
           02  FILLER REDEFINES EPINPRF.                                        
             03 EPINPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPINPRI  PIC X(2).                                               
           02  EPIN82L    COMP  PIC  S9(4).                                     
           02  EPIN82F    PICTURE X.                                            
           02  FILLER REDEFINES EPIN82F.                                        
             03 EPIN82A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPIN82I  PIC X(8).                                               
           02  EPINPR2L    COMP  PIC  S9(4).                                    
           02  EPINPR2F    PICTURE X.                                           
           02  FILLER REDEFINES EPINPR2F.                                       
             03 EPINPR2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPINPR2I  PIC X(2).                                              
           02  EPIN83L    COMP  PIC  S9(4).                                     
           02  EPIN83F    PICTURE X.                                            
           02  FILLER REDEFINES EPIN83F.                                        
             03 EPIN83A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPIN83I  PIC X(8).                                               
           02  EPINPR3L    COMP  PIC  S9(4).                                    
           02  EPINPR3F    PICTURE X.                                           
           02  FILLER REDEFINES EPINPR3F.                                       
             03 EPINPR3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPINPR3I  PIC X(2).                                              
           02  EPIN84L    COMP  PIC  S9(4).                                     
           02  EPIN84F    PICTURE X.                                            
           02  FILLER REDEFINES EPIN84F.                                        
             03 EPIN84A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPIN84I  PIC X(8).                                               
           02  EPINPR4L    COMP  PIC  S9(4).                                    
           02  EPINPR4F    PICTURE X.                                           
           02  FILLER REDEFINES EPINPR4F.                                       
             03 EPINPR4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPINPR4I  PIC X(2).                                              
           02  EPIN85L    COMP  PIC  S9(4).                                     
           02  EPIN85F    PICTURE X.                                            
           02  FILLER REDEFINES EPIN85F.                                        
             03 EPIN85A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPIN85I  PIC X(8).                                               
           02  EPINPR5L    COMP  PIC  S9(4).                                    
           02  EPINPR5F    PICTURE X.                                           
           02  FILLER REDEFINES EPINPR5F.                                       
             03 EPINPR5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPINPR5I  PIC X(2).                                              
           02  TKDNAML    COMP  PIC  S9(4).                                     
           02  TKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES TKDNAMF.                                        
             03 TKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDNAMI  PIC X(10).                                              
           02  EKDNAML    COMP  PIC  S9(4).                                     
           02  EKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES EKDNAMF.                                        
             03 EKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDNAMI  PIC X(26).                                              
           02  TKDVNAL    COMP  PIC  S9(4).                                     
           02  TKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES TKDVNAF.                                        
             03 TKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDVNAI  PIC X(10).                                              
           02  EKDVNAL    COMP  PIC  S9(4).                                     
           02  EKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES EKDVNAF.                                        
             03 EKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDVNAI  PIC X(26).                                              
           02  TPLZL    COMP  PIC  S9(4).                                       
           02  TPLZF    PICTURE X.                                              
           02  FILLER REDEFINES TPLZF.                                          
             03 TPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPLZI  PIC X(10).                                                
           02  EPLZL    COMP  PIC  S9(4).                                       
           02  EPLZF    PICTURE X.                                              
           02  FILLER REDEFINES EPLZF.                                          
             03 EPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPLZI  PIC X(5).                                                 
           02  EKDORTL    COMP  PIC  S9(4).                                     
           02  EKDORTF    PICTURE X.                                            
           02  FILLER REDEFINES EKDORTF.                                        
             03 EKDORTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDORTI  PIC X(21).                                              
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EAUSLI  PIC X(3).                                                
           02  TVSNRL    COMP  PIC  S9(4).                                      
           02  TVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVSNRF.                                         
             03 TVSNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVSNRI  PIC X(7).                                                
           02  AVSNRL    COMP  PIC  S9(4).                                      
           02  AVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVSNRF.                                         
             03 AVSNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVSNRI  PIC X(15).                                               
           02  TPRODL    COMP  PIC  S9(4).                                      
           02  TPRODF    PICTURE X.                                             
           02  FILLER REDEFINES TPRODF.                                         
             03 TPRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TPRODI  PIC X(10).                                               
           02  EPROD1L    COMP  PIC  S9(4).                                     
           02  EPROD1F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD1F.                                        
             03 EPROD1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD1I  PIC X(2).                                               
           02  EPROD2L    COMP  PIC  S9(4).                                     
           02  EPROD2F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD2F.                                        
             03 EPROD2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD2I  PIC X(2).                                               
           02  EPROD3L    COMP  PIC  S9(4).                                     
           02  EPROD3F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD3F.                                        
             03 EPROD3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD3I  PIC X(2).                                               
           02  EPROD4L    COMP  PIC  S9(4).                                     
           02  EPROD4F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD4F.                                        
             03 EPROD4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD4I  PIC X(2).                                               
           02  EPROD5L    COMP  PIC  S9(4).                                     
           02  EPROD5F    PICTURE X.                                            
           02  FILLER REDEFINES EPROD5F.                                        
             03 EPROD5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPROD5I  PIC X(2).                                               
           02  TEINHAL    COMP  PIC  S9(4).                                     
           02  TEINHAF    PICTURE X.                                            
           02  FILLER REDEFINES TEINHAF.                                        
             03 TEINHAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TEINHAI  PIC X(10).                                              
           02  AEINH1L    COMP  PIC  S9(4).                                     
           02  AEINH1F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH1F.                                        
             03 AEINH1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH1I  PIC X(7).                                               
           02  AEINH2L    COMP  PIC  S9(4).                                     
           02  AEINH2F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH2F.                                        
             03 AEINH2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH2I  PIC X(7).                                               
           02  AEINH3L    COMP  PIC  S9(4).                                     
           02  AEINH3F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH3F.                                        
             03 AEINH3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH3I  PIC X(7).                                               
           02  AEINH4L    COMP  PIC  S9(4).                                     
           02  AEINH4F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH4F.                                        
             03 AEINH4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH4I  PIC X(7).                                               
           02  AEINH5L    COMP  PIC  S9(4).                                     
           02  AEINH5F    PICTURE X.                                            
           02  FILLER REDEFINES AEINH5F.                                        
             03 AEINH5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEINH5I  PIC X(7).                                               
           02  TEINHEL    COMP  PIC  S9(4).                                     
           02  TEINHEF    PICTURE X.                                            
           02  FILLER REDEFINES TEINHEF.                                        
             03 TEINHEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TEINHEI  PIC X(10).                                              
           02  EEINH1L    COMP  PIC  S9(4).                                     
           02  EEINH1F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH1F.                                        
             03 EEINH1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH1I  PIC X(7).                                               
           02  EEINH2L    COMP  PIC  S9(4).                                     
           02  EEINH2F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH2F.                                        
             03 EEINH2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH2I  PIC X(7).                                               
           02  EEINH3L    COMP  PIC  S9(4).                                     
           02  EEINH3F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH3F.                                        
             03 EEINH3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH3I  PIC X(7).                                               
           02  EEINH4L    COMP  PIC  S9(4).                                     
           02  EEINH4F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH4F.                                        
             03 EEINH4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH4I  PIC X(7).                                               
           02  EEINH5L    COMP  PIC  S9(4).                                     
           02  EEINH5F    PICTURE X.                                            
           02  FILLER REDEFINES EEINH5F.                                        
             03 EEINH5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEINH5I  PIC X(7).                                               
           02  TVEBEGL    COMP  PIC  S9(4).                                     
           02  TVEBEGF    PICTURE X.                                            
           02  FILLER REDEFINES TVEBEGF.                                        
             03 TVEBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVEBEGI  PIC X(10).                                              
           02  EVEBEGL    COMP  PIC  S9(4).                                     
           02  EVEBEGF    PICTURE X.                                            
           02  FILLER REDEFINES EVEBEGF.                                        
             03 EVEBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEGI  PIC X(6).                                               
           02  EVEBEG2L    COMP  PIC  S9(4).                                    
           02  EVEBEG2F    PICTURE X.                                           
           02  FILLER REDEFINES EVEBEG2F.                                       
             03 EVEBEG2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEG2I  PIC X(6).                                              
           02  EVEBEG3L    COMP  PIC  S9(4).                                    
           02  EVEBEG3F    PICTURE X.                                           
           02  FILLER REDEFINES EVEBEG3F.                                       
             03 EVEBEG3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEG3I  PIC X(6).                                              
           02  EVEBEG4L    COMP  PIC  S9(4).                                    
           02  EVEBEG4F    PICTURE X.                                           
           02  FILLER REDEFINES EVEBEG4F.                                       
             03 EVEBEG4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEG4I  PIC X(6).                                              
           02  EVEBEG5L    COMP  PIC  S9(4).                                    
           02  EVEBEG5F    PICTURE X.                                           
           02  FILLER REDEFINES EVEBEG5F.                                       
             03 EVEBEG5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEG5I  PIC X(6).                                              
           02  TVEENDL    COMP  PIC  S9(4).                                     
           02  TVEENDF    PICTURE X.                                            
           02  FILLER REDEFINES TVEENDF.                                        
             03 TVEENDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVEENDI  PIC X(10).                                              
           02  EVEENDL    COMP  PIC  S9(4).                                     
           02  EVEENDF    PICTURE X.                                            
           02  FILLER REDEFINES EVEENDF.                                        
             03 EVEENDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVEENDI  PIC X(6).                                               
           02  EVEEND2L    COMP  PIC  S9(4).                                    
           02  EVEEND2F    PICTURE X.                                           
           02  FILLER REDEFINES EVEEND2F.                                       
             03 EVEEND2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEEND2I  PIC X(6).                                              
           02  EVEEND3L    COMP  PIC  S9(4).                                    
           02  EVEEND3F    PICTURE X.                                           
           02  FILLER REDEFINES EVEEND3F.                                       
             03 EVEEND3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEEND3I  PIC X(6).                                              
           02  EVEEND4L    COMP  PIC  S9(4).                                    
           02  EVEEND4F    PICTURE X.                                           
           02  FILLER REDEFINES EVEEND4F.                                       
             03 EVEEND4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEEND4I  PIC X(6).                                              
           02  EVEEND5L    COMP  PIC  S9(4).                                    
           02  EVEEND5F    PICTURE X.                                           
           02  FILLER REDEFINES EVEEND5F.                                       
             03 EVEEND5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVEEND5I  PIC X(6).                                              
           02  TZAHLWL    COMP  PIC  S9(4).                                     
           02  TZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES TZAHLWF.                                        
             03 TZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TZAHLWI  PIC X(10).                                              
           02  EZAHLWL    COMP  PIC  S9(4).                                     
           02  EZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES EZAHLWF.                                        
             03 EZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLWI  PIC X(1).                                               
           02  EZAHLW2L    COMP  PIC  S9(4).                                    
           02  EZAHLW2F    PICTURE X.                                           
           02  FILLER REDEFINES EZAHLW2F.                                       
             03 EZAHLW2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLW2I  PIC X(1).                                              
           02  EZAHLW3L    COMP  PIC  S9(4).                                    
           02  EZAHLW3F    PICTURE X.                                           
           02  FILLER REDEFINES EZAHLW3F.                                       
             03 EZAHLW3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLW3I  PIC X(1).                                              
           02  EZAHLW4L    COMP  PIC  S9(4).                                    
           02  EZAHLW4F    PICTURE X.                                           
           02  FILLER REDEFINES EZAHLW4F.                                       
             03 EZAHLW4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLW4I  PIC X(1).                                              
           02  EZAHLW5L    COMP  PIC  S9(4).                                    
           02  EZAHLW5F    PICTURE X.                                           
           02  FILLER REDEFINES EZAHLW5F.                                       
             03 EZAHLW5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLW5I  PIC X(1).                                              
           02  TBEITRL    COMP  PIC  S9(4).                                     
           02  TBEITRF    PICTURE X.                                            
           02  FILLER REDEFINES TBEITRF.                                        
             03 TBEITRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TBEITRI  PIC X(10).                                              
           02  EBEITRL    COMP  PIC  S9(4).                                     
           02  EBEITRF    PICTURE X.                                            
           02  FILLER REDEFINES EBEITRF.                                        
             03 EBEITRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBEITRI  PIC X(9).                                               
           02  EBEITR2L    COMP  PIC  S9(4).                                    
           02  EBEITR2F    PICTURE X.                                           
           02  FILLER REDEFINES EBEITR2F.                                       
             03 EBEITR2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBEITR2I  PIC X(9).                                              
           02  EBEITR3L    COMP  PIC  S9(4).                                    
           02  EBEITR3F    PICTURE X.                                           
           02  FILLER REDEFINES EBEITR3F.                                       
             03 EBEITR3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBEITR3I  PIC X(9).                                              
           02  EBEITR4L    COMP  PIC  S9(4).                                    
           02  EBEITR4F    PICTURE X.                                           
           02  FILLER REDEFINES EBEITR4F.                                       
             03 EBEITR4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBEITR4I  PIC X(9).                                              
           02  EBEITR5L    COMP  PIC  S9(4).                                    
           02  EBEITR5F    PICTURE X.                                           
           02  FILLER REDEFINES EBEITR5F.                                       
             03 EBEITR5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBEITR5I  PIC X(9).                                              
           02  TKTNRL    COMP  PIC  S9(4).                                      
           02  TKTNRF    PICTURE X.                                             
           02  FILLER REDEFINES TKTNRF.                                         
             03 TKTNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TKTNRI  PIC X(3).                                                
           02  EKTONRL    COMP  PIC  S9(4).                                     
           02  EKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES EKTONRF.                                        
             03 EKTONRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKTONRI  PIC X(12).                                              
           02  TBLZL    COMP  PIC  S9(4).                                       
           02  TBLZF    PICTURE X.                                              
           02  FILLER REDEFINES TBLZF.                                          
             03 TBLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TBLZI  PIC X(3).                                                 
           02  EBLZL    COMP  PIC  S9(4).                                       
           02  EBLZF    PICTURE X.                                              
           02  FILLER REDEFINES EBLZF.                                          
             03 EBLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EBLZI  PIC X(8).                                                 
           02  THANDJL    COMP  PIC  S9(4).                                     
           02  THANDJF    PICTURE X.                                            
           02  FILLER REDEFINES THANDJF.                                        
             03 THANDJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  THANDJI  PIC X(9).                                               
           02  EHANDJL    COMP  PIC  S9(4).                                     
           02  EHANDJF    PICTURE X.                                            
           02  FILLER REDEFINES EHANDJF.                                        
             03 EHANDJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EHANDJI  PIC X(1).                                               
           02  TBERPRL    COMP  PIC  S9(4).                                     
           02  TBERPRF    PICTURE X.                                            
           02  FILLER REDEFINES TBERPRF.                                        
             03 TBERPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TBERPRI  PIC X(11).                                              
           02  EBERPRL    COMP  PIC  S9(4).                                     
           02  EBERPRF    PICTURE X.                                            
           02  FILLER REDEFINES EBERPRF.                                        
             03 EBERPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBERPRI  PIC X(1).                                               
           02  THAND2L    COMP  PIC  S9(4).                                     
           02  THAND2F    PICTURE X.                                            
           02  FILLER REDEFINES THAND2F.                                        
             03 THAND2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  THAND2I  PIC X(6).                                               
           02  EHAND2L    COMP  PIC  S9(4).                                     
           02  EHAND2F    PICTURE X.                                            
           02  FILLER REDEFINES EHAND2F.                                        
             03 EHAND2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EHAND2I  PIC X(1).                                               
           02  TIBANL    COMP  PIC  S9(4).                                      
           02  TIBANF    PICTURE X.                                             
           02  FILLER REDEFINES TIBANF.                                         
             03 TIBANA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TIBANI  PIC X(4).                                                
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EIBANI  PIC X(34).                                               
           02  TBICL    COMP  PIC  S9(4).                                       
           02  TBICF    PICTURE X.                                              
           02  FILLER REDEFINES TBICF.                                          
             03 TBICA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TBICI  PIC X(3).                                                 
           02  EBICL    COMP  PIC  S9(4).                                       
           02  EBICF    PICTURE X.                                              
           02  FILLER REDEFINES EBICF.                                          
             03 EBICA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EBICI  PIC X(11).                                                
           02  TAMTKZL    COMP  PIC  S9(4).                                     
           02  TAMTKZF    PICTURE X.                                            
           02  FILLER REDEFINES TAMTKZF.                                        
             03 TAMTKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TAMTKZI  PIC X(7).                                               
           02  EAMTKZL    COMP  PIC  S9(4).                                     
           02  EAMTKZF    PICTURE X.                                            
           02  FILLER REDEFINES EAMTKZF.                                        
             03 EAMTKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAMTKZI  PIC X(11).                                              
           02  TANARTL    COMP  PIC  S9(4).                                     
           02  TANARTF    PICTURE X.                                            
           02  FILLER REDEFINES TANARTF.                                        
             03 TANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TANARTI  PIC X(10).                                              
           02  EANARTL    COMP  PIC  S9(4).                                     
           02  EANARTF    PICTURE X.                                            
           02  FILLER REDEFINES EANARTF.                                        
             03 EANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EANARTI  PIC X(1).                                               
           02  TKMBEGL    COMP  PIC  S9(4).                                     
           02  TKMBEGF    PICTURE X.                                            
           02  FILLER REDEFINES TKMBEGF.                                        
             03 TKMBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKMBEGI  PIC X(7).                                               
           02  EKMBEGL    COMP  PIC  S9(4).                                     
           02  EKMBEGF    PICTURE X.                                            
           02  FILLER REDEFINES EKMBEGF.                                        
             03 EKMBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKMBEGI  PIC X(6).                                               
           02  TKMJL    COMP  PIC  S9(4).                                       
           02  TKMJF    PICTURE X.                                              
           02  FILLER REDEFINES TKMJF.                                          
             03 TKMJA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TKMJI  PIC X(9).                                                 
           02  EKMJL    COMP  PIC  S9(4).                                       
           02  EKMJF    PICTURE X.                                              
           02  FILLER REDEFINES EKMJF.                                          
             03 EKMJA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EKMJI  PIC X(6).                                                 
           02  TFGNRL    COMP  PIC  S9(4).                                      
           02  TFGNRF    PICTURE X.                                             
           02  FILLER REDEFINES TFGNRF.                                         
             03 TFGNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TFGNRI  PIC X(10).                                               
           02  EFGNRL    COMP  PIC  S9(4).                                      
           02  EFGNRF    PICTURE X.                                             
           02  FILLER REDEFINES EFGNRF.                                         
             03 EFGNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFGNRI  PIC X(17).                                               
           02  TAUFNDL    COMP  PIC  S9(4).                                     
           02  TAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES TAUFNDF.                                        
             03 TAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TAUFNDI  PIC X(10).                                              
           02  EAUFNDL    COMP  PIC  S9(4).                                     
           02  EAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES EAUFNDF.                                        
             03 EAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAUFNDI  PIC X(6).                                               
           02  TPESTRL    COMP  PIC  S9(4).                                     
           02  TPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES TPESTRF.                                        
             03 TPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TPESTRI  PIC X(10).                                              
           02  EPESTRL    COMP  PIC  S9(4).                                     
           02  EPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES EPESTRF.                                        
             03 EPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPESTRI  PIC X(6).                                               
           02  TSTATIL    COMP  PIC  S9(4).                                     
           02  TSTATIF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATIF.                                        
             03 TSTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATII  PIC X(10).                                              
           02  ESTATIL    COMP  PIC  S9(4).                                     
           02  ESTATIF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATIF.                                        
             03 ESTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATII  PIC X(6).                                               
           02  TSTATUL    COMP  PIC  S9(4).                                     
           02  TSTATUF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATUF.                                        
             03 TSTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATUI  PIC X(2).                                               
           02  ESTATUL    COMP  PIC  S9(4).                                     
           02  ESTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATUF.                                        
             03 ESTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATUI  PIC X(2).                                               
           02  ASTATUL    COMP  PIC  S9(4).                                     
           02  ASTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ASTATUF.                                        
             03 ASTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASTATUI  PIC X(12).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0033O REDEFINES BAN0033I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBPRZH    PICTURE X.                                            
           02  AVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIRH    PICTURE X.                                              
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNAMEH    PICTURE X.                                           
           02  AVBNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVORSCH    PICTURE X.                                            
           02  TVORSCO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORSCH    PICTURE X.                                            
           02  AVORSCO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVMNRH    PICTURE X.                                             
           02  TVMNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNRH    PICTURE X.                                             
           02  AVMNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMPRZH    PICTURE X.                                            
           02  AVMPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNAMEH    PICTURE X.                                           
           02  AVMNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVBZEIH    PICTURE X.                                            
           02  TVBZEIO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBZEIH    PICTURE X.                                            
           02  AVBZEIO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPINH    PICTURE X.                                              
           02  TPINO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPIN81H    PICTURE X.                                            
           02  EPIN81O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPINPRH    PICTURE X.                                            
           02  EPINPRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPIN82H    PICTURE X.                                            
           02  EPIN82O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPINPR2H    PICTURE X.                                           
           02  EPINPR2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPIN83H    PICTURE X.                                            
           02  EPIN83O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPINPR3H    PICTURE X.                                           
           02  EPINPR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPIN84H    PICTURE X.                                            
           02  EPIN84O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPINPR4H    PICTURE X.                                           
           02  EPINPR4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPIN85H    PICTURE X.                                            
           02  EPIN85O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPINPR5H    PICTURE X.                                           
           02  EPINPR5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDNAMH    PICTURE X.                                            
           02  TKDNAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDNAMH    PICTURE X.                                            
           02  EKDNAMO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDVNAH    PICTURE X.                                            
           02  TKDVNAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDVNAH    PICTURE X.                                            
           02  EKDVNAO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPLZH    PICTURE X.                                              
           02  TPLZO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPLZH    PICTURE X.                                              
           02  EPLZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EKDORTH    PICTURE X.                                            
           02  EKDORTO  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUSLH    PICTURE X.                                             
           02  EAUSLO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVSNRH    PICTURE X.                                             
           02  TVSNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSNRH    PICTURE X.                                             
           02  AVSNRO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPRODH    PICTURE X.                                             
           02  TPRODO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD1H    PICTURE X.                                            
           02  EPROD1O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD2H    PICTURE X.                                            
           02  EPROD2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD3H    PICTURE X.                                            
           02  EPROD3O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD4H    PICTURE X.                                            
           02  EPROD4O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPROD5H    PICTURE X.                                            
           02  EPROD5O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEINHAH    PICTURE X.                                            
           02  TEINHAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINH1H    PICTURE X.                                            
           02  AEINH1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEINH2H    PICTURE X.                                            
           02  AEINH2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEINH3H    PICTURE X.                                            
           02  AEINH3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEINH4H    PICTURE X.                                            
           02  AEINH4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEINH5H    PICTURE X.                                            
           02  AEINH5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEINHEH    PICTURE X.                                            
           02  TEINHEO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEINH1H    PICTURE X.                                            
           02  EEINH1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH2H    PICTURE X.                                            
           02  EEINH2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH3H    PICTURE X.                                            
           02  EEINH3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH4H    PICTURE X.                                            
           02  EEINH4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINH5H    PICTURE X.                                            
           02  EEINH5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVEBEGH    PICTURE X.                                            
           02  TVEBEGO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEBEGH    PICTURE X.                                            
           02  EVEBEGO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVEBEG2H    PICTURE X.                                           
           02  EVEBEG2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEBEG3H    PICTURE X.                                           
           02  EVEBEG3O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEBEG4H    PICTURE X.                                           
           02  EVEBEG4O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEBEG5H    PICTURE X.                                           
           02  EVEBEG5O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVEENDH    PICTURE X.                                            
           02  TVEENDO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEENDH    PICTURE X.                                            
           02  EVEENDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVEEND2H    PICTURE X.                                           
           02  EVEEND2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEEND3H    PICTURE X.                                           
           02  EVEEND3O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEEND4H    PICTURE X.                                           
           02  EVEEND4O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEEND5H    PICTURE X.                                           
           02  EVEEND5O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZAHLWH    PICTURE X.                                            
           02  TZAHLWO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHLWH    PICTURE X.                                            
           02  EZAHLWO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EZAHLW2H    PICTURE X.                                           
           02  EZAHLW2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHLW3H    PICTURE X.                                           
           02  EZAHLW3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHLW4H    PICTURE X.                                           
           02  EZAHLW4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHLW5H    PICTURE X.                                           
           02  EZAHLW5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBEITRH    PICTURE X.                                            
           02  TBEITRO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBEITRH    PICTURE X.                                            
           02  EBEITRO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEITR2H    PICTURE X.                                           
           02  EBEITR2O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBEITR3H    PICTURE X.                                           
           02  EBEITR3O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBEITR4H    PICTURE X.                                           
           02  EBEITR4O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBEITR5H    PICTURE X.                                           
           02  EBEITR5O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKTNRH    PICTURE X.                                             
           02  TKTNRO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  EKTONRH    PICTURE X.                                            
           02  EKTONRO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBLZH    PICTURE X.                                              
           02  TBLZO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBLZH    PICTURE X.                                              
           02  EBLZO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  THANDJH    PICTURE X.                                            
           02  THANDJO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EHANDJH    PICTURE X.                                            
           02  EHANDJO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBERPRH    PICTURE X.                                            
           02  TBERPRO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBERPRH    PICTURE X.                                            
           02  EBERPRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  THAND2H    PICTURE X.                                            
           02  THAND2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EHAND2H    PICTURE X.                                            
           02  EHAND2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TIBANH    PICTURE X.                                             
           02  TIBANO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  EIBANH    PICTURE X.                                             
           02  EIBANO  PIC X(34).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBICH    PICTURE X.                                              
           02  TBICO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBICH    PICTURE X.                                              
           02  EBICO  PIC X(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAMTKZH    PICTURE X.                                            
           02  TAMTKZO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAMTKZH    PICTURE X.                                            
           02  EAMTKZO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  TANARTH    PICTURE X.                                            
           02  TANARTO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANARTH    PICTURE X.                                            
           02  EANARTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TKMBEGH    PICTURE X.                                            
           02  TKMBEGO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKMBEGH    PICTURE X.                                            
           02  EKMBEGO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TKMJH    PICTURE X.                                              
           02  TKMJO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EKMJH    PICTURE X.                                              
           02  EKMJO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TFGNRH    PICTURE X.                                             
           02  TFGNRO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFGNRH    PICTURE X.                                             
           02  EFGNRO  PIC X(17).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUFNDH    PICTURE X.                                            
           02  TAUFNDO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUFNDH    PICTURE X.                                            
           02  EAUFNDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPESTRH    PICTURE X.                                            
           02  TPESTRO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPESTRH    PICTURE X.                                            
           02  EPESTRO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATIH    PICTURE X.                                            
           02  TSTATIO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTATIH    PICTURE X.                                            
           02  ESTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATUH    PICTURE X.                                            
           02  TSTATUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATUH    PICTURE X.                                            
           02  ESTATUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTATUH    PICTURE X.                                            
           02  ASTATUO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
