       01  BAN0039I.                                                            
           02  FILLER PIC X(12).                                                
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(11).                                               
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AVBPRZL    COMP  PIC  S9(4).                                     
           02  AVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVBPRZF.                                        
             03 AVBPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBPRZI  PIC X(1).                                               
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADIRI  PIC X(3).                                                 
           02  AVBNAMEL    COMP  PIC  S9(4).                                    
           02  AVBNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAMEF.                                       
             03 AVBNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNAMEI  PIC X(20).                                             
           02  TVORSCL    COMP  PIC  S9(4).                                     
           02  TVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES TVORSCF.                                        
             03 TVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVORSCI  PIC X(8).                                               
           02  AVORSCL    COMP  PIC  S9(4).                                     
           02  AVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES AVORSCF.                                        
             03 AVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVORSCI  PIC X(16).                                              
           02  TVMNRL    COMP  PIC  S9(4).                                      
           02  TVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVMNRF.                                         
             03 TVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVMNRI  PIC X(11).                                               
           02  AVMNRL    COMP  PIC  S9(4).                                      
           02  AVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVMNRF.                                         
             03 AVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVMNRI  PIC X(7).                                                
           02  AVMPRZL    COMP  PIC  S9(4).                                     
           02  AVMPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVMPRZF.                                        
             03 AVMPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVMPRZI  PIC X(1).                                               
           02  AVMNAMEL    COMP  PIC  S9(4).                                    
           02  AVMNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVMNAMEF.                                       
             03 AVMNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVMNAMEI  PIC X(20).                                             
           02  TVBGWL    COMP  PIC  S9(4).                                      
           02  TVBGWF    PICTURE X.                                             
           02  FILLER REDEFINES TVBGWF.                                         
             03 TVBGWA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBGWI  PIC X(13).                                               
           02  AVBGWL    COMP  PIC  S9(4).                                      
           02  AVBGWF    PICTURE X.                                             
           02  FILLER REDEFINES AVBGWF.                                         
             03 AVBGWA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBGWI  PIC X(7).                                                
           02  TPINL    COMP  PIC  S9(4).                                       
           02  TPINF    PICTURE X.                                              
           02  FILLER REDEFINES TPINF.                                          
             03 TPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPINI  PIC X(10).                                                
           02  EPINL    COMP  PIC  S9(4).                                       
           02  EPINF    PICTURE X.                                              
           02  FILLER REDEFINES EPINF.                                          
             03 EPINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPINI  PIC X(7).                                                 
           02  EPINPRL    COMP  PIC  S9(4).                                     
           02  EPINPRF    PICTURE X.                                            
           02  FILLER REDEFINES EPINPRF.                                        
             03 EPINPRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPINPRI  PIC X(2).                                               
           02  TVSNRL    COMP  PIC  S9(4).                                      
           02  TVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVSNRF.                                         
             03 TVSNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVSNRI  PIC X(7).                                                
           02  AVSNRL    COMP  PIC  S9(4).                                      
           02  AVSNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVSNRF.                                         
             03 AVSNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVSNRI  PIC X(15).                                               
           02  AVBZNAML    COMP  PIC  S9(4).                                    
           02  AVBZNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVBZNAMF.                                       
             03 AVBZNAMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBZNAMI  PIC X(20).                                             
           02  TKDTITL    COMP  PIC  S9(4).                                     
           02  TKDTITF    PICTURE X.                                            
           02  FILLER REDEFINES TKDTITF.                                        
             03 TKDTITA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDTITI  PIC X(11).                                              
           02  EKDTITL    COMP  PIC  S9(4).                                     
           02  EKDTITF    PICTURE X.                                            
           02  FILLER REDEFINES EKDTITF.                                        
             03 EKDTITA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDTITI  PIC X(26).                                              
           02  TKDNAML    COMP  PIC  S9(4).                                     
           02  TKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES TKDNAMF.                                        
             03 TKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDNAMI  PIC X(10).                                              
           02  EKDNAML    COMP  PIC  S9(4).                                     
           02  EKDNAMF    PICTURE X.                                            
           02  FILLER REDEFINES EKDNAMF.                                        
             03 EKDNAMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDNAMI  PIC X(26).                                              
           02  TKDVNAL    COMP  PIC  S9(4).                                     
           02  TKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES TKDVNAF.                                        
             03 TKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDVNAI  PIC X(7).                                               
           02  EKDVNAL    COMP  PIC  S9(4).                                     
           02  EKDVNAF    PICTURE X.                                            
           02  FILLER REDEFINES EKDVNAF.                                        
             03 EKDVNAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDVNAI  PIC X(26).                                              
           02  TPLZL    COMP  PIC  S9(4).                                       
           02  TPLZF    PICTURE X.                                              
           02  FILLER REDEFINES TPLZF.                                          
             03 TPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPLZI  PIC X(10).                                                
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EAUSLI  PIC X(3).                                                
           02  EPLZL    COMP  PIC  S9(4).                                       
           02  EPLZF    PICTURE X.                                              
           02  FILLER REDEFINES EPLZF.                                          
             03 EPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPLZI  PIC X(5).                                                 
           02  EKDORTL    COMP  PIC  S9(4).                                     
           02  EKDORTF    PICTURE X.                                            
           02  FILLER REDEFINES EKDORTF.                                        
             03 EKDORTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDORTI  PIC X(26).                                              
           02  TKDSTRL    COMP  PIC  S9(4).                                     
           02  TKDSTRF    PICTURE X.                                            
           02  FILLER REDEFINES TKDSTRF.                                        
             03 TKDSTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDSTRI  PIC X(7).                                               
           02  EKDSTRL    COMP  PIC  S9(4).                                     
           02  EKDSTRF    PICTURE X.                                            
           02  FILLER REDEFINES EKDSTRF.                                        
             03 EKDSTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDSTRI  PIC X(26).                                              
           02  TKDSVNRL    COMP  PIC  S9(4).                                    
           02  TKDSVNRF    PICTURE X.                                           
           02  FILLER REDEFINES TKDSVNRF.                                       
             03 TKDSVNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TKDSVNRI  PIC X(11).                                             
           02  EKDSVNRL    COMP  PIC  S9(4).                                    
           02  EKDSVNRF    PICTURE X.                                           
           02  FILLER REDEFINES EKDSVNRF.                                       
             03 EKDSVNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKDSVNRI  PIC X(4).                                              
           02  TKDSTAAL    COMP  PIC  S9(4).                                    
           02  TKDSTAAF    PICTURE X.                                           
           02  FILLER REDEFINES TKDSTAAF.                                       
             03 TKDSTAAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TKDSTAAI  PIC X(10).                                             
           02  EKDSTAAL    COMP  PIC  S9(4).                                    
           02  EKDSTAAF    PICTURE X.                                           
           02  FILLER REDEFINES EKDSTAAF.                                       
             03 EKDSTAAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKDSTAAI  PIC X(3).                                              
           02  TKDBGRPL    COMP  PIC  S9(4).                                    
           02  TKDBGRPF    PICTURE X.                                           
           02  FILLER REDEFINES TKDBGRPF.                                       
             03 TKDBGRPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TKDBGRPI  PIC X(10).                                             
           02  EKDBGRPL    COMP  PIC  S9(4).                                    
           02  EKDBGRPF    PICTURE X.                                           
           02  FILLER REDEFINES EKDBGRPF.                                       
             03 EKDBGRPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKDBGRPI  PIC X(40).                                             
           02  TKDPEPL    COMP  PIC  S9(4).                                     
           02  TKDPEPF    PICTURE X.                                            
           02  FILLER REDEFINES TKDPEPF.                                        
             03 TKDPEPA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKDPEPI  PIC X(10).                                              
           02  EKDPEPL    COMP  PIC  S9(4).                                     
           02  EKDPEPF    PICTURE X.                                            
           02  FILLER REDEFINES EKDPEPF.                                        
             03 EKDPEPA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDPEPI  PIC X(1).                                               
           02  TKDBRANL    COMP  PIC  S9(4).                                    
           02  TKDBRANF    PICTURE X.                                           
           02  FILLER REDEFINES TKDBRANF.                                       
             03 TKDBRANA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TKDBRANI  PIC X(7).                                              
           02  EKDBRANL    COMP  PIC  S9(4).                                    
           02  EKDBRANF    PICTURE X.                                           
           02  FILLER REDEFINES EKDBRANF.                                       
             03 EKDBRANA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EKDBRANI  PIC X(40).                                             
           02  TTARIFL    COMP  PIC  S9(4).                                     
           02  TTARIFF    PICTURE X.                                            
           02  FILLER REDEFINES TTARIFF.                                        
             03 TTARIFA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TTARIFI  PIC X(25).                                              
           02  ETARIFL    COMP  PIC  S9(4).                                     
           02  ETARIFF    PICTURE X.                                            
           02  FILLER REDEFINES ETARIFF.                                        
             03 ETARIFA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ETARIFI  PIC X(15).                                              
           02  TFILL01L    COMP  PIC  S9(4).                                    
           02  TFILL01F    PICTURE X.                                           
           02  FILLER REDEFINES TFILL01F.                                       
             03 TFILL01A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TFILL01I  PIC X(1).                                              
           02  EPRODL    COMP  PIC  S9(4).                                      
           02  EPRODF    PICTURE X.                                             
           02  FILLER REDEFINES EPRODF.                                         
             03 EPRODA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EPRODI  PIC X(2).                                                
           02  EGEBURL    COMP  PIC  S9(4).                                     
           02  EGEBURF    PICTURE X.                                            
           02  FILLER REDEFINES EGEBURF.                                        
             03 EGEBURA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EGEBURI  PIC X(6).                                               
           02  ESUMMEL    COMP  PIC  S9(4).                                     
           02  ESUMMEF    PICTURE X.                                            
           02  FILLER REDEFINES ESUMMEF.                                        
             03 ESUMMEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESUMMEI  PIC X(9).                                               
           02  TVEBEGL    COMP  PIC  S9(4).                                     
           02  TVEBEGF    PICTURE X.                                            
           02  FILLER REDEFINES TVEBEGF.                                        
             03 TVEBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVEBEGI  PIC X(20).                                              
           02  EVEBEGL    COMP  PIC  S9(4).                                     
           02  EVEBEGF    PICTURE X.                                            
           02  FILLER REDEFINES EVEBEGF.                                        
             03 EVEBEGA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVEBEGI  PIC X(6).                                               
           02  EBZDAUL    COMP  PIC  S9(4).                                     
           02  EBZDAUF    PICTURE X.                                            
           02  FILLER REDEFINES EBZDAUF.                                        
             03 EBZDAUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBZDAUI  PIC X(2).                                               
           02  TDYNAJL    COMP  PIC  S9(4).                                     
           02  TDYNAJF    PICTURE X.                                            
           02  FILLER REDEFINES TDYNAJF.                                        
             03 TDYNAJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TDYNAJI  PIC X(20).                                              
           02  EDYNAJL    COMP  PIC  S9(4).                                     
           02  EDYNAJF    PICTURE X.                                            
           02  FILLER REDEFINES EDYNAJF.                                        
             03 EDYNAJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EDYNAJI  PIC X(1).                                               
           02  EBUZBJL    COMP  PIC  S9(4).                                     
           02  EBUZBJF    PICTURE X.                                            
           02  FILLER REDEFINES EBUZBJF.                                        
             03 EBUZBJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBUZBJI  PIC X(1).                                               
           02  EBUZRJL    COMP  PIC  S9(4).                                     
           02  EBUZRJF    PICTURE X.                                            
           02  FILLER REDEFINES EBUZRJF.                                        
             03 EBUZRJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBUZRJI  PIC X(1).                                               
           02  EPOJL    COMP  PIC  S9(4).                                       
           02  EPOJF    PICTURE X.                                              
           02  FILLER REDEFINES EPOJF.                                          
             03 EPOJA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPOJI  PIC X(1).                                                 
           02  EUZVEJL    COMP  PIC  S9(4).                                     
           02  EUZVEJF    PICTURE X.                                            
           02  FILLER REDEFINES EUZVEJF.                                        
             03 EUZVEJA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EUZVEJI  PIC X(1).                                               
           02  TBEITRL    COMP  PIC  S9(4).                                     
           02  TBEITRF    PICTURE X.                                            
           02  FILLER REDEFINES TBEITRF.                                        
             03 TBEITRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TBEITRI  PIC X(20).                                              
           02  EBEITRL    COMP  PIC  S9(4).                                     
           02  EBEITRF    PICTURE X.                                            
           02  FILLER REDEFINES EBEITRF.                                        
             03 EBEITRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBEITRI  PIC X(13).                                              
           02  EZAHLWL    COMP  PIC  S9(4).                                     
           02  EZAHLWF    PICTURE X.                                            
           02  FILLER REDEFINES EZAHLWF.                                        
             03 EZAHLWA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EZAHLWI  PIC X(1).                                               
           02  TSUMME2L    COMP  PIC  S9(4).                                    
           02  TSUMME2F    PICTURE X.                                           
           02  FILLER REDEFINES TSUMME2F.                                       
             03 TSUMME2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TSUMME2I  PIC X(19).                                             
           02  EBETR2L    COMP  PIC  S9(4).                                     
           02  EBETR2F    PICTURE X.                                            
           02  FILLER REDEFINES EBETR2F.                                        
             03 EBETR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBETR2I  PIC X(13).                                              
           02  TBEITR2L    COMP  PIC  S9(4).                                    
           02  TBEITR2F    PICTURE X.                                           
           02  FILLER REDEFINES TBEITR2F.                                       
             03 TBEITR2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TBEITR2I  PIC X(20).                                             
           02  EBETR1L    COMP  PIC  S9(4).                                     
           02  EBETR1F    PICTURE X.                                            
           02  FILLER REDEFINES EBETR1F.                                        
             03 EBETR1A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBETR1I  PIC X(13).                                              
           02  TEINHL    COMP  PIC  S9(4).                                      
           02  TEINHF    PICTURE X.                                             
           02  FILLER REDEFINES TEINHF.                                         
             03 TEINHA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TEINHI  PIC X(9).                                                
           02  AEINHL    COMP  PIC  S9(4).                                      
           02  AEINHF    PICTURE X.                                             
           02  FILLER REDEFINES AEINHF.                                         
             03 AEINHA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AEINHI  PIC X(11).                                               
           02  EEINHL    COMP  PIC  S9(4).                                      
           02  EEINHF    PICTURE X.                                             
           02  FILLER REDEFINES EEINHF.                                         
             03 EEINHA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EEINHI  PIC X(11).                                               
           02  TKNRBLZL    COMP  PIC  S9(4).                                    
           02  TKNRBLZF    PICTURE X.                                           
           02  FILLER REDEFINES TKNRBLZF.                                       
             03 TKNRBLZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TKNRBLZI  PIC X(20).                                             
           02  EKDKNRL    COMP  PIC  S9(4).                                     
           02  EKDKNRF    PICTURE X.                                            
           02  FILLER REDEFINES EKDKNRF.                                        
             03 EKDKNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDKNRI  PIC X(15).                                              
           02  EKDBLZL    COMP  PIC  S9(4).                                     
           02  EKDBLZF    PICTURE X.                                            
           02  FILLER REDEFINES EKDBLZF.                                        
             03 EKDBLZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKDBLZI  PIC X(15).                                              
           02  TIBANL    COMP  PIC  S9(4).                                      
           02  TIBANF    PICTURE X.                                             
           02  FILLER REDEFINES TIBANF.                                         
             03 TIBANA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TIBANI  PIC X(4).                                                
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EIBANI  PIC X(34).                                               
           02  TANARTL    COMP  PIC  S9(4).                                     
           02  TANARTF    PICTURE X.                                            
           02  FILLER REDEFINES TANARTF.                                        
             03 TANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TANARTI  PIC X(7).                                               
           02  EANARTL    COMP  PIC  S9(4).                                     
           02  EANARTF    PICTURE X.                                            
           02  FILLER REDEFINES EANARTF.                                        
             03 EANARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EANARTI  PIC X(1).                                               
           02  TAUFNDL    COMP  PIC  S9(4).                                     
           02  TAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES TAUFNDF.                                        
             03 TAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TAUFNDI  PIC X(6).                                               
           02  EAUFNDL    COMP  PIC  S9(4).                                     
           02  EAUFNDF    PICTURE X.                                            
           02  FILLER REDEFINES EAUFNDF.                                        
             03 EAUFNDA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EAUFNDI  PIC X(6).                                               
           02  TPESTRL    COMP  PIC  S9(4).                                     
           02  TPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES TPESTRF.                                        
             03 TPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TPESTRI  PIC X(6).                                               
           02  EPESTRL    COMP  PIC  S9(4).                                     
           02  EPESTRF    PICTURE X.                                            
           02  FILLER REDEFINES EPESTRF.                                        
             03 EPESTRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EPESTRI  PIC X(6).                                               
           02  TSTATIL    COMP  PIC  S9(4).                                     
           02  TSTATIF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATIF.                                        
             03 TSTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATII  PIC X(6).                                               
           02  ESTATIL    COMP  PIC  S9(4).                                     
           02  ESTATIF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATIF.                                        
             03 ESTATIA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATII  PIC X(6).                                               
           02  TSTATUL    COMP  PIC  S9(4).                                     
           02  TSTATUF    PICTURE X.                                            
           02  FILLER REDEFINES TSTATUF.                                        
             03 TSTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TSTATUI  PIC X(6).                                               
           02  ESTATUL    COMP  PIC  S9(4).                                     
           02  ESTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ESTATUF.                                        
             03 ESTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTATUI  PIC X(2).                                               
           02  ASTATUL    COMP  PIC  S9(4).                                     
           02  ASTATUF    PICTURE X.                                            
           02  FILLER REDEFINES ASTATUF.                                        
             03 ASTATUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASTATUI  PIC X(12).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0039O REDEFINES BAN0039I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBPRZH    PICTURE X.                                            
           02  AVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIRH    PICTURE X.                                              
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNAMEH    PICTURE X.                                           
           02  AVBNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVORSCH    PICTURE X.                                            
           02  TVORSCO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORSCH    PICTURE X.                                            
           02  AVORSCO  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVMNRH    PICTURE X.                                             
           02  TVMNRO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNRH    PICTURE X.                                             
           02  AVMNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMPRZH    PICTURE X.                                            
           02  AVMPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNAMEH    PICTURE X.                                           
           02  AVMNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVBGWH    PICTURE X.                                             
           02  TVBGWO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBGWH    PICTURE X.                                             
           02  AVBGWO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPINH    PICTURE X.                                              
           02  TPINO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPINH    PICTURE X.                                              
           02  EPINO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EPINPRH    PICTURE X.                                            
           02  EPINPRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVSNRH    PICTURE X.                                             
           02  TVSNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSNRH    PICTURE X.                                             
           02  AVSNRO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBZNAMH    PICTURE X.                                           
           02  AVBZNAMO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TKDTITH    PICTURE X.                                            
           02  TKDTITO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDTITH    PICTURE X.                                            
           02  EKDTITO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDNAMH    PICTURE X.                                            
           02  TKDNAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDNAMH    PICTURE X.                                            
           02  EKDNAMO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDVNAH    PICTURE X.                                            
           02  TKDVNAO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKDVNAH    PICTURE X.                                            
           02  EKDVNAO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPLZH    PICTURE X.                                              
           02  TPLZO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAUSLH    PICTURE X.                                             
           02  EAUSLO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPLZH    PICTURE X.                                              
           02  EPLZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EKDORTH    PICTURE X.                                            
           02  EKDORTO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDSTRH    PICTURE X.                                            
           02  TKDSTRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKDSTRH    PICTURE X.                                            
           02  EKDSTRO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDSVNRH    PICTURE X.                                           
           02  TKDSVNRO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKDSVNRH    PICTURE X.                                           
           02  EKDSVNRO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDSTAAH    PICTURE X.                                           
           02  TKDSTAAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKDSTAAH    PICTURE X.                                           
           02  EKDSTAAO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKDBGRPH    PICTURE X.                                           
           02  TKDBGRPO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKDBGRPH    PICTURE X.                                           
           02  EKDBGRPO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  TKDPEPH    PICTURE X.                                            
           02  TKDPEPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDPEPH    PICTURE X.                                            
           02  EKDPEPO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TKDBRANH    PICTURE X.                                           
           02  TKDBRANO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDBRANH    PICTURE X.                                           
           02  EKDBRANO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  TTARIFH    PICTURE X.                                            
           02  TTARIFO  PIC X(25).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETARIFH    PICTURE X.                                            
           02  ETARIFO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  TFILL01H    PICTURE X.                                           
           02  TFILL01O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRODH    PICTURE X.                                             
           02  EPRODO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGEBURH    PICTURE X.                                            
           02  EGEBURO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESUMMEH    PICTURE X.                                            
           02  ESUMMEO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVEBEGH    PICTURE X.                                            
           02  TVEBEGO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVEBEGH    PICTURE X.                                            
           02  EVEBEGO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBZDAUH    PICTURE X.                                            
           02  EBZDAUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TDYNAJH    PICTURE X.                                            
           02  TDYNAJO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDYNAJH    PICTURE X.                                            
           02  EDYNAJO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBUZBJH    PICTURE X.                                            
           02  EBUZBJO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBUZRJH    PICTURE X.                                            
           02  EBUZRJO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPOJH    PICTURE X.                                              
           02  EPOJO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EUZVEJH    PICTURE X.                                            
           02  EUZVEJO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBEITRH    PICTURE X.                                            
           02  TBEITRO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBEITRH    PICTURE X.                                            
           02  EBEITRO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHLWH    PICTURE X.                                            
           02  EZAHLWO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSUMME2H    PICTURE X.                                           
           02  TSUMME2O  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETR2H    PICTURE X.                                            
           02  EBETR2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBEITR2H    PICTURE X.                                           
           02  TBEITR2O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETR1H    PICTURE X.                                            
           02  EBETR1O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEINHH    PICTURE X.                                             
           02  TEINHO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AEINHH    PICTURE X.                                             
           02  AEINHO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINHH    PICTURE X.                                             
           02  EEINHO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  TKNRBLZH    PICTURE X.                                           
           02  TKNRBLZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKDKNRH    PICTURE X.                                            
           02  EKDKNRO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKDBLZH    PICTURE X.                                            
           02  EKDBLZO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  TIBANH    PICTURE X.                                             
           02  TIBANO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  EIBANH    PICTURE X.                                             
           02  EIBANO  PIC X(34).                                               
           02  FILLER PICTURE X(3).                                             
           02  TANARTH    PICTURE X.                                            
           02  TANARTO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EANARTH    PICTURE X.                                            
           02  EANARTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAUFNDH    PICTURE X.                                            
           02  TAUFNDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUFNDH    PICTURE X.                                            
           02  EAUFNDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPESTRH    PICTURE X.                                            
           02  TPESTRO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EPESTRH    PICTURE X.                                            
           02  EPESTRO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATIH    PICTURE X.                                            
           02  TSTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATIH    PICTURE X.                                            
           02  ESTATIO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTATUH    PICTURE X.                                            
           02  TSTATUO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTATUH    PICTURE X.                                            
           02  ESTATUO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTATUH    PICTURE X.                                            
           02  ASTATUO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
