       01  BAN0049I.                                                            
           02  FILLER PIC X(12).                                                
           02  TVBNRL    COMP  PIC  S9(4).                                      
           02  TVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVBNRF.                                         
             03 TVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVBNRI  PIC X(2).                                                
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AVBPRZL    COMP  PIC  S9(4).                                     
           02  AVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVBPRZF.                                        
             03 AVBPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBPRZI  PIC X(1).                                               
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADIRI  PIC X(3).                                                 
           02  AVBNAMEL    COMP  PIC  S9(4).                                    
           02  AVBNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAMEF.                                       
             03 AVBNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNAMEI  PIC X(20).                                             
           02  TVMNRL    COMP  PIC  S9(4).                                      
           02  TVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES TVMNRF.                                         
             03 TVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TVMNRI  PIC X(2).                                                
           02  AVMNRL    COMP  PIC  S9(4).                                      
           02  AVMNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVMNRF.                                         
             03 AVMNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVMNRI  PIC X(7).                                                
           02  AVMPRZL    COMP  PIC  S9(4).                                     
           02  AVMPRZF    PICTURE X.                                            
           02  FILLER REDEFINES AVMPRZF.                                        
             03 AVMPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVMPRZI  PIC X(1).                                               
           02  AVMNAMEL    COMP  PIC  S9(4).                                    
           02  AVMNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AVMNAMEF.                                       
             03 AVMNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVMNAMEI  PIC X(20).                                             
           02  TVORSCL    COMP  PIC  S9(4).                                     
           02  TVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES TVORSCF.                                        
             03 TVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TVORSCI  PIC X(7).                                               
           02  AVORSCL    COMP  PIC  S9(4).                                     
           02  AVORSCF    PICTURE X.                                            
           02  FILLER REDEFINES AVORSCF.                                        
             03 AVORSCA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVORSCI  PIC X(17).                                              
           02  TVNRL    COMP  PIC  S9(4).                                       
           02  TVNRF    PICTURE X.                                              
           02  FILLER REDEFINES TVNRF.                                          
             03 TVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TVNRI  PIC X(11).                                                
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EVNRPZL    COMP  PIC  S9(4).                                     
           02  EVNRPZF    PICTURE X.                                            
           02  FILLER REDEFINES EVNRPZF.                                        
             03 EVNRPZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVNRPZI  PIC X(2).                                               
           02  TR-FORML    COMP  PIC  S9(4).                                    
           02  TR-FORMF    PICTURE X.                                           
           02  FILLER REDEFINES TR-FORMF.                                       
             03 TR-FORMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TR-FORMI  PIC X(17).                                             
           02  ER-FORML    COMP  PIC  S9(4).                                    
           02  ER-FORMF    PICTURE X.                                           
           02  FILLER REDEFINES ER-FORMF.                                       
             03 ER-FORMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ER-FORMI  PIC X(3).                                              
           02  TFNLANGL    COMP  PIC  S9(4).                                    
           02  TFNLANGF    PICTURE X.                                           
           02  FILLER REDEFINES TFNLANGF.                                       
             03 TFNLANGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TFNLANGI  PIC X(7).                                              
           02  EFNLANGL    COMP  PIC  S9(4).                                    
           02  EFNLANGF    PICTURE X.                                           
           02  FILLER REDEFINES EFNLANGF.                                       
             03 EFNLANGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFNLANGI  PIC X(70).                                             
           02  TSTRL    COMP  PIC  S9(4).                                       
           02  TSTRF    PICTURE X.                                              
           02  FILLER REDEFINES TSTRF.                                          
             03 TSTRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TSTRI  PIC X(9).                                                 
           02  ESTRL    COMP  PIC  S9(4).                                       
           02  ESTRF    PICTURE X.                                              
           02  FILLER REDEFINES ESTRF.                                          
             03 ESTRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ESTRI  PIC X(45).                                                
           02  TPLZL    COMP  PIC  S9(4).                                       
           02  TPLZF    PICTURE X.                                              
           02  FILLER REDEFINES TPLZF.                                          
             03 TPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TPLZI  PIC X(6).                                                 
           02  EFAPLZL    COMP  PIC  S9(4).                                     
           02  EFAPLZF    PICTURE X.                                            
           02  FILLER REDEFINES EFAPLZF.                                        
             03 EFAPLZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFAPLZI  PIC X(5).                                               
           02  TORTL    COMP  PIC  S9(4).                                       
           02  TORTF    PICTURE X.                                              
           02  FILLER REDEFINES TORTF.                                          
             03 TORTA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TORTI  PIC X(6).                                                 
           02  EFAORTL    COMP  PIC  S9(4).                                     
           02  EFAORTF    PICTURE X.                                            
           02  FILLER REDEFINES EFAORTF.                                        
             03 EFAORTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFAORTI  PIC X(50).                                              
           02  TPOSTFL    COMP  PIC  S9(4).                                     
           02  TPOSTFF    PICTURE X.                                            
           02  FILLER REDEFINES TPOSTFF.                                        
             03 TPOSTFA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TPOSTFI  PIC X(11).                                              
           02  EPOSTFNL    COMP  PIC  S9(4).                                    
           02  EPOSTFNF    PICTURE X.                                           
           02  FILLER REDEFINES EPOSTFNF.                                       
             03 EPOSTFNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPOSTFNI  PIC X(10).                                             
           02  TPOSTFPL    COMP  PIC  S9(4).                                    
           02  TPOSTFPF    PICTURE X.                                           
           02  FILLER REDEFINES TPOSTFPF.                                       
             03 TPOSTFPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TPOSTFPI  PIC X(12).                                             
           02  EPOSTFPL    COMP  PIC  S9(4).                                    
           02  EPOSTFPF    PICTURE X.                                           
           02  FILLER REDEFINES EPOSTFPF.                                       
             03 EPOSTFPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPOSTFPI  PIC X(5).                                              
           02  TPOSTFOL    COMP  PIC  S9(4).                                    
           02  TPOSTFOF    PICTURE X.                                           
           02  FILLER REDEFINES TPOSTFOF.                                       
             03 TPOSTFOA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TPOSTFOI  PIC X(12).                                             
           02  EPOSTFOL    COMP  PIC  S9(4).                                    
           02  EPOSTFOF    PICTURE X.                                           
           02  FILLER REDEFINES EPOSTFOF.                                       
             03 EPOSTFOA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPOSTFOI  PIC X(40).                                             
           02  TTELEL    COMP  PIC  S9(4).                                      
           02  TTELEF    PICTURE X.                                             
           02  FILLER REDEFINES TTELEF.                                         
             03 TTELEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TTELEI  PIC X(8).                                                
           02  ETELEL    COMP  PIC  S9(4).                                      
           02  ETELEF    PICTURE X.                                             
           02  FILLER REDEFINES ETELEF.                                         
             03 ETELEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ETELEI  PIC X(30).                                               
           02  TFAXL    COMP  PIC  S9(4).                                       
           02  TFAXF    PICTURE X.                                              
           02  FILLER REDEFINES TFAXF.                                          
             03 TFAXA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  TFAXI  PIC X(4).                                                 
           02  EFAXL    COMP  PIC  S9(4).                                       
           02  EFAXF    PICTURE X.                                              
           02  FILLER REDEFINES EFAXF.                                          
             03 EFAXA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFAXI  PIC X(30).                                                
           02  TMOBILL    COMP  PIC  S9(4).                                     
           02  TMOBILF    PICTURE X.                                            
           02  FILLER REDEFINES TMOBILF.                                        
             03 TMOBILA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TMOBILI  PIC X(6).                                               
           02  EMOBILL    COMP  PIC  S9(4).                                     
           02  EMOBILF    PICTURE X.                                            
           02  FILLER REDEFINES EMOBILF.                                        
             03 EMOBILA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EMOBILI  PIC X(30).                                              
           02  T-EMAILL    COMP  PIC  S9(4).                                    
           02  T-EMAILF    PICTURE X.                                           
           02  FILLER REDEFINES T-EMAILF.                                       
             03 T-EMAILA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  T-EMAILI  PIC X(7).                                              
           02  EEMAILL    COMP  PIC  S9(4).                                     
           02  EEMAILF    PICTURE X.                                            
           02  FILLER REDEFINES EEMAILF.                                        
             03 EEMAILA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEMAILI  PIC X(50).                                              
           02  TAMTGL    COMP  PIC  S9(4).                                      
           02  TAMTGF    PICTURE X.                                             
           02  FILLER REDEFINES TAMTGF.                                         
             03 TAMTGA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  TAMTGI  PIC X(12).                                               
           02  EAMTGL    COMP  PIC  S9(4).                                      
           02  EAMTGF    PICTURE X.                                             
           02  FILLER REDEFINES EAMTGF.                                         
             03 EAMTGA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EAMTGI  PIC X(50).                                               
           02  THREGNRL    COMP  PIC  S9(4).                                    
           02  THREGNRF    PICTURE X.                                           
           02  FILLER REDEFINES THREGNRF.                                       
             03 THREGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  THREGNRI  PIC X(19).                                             
           02  EHREGNRL    COMP  PIC  S9(4).                                    
           02  EHREGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EHREGNRF.                                       
             03 EHREGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EHREGNRI  PIC X(30).                                             
           02  TUST-IDL    COMP  PIC  S9(4).                                    
           02  TUST-IDF    PICTURE X.                                           
           02  FILLER REDEFINES TUST-IDF.                                       
             03 TUST-IDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  TUST-IDI  PIC X(11).                                             
           02  EUST-IDL    COMP  PIC  S9(4).                                    
           02  EUST-IDF    PICTURE X.                                           
           02  FILLER REDEFINES EUST-IDF.                                       
             03 EUST-IDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EUST-IDI  PIC X(15).                                             
           02  TKZVSTL    COMP  PIC  S9(4).                                     
           02  TKZVSTF    PICTURE X.                                            
           02  FILLER REDEFINES TKZVSTF.                                        
             03 TKZVSTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  TKZVSTI  PIC X(26).                                              
           02  EKZVSTL    COMP  PIC  S9(4).                                     
           02  EKZVSTF    PICTURE X.                                            
           02  FILLER REDEFINES EKZVSTF.                                        
             03 EKZVSTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKZVSTI  PIC X(1).                                               
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BAN0049O REDEFINES BAN0049I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVBNRH    PICTURE X.                                             
           02  TVBNRO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBPRZH    PICTURE X.                                            
           02  AVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIRH    PICTURE X.                                              
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNAMEH    PICTURE X.                                           
           02  AVBNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVMNRH    PICTURE X.                                             
           02  TVMNRO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMNRH    PICTURE X.                                             
           02  AVMNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVMPRZH    PICTURE X.                                            
           02  AVMPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVMNAMEH    PICTURE X.                                           
           02  AVMNAMEO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVORSCH    PICTURE X.                                            
           02  TVORSCO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORSCH    PICTURE X.                                            
           02  AVORSCO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNRH    PICTURE X.                                              
           02  TVNRO  PIC X(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVNRPZH    PICTURE X.                                            
           02  EVNRPZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TR-FORMH    PICTURE X.                                           
           02  TR-FORMO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  ER-FORMH    PICTURE X.                                           
           02  ER-FORMO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TFNLANGH    PICTURE X.                                           
           02  TFNLANGO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFNLANGH    PICTURE X.                                           
           02  EFNLANGO  PIC X(70).                                             
           02  FILLER PICTURE X(3).                                             
           02  TSTRH    PICTURE X.                                              
           02  TSTRO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESTRH    PICTURE X.                                              
           02  ESTRO  PIC X(45).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPLZH    PICTURE X.                                              
           02  TPLZO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EFAPLZH    PICTURE X.                                            
           02  EFAPLZO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  TORTH    PICTURE X.                                              
           02  TORTO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EFAORTH    PICTURE X.                                            
           02  EFAORTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPOSTFH    PICTURE X.                                            
           02  TPOSTFO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPOSTFNH    PICTURE X.                                           
           02  EPOSTFNO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  TPOSTFPH    PICTURE X.                                           
           02  TPOSTFPO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPOSTFPH    PICTURE X.                                           
           02  EPOSTFPO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPOSTFOH    PICTURE X.                                           
           02  TPOSTFOO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPOSTFOH    PICTURE X.                                           
           02  EPOSTFOO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  TTELEH    PICTURE X.                                             
           02  TTELEO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  ETELEH    PICTURE X.                                             
           02  ETELEO  PIC X(30).                                               
           02  FILLER PICTURE X(3).                                             
           02  TFAXH    PICTURE X.                                              
           02  TFAXO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EFAXH    PICTURE X.                                              
           02  EFAXO  PIC X(30).                                                
           02  FILLER PICTURE X(3).                                             
           02  TMOBILH    PICTURE X.                                            
           02  TMOBILO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EMOBILH    PICTURE X.                                            
           02  EMOBILO  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  T-EMAILH    PICTURE X.                                           
           02  T-EMAILO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEMAILH    PICTURE X.                                            
           02  EEMAILO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAMTGH    PICTURE X.                                             
           02  TAMTGO  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAMTGH    PICTURE X.                                             
           02  EAMTGO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  THREGNRH    PICTURE X.                                           
           02  THREGNRO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  EHREGNRH    PICTURE X.                                           
           02  EHREGNRO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  TUST-IDH    PICTURE X.                                           
           02  TUST-IDO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  EUST-IDH    PICTURE X.                                           
           02  EUST-IDO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  TKZVSTH    PICTURE X.                                            
           02  TKZVSTO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKZVSTH    PICTURE X.                                            
           02  EKZVSTO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
