       01  BAT0029I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGSNRL    COMP  PIC  S9(4).                                      
           02  AGSNRF    PICTURE X.                                             
           02  FILLER REDEFINES AGSNRF.                                         
             03 AGSNRA    PICTURE X.                                            
           02  AGSNRI  PIC X(3).                                                
           02  AFCSL    COMP  PIC  S9(4).                                       
           02  AFCSF    PICTURE X.                                              
           02  FILLER REDEFINES AFCSF.                                          
             03 AFCSA    PICTURE X.                                             
           02  AFCSI  PIC X(5).                                                 
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  EFCSI  PIC X(1).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  AFCSANZI  PIC X(30).                                             
           02  AGSLBSL    COMP  PIC  S9(4).                                     
           02  AGSLBSF    PICTURE X.                                            
           02  FILLER REDEFINES AGSLBSF.                                        
             03 AGSLBSA    PICTURE X.                                           
           02  AGSLBSI  PIC X(1).                                               
           02  EGSLBZL    COMP  PIC  S9(4).                                     
           02  EGSLBZF    PICTURE X.                                            
           02  FILLER REDEFINES EGSLBZF.                                        
             03 EGSLBZA    PICTURE X.                                           
           02  EGSLBZI  PIC X(40).                                              
           02  AGSKBSL    COMP  PIC  S9(4).                                     
           02  AGSKBSF    PICTURE X.                                            
           02  FILLER REDEFINES AGSKBSF.                                        
             03 AGSKBSA    PICTURE X.                                           
           02  AGSKBSI  PIC X(1).                                               
           02  EGSKBZL    COMP  PIC  S9(4).                                     
           02  EGSKBZF    PICTURE X.                                            
           02  FILLER REDEFINES EGSKBZF.                                        
             03 EGSKBZA    PICTURE X.                                           
           02  EGSKBZI  PIC X(10).                                              
           02  AUPDFBL    COMP  PIC  S9(4).                                     
           02  AUPDFBF    PICTURE X.                                            
           02  FILLER REDEFINES AUPDFBF.                                        
             03 AUPDFBA    PICTURE X.                                           
           02  AUPDFBI  PIC X(22).                                              
           02  AUPDDAL    COMP  PIC  S9(4).                                     
           02  AUPDDAF    PICTURE X.                                            
           02  FILLER REDEFINES AUPDDAF.                                        
             03 AUPDDAA    PICTURE X.                                           
           02  AUPDDAI  PIC X(10).                                              
           02  AGSKB4SL    COMP  PIC  S9(4).                                    
           02  AGSKB4SF    PICTURE X.                                           
           02  FILLER REDEFINES AGSKB4SF.                                       
             03 AGSKB4SA    PICTURE X.                                          
           02  AGSKB4SI  PIC X(1).                                              
           02  EGSKBZ4L    COMP  PIC  S9(4).                                    
           02  EGSKBZ4F    PICTURE X.                                           
           02  FILLER REDEFINES EGSKBZ4F.                                       
             03 EGSKBZ4A    PICTURE X.                                          
           02  EGSKBZ4I  PIC X(4).                                              
           02  AUPDIFBL    COMP  PIC  S9(4).                                    
           02  AUPDIFBF    PICTURE X.                                           
           02  FILLER REDEFINES AUPDIFBF.                                       
             03 AUPDIFBA    PICTURE X.                                          
           02  AUPDIFBI  PIC X(4).                                              
           02  AUPDUIDL    COMP  PIC  S9(4).                                    
           02  AUPDUIDF    PICTURE X.                                           
           02  FILLER REDEFINES AUPDUIDF.                                       
             03 AUPDUIDA    PICTURE X.                                          
           02  AUPDUIDI  PIC X(8).                                              
           02  AAUSLSL    COMP  PIC  S9(4).                                     
           02  AAUSLSF    PICTURE X.                                            
           02  FILLER REDEFINES AAUSLSF.                                        
             03 AAUSLSA    PICTURE X.                                           
           02  AAUSLSI  PIC X(1).                                               
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  EAUSLI  PIC X(2).                                                
           02  AALBEZL    COMP  PIC  S9(4).                                     
           02  AALBEZF    PICTURE X.                                            
           02  FILLER REDEFINES AALBEZF.                                        
             03 AALBEZA    PICTURE X.                                           
           02  AALBEZI  PIC X(4).                                               
           02  ABEWSL    COMP  PIC  S9(4).                                      
           02  ABEWSF    PICTURE X.                                             
           02  FILLER REDEFINES ABEWSF.                                         
             03 ABEWSA    PICTURE X.                                            
           02  ABEWSI  PIC X(1).                                                
           02  EBEWL    COMP  PIC  S9(4).                                       
           02  EBEWF    PICTURE X.                                              
           02  FILLER REDEFINES EBEWF.                                          
             03 EBEWA    PICTURE X.                                             
           02  EBEWI  PIC X(2).                                                 
           02  ABEWBEZL    COMP  PIC  S9(4).                                    
           02  ABEWBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ABEWBEZF.                                       
             03 ABEWBEZA    PICTURE X.                                          
           02  ABEWBEZI  PIC X(10).                                             
           02  AWAEHRSL    COMP  PIC  S9(4).                                    
           02  AWAEHRSF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEHRSF.                                       
             03 AWAEHRSA    PICTURE X.                                          
           02  AWAEHRSI  PIC X(1).                                              
           02  EWAEHRL    COMP  PIC  S9(4).                                     
           02  EWAEHRF    PICTURE X.                                            
           02  FILLER REDEFINES EWAEHRF.                                        
             03 EWAEHRA    PICTURE X.                                           
           02  EWAEHRI  PIC X(2).                                               
           02  AWAEBEZL    COMP  PIC  S9(4).                                    
           02  AWAEBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEBEZF.                                       
             03 AWAEBEZA    PICTURE X.                                          
           02  AWAEBEZI  PIC X(10).                                             
           02  AEXPORSL    COMP  PIC  S9(4).                                    
           02  AEXPORSF    PICTURE X.                                           
           02  FILLER REDEFINES AEXPORSF.                                       
             03 AEXPORSA    PICTURE X.                                          
           02  AEXPORSI  PIC X(1).                                              
           02  EEXPORTL    COMP  PIC  S9(4).                                    
           02  EEXPORTF    PICTURE X.                                           
           02  FILLER REDEFINES EEXPORTF.                                       
             03 EEXPORTA    PICTURE X.                                          
           02  EEXPORTI  PIC X(2).                                              
           02  AEXPBEZL    COMP  PIC  S9(4).                                    
           02  AEXPBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AEXPBEZF.                                       
             03 AEXPBEZA    PICTURE X.                                          
           02  AEXPBEZI  PIC X(10).                                             
           02  AVTGESSL    COMP  PIC  S9(4).                                    
           02  AVTGESSF    PICTURE X.                                           
           02  FILLER REDEFINES AVTGESSF.                                       
             03 AVTGESSA    PICTURE X.                                          
           02  AVTGESSI  PIC X(1).                                              
           02  EVTGESL    COMP  PIC  S9(4).                                     
           02  EVTGESF    PICTURE X.                                            
           02  FILLER REDEFINES EVTGESF.                                        
             03 EVTGESA    PICTURE X.                                           
           02  EVTGESI  PIC X(2).                                               
           02  AVTGBEZL    COMP  PIC  S9(4).                                    
           02  AVTGBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AVTGBEZF.                                       
             03 AVTGBEZA    PICTURE X.                                          
           02  AVTGBEZI  PIC X(10).                                             
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  EFCI  PIC X(1).                                                  
           02  AAENDKZL    COMP  PIC  S9(4).                                    
           02  AAENDKZF    PICTURE X.                                           
           02  FILLER REDEFINES AAENDKZF.                                       
             03 AAENDKZA    PICTURE X.                                          
           02  AAENDKZI  PIC X(1).                                              
           02  EMANDANL    COMP  PIC  S9(4).                                    
           02  EMANDANF    PICTURE X.                                           
           02  FILLER REDEFINES EMANDANF.                                       
             03 EMANDANA    PICTURE X.                                          
           02  EMANDANI  PIC X(2).                                              
           02  AMANBZL    COMP  PIC  S9(4).                                     
           02  AMANBZF    PICTURE X.                                            
           02  FILLER REDEFINES AMANBZF.                                        
             03 AMANBZA    PICTURE X.                                           
           02  AMANBZI  PIC X(10).                                              
           02  EKONTOL    COMP  PIC  S9(4).                                     
           02  EKONTOF    PICTURE X.                                            
           02  FILLER REDEFINES EKONTOF.                                        
             03 EKONTOA    PICTURE X.                                           
           02  EKONTOI  PIC X(10).                                              
           02  EGKOEINL    COMP  PIC  S9(4).                                    
           02  EGKOEINF    PICTURE X.                                           
           02  FILLER REDEFINES EGKOEINF.                                       
             03 EGKOEINA    PICTURE X.                                          
           02  EGKOEINI  PIC X(3).                                              
           02  EGKOAUSL    COMP  PIC  S9(4).                                    
           02  EGKOAUSF    PICTURE X.                                           
           02  FILLER REDEFINES EGKOAUSF.                                       
             03 EGKOAUSA    PICTURE X.                                          
           02  EGKOAUSI  PIC X(3).                                              
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  EFC2I  PIC X(1).                                                 
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  F000006I  PIC X(1).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  F000005I  PIC X(2).                                              
           02  AMANBZ2L    COMP  PIC  S9(4).                                    
           02  AMANBZ2F    PICTURE X.                                           
           02  FILLER REDEFINES AMANBZ2F.                                       
             03 AMANBZ2A    PICTURE X.                                          
           02  AMANBZ2I  PIC X(10).                                             
           02  EKONTO2L    COMP  PIC  S9(4).                                    
           02  EKONTO2F    PICTURE X.                                           
           02  FILLER REDEFINES EKONTO2F.                                       
             03 EKONTO2A    PICTURE X.                                          
           02  EKONTO2I  PIC X(10).                                             
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  F000004I  PIC X(3).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  F000003I  PIC X(3).                                              
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  EFC3I  PIC X(1).                                                 
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  F000010I  PIC X(1).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  F000009I  PIC X(2).                                              
           02  AMANBZ3L    COMP  PIC  S9(4).                                    
           02  AMANBZ3F    PICTURE X.                                           
           02  FILLER REDEFINES AMANBZ3F.                                       
             03 AMANBZ3A    PICTURE X.                                          
           02  AMANBZ3I  PIC X(10).                                             
           02  EKONTO3L    COMP  PIC  S9(4).                                    
           02  EKONTO3F    PICTURE X.                                           
           02  FILLER REDEFINES EKONTO3F.                                       
             03 EKONTO3A    PICTURE X.                                          
           02  EKONTO3I  PIC X(10).                                             
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  F000008I  PIC X(3).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  F000007I  PIC X(3).                                              
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  EFC4I  PIC X(1).                                                 
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  F000014I  PIC X(1).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  F000013I  PIC X(2).                                              
           02  AMANBZ4L    COMP  PIC  S9(4).                                    
           02  AMANBZ4F    PICTURE X.                                           
           02  FILLER REDEFINES AMANBZ4F.                                       
             03 AMANBZ4A    PICTURE X.                                          
           02  AMANBZ4I  PIC X(10).                                             
           02  EKONTO4L    COMP  PIC  S9(4).                                    
           02  EKONTO4F    PICTURE X.                                           
           02  FILLER REDEFINES EKONTO4F.                                       
             03 EKONTO4A    PICTURE X.                                          
           02  EKONTO4I  PIC X(10).                                             
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  F000012I  PIC X(3).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  F000011I  PIC X(3).                                              
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  AFCZANZI  PIC X(79).                                             
       01  BAT0029O REDEFINES BAT0029I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGSNRO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFCSO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EFCSO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGSLBSO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGSLBZO  PIC X(40).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGSKBSO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGSKBZO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUPDFBO  PIC X(22).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUPDDAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGSKB4SO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGSKBZ4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUPDIFBO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUPDUIDO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUSLSO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUSLO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AALBEZO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABEWSO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEWO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ABEWBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AWAEHRSO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EWAEHRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AWAEBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEXPORSO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEXPORTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEXPBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVTGESSO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVTGESO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVTGBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AAENDKZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMANDANO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMANBZO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKONTOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGKOEINO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGKOAUSO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000006O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMANBZ2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKONTO2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000004O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000010O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMANBZ3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKONTO3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000008O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  F000014O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMANBZ4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EKONTO4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000012O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZO  PIC X(79).                                             
