       01  BAT0026I.                                                            
           02  FILLER PIC X(12).                                                
           02  EVSTATL    COMP  PIC  S9(4).                                     
           02  EVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES EVSTATF.                                        
             03 EVSTATA    PICTURE X.                                           
           02  EVSTATI  PIC X(4).                                               
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1VSTAL    COMP  PIC  S9(4).                                     
           02  E1VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E1VSTAF.                                        
             03 E1VSTAA    PICTURE X.                                           
           02  E1VSTAI  PIC X(4).                                               
           02  E1TEXTL    COMP  PIC  S9(4).                                     
           02  E1TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E1TEXTF.                                        
             03 E1TEXTA    PICTURE X.                                           
           02  E1TEXTI  PIC X(50).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2VSTAL    COMP  PIC  S9(4).                                     
           02  E2VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E2VSTAF.                                        
             03 E2VSTAA    PICTURE X.                                           
           02  E2VSTAI  PIC X(4).                                               
           02  E2TEXTL    COMP  PIC  S9(4).                                     
           02  E2TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E2TEXTF.                                        
             03 E2TEXTA    PICTURE X.                                           
           02  E2TEXTI  PIC X(50).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3VSTAL    COMP  PIC  S9(4).                                     
           02  E3VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E3VSTAF.                                        
             03 E3VSTAA    PICTURE X.                                           
           02  E3VSTAI  PIC X(4).                                               
           02  E3TEXTL    COMP  PIC  S9(4).                                     
           02  E3TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E3TEXTF.                                        
             03 E3TEXTA    PICTURE X.                                           
           02  E3TEXTI  PIC X(50).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4VSTAL    COMP  PIC  S9(4).                                     
           02  E4VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E4VSTAF.                                        
             03 E4VSTAA    PICTURE X.                                           
           02  E4VSTAI  PIC X(4).                                               
           02  E4TEXTL    COMP  PIC  S9(4).                                     
           02  E4TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E4TEXTF.                                        
             03 E4TEXTA    PICTURE X.                                           
           02  E4TEXTI  PIC X(50).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5VSTAL    COMP  PIC  S9(4).                                     
           02  E5VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E5VSTAF.                                        
             03 E5VSTAA    PICTURE X.                                           
           02  E5VSTAI  PIC X(4).                                               
           02  E5TEXTL    COMP  PIC  S9(4).                                     
           02  E5TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E5TEXTF.                                        
             03 E5TEXTA    PICTURE X.                                           
           02  E5TEXTI  PIC X(50).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6VSTAL    COMP  PIC  S9(4).                                     
           02  E6VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E6VSTAF.                                        
             03 E6VSTAA    PICTURE X.                                           
           02  E6VSTAI  PIC X(4).                                               
           02  E6TEXTL    COMP  PIC  S9(4).                                     
           02  E6TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E6TEXTF.                                        
             03 E6TEXTA    PICTURE X.                                           
           02  E6TEXTI  PIC X(50).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7VSTAL    COMP  PIC  S9(4).                                     
           02  E7VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E7VSTAF.                                        
             03 E7VSTAA    PICTURE X.                                           
           02  E7VSTAI  PIC X(4).                                               
           02  E7TEXTL    COMP  PIC  S9(4).                                     
           02  E7TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E7TEXTF.                                        
             03 E7TEXTA    PICTURE X.                                           
           02  E7TEXTI  PIC X(50).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8VSTAL    COMP  PIC  S9(4).                                     
           02  E8VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E8VSTAF.                                        
             03 E8VSTAA    PICTURE X.                                           
           02  E8VSTAI  PIC X(4).                                               
           02  E8TEXTL    COMP  PIC  S9(4).                                     
           02  E8TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E8TEXTF.                                        
             03 E8TEXTA    PICTURE X.                                           
           02  E8TEXTI  PIC X(50).                                              
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9VSTAL    COMP  PIC  S9(4).                                     
           02  E9VSTAF    PICTURE X.                                            
           02  FILLER REDEFINES E9VSTAF.                                        
             03 E9VSTAA    PICTURE X.                                           
           02  E9VSTAI  PIC X(4).                                               
           02  E9TEXTL    COMP  PIC  S9(4).                                     
           02  E9TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E9TEXTF.                                        
             03 E9TEXTA    PICTURE X.                                           
           02  E9TEXTI  PIC X(50).                                              
           02  E10FCL    COMP  PIC  S9(4).                                      
           02  E10FCF    PICTURE X.                                             
           02  FILLER REDEFINES E10FCF.                                         
             03 E10FCA    PICTURE X.                                            
           02  E10FCI  PIC X(1).                                                
           02  E10VSTAL    COMP  PIC  S9(4).                                    
           02  E10VSTAF    PICTURE X.                                           
           02  FILLER REDEFINES E10VSTAF.                                       
             03 E10VSTAA    PICTURE X.                                          
           02  E10VSTAI  PIC X(4).                                              
           02  E10TEXTL    COMP  PIC  S9(4).                                    
           02  E10TEXTF    PICTURE X.                                           
           02  FILLER REDEFINES E10TEXTF.                                       
             03 E10TEXTA    PICTURE X.                                          
           02  E10TEXTI  PIC X(50).                                             
           02  E11FCL    COMP  PIC  S9(4).                                      
           02  E11FCF    PICTURE X.                                             
           02  FILLER REDEFINES E11FCF.                                         
             03 E11FCA    PICTURE X.                                            
           02  E11FCI  PIC X(1).                                                
           02  E11VSTAL    COMP  PIC  S9(4).                                    
           02  E11VSTAF    PICTURE X.                                           
           02  FILLER REDEFINES E11VSTAF.                                       
             03 E11VSTAA    PICTURE X.                                          
           02  E11VSTAI  PIC X(4).                                              
           02  E11TEXTL    COMP  PIC  S9(4).                                    
           02  E11TEXTF    PICTURE X.                                           
           02  FILLER REDEFINES E11TEXTF.                                       
             03 E11TEXTA    PICTURE X.                                          
           02  E11TEXTI  PIC X(50).                                             
           02  ATXFCL    COMP  PIC  S9(4).                                      
           02  ATXFCF    PICTURE X.                                             
           02  FILLER REDEFINES ATXFCF.                                         
             03 ATXFCA    PICTURE X.                                            
           02  ATXFCI  PIC X(32).                                               
       01  BAT0026O REDEFINES BAT0026I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9VSTAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E9TEXTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10VSTAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10TEXTO  PIC X(50).                                             
           02  FILLER PICTURE X(3).                                             
           02  E11FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E11VSTAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  E11TEXTO  PIC X(50).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATXFCO  PIC X(32).                                               
