       01  BAT0024I.                                                            
           02  FILLER PIC X(12).                                                
           02  AKTYNRL    COMP  PIC  S9(4).                                     
           02  AKTYNRF    PICTURE X.                                            
           02  FILLER REDEFINES AKTYNRF.                                        
             03 AKTYNRA    PICTURE X.                                           
           02  AKTYNRI  PIC X(3).                                               
           02  AKTYBEZL    COMP  PIC  S9(4).                                    
           02  AKTYBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AKTYBEZF.                                       
             03 AKTYBEZA    PICTURE X.                                          
           02  AKTYBEZI  PIC X(50).                                             
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1KNRL    COMP  PIC  S9(4).                                      
           02  E1KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E1KNRF.                                         
             03 E1KNRA    PICTURE X.                                            
           02  E1KNRI  PIC X(4).                                                
           02  E1BEZKL    COMP  PIC  S9(4).                                     
           02  E1BEZKF    PICTURE X.                                            
           02  FILLER REDEFINES E1BEZKF.                                        
             03 E1BEZKA    PICTURE X.                                           
           02  E1BEZKI  PIC X(4).                                               
           02  E1BEZ10L    COMP  PIC  S9(4).                                    
           02  E1BEZ10F    PICTURE X.                                           
           02  FILLER REDEFINES E1BEZ10F.                                       
             03 E1BEZ10A    PICTURE X.                                          
           02  E1BEZ10I  PIC X(10).                                             
           02  E1HINDL    COMP  PIC  S9(4).                                     
           02  E1HINDF    PICTURE X.                                            
           02  FILLER REDEFINES E1HINDF.                                        
             03 E1HINDA    PICTURE X.                                           
           02  E1HINDI  PIC X(1).                                               
           02  E1BEZL    COMP  PIC  S9(4).                                      
           02  E1BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E1BEZF.                                         
             03 E1BEZA    PICTURE X.                                            
           02  E1BEZI  PIC X(70).                                               
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2KNRL    COMP  PIC  S9(4).                                      
           02  E2KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E2KNRF.                                         
             03 E2KNRA    PICTURE X.                                            
           02  E2KNRI  PIC X(4).                                                
           02  E2BEZKL    COMP  PIC  S9(4).                                     
           02  E2BEZKF    PICTURE X.                                            
           02  FILLER REDEFINES E2BEZKF.                                        
             03 E2BEZKA    PICTURE X.                                           
           02  E2BEZKI  PIC X(4).                                               
           02  E2BEZ10L    COMP  PIC  S9(4).                                    
           02  E2BEZ10F    PICTURE X.                                           
           02  FILLER REDEFINES E2BEZ10F.                                       
             03 E2BEZ10A    PICTURE X.                                          
           02  E2BEZ10I  PIC X(10).                                             
           02  E2HINDL    COMP  PIC  S9(4).                                     
           02  E2HINDF    PICTURE X.                                            
           02  FILLER REDEFINES E2HINDF.                                        
             03 E2HINDA    PICTURE X.                                           
           02  E2HINDI  PIC X(1).                                               
           02  E2BEZL    COMP  PIC  S9(4).                                      
           02  E2BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E2BEZF.                                         
             03 E2BEZA    PICTURE X.                                            
           02  E2BEZI  PIC X(70).                                               
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3KNRL    COMP  PIC  S9(4).                                      
           02  E3KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E3KNRF.                                         
             03 E3KNRA    PICTURE X.                                            
           02  E3KNRI  PIC X(4).                                                
           02  E3BEZKL    COMP  PIC  S9(4).                                     
           02  E3BEZKF    PICTURE X.                                            
           02  FILLER REDEFINES E3BEZKF.                                        
             03 E3BEZKA    PICTURE X.                                           
           02  E3BEZKI  PIC X(4).                                               
           02  E3BEZ10L    COMP  PIC  S9(4).                                    
           02  E3BEZ10F    PICTURE X.                                           
           02  FILLER REDEFINES E3BEZ10F.                                       
             03 E3BEZ10A    PICTURE X.                                          
           02  E3BEZ10I  PIC X(10).                                             
           02  E3HINDL    COMP  PIC  S9(4).                                     
           02  E3HINDF    PICTURE X.                                            
           02  FILLER REDEFINES E3HINDF.                                        
             03 E3HINDA    PICTURE X.                                           
           02  E3HINDI  PIC X(1).                                               
           02  E3BEZL    COMP  PIC  S9(4).                                      
           02  E3BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E3BEZF.                                         
             03 E3BEZA    PICTURE X.                                            
           02  E3BEZI  PIC X(70).                                               
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4KNRL    COMP  PIC  S9(4).                                      
           02  E4KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E4KNRF.                                         
             03 E4KNRA    PICTURE X.                                            
           02  E4KNRI  PIC X(4).                                                
           02  E4BEZKL    COMP  PIC  S9(4).                                     
           02  E4BEZKF    PICTURE X.                                            
           02  FILLER REDEFINES E4BEZKF.                                        
             03 E4BEZKA    PICTURE X.                                           
           02  E4BEZKI  PIC X(4).                                               
           02  E4BEZ10L    COMP  PIC  S9(4).                                    
           02  E4BEZ10F    PICTURE X.                                           
           02  FILLER REDEFINES E4BEZ10F.                                       
             03 E4BEZ10A    PICTURE X.                                          
           02  E4BEZ10I  PIC X(10).                                             
           02  E4HINDL    COMP  PIC  S9(4).                                     
           02  E4HINDF    PICTURE X.                                            
           02  FILLER REDEFINES E4HINDF.                                        
             03 E4HINDA    PICTURE X.                                           
           02  E4HINDI  PIC X(1).                                               
           02  E4BEZL    COMP  PIC  S9(4).                                      
           02  E4BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E4BEZF.                                         
             03 E4BEZA    PICTURE X.                                            
           02  E4BEZI  PIC X(70).                                               
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5KNRL    COMP  PIC  S9(4).                                      
           02  E5KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E5KNRF.                                         
             03 E5KNRA    PICTURE X.                                            
           02  E5KNRI  PIC X(4).                                                
           02  E5BEZKL    COMP  PIC  S9(4).                                     
           02  E5BEZKF    PICTURE X.                                            
           02  FILLER REDEFINES E5BEZKF.                                        
             03 E5BEZKA    PICTURE X.                                           
           02  E5BEZKI  PIC X(4).                                               
           02  E5BEZ10L    COMP  PIC  S9(4).                                    
           02  E5BEZ10F    PICTURE X.                                           
           02  FILLER REDEFINES E5BEZ10F.                                       
             03 E5BEZ10A    PICTURE X.                                          
           02  E5BEZ10I  PIC X(10).                                             
           02  E5HINDL    COMP  PIC  S9(4).                                     
           02  E5HINDF    PICTURE X.                                            
           02  FILLER REDEFINES E5HINDF.                                        
             03 E5HINDA    PICTURE X.                                           
           02  E5HINDI  PIC X(1).                                               
           02  E5BEZL    COMP  PIC  S9(4).                                      
           02  E5BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E5BEZF.                                         
             03 E5BEZA    PICTURE X.                                            
           02  E5BEZI  PIC X(70).                                               
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6KNRL    COMP  PIC  S9(4).                                      
           02  E6KNRF    PICTURE X.                                             
           02  FILLER REDEFINES E6KNRF.                                         
             03 E6KNRA    PICTURE X.                                            
           02  E6KNRI  PIC X(4).                                                
           02  E6BEZKL    COMP  PIC  S9(4).                                     
           02  E6BEZKF    PICTURE X.                                            
           02  FILLER REDEFINES E6BEZKF.                                        
             03 E6BEZKA    PICTURE X.                                           
           02  E6BEZKI  PIC X(4).                                               
           02  E6BEZ10L    COMP  PIC  S9(4).                                    
           02  E6BEZ10F    PICTURE X.                                           
           02  FILLER REDEFINES E6BEZ10F.                                       
             03 E6BEZ10A    PICTURE X.                                          
           02  E6BEZ10I  PIC X(10).                                             
           02  E6HINDL    COMP  PIC  S9(4).                                     
           02  E6HINDF    PICTURE X.                                            
           02  FILLER REDEFINES E6HINDF.                                        
             03 E6HINDA    PICTURE X.                                           
           02  E6HINDI  PIC X(1).                                               
           02  E6BEZL    COMP  PIC  S9(4).                                      
           02  E6BEZF    PICTURE X.                                             
           02  FILLER REDEFINES E6BEZF.                                         
             03 E6BEZA    PICTURE X.                                            
           02  E6BEZI  PIC X(70).                                               
           02  ATXAUSWL    COMP  PIC  S9(4).                                    
           02  ATXAUSWF    PICTURE X.                                           
           02  FILLER REDEFINES ATXAUSWF.                                       
             03 ATXAUSWA    PICTURE X.                                          
           02  ATXAUSWI  PIC X(24).                                             
           02  AFCLOEL    COMP  PIC  S9(4).                                     
           02  AFCLOEF    PICTURE X.                                            
           02  FILLER REDEFINES AFCLOEF.                                        
             03 AFCLOEA    PICTURE X.                                           
           02  AFCLOEI  PIC X(10).                                              
       01  BAT0024O REDEFINES BAT0024I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AKTYNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AKTYBEZO  PIC X(50).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1BEZKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1BEZ10O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1BEZO  PIC X(70).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2BEZKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2BEZ10O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E2HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2BEZO  PIC X(70).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3BEZKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3BEZ10O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E3HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3BEZO  PIC X(70).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4BEZKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4BEZ10O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E4HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4BEZO  PIC X(70).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5BEZKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5BEZ10O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E5HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5BEZO  PIC X(70).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6KNRO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6BEZKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6BEZ10O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E6HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6BEZO  PIC X(70).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATXAUSWO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCLOEO  PIC X(10).                                              
