       01  BAT0022I.                                                            
           02  FILLER PIC X(12).                                                
           02  EOFFSETL    COMP  PIC  S9(4).                                    
           02  EOFFSETF    PICTURE X.                                           
           02  FILLER REDEFINES EOFFSETF.                                       
             03 EOFFSETA    PICTURE X.                                          
           02  EOFFSETI  PIC X(3).                                              
           02  TDATL    COMP  PIC  S9(4).                                       
           02  TDATF    PICTURE X.                                              
           02  FILLER REDEFINES TDATF.                                          
             03 TDATA    PICTURE X.                                             
           02  TDATI  PIC X(3).                                                 
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1PSNRL    COMP  PIC  S9(4).                                     
           02  E1PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E1PSNRF.                                        
             03 E1PSNRA    PICTURE X.                                           
           02  E1PSNRI  PIC X(3).                                               
           02  A1PSBEZL    COMP  PIC  S9(4).                                    
           02  A1PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A1PSBEZF.                                       
             03 A1PSBEZA    PICTURE X.                                          
           02  A1PSBEZI  PIC X(20).                                             
           02  E1PTNRL    COMP  PIC  S9(4).                                     
           02  E1PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E1PTNRF.                                        
             03 E1PTNRA    PICTURE X.                                           
           02  E1PTNRI  PIC X(2).                                               
           02  A1PTBEZL    COMP  PIC  S9(4).                                    
           02  A1PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A1PTBEZF.                                       
             03 A1PTBEZA    PICTURE X.                                          
           02  A1PTBEZI  PIC X(10).                                             
           02  E1GSNRL    COMP  PIC  S9(4).                                     
           02  E1GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E1GSNRF.                                        
             03 E1GSNRA    PICTURE X.                                           
           02  E1GSNRI  PIC X(3).                                               
           02  A1GSBEZL    COMP  PIC  S9(4).                                    
           02  A1GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A1GSBEZF.                                       
             03 A1GSBEZA    PICTURE X.                                          
           02  A1GSBEZI  PIC X(20).                                             
           02  A1VDATL    COMP  PIC  S9(4).                                     
           02  A1VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A1VDATF.                                        
             03 A1VDATA    PICTURE X.                                           
           02  A1VDATI  PIC X(10).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2PSNRL    COMP  PIC  S9(4).                                     
           02  E2PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E2PSNRF.                                        
             03 E2PSNRA    PICTURE X.                                           
           02  E2PSNRI  PIC X(3).                                               
           02  A2PSBEZL    COMP  PIC  S9(4).                                    
           02  A2PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A2PSBEZF.                                       
             03 A2PSBEZA    PICTURE X.                                          
           02  A2PSBEZI  PIC X(20).                                             
           02  E2PTNRL    COMP  PIC  S9(4).                                     
           02  E2PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E2PTNRF.                                        
             03 E2PTNRA    PICTURE X.                                           
           02  E2PTNRI  PIC X(2).                                               
           02  A2PTBEZL    COMP  PIC  S9(4).                                    
           02  A2PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A2PTBEZF.                                       
             03 A2PTBEZA    PICTURE X.                                          
           02  A2PTBEZI  PIC X(10).                                             
           02  E2GSNRL    COMP  PIC  S9(4).                                     
           02  E2GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E2GSNRF.                                        
             03 E2GSNRA    PICTURE X.                                           
           02  E2GSNRI  PIC X(3).                                               
           02  A2GSBEZL    COMP  PIC  S9(4).                                    
           02  A2GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A2GSBEZF.                                       
             03 A2GSBEZA    PICTURE X.                                          
           02  A2GSBEZI  PIC X(20).                                             
           02  A2VDATL    COMP  PIC  S9(4).                                     
           02  A2VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A2VDATF.                                        
             03 A2VDATA    PICTURE X.                                           
           02  A2VDATI  PIC X(10).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3PSNRL    COMP  PIC  S9(4).                                     
           02  E3PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E3PSNRF.                                        
             03 E3PSNRA    PICTURE X.                                           
           02  E3PSNRI  PIC X(3).                                               
           02  A3PSBEZL    COMP  PIC  S9(4).                                    
           02  A3PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A3PSBEZF.                                       
             03 A3PSBEZA    PICTURE X.                                          
           02  A3PSBEZI  PIC X(20).                                             
           02  E3PTNRL    COMP  PIC  S9(4).                                     
           02  E3PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E3PTNRF.                                        
             03 E3PTNRA    PICTURE X.                                           
           02  E3PTNRI  PIC X(2).                                               
           02  A3PTBEZL    COMP  PIC  S9(4).                                    
           02  A3PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A3PTBEZF.                                       
             03 A3PTBEZA    PICTURE X.                                          
           02  A3PTBEZI  PIC X(10).                                             
           02  E3GSNRL    COMP  PIC  S9(4).                                     
           02  E3GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E3GSNRF.                                        
             03 E3GSNRA    PICTURE X.                                           
           02  E3GSNRI  PIC X(3).                                               
           02  A3GSBEZL    COMP  PIC  S9(4).                                    
           02  A3GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A3GSBEZF.                                       
             03 A3GSBEZA    PICTURE X.                                          
           02  A3GSBEZI  PIC X(20).                                             
           02  A3VDATL    COMP  PIC  S9(4).                                     
           02  A3VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A3VDATF.                                        
             03 A3VDATA    PICTURE X.                                           
           02  A3VDATI  PIC X(10).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4PSNRL    COMP  PIC  S9(4).                                     
           02  E4PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E4PSNRF.                                        
             03 E4PSNRA    PICTURE X.                                           
           02  E4PSNRI  PIC X(3).                                               
           02  A4PSBEZL    COMP  PIC  S9(4).                                    
           02  A4PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A4PSBEZF.                                       
             03 A4PSBEZA    PICTURE X.                                          
           02  A4PSBEZI  PIC X(20).                                             
           02  E4PTNRL    COMP  PIC  S9(4).                                     
           02  E4PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E4PTNRF.                                        
             03 E4PTNRA    PICTURE X.                                           
           02  E4PTNRI  PIC X(2).                                               
           02  A4PTBEZL    COMP  PIC  S9(4).                                    
           02  A4PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A4PTBEZF.                                       
             03 A4PTBEZA    PICTURE X.                                          
           02  A4PTBEZI  PIC X(10).                                             
           02  E4GSNRL    COMP  PIC  S9(4).                                     
           02  E4GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E4GSNRF.                                        
             03 E4GSNRA    PICTURE X.                                           
           02  E4GSNRI  PIC X(3).                                               
           02  A4GSBEZL    COMP  PIC  S9(4).                                    
           02  A4GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A4GSBEZF.                                       
             03 A4GSBEZA    PICTURE X.                                          
           02  A4GSBEZI  PIC X(20).                                             
           02  A4VDATL    COMP  PIC  S9(4).                                     
           02  A4VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A4VDATF.                                        
             03 A4VDATA    PICTURE X.                                           
           02  A4VDATI  PIC X(10).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5PSNRL    COMP  PIC  S9(4).                                     
           02  E5PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E5PSNRF.                                        
             03 E5PSNRA    PICTURE X.                                           
           02  E5PSNRI  PIC X(3).                                               
           02  A5PSBEZL    COMP  PIC  S9(4).                                    
           02  A5PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A5PSBEZF.                                       
             03 A5PSBEZA    PICTURE X.                                          
           02  A5PSBEZI  PIC X(20).                                             
           02  E5PTNRL    COMP  PIC  S9(4).                                     
           02  E5PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E5PTNRF.                                        
             03 E5PTNRA    PICTURE X.                                           
           02  E5PTNRI  PIC X(2).                                               
           02  A5PTBEZL    COMP  PIC  S9(4).                                    
           02  A5PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A5PTBEZF.                                       
             03 A5PTBEZA    PICTURE X.                                          
           02  A5PTBEZI  PIC X(10).                                             
           02  E5GSNRL    COMP  PIC  S9(4).                                     
           02  E5GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E5GSNRF.                                        
             03 E5GSNRA    PICTURE X.                                           
           02  E5GSNRI  PIC X(3).                                               
           02  A5GSBEZL    COMP  PIC  S9(4).                                    
           02  A5GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A5GSBEZF.                                       
             03 A5GSBEZA    PICTURE X.                                          
           02  A5GSBEZI  PIC X(20).                                             
           02  A5VDATL    COMP  PIC  S9(4).                                     
           02  A5VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A5VDATF.                                        
             03 A5VDATA    PICTURE X.                                           
           02  A5VDATI  PIC X(10).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6PSNRL    COMP  PIC  S9(4).                                     
           02  E6PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E6PSNRF.                                        
             03 E6PSNRA    PICTURE X.                                           
           02  E6PSNRI  PIC X(3).                                               
           02  A6PSBEZL    COMP  PIC  S9(4).                                    
           02  A6PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A6PSBEZF.                                       
             03 A6PSBEZA    PICTURE X.                                          
           02  A6PSBEZI  PIC X(20).                                             
           02  E6PTNRL    COMP  PIC  S9(4).                                     
           02  E6PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E6PTNRF.                                        
             03 E6PTNRA    PICTURE X.                                           
           02  E6PTNRI  PIC X(2).                                               
           02  A6PTBEZL    COMP  PIC  S9(4).                                    
           02  A6PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A6PTBEZF.                                       
             03 A6PTBEZA    PICTURE X.                                          
           02  A6PTBEZI  PIC X(10).                                             
           02  E6GSNRL    COMP  PIC  S9(4).                                     
           02  E6GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E6GSNRF.                                        
             03 E6GSNRA    PICTURE X.                                           
           02  E6GSNRI  PIC X(3).                                               
           02  A6GSBEZL    COMP  PIC  S9(4).                                    
           02  A6GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A6GSBEZF.                                       
             03 A6GSBEZA    PICTURE X.                                          
           02  A6GSBEZI  PIC X(20).                                             
           02  A6VDATL    COMP  PIC  S9(4).                                     
           02  A6VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A6VDATF.                                        
             03 A6VDATA    PICTURE X.                                           
           02  A6VDATI  PIC X(10).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7PSNRL    COMP  PIC  S9(4).                                     
           02  E7PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E7PSNRF.                                        
             03 E7PSNRA    PICTURE X.                                           
           02  E7PSNRI  PIC X(3).                                               
           02  A7PSBEZL    COMP  PIC  S9(4).                                    
           02  A7PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A7PSBEZF.                                       
             03 A7PSBEZA    PICTURE X.                                          
           02  A7PSBEZI  PIC X(20).                                             
           02  E7PTNRL    COMP  PIC  S9(4).                                     
           02  E7PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E7PTNRF.                                        
             03 E7PTNRA    PICTURE X.                                           
           02  E7PTNRI  PIC X(2).                                               
           02  A7PTBEZL    COMP  PIC  S9(4).                                    
           02  A7PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A7PTBEZF.                                       
             03 A7PTBEZA    PICTURE X.                                          
           02  A7PTBEZI  PIC X(10).                                             
           02  E7GSNRL    COMP  PIC  S9(4).                                     
           02  E7GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E7GSNRF.                                        
             03 E7GSNRA    PICTURE X.                                           
           02  E7GSNRI  PIC X(3).                                               
           02  A7GSBEZL    COMP  PIC  S9(4).                                    
           02  A7GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A7GSBEZF.                                       
             03 A7GSBEZA    PICTURE X.                                          
           02  A7GSBEZI  PIC X(20).                                             
           02  A7VDATL    COMP  PIC  S9(4).                                     
           02  A7VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A7VDATF.                                        
             03 A7VDATA    PICTURE X.                                           
           02  A7VDATI  PIC X(10).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8PSNRL    COMP  PIC  S9(4).                                     
           02  E8PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E8PSNRF.                                        
             03 E8PSNRA    PICTURE X.                                           
           02  E8PSNRI  PIC X(3).                                               
           02  A8PSBEZL    COMP  PIC  S9(4).                                    
           02  A8PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A8PSBEZF.                                       
             03 A8PSBEZA    PICTURE X.                                          
           02  A8PSBEZI  PIC X(20).                                             
           02  E8PTNRL    COMP  PIC  S9(4).                                     
           02  E8PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E8PTNRF.                                        
             03 E8PTNRA    PICTURE X.                                           
           02  E8PTNRI  PIC X(2).                                               
           02  A8PTBEZL    COMP  PIC  S9(4).                                    
           02  A8PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A8PTBEZF.                                       
             03 A8PTBEZA    PICTURE X.                                          
           02  A8PTBEZI  PIC X(10).                                             
           02  E8GSNRL    COMP  PIC  S9(4).                                     
           02  E8GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E8GSNRF.                                        
             03 E8GSNRA    PICTURE X.                                           
           02  E8GSNRI  PIC X(3).                                               
           02  A8GSBEZL    COMP  PIC  S9(4).                                    
           02  A8GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A8GSBEZF.                                       
             03 A8GSBEZA    PICTURE X.                                          
           02  A8GSBEZI  PIC X(20).                                             
           02  A8VDATL    COMP  PIC  S9(4).                                     
           02  A8VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A8VDATF.                                        
             03 A8VDATA    PICTURE X.                                           
           02  A8VDATI  PIC X(10).                                              
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9PSNRL    COMP  PIC  S9(4).                                     
           02  E9PSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E9PSNRF.                                        
             03 E9PSNRA    PICTURE X.                                           
           02  E9PSNRI  PIC X(3).                                               
           02  A9PSBEZL    COMP  PIC  S9(4).                                    
           02  A9PSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A9PSBEZF.                                       
             03 A9PSBEZA    PICTURE X.                                          
           02  A9PSBEZI  PIC X(20).                                             
           02  E9PTNRL    COMP  PIC  S9(4).                                     
           02  E9PTNRF    PICTURE X.                                            
           02  FILLER REDEFINES E9PTNRF.                                        
             03 E9PTNRA    PICTURE X.                                           
           02  E9PTNRI  PIC X(2).                                               
           02  A9PTBEZL    COMP  PIC  S9(4).                                    
           02  A9PTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A9PTBEZF.                                       
             03 A9PTBEZA    PICTURE X.                                          
           02  A9PTBEZI  PIC X(10).                                             
           02  E9GSNRL    COMP  PIC  S9(4).                                     
           02  E9GSNRF    PICTURE X.                                            
           02  FILLER REDEFINES E9GSNRF.                                        
             03 E9GSNRA    PICTURE X.                                           
           02  E9GSNRI  PIC X(3).                                               
           02  A9GSBEZL    COMP  PIC  S9(4).                                    
           02  A9GSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES A9GSBEZF.                                       
             03 A9GSBEZA    PICTURE X.                                          
           02  A9GSBEZI  PIC X(20).                                             
           02  A9VDATL    COMP  PIC  S9(4).                                     
           02  A9VDATF    PICTURE X.                                            
           02  FILLER REDEFINES A9VDATF.                                        
             03 A9VDATA    PICTURE X.                                           
           02  A9VDATI  PIC X(10).                                              
           02  EAFCL    COMP  PIC  S9(4).                                       
           02  EAFCF    PICTURE X.                                              
           02  FILLER REDEFINES EAFCF.                                          
             03 EAFCA    PICTURE X.                                             
           02  EAFCI  PIC X(1).                                                 
           02  EAPSNRL    COMP  PIC  S9(4).                                     
           02  EAPSNRF    PICTURE X.                                            
           02  FILLER REDEFINES EAPSNRF.                                        
             03 EAPSNRA    PICTURE X.                                           
           02  EAPSNRI  PIC X(3).                                               
           02  AAPSBEZL    COMP  PIC  S9(4).                                    
           02  AAPSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AAPSBEZF.                                       
             03 AAPSBEZA    PICTURE X.                                          
           02  AAPSBEZI  PIC X(20).                                             
           02  EAPTNRL    COMP  PIC  S9(4).                                     
           02  EAPTNRF    PICTURE X.                                            
           02  FILLER REDEFINES EAPTNRF.                                        
             03 EAPTNRA    PICTURE X.                                           
           02  EAPTNRI  PIC X(2).                                               
           02  AAPTBEZL    COMP  PIC  S9(4).                                    
           02  AAPTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AAPTBEZF.                                       
             03 AAPTBEZA    PICTURE X.                                          
           02  AAPTBEZI  PIC X(10).                                             
           02  EAGSNRL    COMP  PIC  S9(4).                                     
           02  EAGSNRF    PICTURE X.                                            
           02  FILLER REDEFINES EAGSNRF.                                        
             03 EAGSNRA    PICTURE X.                                           
           02  EAGSNRI  PIC X(3).                                               
           02  AAGSBEZL    COMP  PIC  S9(4).                                    
           02  AAGSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES AAGSBEZF.                                       
             03 AAGSBEZA    PICTURE X.                                          
           02  AAGSBEZI  PIC X(20).                                             
           02  AAVDATL    COMP  PIC  S9(4).                                     
           02  AAVDATF    PICTURE X.                                            
           02  FILLER REDEFINES AAVDATF.                                        
             03 AAVDATA    PICTURE X.                                           
           02  AAVDATI  PIC X(10).                                              
           02  EBFCL    COMP  PIC  S9(4).                                       
           02  EBFCF    PICTURE X.                                              
           02  FILLER REDEFINES EBFCF.                                          
             03 EBFCA    PICTURE X.                                             
           02  EBFCI  PIC X(1).                                                 
           02  EBPSNRL    COMP  PIC  S9(4).                                     
           02  EBPSNRF    PICTURE X.                                            
           02  FILLER REDEFINES EBPSNRF.                                        
             03 EBPSNRA    PICTURE X.                                           
           02  EBPSNRI  PIC X(3).                                               
           02  ABPSBEZL    COMP  PIC  S9(4).                                    
           02  ABPSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ABPSBEZF.                                       
             03 ABPSBEZA    PICTURE X.                                          
           02  ABPSBEZI  PIC X(20).                                             
           02  EBPTNRL    COMP  PIC  S9(4).                                     
           02  EBPTNRF    PICTURE X.                                            
           02  FILLER REDEFINES EBPTNRF.                                        
             03 EBPTNRA    PICTURE X.                                           
           02  EBPTNRI  PIC X(2).                                               
           02  ABPTBEZL    COMP  PIC  S9(4).                                    
           02  ABPTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ABPTBEZF.                                       
             03 ABPTBEZA    PICTURE X.                                          
           02  ABPTBEZI  PIC X(10).                                             
           02  EBGSNRL    COMP  PIC  S9(4).                                     
           02  EBGSNRF    PICTURE X.                                            
           02  FILLER REDEFINES EBGSNRF.                                        
             03 EBGSNRA    PICTURE X.                                           
           02  EBGSNRI  PIC X(3).                                               
           02  ABGSBEZL    COMP  PIC  S9(4).                                    
           02  ABGSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ABGSBEZF.                                       
             03 ABGSBEZA    PICTURE X.                                          
           02  ABGSBEZI  PIC X(20).                                             
           02  ABVDATL    COMP  PIC  S9(4).                                     
           02  ABVDATF    PICTURE X.                                            
           02  FILLER REDEFINES ABVDATF.                                        
             03 ABVDATA    PICTURE X.                                           
           02  ABVDATI  PIC X(10).                                              
           02  ECFCL    COMP  PIC  S9(4).                                       
           02  ECFCF    PICTURE X.                                              
           02  FILLER REDEFINES ECFCF.                                          
             03 ECFCA    PICTURE X.                                             
           02  ECFCI  PIC X(1).                                                 
           02  ECPSNRL    COMP  PIC  S9(4).                                     
           02  ECPSNRF    PICTURE X.                                            
           02  FILLER REDEFINES ECPSNRF.                                        
             03 ECPSNRA    PICTURE X.                                           
           02  ECPSNRI  PIC X(3).                                               
           02  ACPSBEZL    COMP  PIC  S9(4).                                    
           02  ACPSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ACPSBEZF.                                       
             03 ACPSBEZA    PICTURE X.                                          
           02  ACPSBEZI  PIC X(20).                                             
           02  ECPTNRL    COMP  PIC  S9(4).                                     
           02  ECPTNRF    PICTURE X.                                            
           02  FILLER REDEFINES ECPTNRF.                                        
             03 ECPTNRA    PICTURE X.                                           
           02  ECPTNRI  PIC X(2).                                               
           02  ACPTBEZL    COMP  PIC  S9(4).                                    
           02  ACPTBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ACPTBEZF.                                       
             03 ACPTBEZA    PICTURE X.                                          
           02  ACPTBEZI  PIC X(10).                                             
           02  ECGSNRL    COMP  PIC  S9(4).                                     
           02  ECGSNRF    PICTURE X.                                            
           02  FILLER REDEFINES ECGSNRF.                                        
             03 ECGSNRA    PICTURE X.                                           
           02  ECGSNRI  PIC X(3).                                               
           02  ACGSBEZL    COMP  PIC  S9(4).                                    
           02  ACGSBEZF    PICTURE X.                                           
           02  FILLER REDEFINES ACGSBEZF.                                       
             03 ACGSBEZA    PICTURE X.                                          
           02  ACGSBEZI  PIC X(20).                                             
           02  ACVDATL    COMP  PIC  S9(4).                                     
           02  ACVDATF    PICTURE X.                                            
           02  FILLER REDEFINES ACVDATF.                                        
             03 ACVDATA    PICTURE X.                                           
           02  ACVDATI  PIC X(10).                                              
       01  BAT0022O REDEFINES BAT0022I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EOFFSETO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TDATO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A1PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A1PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A1GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A1VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E2PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E2GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A2VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A3PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E3PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A3PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E3GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A3GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A3VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A4PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E4PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A4PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E4GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A4GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A4VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A5PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E5PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A5PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E5GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A5GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A5VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A6PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E6PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A6PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E6GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A6GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A6VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A7PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E7PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A7PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E7GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A7GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A7VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A8PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E8PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A8PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E8GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A8GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A8VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9PSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A9PSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  E9PTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  A9PTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  E9GSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A9GSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  A9VDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAFCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EAPSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAPSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  EAPTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAPTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EAGSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAGSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AAVDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBFCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBPSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABPSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBPTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABPTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBGSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABGSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABVDATO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ECFCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ECPSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ACPSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ECPTNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ACPTBEZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ECGSNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ACGSBEZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ACVDATO  PIC X(10).                                              
