       01  BAT0007I.                                                            
           02  FILLER PIC X(12).                                                
           02  EOFFKZL    COMP  PIC  S9(4).                                     
           02  EOFFKZF    PICTURE X.                                            
           02  FILLER REDEFINES EOFFKZF.                                        
             03 EOFFKZA    PICTURE X.                                           
           02  EOFFKZI  PIC X(1).                                               
           02  AOFFKZL    COMP  PIC  S9(4).                                     
           02  AOFFKZF    PICTURE X.                                            
           02  FILLER REDEFINES AOFFKZF.                                        
             03 AOFFKZA    PICTURE X.                                           
           02  AOFFKZI  PIC X(6).                                               
           02  EBERL    COMP  PIC  S9(4).                                       
           02  EBERF    PICTURE X.                                              
           02  FILLER REDEFINES EBERF.                                          
             03 EBERA    PICTURE X.                                             
           02  EBERI  PIC X(2).                                                 
           02  EMAPL    COMP  PIC  S9(4).                                       
           02  EMAPF    PICTURE X.                                              
           02  FILLER REDEFINES EMAPF.                                          
             03 EMAPA    PICTURE X.                                             
           02  EMAPI  PIC X(7).                                                 
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1MAPL    COMP  PIC  S9(4).                                      
           02  E1MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E1MAPF.                                         
             03 E1MAPA    PICTURE X.                                            
           02  E1MAPI  PIC X(7).                                                
           02  E1FELDL    COMP  PIC  S9(4).                                     
           02  E1FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E1FELDF.                                        
             03 E1FELDA    PICTURE X.                                           
           02  E1FELDI  PIC X(7).                                               
           02  E1TEXTL    COMP  PIC  S9(4).                                     
           02  E1TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E1TEXTF.                                        
             03 E1TEXTA    PICTURE X.                                           
           02  E1TEXTI  PIC X(70).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2MAPL    COMP  PIC  S9(4).                                      
           02  E2MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E2MAPF.                                         
             03 E2MAPA    PICTURE X.                                            
           02  E2MAPI  PIC X(7).                                                
           02  E2FELDL    COMP  PIC  S9(4).                                     
           02  E2FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E2FELDF.                                        
             03 E2FELDA    PICTURE X.                                           
           02  E2FELDI  PIC X(7).                                               
           02  E2TEXTL    COMP  PIC  S9(4).                                     
           02  E2TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E2TEXTF.                                        
             03 E2TEXTA    PICTURE X.                                           
           02  E2TEXTI  PIC X(70).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3MAPL    COMP  PIC  S9(4).                                      
           02  E3MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E3MAPF.                                         
             03 E3MAPA    PICTURE X.                                            
           02  E3MAPI  PIC X(7).                                                
           02  E3FELDL    COMP  PIC  S9(4).                                     
           02  E3FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E3FELDF.                                        
             03 E3FELDA    PICTURE X.                                           
           02  E3FELDI  PIC X(7).                                               
           02  E3TEXTL    COMP  PIC  S9(4).                                     
           02  E3TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E3TEXTF.                                        
             03 E3TEXTA    PICTURE X.                                           
           02  E3TEXTI  PIC X(70).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4MAPL    COMP  PIC  S9(4).                                      
           02  E4MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E4MAPF.                                         
             03 E4MAPA    PICTURE X.                                            
           02  E4MAPI  PIC X(7).                                                
           02  E4FELDL    COMP  PIC  S9(4).                                     
           02  E4FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E4FELDF.                                        
             03 E4FELDA    PICTURE X.                                           
           02  E4FELDI  PIC X(7).                                               
           02  E4TEXTL    COMP  PIC  S9(4).                                     
           02  E4TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E4TEXTF.                                        
             03 E4TEXTA    PICTURE X.                                           
           02  E4TEXTI  PIC X(70).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5MAPL    COMP  PIC  S9(4).                                      
           02  E5MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E5MAPF.                                         
             03 E5MAPA    PICTURE X.                                            
           02  E5MAPI  PIC X(7).                                                
           02  E5FELDL    COMP  PIC  S9(4).                                     
           02  E5FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E5FELDF.                                        
             03 E5FELDA    PICTURE X.                                           
           02  E5FELDI  PIC X(7).                                               
           02  E5TEXTL    COMP  PIC  S9(4).                                     
           02  E5TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E5TEXTF.                                        
             03 E5TEXTA    PICTURE X.                                           
           02  E5TEXTI  PIC X(70).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6MAPL    COMP  PIC  S9(4).                                      
           02  E6MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E6MAPF.                                         
             03 E6MAPA    PICTURE X.                                            
           02  E6MAPI  PIC X(7).                                                
           02  E6FELDL    COMP  PIC  S9(4).                                     
           02  E6FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E6FELDF.                                        
             03 E6FELDA    PICTURE X.                                           
           02  E6FELDI  PIC X(7).                                               
           02  E6TEXTL    COMP  PIC  S9(4).                                     
           02  E6TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E6TEXTF.                                        
             03 E6TEXTA    PICTURE X.                                           
           02  E6TEXTI  PIC X(70).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7MAPL    COMP  PIC  S9(4).                                      
           02  E7MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E7MAPF.                                         
             03 E7MAPA    PICTURE X.                                            
           02  E7MAPI  PIC X(7).                                                
           02  E7FELDL    COMP  PIC  S9(4).                                     
           02  E7FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E7FELDF.                                        
             03 E7FELDA    PICTURE X.                                           
           02  E7FELDI  PIC X(7).                                               
           02  E7TEXTL    COMP  PIC  S9(4).                                     
           02  E7TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E7TEXTF.                                        
             03 E7TEXTA    PICTURE X.                                           
           02  E7TEXTI  PIC X(70).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8MAPL    COMP  PIC  S9(4).                                      
           02  E8MAPF    PICTURE X.                                             
           02  FILLER REDEFINES E8MAPF.                                         
             03 E8MAPA    PICTURE X.                                            
           02  E8MAPI  PIC X(7).                                                
           02  E8FELDL    COMP  PIC  S9(4).                                     
           02  E8FELDF    PICTURE X.                                            
           02  FILLER REDEFINES E8FELDF.                                        
             03 E8FELDA    PICTURE X.                                           
           02  E8FELDI  PIC X(7).                                               
           02  E8TEXTL    COMP  PIC  S9(4).                                     
           02  E8TEXTF    PICTURE X.                                            
           02  FILLER REDEFINES E8TEXTF.                                        
             03 E8TEXTA    PICTURE X.                                           
           02  E8TEXTI  PIC X(70).                                              
       01  BAT0007O REDEFINES BAT0007I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EOFFKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AOFFKZO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBERO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EMAPO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7TEXTO  PIC X(70).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8MAPO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8FELDO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8TEXTO  PIC X(70).                                              
