       01  BAT0001I.                                                            
           02  FILLER PIC X(12).                                                
           02  ARDCODEL    COMP  PIC  S9(4).                                    
           02  ARDCODEF    PICTURE X.                                           
           02  FILLER REDEFINES ARDCODEF.                                       
             03 ARDCODEA    PICTURE X.                                          
           02  ARDCODEI  PIC X(4).                                              
           02  ARSCODEL    COMP  PIC  S9(4).                                    
           02  ARSCODEF    PICTURE X.                                           
           02  FILLER REDEFINES ARSCODEF.                                       
             03 ARSCODEA    PICTURE X.                                          
           02  ARSCODEI  PIC X(4).                                              
           02  ARBILDFL    COMP  PIC  S9(4).                                    
           02  ARBILDFF    PICTURE X.                                           
           02  FILLER REDEFINES ARBILDFF.                                       
             03 ARBILDFA    PICTURE X.                                          
           02  ARBILDFI.                                                        
             03  ARBFAKTI  PIC X(2).                                            
             03  ARBFTX1I  PIC X(1).                                            
             03  ARBFANZI  PIC X(2).                                            
             03  ARBFTX2I  PIC X(1).                                            
           02  ARTITL1L    COMP  PIC  S9(4).                                    
           02  ARTITL1F    PICTURE X.                                           
           02  FILLER REDEFINES ARTITL1F.                                       
             03 ARTITL1A    PICTURE X.                                          
           02  ARTITL1I  PIC X(45).                                             
           02  ARMODEUL    COMP  PIC  S9(4).                                    
           02  ARMODEUF    PICTURE X.                                           
           02  FILLER REDEFINES ARMODEUF.                                       
             03 ARMODEUA    PICTURE X.                                          
           02  ARMODEUI  PIC X(1).                                              
           02  ARSYSBZL    COMP  PIC  S9(4).                                    
           02  ARSYSBZF    PICTURE X.                                           
           02  FILLER REDEFINES ARSYSBZF.                                       
             03 ARSYSBZA    PICTURE X.                                          
           02  ARSYSBZI  PIC X(4).                                              
           02  ARPERSNL    COMP  PIC  S9(4).                                    
           02  ARPERSNF    PICTURE X.                                           
           02  FILLER REDEFINES ARPERSNF.                                       
             03 ARPERSNA    PICTURE X.                                          
           02  ARPERSNI  PIC X(7).                                              
           02  ARDTIAKL    COMP  PIC  S9(4).                                    
           02  ARDTIAKF    PICTURE X.                                           
           02  FILLER REDEFINES ARDTIAKF.                                       
             03 ARDTIAKA    PICTURE X.                                          
           02  ARDTIAKI.                                                        
             03  ARDATAKI  PIC X(8).                                            
             03  ARDTITXI  PIC X(1).                                            
             03  ARTIMAKI  PIC X(5).                                            
           02  ARTITL2L    COMP  PIC  S9(4).                                    
           02  ARTITL2F    PICTURE X.                                           
           02  FILLER REDEFINES ARTITL2F.                                       
             03 ARTITL2A    PICTURE X.                                          
           02  ARTITL2I  PIC X(45).                                             
           02  ARBEZCIL    COMP  PIC  S9(4).                                    
           02  ARBEZCIF    PICTURE X.                                           
           02  FILLER REDEFINES ARBEZCIF.                                       
             03 ARBEZCIA    PICTURE X.                                          
           02  ARBEZCII  PIC X(5).                                              
           02  ARDATCIL    COMP  PIC  S9(4).                                    
           02  ARDATCIF    PICTURE X.                                           
           02  FILLER REDEFINES ARDATCIF.                                       
             03 ARDATCIA    PICTURE X.                                          
           02  ARDATCII  PIC X(8).                                              
       01  BAT0001O REDEFINES BAT0001I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ARDCODEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARSCODEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARBILDFO.                                                        
             03  ARBFAKTO  PIC X(2).                                            
             03  ARBFTX1O  PIC X(1).                                            
             03  ARBFANZO  PIC X(2).                                            
             03  ARBFTX2O  PIC X(1).                                            
           02  FILLER PICTURE X(3).                                             
           02  ARTITL1O  PIC X(45).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARMODEUO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARSYSBZO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARPERSNO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARDTIAKO.                                                        
             03  ARDATAKO  PIC X(8).                                            
             03  ARDTITXO  PIC X(1).                                            
             03  ARTIMAKO  PIC X(5).                                            
           02  FILLER PICTURE X(3).                                             
           02  ARTITL2O  PIC X(45).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARBEZCIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARDATCIO  PIC X(8).                                              
