       01  BAT0032I.                                                            
           02  FILLER PIC X(12).                                                
           02  AKEYTX1L    COMP  PIC  S9(4).                                    
           02  AKEYTX1F    PICTURE X.                                           
           02  FILLER REDEFINES AKEYTX1F.                                       
             03 AKEYTX1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKEYTX1I  PIC X(79).                                             
           02  AKEYTX2L    COMP  PIC  S9(4).                                    
           02  AKEYTX2F    PICTURE X.                                           
           02  FILLER REDEFINES AKEYTX2F.                                       
             03 AKEYTX2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKEYTX2I  PIC X(79).                                             
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(20).                                             
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  FLD0001L    COMP  PIC  S9(4).                                    
           02  FLD0001F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0001F.                                       
             03 FLD0001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0001I  PIC X(1).                                              
           02  FLD0002L    COMP  PIC  S9(4).                                    
           02  FLD0002F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0002F.                                       
             03 FLD0002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0002I  PIC X(1).                                              
           02  FLD0003L    COMP  PIC  S9(4).                                    
           02  FLD0003F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0003F.                                       
             03 FLD0003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0003I  PIC X(1).                                              
           02  FLD0004L    COMP  PIC  S9(4).                                    
           02  FLD0004F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0004F.                                       
             03 FLD0004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0004I  PIC X(1).                                              
           02  FLD0005L    COMP  PIC  S9(4).                                    
           02  FLD0005F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0005F.                                       
             03 FLD0005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0005I  PIC X(1).                                              
           02  FLD0006L    COMP  PIC  S9(4).                                    
           02  FLD0006F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0006F.                                       
             03 FLD0006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0006I  PIC X(1).                                              
           02  FLD0007L    COMP  PIC  S9(4).                                    
           02  FLD0007F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0007F.                                       
             03 FLD0007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0007I  PIC X(1).                                              
           02  FLD0008L    COMP  PIC  S9(4).                                    
           02  FLD0008F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0008F.                                       
             03 FLD0008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0008I  PIC X(1).                                              
           02  FLD0009L    COMP  PIC  S9(4).                                    
           02  FLD0009F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0009F.                                       
             03 FLD0009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0009I  PIC X(1).                                              
           02  AESTDATL    COMP  PIC  S9(4).                                    
           02  AESTDATF    PICTURE X.                                           
           02  FILLER REDEFINES AESTDATF.                                       
             03 AESTDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AESTDATI  PIC X(10).                                             
           02  FLD0010L    COMP  PIC  S9(4).                                    
           02  FLD0010F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0010F.                                       
             03 FLD0010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0010I  PIC X(10).                                             
           02  FLD0011L    COMP  PIC  S9(4).                                    
           02  FLD0011F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0011F.                                       
             03 FLD0011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0011I  PIC X(10).                                             
           02  FLD0012L    COMP  PIC  S9(4).                                    
           02  FLD0012F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0012F.                                       
             03 FLD0012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0012I  PIC X(10).                                             
           02  FLD0013L    COMP  PIC  S9(4).                                    
           02  FLD0013F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0013F.                                       
             03 FLD0013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0013I  PIC X(10).                                             
           02  FLD0014L    COMP  PIC  S9(4).                                    
           02  FLD0014F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0014F.                                       
             03 FLD0014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0014I  PIC X(10).                                             
           02  FLD0015L    COMP  PIC  S9(4).                                    
           02  FLD0015F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0015F.                                       
             03 FLD0015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0015I  PIC X(10).                                             
           02  FLD0016L    COMP  PIC  S9(4).                                    
           02  FLD0016F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0016F.                                       
             03 FLD0016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0016I  PIC X(10).                                             
           02  FLD0017L    COMP  PIC  S9(4).                                    
           02  FLD0017F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0017F.                                       
             03 FLD0017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0017I  PIC X(10).                                             
           02  FLD0018L    COMP  PIC  S9(4).                                    
           02  FLD0018F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0018F.                                       
             03 FLD0018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0018I  PIC X(10).                                             
           02  ANTZABML    COMP  PIC  S9(4).                                    
           02  ANTZABMF    PICTURE X.                                           
           02  FILLER REDEFINES ANTZABMF.                                       
             03 ANTZABMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANTZABMI  PIC X(10).                                             
           02  FLD0019L    COMP  PIC  S9(4).                                    
           02  FLD0019F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0019F.                                       
             03 FLD0019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0019I  PIC X(10).                                             
           02  FLD0020L    COMP  PIC  S9(4).                                    
           02  FLD0020F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0020F.                                       
             03 FLD0020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0020I  PIC X(10).                                             
           02  FLD0021L    COMP  PIC  S9(4).                                    
           02  FLD0021F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0021F.                                       
             03 FLD0021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0021I  PIC X(10).                                             
           02  FLD0022L    COMP  PIC  S9(4).                                    
           02  FLD0022F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0022F.                                       
             03 FLD0022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0022I  PIC X(10).                                             
           02  FLD0023L    COMP  PIC  S9(4).                                    
           02  FLD0023F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0023F.                                       
             03 FLD0023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0023I  PIC X(10).                                             
           02  FLD0024L    COMP  PIC  S9(4).                                    
           02  FLD0024F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0024F.                                       
             03 FLD0024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0024I  PIC X(10).                                             
           02  FLD0025L    COMP  PIC  S9(4).                                    
           02  FLD0025F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0025F.                                       
             03 FLD0025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0025I  PIC X(10).                                             
           02  FLD0026L    COMP  PIC  S9(4).                                    
           02  FLD0026F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0026F.                                       
             03 FLD0026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0026I  PIC X(10).                                             
           02  FLD0027L    COMP  PIC  S9(4).                                    
           02  FLD0027F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0027F.                                       
             03 FLD0027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0027I  PIC X(10).                                             
           02  ANTZZEIL    COMP  PIC  S9(4).                                    
           02  ANTZZEIF    PICTURE X.                                           
           02  FILLER REDEFINES ANTZZEIF.                                       
             03 ANTZZEIA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANTZZEII  PIC X(44).                                             
           02  FLD0028L    COMP  PIC  S9(4).                                    
           02  FLD0028F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0028F.                                       
             03 FLD0028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0028I  PIC X(44).                                             
           02  FLD0029L    COMP  PIC  S9(4).                                    
           02  FLD0029F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0029F.                                       
             03 FLD0029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0029I  PIC X(44).                                             
           02  FLD0030L    COMP  PIC  S9(4).                                    
           02  FLD0030F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0030F.                                       
             03 FLD0030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0030I  PIC X(44).                                             
           02  FLD0031L    COMP  PIC  S9(4).                                    
           02  FLD0031F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0031F.                                       
             03 FLD0031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0031I  PIC X(44).                                             
           02  FLD0032L    COMP  PIC  S9(4).                                    
           02  FLD0032F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0032F.                                       
             03 FLD0032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0032I  PIC X(44).                                             
           02  FLD0033L    COMP  PIC  S9(4).                                    
           02  FLD0033F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0033F.                                       
             03 FLD0033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0033I  PIC X(44).                                             
           02  FLD0034L    COMP  PIC  S9(4).                                    
           02  FLD0034F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0034F.                                       
             03 FLD0034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0034I  PIC X(44).                                             
           02  FLD0035L    COMP  PIC  S9(4).                                    
           02  FLD0035F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0035F.                                       
             03 FLD0035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0035I  PIC X(44).                                             
           02  FLD0036L    COMP  PIC  S9(4).                                    
           02  FLD0036F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0036F.                                       
             03 FLD0036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0036I  PIC X(44).                                             
           02  ANTZKNGL    COMP  PIC  S9(4).                                    
           02  ANTZKNGF    PICTURE X.                                           
           02  FILLER REDEFINES ANTZKNGF.                                       
             03 ANTZKNGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANTZKNGI  PIC X(9).                                              
           02  FLD0037L    COMP  PIC  S9(4).                                    
           02  FLD0037F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0037F.                                       
             03 FLD0037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0037I  PIC X(9).                                              
           02  FLD0038L    COMP  PIC  S9(4).                                    
           02  FLD0038F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0038F.                                       
             03 FLD0038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0038I  PIC X(9).                                              
           02  FLD0039L    COMP  PIC  S9(4).                                    
           02  FLD0039F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0039F.                                       
             03 FLD0039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0039I  PIC X(9).                                              
           02  FLD0040L    COMP  PIC  S9(4).                                    
           02  FLD0040F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0040F.                                       
             03 FLD0040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0040I  PIC X(9).                                              
           02  FLD0041L    COMP  PIC  S9(4).                                    
           02  FLD0041F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0041F.                                       
             03 FLD0041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0041I  PIC X(9).                                              
           02  FLD0042L    COMP  PIC  S9(4).                                    
           02  FLD0042F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0042F.                                       
             03 FLD0042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0042I  PIC X(9).                                              
           02  FLD0043L    COMP  PIC  S9(4).                                    
           02  FLD0043F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0043F.                                       
             03 FLD0043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0043I  PIC X(9).                                              
           02  FLD0044L    COMP  PIC  S9(4).                                    
           02  FLD0044F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0044F.                                       
             03 FLD0044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0044I  PIC X(9).                                              
           02  FLD0045L    COMP  PIC  S9(4).                                    
           02  FLD0045F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0045F.                                       
             03 FLD0045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0045I  PIC X(9).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BAT0032O REDEFINES BAT0032I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AKEYTX1H    PICTURE X.                                           
           02  AKEYTX1O  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKEYTX2H    PICTURE X.                                           
           02  AKEYTX2O  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  FLD0001H    PICTURE X.                                           
           02  FLD0001O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0002H    PICTURE X.                                           
           02  FLD0002O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0003H    PICTURE X.                                           
           02  FLD0003O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0004H    PICTURE X.                                           
           02  FLD0004O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0005H    PICTURE X.                                           
           02  FLD0005O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0006H    PICTURE X.                                           
           02  FLD0006O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0007H    PICTURE X.                                           
           02  FLD0007O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0008H    PICTURE X.                                           
           02  FLD0008O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0009H    PICTURE X.                                           
           02  FLD0009O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AESTDATH    PICTURE X.                                           
           02  AESTDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0010H    PICTURE X.                                           
           02  FLD0010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0011H    PICTURE X.                                           
           02  FLD0011O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0012H    PICTURE X.                                           
           02  FLD0012O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0013H    PICTURE X.                                           
           02  FLD0013O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0014H    PICTURE X.                                           
           02  FLD0014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0015H    PICTURE X.                                           
           02  FLD0015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0016H    PICTURE X.                                           
           02  FLD0016O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0017H    PICTURE X.                                           
           02  FLD0017O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0018H    PICTURE X.                                           
           02  FLD0018O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANTZABMH    PICTURE X.                                           
           02  ANTZABMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0019H    PICTURE X.                                           
           02  FLD0019O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0020H    PICTURE X.                                           
           02  FLD0020O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0021H    PICTURE X.                                           
           02  FLD0021O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0022H    PICTURE X.                                           
           02  FLD0022O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0023H    PICTURE X.                                           
           02  FLD0023O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0024H    PICTURE X.                                           
           02  FLD0024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0025H    PICTURE X.                                           
           02  FLD0025O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0026H    PICTURE X.                                           
           02  FLD0026O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0027H    PICTURE X.                                           
           02  FLD0027O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANTZZEIH    PICTURE X.                                           
           02  ANTZZEIO PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0028H    PICTURE X.                                           
           02  FLD0028O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0029H    PICTURE X.                                           
           02  FLD0029O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0030H    PICTURE X.                                           
           02  FLD0030O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0031H    PICTURE X.                                           
           02  FLD0031O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0032H    PICTURE X.                                           
           02  FLD0032O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0033H    PICTURE X.                                           
           02  FLD0033O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0034H    PICTURE X.                                           
           02  FLD0034O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0035H    PICTURE X.                                           
           02  FLD0035O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0036H    PICTURE X.                                           
           02  FLD0036O PIC X(44).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANTZKNGH    PICTURE X.                                           
           02  ANTZKNGO PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0037H    PICTURE X.                                           
           02  FLD0037O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0038H    PICTURE X.                                           
           02  FLD0038O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0039H    PICTURE X.                                           
           02  FLD0039O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0040H    PICTURE X.                                           
           02  FLD0040O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0041H    PICTURE X.                                           
           02  FLD0041O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0042H    PICTURE X.                                           
           02  FLD0042O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0043H    PICTURE X.                                           
           02  FLD0043O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0044H    PICTURE X.                                           
           02  FLD0044O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0045H    PICTURE X.                                           
           02  FLD0045O PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
