       01  BKD0001I.                                                            
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  V0630L    COMP  PIC  S9(4).                                      
           02  V0630F    PICTURE X.                                             
           02  FILLER REDEFINES V0630F.                                         
             03 V0630A    PICTURE X.                                            
           02  V0630I  PIC X(7).                                                
           02  V0730L    COMP  PIC  S9(4).                                      
           02  V0730F    PICTURE X.                                             
           02  FILLER REDEFINES V0730F.                                         
             03 V0730A    PICTURE X.                                            
           02  V0730I  PIC X(3).                                                
           02  V0930L    COMP  PIC  S9(4).                                      
           02  V0930F    PICTURE X.                                             
           02  FILLER REDEFINES V0930F.                                         
             03 V0930A    PICTURE X.                                            
           02  V0930I  PIC X(6).                                                
           02  V1130L    COMP  PIC  S9(4).                                      
           02  V1130F    PICTURE X.                                             
           02  FILLER REDEFINES V1130F.                                         
             03 V1130A    PICTURE X.                                            
           02  V1130I  PIC X(5).                                                
           02  V1230L    COMP  PIC  S9(4).                                      
           02  V1230F    PICTURE X.                                             
           02  FILLER REDEFINES V1230F.                                         
             03 V1230A    PICTURE X.                                            
           02  V1230I  PIC X(4).                                                
           02  V1235L    COMP  PIC  S9(4).                                      
           02  V1235F    PICTURE X.                                             
           02  FILLER REDEFINES V1235F.                                         
             03 V1235A    PICTURE X.                                            
           02  V1235I  PIC X(2).                                                
           02  V1330L    COMP  PIC  S9(4).                                      
           02  V1330F    PICTURE X.                                             
           02  FILLER REDEFINES V1330F.                                         
             03 V1330A    PICTURE X.                                            
           02  V1330I  PIC X(3).                                                
           02  V1730L    COMP  PIC  S9(4).                                      
           02  V1730F    PICTURE X.                                             
           02  FILLER REDEFINES V1730F.                                         
             03 V1730A    PICTURE X.                                            
           02  V1730I  PIC X(3).                                                
           02  V1734L    COMP  PIC  S9(4).                                      
           02  V1734F    PICTURE X.                                             
           02  FILLER REDEFINES V1734F.                                         
             03 V1734A    PICTURE X.                                            
           02  V1734I  PIC X(4).                                                
           02  V1930L    COMP  PIC  S9(4).                                      
           02  V1930F    PICTURE X.                                             
           02  FILLER REDEFINES V1930F.                                         
             03 V1930A    PICTURE X.                                            
           02  V1930I  PIC X(7).                                                
           02  V2201L    COMP  PIC  S9(4).                                      
           02  V2201F    PICTURE X.                                             
           02  FILLER REDEFINES V2201F.                                         
             03 V2201A    PICTURE X.                                            
           02  V2201I  PIC X(79).                                               
           02  V2315L    COMP  PIC  S9(4).                                      
           02  V2315F    PICTURE X.                                             
           02  FILLER REDEFINES V2315F.                                         
             03 V2315A    PICTURE X.                                            
           02  V2315I  PIC X(4).                                                
       01  BKD0001O REDEFINES BKD0001I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  V0630O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0730O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0930O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1130O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1230O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1235O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1330O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1730O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1734O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1930O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2201O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2315O  PIC X(4).                                                
