       01  BKD0002I.                                                            
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  V0713L    COMP  PIC  S9(4).                                      
           02  V0713F    PICTURE X.                                             
           02  FILLER REDEFINES V0713F.                                         
             03 V0713A    PICTURE X.                                            
           02  V0713I  PIC X(7).                                                
           02  V0745L    COMP  PIC  S9(4).                                      
           02  V0745F    PICTURE X.                                             
           02  FILLER REDEFINES V0745F.                                         
             03 V0745A    PICTURE X.                                            
           02  V0745I  PIC X(3).                                                
           02  V0768L    COMP  PIC  S9(4).                                      
           02  V0768F    PICTURE X.                                             
           02  FILLER REDEFINES V0768F.                                         
             03 V0768A    PICTURE X.                                            
           02  V0768I  PIC X(10).                                               
           02  V0813L    COMP  PIC  S9(4).                                      
           02  V0813F    PICTURE X.                                             
           02  FILLER REDEFINES V0813F.                                         
             03 V0813A    PICTURE X.                                            
           02  V0813I  PIC X(7).                                                
           02  V0845L    COMP  PIC  S9(4).                                      
           02  V0845F    PICTURE X.                                             
           02  FILLER REDEFINES V0845F.                                         
             03 V0845A    PICTURE X.                                            
           02  V0845I  PIC X(3).                                                
           02  V0868L    COMP  PIC  S9(4).                                      
           02  V0868F    PICTURE X.                                             
           02  FILLER REDEFINES V0868F.                                         
             03 V0868A    PICTURE X.                                            
           02  V0868I  PIC X(5).                                                
           02  V0968L    COMP  PIC  S9(4).                                      
           02  V0968F    PICTURE X.                                             
           02  FILLER REDEFINES V0968F.                                         
             03 V0968A    PICTURE X.                                            
           02  V0968I  PIC X(8).                                                
           02  V1059L    COMP  PIC  S9(4).                                      
           02  V1059F    PICTURE X.                                             
           02  FILLER REDEFINES V1059F.                                         
             03 V1059A    PICTURE X.                                            
           02  V1059I  PIC X(3).                                                
           02  V1067L    COMP  PIC  S9(4).                                      
           02  V1067F    PICTURE X.                                             
           02  FILLER REDEFINES V1067F.                                         
             03 V1067A    PICTURE X.                                            
           02  V1067I  PIC X(3).                                                
           02  V1076L    COMP  PIC  S9(4).                                      
           02  V1076F    PICTURE X.                                             
           02  FILLER REDEFINES V1076F.                                         
             03 V1076A    PICTURE X.                                            
           02  V1076I  PIC X(3).                                                
           02  V1401L    COMP  PIC  S9(4).                                      
           02  V1401F    PICTURE X.                                             
           02  FILLER REDEFINES V1401F.                                         
             03 V1401A    PICTURE X.                                            
           02  V1401I  PIC X(1).                                                
           02  V1403L    COMP  PIC  S9(4).                                      
           02  V1403F    PICTURE X.                                             
           02  FILLER REDEFINES V1403F.                                         
             03 V1403A    PICTURE X.                                            
           02  V1403I  PIC X(20).                                               
           02  V1424L    COMP  PIC  S9(4).                                      
           02  V1424F    PICTURE X.                                             
           02  FILLER REDEFINES V1424F.                                         
             03 V1424A    PICTURE X.                                            
           02  V1424I  PIC X(7).                                                
           02  V1432L    COMP  PIC  S9(4).                                      
           02  V1432F    PICTURE X.                                             
           02  FILLER REDEFINES V1432F.                                         
             03 V1432A    PICTURE X.                                            
           02  V1432I  PIC X(2).                                                
           02  V1435L    COMP  PIC  S9(4).                                      
           02  V1435F    PICTURE X.                                             
           02  FILLER REDEFINES V1435F.                                         
             03 V1435A    PICTURE X.                                            
           02  V1435I  PIC X(5).                                                
           02  V1441L    COMP  PIC  S9(4).                                      
           02  V1441F    PICTURE X.                                             
           02  FILLER REDEFINES V1441F.                                         
             03 V1441A    PICTURE X.                                            
           02  V1441I  PIC X(12).                                               
           02  V1454L    COMP  PIC  S9(4).                                      
           02  V1454F    PICTURE X.                                             
           02  FILLER REDEFINES V1454F.                                         
             03 V1454A    PICTURE X.                                            
           02  V1454I  PIC X(16).                                               
           02  V1471L    COMP  PIC  S9(4).                                      
           02  V1471F    PICTURE X.                                             
           02  FILLER REDEFINES V1471F.                                         
             03 V1471A    PICTURE X.                                            
           02  V1471I  PIC X(8).                                                
           02  V1501L    COMP  PIC  S9(4).                                      
           02  V1501F    PICTURE X.                                             
           02  FILLER REDEFINES V1501F.                                         
             03 V1501A    PICTURE X.                                            
           02  V1501I  PIC X(1).                                                
           02  V1503L    COMP  PIC  S9(4).                                      
           02  V1503F    PICTURE X.                                             
           02  FILLER REDEFINES V1503F.                                         
             03 V1503A    PICTURE X.                                            
           02  V1503I  PIC X(20).                                               
           02  V1524L    COMP  PIC  S9(4).                                      
           02  V1524F    PICTURE X.                                             
           02  FILLER REDEFINES V1524F.                                         
             03 V1524A    PICTURE X.                                            
           02  V1524I  PIC X(7).                                                
           02  V1532L    COMP  PIC  S9(4).                                      
           02  V1532F    PICTURE X.                                             
           02  FILLER REDEFINES V1532F.                                         
             03 V1532A    PICTURE X.                                            
           02  V1532I  PIC X(2).                                                
           02  V1535L    COMP  PIC  S9(4).                                      
           02  V1535F    PICTURE X.                                             
           02  FILLER REDEFINES V1535F.                                         
             03 V1535A    PICTURE X.                                            
           02  V1535I  PIC X(5).                                                
           02  V1541L    COMP  PIC  S9(4).                                      
           02  V1541F    PICTURE X.                                             
           02  FILLER REDEFINES V1541F.                                         
             03 V1541A    PICTURE X.                                            
           02  V1541I  PIC X(12).                                               
           02  V1557L    COMP  PIC  S9(4).                                      
           02  V1557F    PICTURE X.                                             
           02  FILLER REDEFINES V1557F.                                         
             03 V1557A    PICTURE X.                                            
           02  V1557I  PIC X(16).                                               
           02  V1571L    COMP  PIC  S9(4).                                      
           02  V1571F    PICTURE X.                                             
           02  FILLER REDEFINES V1571F.                                         
             03 V1571A    PICTURE X.                                            
           02  V1571I  PIC X(8).                                                
           02  V1601L    COMP  PIC  S9(4).                                      
           02  V1601F    PICTURE X.                                             
           02  FILLER REDEFINES V1601F.                                         
             03 V1601A    PICTURE X.                                            
           02  V1601I  PIC X(1).                                                
           02  V1603L    COMP  PIC  S9(4).                                      
           02  V1603F    PICTURE X.                                             
           02  FILLER REDEFINES V1603F.                                         
             03 V1603A    PICTURE X.                                            
           02  V1603I  PIC X(20).                                               
           02  V1624L    COMP  PIC  S9(4).                                      
           02  V1624F    PICTURE X.                                             
           02  FILLER REDEFINES V1624F.                                         
             03 V1624A    PICTURE X.                                            
           02  V1624I  PIC X(7).                                                
           02  V1632L    COMP  PIC  S9(4).                                      
           02  V1632F    PICTURE X.                                             
           02  FILLER REDEFINES V1632F.                                         
             03 V1632A    PICTURE X.                                            
           02  V1632I  PIC X(2).                                                
           02  V1635L    COMP  PIC  S9(4).                                      
           02  V1635F    PICTURE X.                                             
           02  FILLER REDEFINES V1635F.                                         
             03 V1635A    PICTURE X.                                            
           02  V1635I  PIC X(5).                                                
           02  V1641L    COMP  PIC  S9(4).                                      
           02  V1641F    PICTURE X.                                             
           02  FILLER REDEFINES V1641F.                                         
             03 V1641A    PICTURE X.                                            
           02  V1641I  PIC X(12).                                               
           02  V1654L    COMP  PIC  S9(4).                                      
           02  V1654F    PICTURE X.                                             
           02  FILLER REDEFINES V1654F.                                         
             03 V1654A    PICTURE X.                                            
           02  V1654I  PIC X(16).                                               
           02  V1671L    COMP  PIC  S9(4).                                      
           02  V1671F    PICTURE X.                                             
           02  FILLER REDEFINES V1671F.                                         
             03 V1671A    PICTURE X.                                            
           02  V1671I  PIC X(8).                                                
           02  V1701L    COMP  PIC  S9(4).                                      
           02  V1701F    PICTURE X.                                             
           02  FILLER REDEFINES V1701F.                                         
             03 V1701A    PICTURE X.                                            
           02  V1701I  PIC X(1).                                                
           02  V1703L    COMP  PIC  S9(4).                                      
           02  V1703F    PICTURE X.                                             
           02  FILLER REDEFINES V1703F.                                         
             03 V1703A    PICTURE X.                                            
           02  V1703I  PIC X(20).                                               
           02  V1724L    COMP  PIC  S9(4).                                      
           02  V1724F    PICTURE X.                                             
           02  FILLER REDEFINES V1724F.                                         
             03 V1724A    PICTURE X.                                            
           02  V1724I  PIC X(7).                                                
           02  V1732L    COMP  PIC  S9(4).                                      
           02  V1732F    PICTURE X.                                             
           02  FILLER REDEFINES V1732F.                                         
             03 V1732A    PICTURE X.                                            
           02  V1732I  PIC X(2).                                                
           02  V1735L    COMP  PIC  S9(4).                                      
           02  V1735F    PICTURE X.                                             
           02  FILLER REDEFINES V1735F.                                         
             03 V1735A    PICTURE X.                                            
           02  V1735I  PIC X(5).                                                
           02  V1741L    COMP  PIC  S9(4).                                      
           02  V1741F    PICTURE X.                                             
           02  FILLER REDEFINES V1741F.                                         
             03 V1741A    PICTURE X.                                            
           02  V1741I  PIC X(12).                                               
           02  V1754L    COMP  PIC  S9(4).                                      
           02  V1754F    PICTURE X.                                             
           02  FILLER REDEFINES V1754F.                                         
             03 V1754A    PICTURE X.                                            
           02  V1754I  PIC X(16).                                               
           02  V1771L    COMP  PIC  S9(4).                                      
           02  V1771F    PICTURE X.                                             
           02  FILLER REDEFINES V1771F.                                         
             03 V1771A    PICTURE X.                                            
           02  V1771I  PIC X(8).                                                
           02  V1801L    COMP  PIC  S9(4).                                      
           02  V1801F    PICTURE X.                                             
           02  FILLER REDEFINES V1801F.                                         
             03 V1801A    PICTURE X.                                            
           02  V1801I  PIC X(1).                                                
           02  V1803L    COMP  PIC  S9(4).                                      
           02  V1803F    PICTURE X.                                             
           02  FILLER REDEFINES V1803F.                                         
             03 V1803A    PICTURE X.                                            
           02  V1803I  PIC X(20).                                               
           02  V1824L    COMP  PIC  S9(4).                                      
           02  V1824F    PICTURE X.                                             
           02  FILLER REDEFINES V1824F.                                         
             03 V1824A    PICTURE X.                                            
           02  V1824I  PIC X(7).                                                
           02  V1832L    COMP  PIC  S9(4).                                      
           02  V1832F    PICTURE X.                                             
           02  FILLER REDEFINES V1832F.                                         
             03 V1832A    PICTURE X.                                            
           02  V1832I  PIC X(2).                                                
           02  V1835L    COMP  PIC  S9(4).                                      
           02  V1835F    PICTURE X.                                             
           02  FILLER REDEFINES V1835F.                                         
             03 V1835A    PICTURE X.                                            
           02  V1835I  PIC X(5).                                                
           02  V1841L    COMP  PIC  S9(4).                                      
           02  V1841F    PICTURE X.                                             
           02  FILLER REDEFINES V1841F.                                         
             03 V1841A    PICTURE X.                                            
           02  V1841I  PIC X(12).                                               
           02  V1854L    COMP  PIC  S9(4).                                      
           02  V1854F    PICTURE X.                                             
           02  FILLER REDEFINES V1854F.                                         
             03 V1854A    PICTURE X.                                            
           02  V1854I  PIC X(16).                                               
           02  V1871L    COMP  PIC  S9(4).                                      
           02  V1871F    PICTURE X.                                             
           02  FILLER REDEFINES V1871F.                                         
             03 V1871A    PICTURE X.                                            
           02  V1871I  PIC X(8).                                                
           02  V1901L    COMP  PIC  S9(4).                                      
           02  V1901F    PICTURE X.                                             
           02  FILLER REDEFINES V1901F.                                         
             03 V1901A    PICTURE X.                                            
           02  V1901I  PIC X(1).                                                
           02  V1903L    COMP  PIC  S9(4).                                      
           02  V1903F    PICTURE X.                                             
           02  FILLER REDEFINES V1903F.                                         
             03 V1903A    PICTURE X.                                            
           02  V1903I  PIC X(20).                                               
           02  V1924L    COMP  PIC  S9(4).                                      
           02  V1924F    PICTURE X.                                             
           02  FILLER REDEFINES V1924F.                                         
             03 V1924A    PICTURE X.                                            
           02  V1924I  PIC X(7).                                                
           02  V1932L    COMP  PIC  S9(4).                                      
           02  V1932F    PICTURE X.                                             
           02  FILLER REDEFINES V1932F.                                         
             03 V1932A    PICTURE X.                                            
           02  V1932I  PIC X(2).                                                
           02  V1935L    COMP  PIC  S9(4).                                      
           02  V1935F    PICTURE X.                                             
           02  FILLER REDEFINES V1935F.                                         
             03 V1935A    PICTURE X.                                            
           02  V1935I  PIC X(5).                                                
           02  V1941L    COMP  PIC  S9(4).                                      
           02  V1941F    PICTURE X.                                             
           02  FILLER REDEFINES V1941F.                                         
             03 V1941A    PICTURE X.                                            
           02  V1941I  PIC X(12).                                               
           02  V1954L    COMP  PIC  S9(4).                                      
           02  V1954F    PICTURE X.                                             
           02  FILLER REDEFINES V1954F.                                         
             03 V1954A    PICTURE X.                                            
           02  V1954I  PIC X(16).                                               
           02  V1971L    COMP  PIC  S9(4).                                      
           02  V1971F    PICTURE X.                                             
           02  FILLER REDEFINES V1971F.                                         
             03 V1971A    PICTURE X.                                            
           02  V1971I  PIC X(8).                                                
           02  V2001L    COMP  PIC  S9(4).                                      
           02  V2001F    PICTURE X.                                             
           02  FILLER REDEFINES V2001F.                                         
             03 V2001A    PICTURE X.                                            
           02  V2001I  PIC X(1).                                                
           02  V2003L    COMP  PIC  S9(4).                                      
           02  V2003F    PICTURE X.                                             
           02  FILLER REDEFINES V2003F.                                         
             03 V2003A    PICTURE X.                                            
           02  V2003I  PIC X(20).                                               
           02  V2024L    COMP  PIC  S9(4).                                      
           02  V2024F    PICTURE X.                                             
           02  FILLER REDEFINES V2024F.                                         
             03 V2024A    PICTURE X.                                            
           02  V2024I  PIC X(7).                                                
           02  V2032L    COMP  PIC  S9(4).                                      
           02  V2032F    PICTURE X.                                             
           02  FILLER REDEFINES V2032F.                                         
             03 V2032A    PICTURE X.                                            
           02  V2032I  PIC X(2).                                                
           02  V2035L    COMP  PIC  S9(4).                                      
           02  V2035F    PICTURE X.                                             
           02  FILLER REDEFINES V2035F.                                         
             03 V2035A    PICTURE X.                                            
           02  V2035I  PIC X(5).                                                
           02  V2041L    COMP  PIC  S9(4).                                      
           02  V2041F    PICTURE X.                                             
           02  FILLER REDEFINES V2041F.                                         
             03 V2041A    PICTURE X.                                            
           02  V2041I  PIC X(12).                                               
           02  V2054L    COMP  PIC  S9(4).                                      
           02  V2054F    PICTURE X.                                             
           02  FILLER REDEFINES V2054F.                                         
             03 V2054A    PICTURE X.                                            
           02  V2054I  PIC X(16).                                               
           02  V2071L    COMP  PIC  S9(4).                                      
           02  V2071F    PICTURE X.                                             
           02  FILLER REDEFINES V2071F.                                         
             03 V2071A    PICTURE X.                                            
           02  V2071I  PIC X(8).                                                
           02  V2101L    COMP  PIC  S9(4).                                      
           02  V2101F    PICTURE X.                                             
           02  FILLER REDEFINES V2101F.                                         
             03 V2101A    PICTURE X.                                            
           02  V2101I  PIC X(1).                                                
           02  V2103L    COMP  PIC  S9(4).                                      
           02  V2103F    PICTURE X.                                             
           02  FILLER REDEFINES V2103F.                                         
             03 V2103A    PICTURE X.                                            
           02  V2103I  PIC X(20).                                               
           02  V2124L    COMP  PIC  S9(4).                                      
           02  V2124F    PICTURE X.                                             
           02  FILLER REDEFINES V2124F.                                         
             03 V2124A    PICTURE X.                                            
           02  V2124I  PIC X(7).                                                
           02  V2132L    COMP  PIC  S9(4).                                      
           02  V2132F    PICTURE X.                                             
           02  FILLER REDEFINES V2132F.                                         
             03 V2132A    PICTURE X.                                            
           02  V2132I  PIC X(2).                                                
           02  V2135L    COMP  PIC  S9(4).                                      
           02  V2135F    PICTURE X.                                             
           02  FILLER REDEFINES V2135F.                                         
             03 V2135A    PICTURE X.                                            
           02  V2135I  PIC X(5).                                                
           02  V2141L    COMP  PIC  S9(4).                                      
           02  V2141F    PICTURE X.                                             
           02  FILLER REDEFINES V2141F.                                         
             03 V2141A    PICTURE X.                                            
           02  V2141I  PIC X(12).                                               
           02  V2154L    COMP  PIC  S9(4).                                      
           02  V2154F    PICTURE X.                                             
           02  FILLER REDEFINES V2154F.                                         
             03 V2154A    PICTURE X.                                            
           02  V2154I  PIC X(16).                                               
           02  V2171L    COMP  PIC  S9(4).                                      
           02  V2171F    PICTURE X.                                             
           02  FILLER REDEFINES V2171F.                                         
             03 V2171A    PICTURE X.                                            
           02  V2171I  PIC X(8).                                                
           02  V2201L    COMP  PIC  S9(4).                                      
           02  V2201F    PICTURE X.                                             
           02  FILLER REDEFINES V2201F.                                         
             03 V2201A    PICTURE X.                                            
           02  V2201I  PIC X(79).                                               
           02  V2315L    COMP  PIC  S9(4).                                      
           02  V2315F    PICTURE X.                                             
           02  FILLER REDEFINES V2315F.                                         
             03 V2315A    PICTURE X.                                            
           02  V2315I  PIC X(4).                                                
           02  V2401L    COMP  PIC  S9(4).                                      
           02  V2401F    PICTURE X.                                             
           02  FILLER REDEFINES V2401F.                                         
             03 V2401A    PICTURE X.                                            
           02  V2401I  PIC X(35).                                               
       01  BKD0002O REDEFINES BKD0002I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  V0713O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0745O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0768O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  V0813O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0845O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0868O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0968O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1059O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1067O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1076O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1401O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1403O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1424O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1432O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1435O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1441O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1454O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1471O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1501O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1503O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1524O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1532O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1535O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1541O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1557O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1571O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1601O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1603O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1624O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1632O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1635O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1641O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1654O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1671O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1701O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1703O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1724O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1732O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1735O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1741O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1754O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1771O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1801O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1803O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1824O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1832O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1835O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1841O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1854O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1871O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1901O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1903O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1924O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1932O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1935O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1941O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1954O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1971O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2001O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2003O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2024O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2032O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2035O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2041O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2054O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2071O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2101O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2103O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2124O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2132O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2135O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2141O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2154O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2171O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2201O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2315O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2401O  PIC X(35).                                               
