       01  BKD0004I.                                                            
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  V0801L    COMP  PIC  S9(4).                                      
           02  V0801F    PICTURE X.                                             
           02  FILLER REDEFINES V0801F.                                         
             03 V0801A    PICTURE X.                                            
           02  V0801I  PIC X(3).                                                
           02  V0805L    COMP  PIC  S9(4).                                      
           02  V0805F    PICTURE X.                                             
           02  FILLER REDEFINES V0805F.                                         
             03 V0805A    PICTURE X.                                            
           02  V0805I  PIC X(4).                                                
           02  V0810L    COMP  PIC  S9(4).                                      
           02  V0810F    PICTURE X.                                             
           02  FILLER REDEFINES V0810F.                                         
             03 V0810A    PICTURE X.                                            
           02  V0810I  PIC X(1).                                                
           02  V0814L    COMP  PIC  S9(4).                                      
           02  V0814F    PICTURE X.                                             
           02  FILLER REDEFINES V0814F.                                         
             03 V0814A    PICTURE X.                                            
           02  V0814I  PIC X(15).                                               
           02  V0830L    COMP  PIC  S9(4).                                      
           02  V0830F    PICTURE X.                                             
           02  FILLER REDEFINES V0830F.                                         
             03 V0830A    PICTURE X.                                            
           02  V0830I  PIC X(3).                                                
           02  V0834L    COMP  PIC  S9(4).                                      
           02  V0834F    PICTURE X.                                             
           02  FILLER REDEFINES V0834F.                                         
             03 V0834A    PICTURE X.                                            
           02  V0834I  PIC X(4).                                                
           02  V0839L    COMP  PIC  S9(4).                                      
           02  V0839F    PICTURE X.                                             
           02  FILLER REDEFINES V0839F.                                         
             03 V0839A    PICTURE X.                                            
           02  V0839I  PIC X(1).                                                
           02  V0843L    COMP  PIC  S9(4).                                      
           02  V0843F    PICTURE X.                                             
           02  FILLER REDEFINES V0843F.                                         
             03 V0843A    PICTURE X.                                            
           02  V0843I  PIC X(15).                                               
           02  V0861L    COMP  PIC  S9(4).                                      
           02  V0861F    PICTURE X.                                             
           02  FILLER REDEFINES V0861F.                                         
             03 V0861A    PICTURE X.                                            
           02  V0861I  PIC X(1).                                                
           02  V0901L    COMP  PIC  S9(4).                                      
           02  V0901F    PICTURE X.                                             
           02  FILLER REDEFINES V0901F.                                         
             03 V0901A    PICTURE X.                                            
           02  V0901I  PIC X(3).                                                
           02  V0905L    COMP  PIC  S9(4).                                      
           02  V0905F    PICTURE X.                                             
           02  FILLER REDEFINES V0905F.                                         
             03 V0905A    PICTURE X.                                            
           02  V0905I  PIC X(4).                                                
           02  V0910L    COMP  PIC  S9(4).                                      
           02  V0910F    PICTURE X.                                             
           02  FILLER REDEFINES V0910F.                                         
             03 V0910A    PICTURE X.                                            
           02  V0910I  PIC X(1).                                                
           02  V0914L    COMP  PIC  S9(4).                                      
           02  V0914F    PICTURE X.                                             
           02  FILLER REDEFINES V0914F.                                         
             03 V0914A    PICTURE X.                                            
           02  V0914I  PIC X(15).                                               
           02  V0930L    COMP  PIC  S9(4).                                      
           02  V0930F    PICTURE X.                                             
           02  FILLER REDEFINES V0930F.                                         
             03 V0930A    PICTURE X.                                            
           02  V0930I  PIC X(3).                                                
           02  V0934L    COMP  PIC  S9(4).                                      
           02  V0934F    PICTURE X.                                             
           02  FILLER REDEFINES V0934F.                                         
             03 V0934A    PICTURE X.                                            
           02  V0934I  PIC X(4).                                                
           02  V0939L    COMP  PIC  S9(4).                                      
           02  V0939F    PICTURE X.                                             
           02  FILLER REDEFINES V0939F.                                         
             03 V0939A    PICTURE X.                                            
           02  V0939I  PIC X(1).                                                
           02  V0943L    COMP  PIC  S9(4).                                      
           02  V0943F    PICTURE X.                                             
           02  FILLER REDEFINES V0943F.                                         
             03 V0943A    PICTURE X.                                            
           02  V0943I  PIC X(15).                                               
           02  V0961L    COMP  PIC  S9(4).                                      
           02  V0961F    PICTURE X.                                             
           02  FILLER REDEFINES V0961F.                                         
             03 V0961A    PICTURE X.                                            
           02  V0961I  PIC X(1).                                                
           02  V1001L    COMP  PIC  S9(4).                                      
           02  V1001F    PICTURE X.                                             
           02  FILLER REDEFINES V1001F.                                         
             03 V1001A    PICTURE X.                                            
           02  V1001I  PIC X(3).                                                
           02  V1005L    COMP  PIC  S9(4).                                      
           02  V1005F    PICTURE X.                                             
           02  FILLER REDEFINES V1005F.                                         
             03 V1005A    PICTURE X.                                            
           02  V1005I  PIC X(4).                                                
           02  V1010L    COMP  PIC  S9(4).                                      
           02  V1010F    PICTURE X.                                             
           02  FILLER REDEFINES V1010F.                                         
             03 V1010A    PICTURE X.                                            
           02  V1010I  PIC X(1).                                                
           02  V1014L    COMP  PIC  S9(4).                                      
           02  V1014F    PICTURE X.                                             
           02  FILLER REDEFINES V1014F.                                         
             03 V1014A    PICTURE X.                                            
           02  V1014I  PIC X(15).                                               
           02  V1030L    COMP  PIC  S9(4).                                      
           02  V1030F    PICTURE X.                                             
           02  FILLER REDEFINES V1030F.                                         
             03 V1030A    PICTURE X.                                            
           02  V1030I  PIC X(3).                                                
           02  V1034L    COMP  PIC  S9(4).                                      
           02  V1034F    PICTURE X.                                             
           02  FILLER REDEFINES V1034F.                                         
             03 V1034A    PICTURE X.                                            
           02  V1034I  PIC X(4).                                                
           02  V1039L    COMP  PIC  S9(4).                                      
           02  V1039F    PICTURE X.                                             
           02  FILLER REDEFINES V1039F.                                         
             03 V1039A    PICTURE X.                                            
           02  V1039I  PIC X(1).                                                
           02  V1043L    COMP  PIC  S9(4).                                      
           02  V1043F    PICTURE X.                                             
           02  FILLER REDEFINES V1043F.                                         
             03 V1043A    PICTURE X.                                            
           02  V1043I  PIC X(15).                                               
           02  V1061L    COMP  PIC  S9(4).                                      
           02  V1061F    PICTURE X.                                             
           02  FILLER REDEFINES V1061F.                                         
             03 V1061A    PICTURE X.                                            
           02  V1061I  PIC X(1).                                                
           02  V1101L    COMP  PIC  S9(4).                                      
           02  V1101F    PICTURE X.                                             
           02  FILLER REDEFINES V1101F.                                         
             03 V1101A    PICTURE X.                                            
           02  V1101I  PIC X(3).                                                
           02  V1105L    COMP  PIC  S9(4).                                      
           02  V1105F    PICTURE X.                                             
           02  FILLER REDEFINES V1105F.                                         
             03 V1105A    PICTURE X.                                            
           02  V1105I  PIC X(4).                                                
           02  V1110L    COMP  PIC  S9(4).                                      
           02  V1110F    PICTURE X.                                             
           02  FILLER REDEFINES V1110F.                                         
             03 V1110A    PICTURE X.                                            
           02  V1110I  PIC X(1).                                                
           02  V1114L    COMP  PIC  S9(4).                                      
           02  V1114F    PICTURE X.                                             
           02  FILLER REDEFINES V1114F.                                         
             03 V1114A    PICTURE X.                                            
           02  V1114I  PIC X(15).                                               
           02  V1130L    COMP  PIC  S9(4).                                      
           02  V1130F    PICTURE X.                                             
           02  FILLER REDEFINES V1130F.                                         
             03 V1130A    PICTURE X.                                            
           02  V1130I  PIC X(3).                                                
           02  V1134L    COMP  PIC  S9(4).                                      
           02  V1134F    PICTURE X.                                             
           02  FILLER REDEFINES V1134F.                                         
             03 V1134A    PICTURE X.                                            
           02  V1134I  PIC X(4).                                                
           02  V1139L    COMP  PIC  S9(4).                                      
           02  V1139F    PICTURE X.                                             
           02  FILLER REDEFINES V1139F.                                         
             03 V1139A    PICTURE X.                                            
           02  V1139I  PIC X(1).                                                
           02  V1143L    COMP  PIC  S9(4).                                      
           02  V1143F    PICTURE X.                                             
           02  FILLER REDEFINES V1143F.                                         
             03 V1143A    PICTURE X.                                            
           02  V1143I  PIC X(15).                                               
           02  V1161L    COMP  PIC  S9(4).                                      
           02  V1161F    PICTURE X.                                             
           02  FILLER REDEFINES V1161F.                                         
             03 V1161A    PICTURE X.                                            
           02  V1161I  PIC X(1).                                                
           02  V1201L    COMP  PIC  S9(4).                                      
           02  V1201F    PICTURE X.                                             
           02  FILLER REDEFINES V1201F.                                         
             03 V1201A    PICTURE X.                                            
           02  V1201I  PIC X(3).                                                
           02  V1205L    COMP  PIC  S9(4).                                      
           02  V1205F    PICTURE X.                                             
           02  FILLER REDEFINES V1205F.                                         
             03 V1205A    PICTURE X.                                            
           02  V1205I  PIC X(4).                                                
           02  V1210L    COMP  PIC  S9(4).                                      
           02  V1210F    PICTURE X.                                             
           02  FILLER REDEFINES V1210F.                                         
             03 V1210A    PICTURE X.                                            
           02  V1210I  PIC X(1).                                                
           02  V1214L    COMP  PIC  S9(4).                                      
           02  V1214F    PICTURE X.                                             
           02  FILLER REDEFINES V1214F.                                         
             03 V1214A    PICTURE X.                                            
           02  V1214I  PIC X(15).                                               
           02  V1230L    COMP  PIC  S9(4).                                      
           02  V1230F    PICTURE X.                                             
           02  FILLER REDEFINES V1230F.                                         
             03 V1230A    PICTURE X.                                            
           02  V1230I  PIC X(3).                                                
           02  V1234L    COMP  PIC  S9(4).                                      
           02  V1234F    PICTURE X.                                             
           02  FILLER REDEFINES V1234F.                                         
             03 V1234A    PICTURE X.                                            
           02  V1234I  PIC X(4).                                                
           02  V1239L    COMP  PIC  S9(4).                                      
           02  V1239F    PICTURE X.                                             
           02  FILLER REDEFINES V1239F.                                         
             03 V1239A    PICTURE X.                                            
           02  V1239I  PIC X(1).                                                
           02  V1243L    COMP  PIC  S9(4).                                      
           02  V1243F    PICTURE X.                                             
           02  FILLER REDEFINES V1243F.                                         
             03 V1243A    PICTURE X.                                            
           02  V1243I  PIC X(15).                                               
           02  V1261L    COMP  PIC  S9(4).                                      
           02  V1261F    PICTURE X.                                             
           02  FILLER REDEFINES V1261F.                                         
             03 V1261A    PICTURE X.                                            
           02  V1261I  PIC X(1).                                                
           02  V1301L    COMP  PIC  S9(4).                                      
           02  V1301F    PICTURE X.                                             
           02  FILLER REDEFINES V1301F.                                         
             03 V1301A    PICTURE X.                                            
           02  V1301I  PIC X(3).                                                
           02  V1305L    COMP  PIC  S9(4).                                      
           02  V1305F    PICTURE X.                                             
           02  FILLER REDEFINES V1305F.                                         
             03 V1305A    PICTURE X.                                            
           02  V1305I  PIC X(4).                                                
           02  V1310L    COMP  PIC  S9(4).                                      
           02  V1310F    PICTURE X.                                             
           02  FILLER REDEFINES V1310F.                                         
             03 V1310A    PICTURE X.                                            
           02  V1310I  PIC X(1).                                                
           02  V1314L    COMP  PIC  S9(4).                                      
           02  V1314F    PICTURE X.                                             
           02  FILLER REDEFINES V1314F.                                         
             03 V1314A    PICTURE X.                                            
           02  V1314I  PIC X(15).                                               
           02  V1330L    COMP  PIC  S9(4).                                      
           02  V1330F    PICTURE X.                                             
           02  FILLER REDEFINES V1330F.                                         
             03 V1330A    PICTURE X.                                            
           02  V1330I  PIC X(3).                                                
           02  V1334L    COMP  PIC  S9(4).                                      
           02  V1334F    PICTURE X.                                             
           02  FILLER REDEFINES V1334F.                                         
             03 V1334A    PICTURE X.                                            
           02  V1334I  PIC X(4).                                                
           02  V1339L    COMP  PIC  S9(4).                                      
           02  V1339F    PICTURE X.                                             
           02  FILLER REDEFINES V1339F.                                         
             03 V1339A    PICTURE X.                                            
           02  V1339I  PIC X(1).                                                
           02  V1343L    COMP  PIC  S9(4).                                      
           02  V1343F    PICTURE X.                                             
           02  FILLER REDEFINES V1343F.                                         
             03 V1343A    PICTURE X.                                            
           02  V1343I  PIC X(15).                                               
           02  V1361L    COMP  PIC  S9(4).                                      
           02  V1361F    PICTURE X.                                             
           02  FILLER REDEFINES V1361F.                                         
             03 V1361A    PICTURE X.                                            
           02  V1361I  PIC X(1).                                                
           02  V1401L    COMP  PIC  S9(4).                                      
           02  V1401F    PICTURE X.                                             
           02  FILLER REDEFINES V1401F.                                         
             03 V1401A    PICTURE X.                                            
           02  V1401I  PIC X(3).                                                
           02  V1405L    COMP  PIC  S9(4).                                      
           02  V1405F    PICTURE X.                                             
           02  FILLER REDEFINES V1405F.                                         
             03 V1405A    PICTURE X.                                            
           02  V1405I  PIC X(4).                                                
           02  V1410L    COMP  PIC  S9(4).                                      
           02  V1410F    PICTURE X.                                             
           02  FILLER REDEFINES V1410F.                                         
             03 V1410A    PICTURE X.                                            
           02  V1410I  PIC X(1).                                                
           02  V1414L    COMP  PIC  S9(4).                                      
           02  V1414F    PICTURE X.                                             
           02  FILLER REDEFINES V1414F.                                         
             03 V1414A    PICTURE X.                                            
           02  V1414I  PIC X(15).                                               
           02  V1430L    COMP  PIC  S9(4).                                      
           02  V1430F    PICTURE X.                                             
           02  FILLER REDEFINES V1430F.                                         
             03 V1430A    PICTURE X.                                            
           02  V1430I  PIC X(3).                                                
           02  V1434L    COMP  PIC  S9(4).                                      
           02  V1434F    PICTURE X.                                             
           02  FILLER REDEFINES V1434F.                                         
             03 V1434A    PICTURE X.                                            
           02  V1434I  PIC X(4).                                                
           02  V1439L    COMP  PIC  S9(4).                                      
           02  V1439F    PICTURE X.                                             
           02  FILLER REDEFINES V1439F.                                         
             03 V1439A    PICTURE X.                                            
           02  V1439I  PIC X(1).                                                
           02  V1443L    COMP  PIC  S9(4).                                      
           02  V1443F    PICTURE X.                                             
           02  FILLER REDEFINES V1443F.                                         
             03 V1443A    PICTURE X.                                            
           02  V1443I  PIC X(15).                                               
           02  V1461L    COMP  PIC  S9(4).                                      
           02  V1461F    PICTURE X.                                             
           02  FILLER REDEFINES V1461F.                                         
             03 V1461A    PICTURE X.                                            
           02  V1461I  PIC X(1).                                                
           02  V1501L    COMP  PIC  S9(4).                                      
           02  V1501F    PICTURE X.                                             
           02  FILLER REDEFINES V1501F.                                         
             03 V1501A    PICTURE X.                                            
           02  V1501I  PIC X(3).                                                
           02  V1505L    COMP  PIC  S9(4).                                      
           02  V1505F    PICTURE X.                                             
           02  FILLER REDEFINES V1505F.                                         
             03 V1505A    PICTURE X.                                            
           02  V1505I  PIC X(4).                                                
           02  V1510L    COMP  PIC  S9(4).                                      
           02  V1510F    PICTURE X.                                             
           02  FILLER REDEFINES V1510F.                                         
             03 V1510A    PICTURE X.                                            
           02  V1510I  PIC X(1).                                                
           02  V1514L    COMP  PIC  S9(4).                                      
           02  V1514F    PICTURE X.                                             
           02  FILLER REDEFINES V1514F.                                         
             03 V1514A    PICTURE X.                                            
           02  V1514I  PIC X(15).                                               
           02  V1530L    COMP  PIC  S9(4).                                      
           02  V1530F    PICTURE X.                                             
           02  FILLER REDEFINES V1530F.                                         
             03 V1530A    PICTURE X.                                            
           02  V1530I  PIC X(3).                                                
           02  V1534L    COMP  PIC  S9(4).                                      
           02  V1534F    PICTURE X.                                             
           02  FILLER REDEFINES V1534F.                                         
             03 V1534A    PICTURE X.                                            
           02  V1534I  PIC X(4).                                                
           02  V1539L    COMP  PIC  S9(4).                                      
           02  V1539F    PICTURE X.                                             
           02  FILLER REDEFINES V1539F.                                         
             03 V1539A    PICTURE X.                                            
           02  V1539I  PIC X(1).                                                
           02  V1543L    COMP  PIC  S9(4).                                      
           02  V1543F    PICTURE X.                                             
           02  FILLER REDEFINES V1543F.                                         
             03 V1543A    PICTURE X.                                            
           02  V1543I  PIC X(15).                                               
           02  V1561L    COMP  PIC  S9(4).                                      
           02  V1561F    PICTURE X.                                             
           02  FILLER REDEFINES V1561F.                                         
             03 V1561A    PICTURE X.                                            
           02  V1561I  PIC X(1).                                                
           02  V1601L    COMP  PIC  S9(4).                                      
           02  V1601F    PICTURE X.                                             
           02  FILLER REDEFINES V1601F.                                         
             03 V1601A    PICTURE X.                                            
           02  V1601I  PIC X(3).                                                
           02  V1605L    COMP  PIC  S9(4).                                      
           02  V1605F    PICTURE X.                                             
           02  FILLER REDEFINES V1605F.                                         
             03 V1605A    PICTURE X.                                            
           02  V1605I  PIC X(4).                                                
           02  V1610L    COMP  PIC  S9(4).                                      
           02  V1610F    PICTURE X.                                             
           02  FILLER REDEFINES V1610F.                                         
             03 V1610A    PICTURE X.                                            
           02  V1610I  PIC X(1).                                                
           02  V1614L    COMP  PIC  S9(4).                                      
           02  V1614F    PICTURE X.                                             
           02  FILLER REDEFINES V1614F.                                         
             03 V1614A    PICTURE X.                                            
           02  V1614I  PIC X(15).                                               
           02  V1630L    COMP  PIC  S9(4).                                      
           02  V1630F    PICTURE X.                                             
           02  FILLER REDEFINES V1630F.                                         
             03 V1630A    PICTURE X.                                            
           02  V1630I  PIC X(3).                                                
           02  V1634L    COMP  PIC  S9(4).                                      
           02  V1634F    PICTURE X.                                             
           02  FILLER REDEFINES V1634F.                                         
             03 V1634A    PICTURE X.                                            
           02  V1634I  PIC X(4).                                                
           02  V1639L    COMP  PIC  S9(4).                                      
           02  V1639F    PICTURE X.                                             
           02  FILLER REDEFINES V1639F.                                         
             03 V1639A    PICTURE X.                                            
           02  V1639I  PIC X(1).                                                
           02  V1643L    COMP  PIC  S9(4).                                      
           02  V1643F    PICTURE X.                                             
           02  FILLER REDEFINES V1643F.                                         
             03 V1643A    PICTURE X.                                            
           02  V1643I  PIC X(15).                                               
           02  V1661L    COMP  PIC  S9(4).                                      
           02  V1661F    PICTURE X.                                             
           02  FILLER REDEFINES V1661F.                                         
             03 V1661A    PICTURE X.                                            
           02  V1661I  PIC X(1).                                                
           02  V1701L    COMP  PIC  S9(4).                                      
           02  V1701F    PICTURE X.                                             
           02  FILLER REDEFINES V1701F.                                         
             03 V1701A    PICTURE X.                                            
           02  V1701I  PIC X(3).                                                
           02  V1705L    COMP  PIC  S9(4).                                      
           02  V1705F    PICTURE X.                                             
           02  FILLER REDEFINES V1705F.                                         
             03 V1705A    PICTURE X.                                            
           02  V1705I  PIC X(4).                                                
           02  V1710L    COMP  PIC  S9(4).                                      
           02  V1710F    PICTURE X.                                             
           02  FILLER REDEFINES V1710F.                                         
             03 V1710A    PICTURE X.                                            
           02  V1710I  PIC X(1).                                                
           02  V1714L    COMP  PIC  S9(4).                                      
           02  V1714F    PICTURE X.                                             
           02  FILLER REDEFINES V1714F.                                         
             03 V1714A    PICTURE X.                                            
           02  V1714I  PIC X(15).                                               
           02  V1730L    COMP  PIC  S9(4).                                      
           02  V1730F    PICTURE X.                                             
           02  FILLER REDEFINES V1730F.                                         
             03 V1730A    PICTURE X.                                            
           02  V1730I  PIC X(3).                                                
           02  V1734L    COMP  PIC  S9(4).                                      
           02  V1734F    PICTURE X.                                             
           02  FILLER REDEFINES V1734F.                                         
             03 V1734A    PICTURE X.                                            
           02  V1734I  PIC X(4).                                                
           02  V1739L    COMP  PIC  S9(4).                                      
           02  V1739F    PICTURE X.                                             
           02  FILLER REDEFINES V1739F.                                         
             03 V1739A    PICTURE X.                                            
           02  V1739I  PIC X(1).                                                
           02  V1743L    COMP  PIC  S9(4).                                      
           02  V1743F    PICTURE X.                                             
           02  FILLER REDEFINES V1743F.                                         
             03 V1743A    PICTURE X.                                            
           02  V1743I  PIC X(15).                                               
           02  V1761L    COMP  PIC  S9(4).                                      
           02  V1761F    PICTURE X.                                             
           02  FILLER REDEFINES V1761F.                                         
             03 V1761A    PICTURE X.                                            
           02  V1761I  PIC X(1).                                                
           02  V1801L    COMP  PIC  S9(4).                                      
           02  V1801F    PICTURE X.                                             
           02  FILLER REDEFINES V1801F.                                         
             03 V1801A    PICTURE X.                                            
           02  V1801I  PIC X(3).                                                
           02  V1805L    COMP  PIC  S9(4).                                      
           02  V1805F    PICTURE X.                                             
           02  FILLER REDEFINES V1805F.                                         
             03 V1805A    PICTURE X.                                            
           02  V1805I  PIC X(4).                                                
           02  V1810L    COMP  PIC  S9(4).                                      
           02  V1810F    PICTURE X.                                             
           02  FILLER REDEFINES V1810F.                                         
             03 V1810A    PICTURE X.                                            
           02  V1810I  PIC X(1).                                                
           02  V1814L    COMP  PIC  S9(4).                                      
           02  V1814F    PICTURE X.                                             
           02  FILLER REDEFINES V1814F.                                         
             03 V1814A    PICTURE X.                                            
           02  V1814I  PIC X(15).                                               
           02  V1830L    COMP  PIC  S9(4).                                      
           02  V1830F    PICTURE X.                                             
           02  FILLER REDEFINES V1830F.                                         
             03 V1830A    PICTURE X.                                            
           02  V1830I  PIC X(3).                                                
           02  V1834L    COMP  PIC  S9(4).                                      
           02  V1834F    PICTURE X.                                             
           02  FILLER REDEFINES V1834F.                                         
             03 V1834A    PICTURE X.                                            
           02  V1834I  PIC X(4).                                                
           02  V1839L    COMP  PIC  S9(4).                                      
           02  V1839F    PICTURE X.                                             
           02  FILLER REDEFINES V1839F.                                         
             03 V1839A    PICTURE X.                                            
           02  V1839I  PIC X(1).                                                
           02  V1843L    COMP  PIC  S9(4).                                      
           02  V1843F    PICTURE X.                                             
           02  FILLER REDEFINES V1843F.                                         
             03 V1843A    PICTURE X.                                            
           02  V1843I  PIC X(15).                                               
           02  V1861L    COMP  PIC  S9(4).                                      
           02  V1861F    PICTURE X.                                             
           02  FILLER REDEFINES V1861F.                                         
             03 V1861A    PICTURE X.                                            
           02  V1861I  PIC X(1).                                                
           02  V1901L    COMP  PIC  S9(4).                                      
           02  V1901F    PICTURE X.                                             
           02  FILLER REDEFINES V1901F.                                         
             03 V1901A    PICTURE X.                                            
           02  V1901I  PIC X(3).                                                
           02  V1905L    COMP  PIC  S9(4).                                      
           02  V1905F    PICTURE X.                                             
           02  FILLER REDEFINES V1905F.                                         
             03 V1905A    PICTURE X.                                            
           02  V1905I  PIC X(4).                                                
           02  V1910L    COMP  PIC  S9(4).                                      
           02  V1910F    PICTURE X.                                             
           02  FILLER REDEFINES V1910F.                                         
             03 V1910A    PICTURE X.                                            
           02  V1910I  PIC X(1).                                                
           02  V1914L    COMP  PIC  S9(4).                                      
           02  V1914F    PICTURE X.                                             
           02  FILLER REDEFINES V1914F.                                         
             03 V1914A    PICTURE X.                                            
           02  V1914I  PIC X(15).                                               
           02  V1930L    COMP  PIC  S9(4).                                      
           02  V1930F    PICTURE X.                                             
           02  FILLER REDEFINES V1930F.                                         
             03 V1930A    PICTURE X.                                            
           02  V1930I  PIC X(3).                                                
           02  V1934L    COMP  PIC  S9(4).                                      
           02  V1934F    PICTURE X.                                             
           02  FILLER REDEFINES V1934F.                                         
             03 V1934A    PICTURE X.                                            
           02  V1934I  PIC X(4).                                                
           02  V1939L    COMP  PIC  S9(4).                                      
           02  V1939F    PICTURE X.                                             
           02  FILLER REDEFINES V1939F.                                         
             03 V1939A    PICTURE X.                                            
           02  V1939I  PIC X(1).                                                
           02  V1943L    COMP  PIC  S9(4).                                      
           02  V1943F    PICTURE X.                                             
           02  FILLER REDEFINES V1943F.                                         
             03 V1943A    PICTURE X.                                            
           02  V1943I  PIC X(15).                                               
           02  V1961L    COMP  PIC  S9(4).                                      
           02  V1961F    PICTURE X.                                             
           02  FILLER REDEFINES V1961F.                                         
             03 V1961A    PICTURE X.                                            
           02  V1961I  PIC X(1).                                                
           02  V2201L    COMP  PIC  S9(4).                                      
           02  V2201F    PICTURE X.                                             
           02  FILLER REDEFINES V2201F.                                         
             03 V2201A    PICTURE X.                                            
           02  V2201I  PIC X(79).                                               
           02  V2315L    COMP  PIC  S9(4).                                      
           02  V2315F    PICTURE X.                                             
           02  FILLER REDEFINES V2315F.                                         
             03 V2315A    PICTURE X.                                            
           02  V2315I  PIC X(4).                                                
           02  V2401L    COMP  PIC  S9(4).                                      
           02  V2401F    PICTURE X.                                             
           02  FILLER REDEFINES V2401F.                                         
             03 V2401A    PICTURE X.                                            
           02  V2401I  PIC X(70).                                               
       01  BKD0004O REDEFINES BKD0004I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  V0801O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0805O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0810O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0814O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V0830O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0834O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0839O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0843O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V0861O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0901O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0905O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0910O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0914O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V0930O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0934O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0939O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V0943O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V0961O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1001O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1005O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1010O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1014O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1030O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1034O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1039O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1043O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1061O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1101O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1105O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1110O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1114O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1130O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1134O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1139O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1143O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1161O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1201O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1205O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1210O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1214O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1230O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1234O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1239O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1243O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1261O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1301O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1305O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1310O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1314O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1330O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1334O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1339O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1343O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1361O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1401O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1405O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1410O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1414O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1430O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1434O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1439O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1443O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1461O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1501O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1505O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1510O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1514O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1530O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1534O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1539O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1543O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1561O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1601O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1605O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1610O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1614O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1630O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1634O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1639O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1643O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1661O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1701O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1705O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1710O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1714O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1730O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1734O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1739O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1743O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1761O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1801O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1805O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1810O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1814O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1830O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1834O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1839O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1843O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1861O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1901O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1905O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1910O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1914O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1930O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1934O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1939O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V1943O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  V1961O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2201O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2315O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  V2401O  PIC X(70).                                               
