       01  BPA0040I.                                                            
           02  FILLER PIC X(12).                                                
           02  APRSUFBL    COMP  PIC  S9(4).                                    
           02  APRSUFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRSUFBF.                                       
             03 APRSUFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRSUFBI  PIC X(22).                                             
           02  ARATBTGL    COMP  PIC  S9(4).                                    
           02  ARATBTGF    PICTURE X.                                           
           02  FILLER REDEFINES ARATBTGF.                                       
             03 ARATBTGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARATBTGI  PIC X(15).                                             
           02  AHISTNRL    COMP  PIC  S9(4).                                    
           02  AHISTNRF    PICTURE X.                                           
           02  FILLER REDEFINES AHISTNRF.                                       
             03 AHISTNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISTNRI  PIC X(3).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  AFBKENNL    COMP  PIC  S9(4).                                    
           02  AFBKENNF    PICTURE X.                                           
           02  FILLER REDEFINES AFBKENNF.                                       
             03 AFBKENNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBKENNI  PIC X(8).                                              
           02  AGLKENNL    COMP  PIC  S9(4).                                    
           02  AGLKENNF    PICTURE X.                                           
           02  FILLER REDEFINES AGLKENNF.                                       
             03 AGLKENNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGLKENNI  PIC X(6).                                              
           02  AORDNRL    COMP  PIC  S9(4).                                     
           02  AORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES AORDNRF.                                        
             03 AORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AORDNRI  PIC X(2).                                               
           02  AFAEVTTL    COMP  PIC  S9(4).                                    
           02  AFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVTTF.                                       
             03 AFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVTTI  PIC X(2).                                              
           02  AFAEVMML    COMP  PIC  S9(4).                                    
           02  AFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVMMF.                                       
             03 AFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVMMI  PIC X(2).                                              
           02  AFAEVJJL    COMP  PIC  S9(4).                                    
           02  AFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVJJF.                                       
             03 AFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVJJI  PIC X(4).                                              
           02  AFAEBTTL    COMP  PIC  S9(4).                                    
           02  AFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBTTF.                                       
             03 AFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBTTI  PIC X(2).                                              
           02  AFAEBMML    COMP  PIC  S9(4).                                    
           02  AFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBMMF.                                       
             03 AFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBMMI  PIC X(2).                                              
           02  AFAEBJJL    COMP  PIC  S9(4).                                    
           02  AFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBJJF.                                       
             03 AFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBJJI  PIC X(4).                                              
           02  AFOLGNRL    COMP  PIC  S9(4).                                    
           02  AFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES AFOLGNRF.                                       
             03 AFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFOLGNRI  PIC X(3).                                              
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  AUNTERL    COMP  PIC  S9(4).                                     
           02  AUNTERF    PICTURE X.                                            
           02  FILLER REDEFINES AUNTERF.                                        
             03 AUNTERA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUNTERI  PIC X(3).                                               
           02  ASCHICHL    COMP  PIC  S9(4).                                    
           02  ASCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ASCHICHF.                                       
             03 ASCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASCHICHI  PIC X(3).                                              
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AURSPFBL    COMP  PIC  S9(4).                                    
           02  AURSPFBF    PICTURE X.                                           
           02  FILLER REDEFINES AURSPFBF.                                       
             03 AURSPFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AURSPFBI  PIC X(19).                                             
           02  AURPDATL    COMP  PIC  S9(4).                                    
           02  AURPDATF    PICTURE X.                                           
           02  FILLER REDEFINES AURPDATF.                                       
             03 AURPDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AURPDATI  PIC X(10).                                             
           02  ABERSUBL    COMP  PIC  S9(4).                                    
           02  ABERSUBF    PICTURE X.                                           
           02  FILLER REDEFINES ABERSUBF.                                       
             03 ABERSUBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABERSUBI  PIC X(15).                                             
           02  APOLDATL    COMP  PIC  S9(4).                                    
           02  APOLDATF    PICTURE X.                                           
           02  FILLER REDEFINES APOLDATF.                                       
             03 APOLDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APOLDATI  PIC X(10).                                             
           02  ARDBWFBL    COMP  PIC  S9(4).                                    
           02  ARDBWFBF    PICTURE X.                                           
           02  FILLER REDEFINES ARDBWFBF.                                       
             03 ARDBWFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARDBWFBI  PIC X(22).                                             
           02  ARBEWSUL    COMP  PIC  S9(4).                                    
           02  ARBEWSUF    PICTURE X.                                           
           02  FILLER REDEFINES ARBEWSUF.                                       
             03 ARBEWSUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARBEWSUI  PIC X(15).                                             
           02  APPFLBEL    COMP  PIC  S9(4).                                    
           02  APPFLBEF    PICTURE X.                                           
           02  FILLER REDEFINES APPFLBEF.                                       
             03 APPFLBEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFLBEI  PIC X(10).                                             
           02  ABZDAUEL    COMP  PIC  S9(4).                                    
           02  ABZDAUEF    PICTURE X.                                           
           02  FILLER REDEFINES ABZDAUEF.                                       
             03 ABZDAUEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABZDAUEI  PIC X(4).                                              
           02  APPFLABL    COMP  PIC  S9(4).                                    
           02  APPFLABF    PICTURE X.                                           
           02  FILLER REDEFINES APPFLABF.                                       
             03 APPFLABA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFLABI  PIC X(10).                                             
           02  AGSDAUEL    COMP  PIC  S9(4).                                    
           02  AGSDAUEF    PICTURE X.                                           
           02  FILLER REDEFINES AGSDAUEF.                                       
             03 AGSDAUEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGSDAUEI  PIC X(4).                                              
           02  AINKSSTL    COMP  PIC  S9(4).                                    
           02  AINKSSTF    PICTURE X.                                           
           02  FILLER REDEFINES AINKSSTF.                                       
             03 AINKSSTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AINKSSTI  PIC X(10).                                             
           02  AJAHRBTL    COMP  PIC  S9(4).                                    
           02  AJAHRBTF    PICTURE X.                                           
           02  FILLER REDEFINES AJAHRBTF.                                       
             03 AJAHRBTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AJAHRBTI  PIC X(13).                                             
           02  AINKAFBL    COMP  PIC  S9(4).                                    
           02  AINKAFBF    PICTURE X.                                           
           02  FILLER REDEFINES AINKAFBF.                                       
             03 AINKAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AINKAFBI  PIC X(19).                                             
           02  AINKSL    COMP  PIC  S9(4).                                      
           02  AINKSF    PICTURE X.                                             
           02  FILLER REDEFINES AINKSF.                                         
             03 AINKSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AINKSI  PIC X(2).                                                
           02  AINKSBML    COMP  PIC  S9(4).                                    
           02  AINKSBMF    PICTURE X.                                           
           02  FILLER REDEFINES AINKSBMF.                                       
             03 AINKSBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AINKSBMI  PIC X(10).                                             
           02  ABWBTFBL    COMP  PIC  S9(4).                                    
           02  ABWBTFBF    PICTURE X.                                           
           02  FILLER REDEFINES ABWBTFBF.                                       
             03 ABWBTFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABWBTFBI  PIC X(22).                                             
           02  ABWTBTL    COMP  PIC  S9(4).                                     
           02  ABWTBTF    PICTURE X.                                            
           02  FILLER REDEFINES ABWTBTF.                                        
             03 ABWTBTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ABWTBTI  PIC X(15).                                              
           02  ANSTOFBL    COMP  PIC  S9(4).                                    
           02  ANSTOFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANSTOFBF.                                       
             03 ANSTOFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTOFBI  PIC X(19).                                             
           02  ANSTOKZL    COMP  PIC  S9(4).                                    
           02  ANSTOKZF    PICTURE X.                                           
           02  FILLER REDEFINES ANSTOKZF.                                       
             03 ANSTOKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTOKZI  PIC X(1).                                              
           02  AVVGFBL    COMP  PIC  S9(4).                                     
           02  AVVGFBF    PICTURE X.                                            
           02  FILLER REDEFINES AVVGFBF.                                        
             03 AVVGFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVGFBI  PIC X(7).                                               
           02  AVVGKZL    COMP  PIC  S9(4).                                     
           02  AVVGKZF    PICTURE X.                                            
           02  FILLER REDEFINES AVVGKZF.                                        
             03 AVVGKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVVGKZI  PIC X(1).                                               
           02  ARDBTFBL    COMP  PIC  S9(4).                                    
           02  ARDBTFBF    PICTURE X.                                           
           02  FILLER REDEFINES ARDBTFBF.                                       
             03 ARDBTFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARDBTFBI  PIC X(22).                                             
           02  ARBWTBTL    COMP  PIC  S9(4).                                    
           02  ARBWTBTF    PICTURE X.                                           
           02  FILLER REDEFINES ARBWTBTF.                                       
             03 ARBWTBTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ARBWTBTI  PIC X(15).                                             
           02  ADYNKZ2L    COMP  PIC  S9(4).                                    
           02  ADYNKZ2F    PICTURE X.                                           
           02  FILLER REDEFINES ADYNKZ2F.                                       
             03 ADYNKZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYNKZ2I  PIC X(1).                                              
           02  ADYN2BML    COMP  PIC  S9(4).                                    
           02  ADYN2BMF    PICTURE X.                                           
           02  FILLER REDEFINES ADYN2BMF.                                       
             03 ADYN2BMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADYN2BMI  PIC X(10).                                             
           02  AVERSFBL    COMP  PIC  S9(4).                                    
           02  AVERSFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVERSFBF.                                       
             03 AVERSFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVERSFBI  PIC X(22).                                             
           02  AVERSSUL    COMP  PIC  S9(4).                                    
           02  AVERSSUF    PICTURE X.                                           
           02  FILLER REDEFINES AVERSSUF.                                       
             03 AVERSSUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVERSSUI  PIC X(15).                                             
           02  ADPKZFBL    COMP  PIC  S9(4).                                    
           02  ADPKZFBF    PICTURE X.                                           
           02  FILLER REDEFINES ADPKZFBF.                                       
             03 ADPKZFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADPKZFBI  PIC X(19).                                             
           02  ADEPOKZL    COMP  PIC  S9(4).                                    
           02  ADEPOKZF    PICTURE X.                                           
           02  FILLER REDEFINES ADEPOKZF.                                       
             03 ADEPOKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADEPOKZI  PIC X(1).                                              
           02  ADEPOBML    COMP  PIC  S9(4).                                    
           02  ADEPOBMF    PICTURE X.                                           
           02  FILLER REDEFINES ADEPOBMF.                                       
             03 ADEPOBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADEPOBMI  PIC X(10).                                             
           02  APRATBTL    COMP  PIC  S9(4).                                    
           02  APRATBTF    PICTURE X.                                           
           02  FILLER REDEFINES APRATBTF.                                       
             03 APRATBTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRATBTI  PIC X(15).                                             
           02  AEIKZFBL    COMP  PIC  S9(4).                                    
           02  AEIKZFBF    PICTURE X.                                           
           02  FILLER REDEFINES AEIKZFBF.                                       
             03 AEIKZFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEIKZFBI  PIC X(19).                                             
           02  AVFGARTL    COMP  PIC  S9(4).                                    
           02  AVFGARTF    PICTURE X.                                           
           02  FILLER REDEFINES AVFGARTF.                                       
             03 AVFGARTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVFGARTI  PIC X(4).                                              
           02  APFBTFBL    COMP  PIC  S9(4).                                    
           02  APFBTFBF    PICTURE X.                                           
           02  FILLER REDEFINES APFBTFBF.                                       
             03 APFBTFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APFBTFBI  PIC X(22).                                             
           02  APPFLBTL    COMP  PIC  S9(4).                                    
           02  APPFLBTF    PICTURE X.                                           
           02  FILLER REDEFINES APPFLBTF.                                       
             03 APPFLBTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFLBTI  PIC X(15).                                             
           02  ATARIFBL    COMP  PIC  S9(4).                                    
           02  ATARIFBF    PICTURE X.                                           
           02  FILLER REDEFINES ATARIFBF.                                       
             03 ATARIFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATARIFBI  PIC X(15).                                             
           02  APRRATZL    COMP  PIC  S9(4).                                    
           02  APRRATZF    PICTURE X.                                           
           02  FILLER REDEFINES APRRATZF.                                       
             03 APRRATZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRATZI  PIC X(4).                                              
           02  APRRATNL    COMP  PIC  S9(4).                                    
           02  APRRATNF    PICTURE X.                                           
           02  FILLER REDEFINES APRRATNF.                                       
             03 APRRATNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRATNI  PIC X(4).                                              
           02  ASAMMFBL    COMP  PIC  S9(4).                                    
           02  ASAMMFBF    PICTURE X.                                           
           02  FILLER REDEFINES ASAMMFBF.                                       
             03 ASAMMFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASAMMFBI  PIC X(19).                                             
           02  ASAMMNRL    COMP  PIC  S9(4).                                    
           02  ASAMMNRF    PICTURE X.                                           
           02  FILLER REDEFINES ASAMMNRF.                                       
             03 ASAMMNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASAMMNRI  PIC X(9).                                              
           02  APFSAFBL    COMP  PIC  S9(4).                                    
           02  APFSAFBF    PICTURE X.                                           
           02  FILLER REDEFINES APFSAFBF.                                       
             03 APFSAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APFSAFBI  PIC X(22).                                             
           02  APPFLSUL    COMP  PIC  S9(4).                                    
           02  APPFLSUF    PICTURE X.                                           
           02  FILLER REDEFINES APPFLSUF.                                       
             03 APPFLSUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APPFLSUI  PIC X(15).                                             
           02  ARABSTL    COMP  PIC  S9(4).                                     
           02  ARABSTF    PICTURE X.                                            
           02  FILLER REDEFINES ARABSTF.                                        
             03 ARABSTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ARABSTI  PIC X(5).                                               
           02  AHISTUNL    COMP  PIC  S9(4).                                    
           02  AHISTUNF    PICTURE X.                                           
           02  FILLER REDEFINES AHISTUNF.                                       
             03 AHISTUNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISTUNI  PIC X(3).                                              
       01  BPA0040O REDEFINES BPA0040I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  APRSUFBH    PICTURE X.                                           
           02  APRSUFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARATBTGH    PICTURE X.                                           
           02  ARATBTGO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHISTNRH    PICTURE X.                                           
           02  AHISTNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFBKENNH    PICTURE X.                                           
           02  AFBKENNO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGLKENNH    PICTURE X.                                           
           02  AGLKENNO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNRH    PICTURE X.                                            
           02  AORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVTTH    PICTURE X.                                           
           02  AFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVMMH    PICTURE X.                                           
           02  AFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVJJH    PICTURE X.                                           
           02  AFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBTTH    PICTURE X.                                           
           02  AFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBMMH    PICTURE X.                                           
           02  AFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBJJH    PICTURE X.                                           
           02  AFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFOLGNRH    PICTURE X.                                           
           02  AFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUNTERH    PICTURE X.                                            
           02  AUNTERO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASCHICHH    PICTURE X.                                           
           02  ASCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AURSPFBH    PICTURE X.                                           
           02  AURSPFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AURPDATH    PICTURE X.                                           
           02  AURPDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABERSUBH    PICTURE X.                                           
           02  ABERSUBO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APOLDATH    PICTURE X.                                           
           02  APOLDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARDBWFBH    PICTURE X.                                           
           02  ARDBWFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARBEWSUH    PICTURE X.                                           
           02  ARBEWSUO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APPFLBEH    PICTURE X.                                           
           02  APPFLBEO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABZDAUEH    PICTURE X.                                           
           02  ABZDAUEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APPFLABH    PICTURE X.                                           
           02  APPFLABO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGSDAUEH    PICTURE X.                                           
           02  AGSDAUEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AINKSSTH    PICTURE X.                                           
           02  AINKSSTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AJAHRBTH    PICTURE X.                                           
           02  AJAHRBTO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AINKAFBH    PICTURE X.                                           
           02  AINKAFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AINKSH    PICTURE X.                                             
           02  AINKSO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AINKSBMH    PICTURE X.                                           
           02  AINKSBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABWBTFBH    PICTURE X.                                           
           02  ABWBTFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABWTBTH    PICTURE X.                                            
           02  ABWTBTO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTOFBH    PICTURE X.                                           
           02  ANSTOFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANSTOKZH    PICTURE X.                                           
           02  ANSTOKZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVVGFBH    PICTURE X.                                            
           02  AVVGFBO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVVGKZH    PICTURE X.                                            
           02  AVVGKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ARDBTFBH    PICTURE X.                                           
           02  ARDBTFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARBWTBTH    PICTURE X.                                           
           02  ARBWTBTO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADYNKZ2H    PICTURE X.                                           
           02  ADYNKZ2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADYN2BMH    PICTURE X.                                           
           02  ADYN2BMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERSFBH    PICTURE X.                                           
           02  AVERSFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERSSUH    PICTURE X.                                           
           02  AVERSSUO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADPKZFBH    PICTURE X.                                           
           02  ADPKZFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADEPOKZH    PICTURE X.                                           
           02  ADEPOKZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADEPOBMH    PICTURE X.                                           
           02  ADEPOBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRATBTH    PICTURE X.                                           
           02  APRATBTO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEIKZFBH    PICTURE X.                                           
           02  AEIKZFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVFGARTH    PICTURE X.                                           
           02  AVFGARTO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APFBTFBH    PICTURE X.                                           
           02  APFBTFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  APPFLBTH    PICTURE X.                                           
           02  APPFLBTO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATARIFBH    PICTURE X.                                           
           02  ATARIFBO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRRATZH    PICTURE X.                                           
           02  APRRATZO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRRATNH    PICTURE X.                                           
           02  APRRATNO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASAMMFBH    PICTURE X.                                           
           02  ASAMMFBO  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASAMMNRH    PICTURE X.                                           
           02  ASAMMNRO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  APFSAFBH    PICTURE X.                                           
           02  APFSAFBO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  APPFLSUH    PICTURE X.                                           
           02  APPFLSUO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARABSTH    PICTURE X.                                            
           02  ARABSTO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  AHISTUNH    PICTURE X.                                           
           02  AHISTUNO  PIC X(3).                                              
