       01  BPA0005I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(1).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(1).                                              
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(24).                                             
           02  AVBNRFBL    COMP  PIC  S9(4).                                    
           02  AVBNRFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVBNRFBF.                                       
             03 AVBNRFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRFBI  PIC X(30).                                             
           02  ESVBNRL    COMP  PIC  S9(4).                                     
           02  ESVBNRF    PICTURE X.                                            
           02  FILLER REDEFINES ESVBNRF.                                        
             03 ESVBNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESVBNRI  PIC X(7).                                               
           02  ESVBNRPL    COMP  PIC  S9(4).                                    
           02  ESVBNRPF    PICTURE X.                                           
           02  FILLER REDEFINES ESVBNRPF.                                       
             03 ESVBNRPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESVBNRPI  PIC X(1).                                              
           02  AZEICHNL    COMP  PIC  S9(4).                                    
           02  AZEICHNF    PICTURE X.                                           
           02  FILLER REDEFINES AZEICHNF.                                       
             03 AZEICHNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZEICHNI  PIC X(30).                                             
           02  EZEICHNL    COMP  PIC  S9(4).                                    
           02  EZEICHNF    PICTURE X.                                           
           02  FILLER REDEFINES EZEICHNF.                                       
             03 EZEICHNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZEICHNI  PIC X(7).                                              
           02  EZEICHPL    COMP  PIC  S9(4).                                    
           02  EZEICHPF    PICTURE X.                                           
           02  FILLER REDEFINES EZEICHPF.                                       
             03 EZEICHPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EZEICHPI  PIC X(1).                                              
           02  ASTREFBL    COMP  PIC  S9(4).                                    
           02  ASTREFBF    PICTURE X.                                           
           02  FILLER REDEFINES ASTREFBF.                                       
             03 ASTREFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTREFBI  PIC X(18).                                             
           02  ASTREDAL    COMP  PIC  S9(4).                                    
           02  ASTREDAF    PICTURE X.                                           
           02  FILLER REDEFINES ASTREDAF.                                       
             03 ASTREDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTREDAI  PIC X(1).                                              
           02  ESTRETTL    COMP  PIC  S9(4).                                    
           02  ESTRETTF    PICTURE X.                                           
           02  FILLER REDEFINES ESTRETTF.                                       
             03 ESTRETTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESTRETTI  PIC X(2).                                              
           02  ESTREMML    COMP  PIC  S9(4).                                    
           02  ESTREMMF    PICTURE X.                                           
           02  FILLER REDEFINES ESTREMMF.                                       
             03 ESTREMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESTREMMI  PIC X(2).                                              
           02  ESTREJJL    COMP  PIC  S9(4).                                    
           02  ESTREJJF    PICTURE X.                                           
           02  FILLER REDEFINES ESTREJJF.                                       
             03 ESTREJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESTREJJI  PIC X(4).                                              
           02  AFCZFBL    COMP  PIC  S9(4).                                     
           02  AFCZFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCZFBF.                                        
             03 AFCZFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCZFBI  PIC X(2).                                               
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(1).                                                
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRI  PIC X(7).                                                
           02  EVBNRPL    COMP  PIC  S9(4).                                     
           02  EVBNRPF    PICTURE X.                                            
           02  FILLER REDEFINES EVBNRPF.                                        
             03 EVBNRPA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRPI  PIC X(1).                                               
           02  AVBNKL    COMP  PIC  S9(4).                                      
           02  AVBNKF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNKF.                                         
             03 AVBNKA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNKI  PIC X(20).                                               
           02  ASTRSTUL    COMP  PIC  S9(4).                                    
           02  ASTRSTUF    PICTURE X.                                           
           02  FILLER REDEFINES ASTRSTUF.                                       
             03 ASTRSTUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTRSTUI  PIC X(1).                                              
           02  ESTRSTUL    COMP  PIC  S9(4).                                    
           02  ESTRSTUF    PICTURE X.                                           
           02  FILLER REDEFINES ESTRSTUF.                                       
             03 ESTRSTUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESTRSTUI  PIC X(4).                                              
           02  ADIPROVL    COMP  PIC  S9(4).                                    
           02  ADIPROVF    PICTURE X.                                           
           02  FILLER REDEFINES ADIPROVF.                                       
             03 ADIPROVA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADIPROVI  PIC X(1).                                              
           02  EDIPROVL    COMP  PIC  S9(4).                                    
           02  EDIPROVF    PICTURE X.                                           
           02  FILLER REDEFINES EDIPROVF.                                       
             03 EDIPROVA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EDIPROVI  PIC X(3).                                              
           02  AEMPTYPL    COMP  PIC  S9(4).                                    
           02  AEMPTYPF    PICTURE X.                                           
           02  FILLER REDEFINES AEMPTYPF.                                       
             03 AEMPTYPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEMPTYPI  PIC X(2).                                              
           02  AEMPTBKL    COMP  PIC  S9(4).                                    
           02  AEMPTBKF    PICTURE X.                                           
           02  FILLER REDEFINES AEMPTBKF.                                       
             03 AEMPTBKA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEMPTBKI  PIC X(10).                                             
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  AVBNR2L    COMP  PIC  S9(4).                                     
           02  AVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR2F.                                        
             03 AVBNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR2I  PIC X(1).                                               
           02  EVBNR2L    COMP  PIC  S9(4).                                     
           02  EVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR2F.                                        
             03 EVBNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR2I  PIC X(7).                                               
           02  EVBNRP2L    COMP  PIC  S9(4).                                    
           02  EVBNRP2F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP2F.                                       
             03 EVBNRP2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP2I  PIC X(1).                                              
           02  AVBNK2L    COMP  PIC  S9(4).                                     
           02  AVBNK2F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK2F.                                        
             03 AVBNK2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK2I  PIC X(20).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(1).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(4).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(1).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(3).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(2).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(10).                                             
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  AVBNR3L    COMP  PIC  S9(4).                                     
           02  AVBNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR3F.                                        
             03 AVBNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR3I  PIC X(1).                                               
           02  EVBNR3L    COMP  PIC  S9(4).                                     
           02  EVBNR3F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR3F.                                        
             03 EVBNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR3I  PIC X(7).                                               
           02  EVBNRP3L    COMP  PIC  S9(4).                                    
           02  EVBNRP3F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP3F.                                       
             03 EVBNRP3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP3I  PIC X(1).                                              
           02  AVBNK3L    COMP  PIC  S9(4).                                     
           02  AVBNK3F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK3F.                                        
             03 AVBNK3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK3I  PIC X(20).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(1).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(4).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(1).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(3).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(2).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(10).                                             
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  AVBNR4L    COMP  PIC  S9(4).                                     
           02  AVBNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR4F.                                        
             03 AVBNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR4I  PIC X(1).                                               
           02  EVBNR4L    COMP  PIC  S9(4).                                     
           02  EVBNR4F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR4F.                                        
             03 EVBNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR4I  PIC X(7).                                               
           02  EVBNRP4L    COMP  PIC  S9(4).                                    
           02  EVBNRP4F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP4F.                                       
             03 EVBNRP4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP4I  PIC X(1).                                              
           02  AVBNK4L    COMP  PIC  S9(4).                                     
           02  AVBNK4F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK4F.                                        
             03 AVBNK4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK4I  PIC X(20).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(1).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(4).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(1).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(3).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(2).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(10).                                             
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  AVBNR5L    COMP  PIC  S9(4).                                     
           02  AVBNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR5F.                                        
             03 AVBNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR5I  PIC X(1).                                               
           02  EVBNR5L    COMP  PIC  S9(4).                                     
           02  EVBNR5F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR5F.                                        
             03 EVBNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR5I  PIC X(7).                                               
           02  EVBNRP5L    COMP  PIC  S9(4).                                    
           02  EVBNRP5F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP5F.                                       
             03 EVBNRP5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP5I  PIC X(1).                                              
           02  AVBNK5L    COMP  PIC  S9(4).                                     
           02  AVBNK5F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK5F.                                        
             03 AVBNK5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK5I  PIC X(20).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(1).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(4).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(1).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(3).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(2).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(10).                                             
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  AVBNR6L    COMP  PIC  S9(4).                                     
           02  AVBNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR6F.                                        
             03 AVBNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR6I  PIC X(1).                                               
           02  EVBNR6L    COMP  PIC  S9(4).                                     
           02  EVBNR6F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR6F.                                        
             03 EVBNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR6I  PIC X(7).                                               
           02  EVBNRP6L    COMP  PIC  S9(4).                                    
           02  EVBNRP6F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP6F.                                       
             03 EVBNRP6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP6I  PIC X(1).                                              
           02  AVBNK6L    COMP  PIC  S9(4).                                     
           02  AVBNK6F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK6F.                                        
             03 AVBNK6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK6I  PIC X(20).                                              
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(1).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(4).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(1).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(3).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(2).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(10).                                             
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  AVBNR7L    COMP  PIC  S9(4).                                     
           02  AVBNR7F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR7F.                                        
             03 AVBNR7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR7I  PIC X(1).                                               
           02  EVBNR7L    COMP  PIC  S9(4).                                     
           02  EVBNR7F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR7F.                                        
             03 EVBNR7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR7I  PIC X(7).                                               
           02  EVBNRP7L    COMP  PIC  S9(4).                                    
           02  EVBNRP7F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP7F.                                       
             03 EVBNRP7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP7I  PIC X(1).                                              
           02  AVBNK7L    COMP  PIC  S9(4).                                     
           02  AVBNK7F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK7F.                                        
             03 AVBNK7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK7I  PIC X(20).                                              
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(1).                                              
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(4).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(1).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(3).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(2).                                              
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(10).                                             
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  AVBNR8L    COMP  PIC  S9(4).                                     
           02  AVBNR8F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR8F.                                        
             03 AVBNR8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR8I  PIC X(1).                                               
           02  EVBNR8L    COMP  PIC  S9(4).                                     
           02  EVBNR8F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR8F.                                        
             03 EVBNR8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR8I  PIC X(7).                                               
           02  EVBNRP8L    COMP  PIC  S9(4).                                    
           02  EVBNRP8F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP8F.                                       
             03 EVBNRP8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP8I  PIC X(1).                                              
           02  AVBNK8L    COMP  PIC  S9(4).                                     
           02  AVBNK8F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK8F.                                        
             03 AVBNK8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK8I  PIC X(20).                                              
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(1).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(4).                                              
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(1).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(3).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(2).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(10).                                             
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  AVBNR9L    COMP  PIC  S9(4).                                     
           02  AVBNR9F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR9F.                                        
             03 AVBNR9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR9I  PIC X(1).                                               
           02  EVBNR9L    COMP  PIC  S9(4).                                     
           02  EVBNR9F    PICTURE X.                                            
           02  FILLER REDEFINES EVBNR9F.                                        
             03 EVBNR9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVBNR9I  PIC X(7).                                               
           02  EVBNRP9L    COMP  PIC  S9(4).                                    
           02  EVBNRP9F    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRP9F.                                       
             03 EVBNRP9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRP9I  PIC X(1).                                              
           02  AVBNK9L    COMP  PIC  S9(4).                                     
           02  AVBNK9F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNK9F.                                        
             03 AVBNK9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNK9I  PIC X(20).                                              
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(1).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(4).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(1).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(3).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(2).                                              
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(10).                                             
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0005O REDEFINES BPA0005I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBNRFBH    PICTURE X.                                           
           02  AVBNRFBO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  ESVBNRH    PICTURE X.                                            
           02  ESVBNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESVBNRPH    PICTURE X.                                           
           02  ESVBNRPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZEICHNH    PICTURE X.                                           
           02  AZEICHNO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  EZEICHNH    PICTURE X.                                           
           02  EZEICHNO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZEICHPH    PICTURE X.                                           
           02  EZEICHPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTREFBH    PICTURE X.                                           
           02  ASTREFBO  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTREDAH    PICTURE X.                                           
           02  ASTREDAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTRETTH    PICTURE X.                                           
           02  ESTRETTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTREMMH    PICTURE X.                                           
           02  ESTREMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTREJJH    PICTURE X.                                           
           02  ESTREJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCZFBH    PICTURE X.                                            
           02  AFCZFBO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVBNRH    PICTURE X.                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EVBNRPH    PICTURE X.                                            
           02  EVBNRPO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVBNKH    PICTURE X.                                             
           02  AVBNKO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTRSTUH    PICTURE X.                                           
           02  ASTRSTUO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTRSTUH    PICTURE X.                                           
           02  ESTRSTUO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADIPROVH    PICTURE X.                                           
           02  ADIPROVO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDIPROVH    PICTURE X.                                           
           02  EDIPROVO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEMPTYPH    PICTURE X.                                           
           02  AEMPTYPO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEMPTBKH    PICTURE X.                                           
           02  AEMPTBKO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR2H    PICTURE X.                                            
           02  AVBNR2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR2H    PICTURE X.                                            
           02  EVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP2H    PICTURE X.                                           
           02  EVBNRP2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK2H    PICTURE X.                                            
           02  AVBNK2O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR3H    PICTURE X.                                            
           02  AVBNR3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR3H    PICTURE X.                                            
           02  EVBNR3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP3H    PICTURE X.                                           
           02  EVBNRP3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK3H    PICTURE X.                                            
           02  AVBNK3O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR4H    PICTURE X.                                            
           02  AVBNR4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR4H    PICTURE X.                                            
           02  EVBNR4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP4H    PICTURE X.                                           
           02  EVBNRP4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK4H    PICTURE X.                                            
           02  AVBNK4O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR5H    PICTURE X.                                            
           02  AVBNR5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR5H    PICTURE X.                                            
           02  EVBNR5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP5H    PICTURE X.                                           
           02  EVBNRP5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK5H    PICTURE X.                                            
           02  AVBNK5O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR6H    PICTURE X.                                            
           02  AVBNR6O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR6H    PICTURE X.                                            
           02  EVBNR6O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP6H    PICTURE X.                                           
           02  EVBNRP6O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK6H    PICTURE X.                                            
           02  AVBNK6O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR7H    PICTURE X.                                            
           02  AVBNR7O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR7H    PICTURE X.                                            
           02  EVBNR7O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP7H    PICTURE X.                                           
           02  EVBNRP7O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK7H    PICTURE X.                                            
           02  AVBNK7O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR8H    PICTURE X.                                            
           02  AVBNR8O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR8H    PICTURE X.                                            
           02  EVBNR8O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP8H    PICTURE X.                                           
           02  EVBNRP8O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK8H    PICTURE X.                                            
           02  AVBNK8O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR9H    PICTURE X.                                            
           02  AVBNR9O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNR9H    PICTURE X.                                            
           02  EVBNR9O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBNRP9H    PICTURE X.                                           
           02  EVBNRP9O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBNK9H    PICTURE X.                                            
           02  AVBNK9O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
