       01  BPA0041I.                                                            
           02  FILLER PIC X(12).                                                
           02  APOBJBKL    COMP  PIC  S9(4).                                    
           02  APOBJBKF    PICTURE X.                                           
           02  FILLER REDEFINES APOBJBKF.                                       
             03 APOBJBKA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APOBJBKI  PIC X(4).                                              
           02  APAUSL    COMP  PIC  S9(4).                                      
           02  APAUSF    PICTURE X.                                             
           02  FILLER REDEFINES APAUSF.                                         
             03 APAUSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APAUSI  PIC X(3).                                                
           02  APAUSBML    COMP  PIC  S9(4).                                    
           02  APAUSBMF    PICTURE X.                                           
           02  FILLER REDEFINES APAUSBMF.                                       
             03 APAUSBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APAUSBMI  PIC X(10).                                             
           02  AERSTDAL    COMP  PIC  S9(4).                                    
           02  AERSTDAF    PICTURE X.                                           
           02  FILLER REDEFINES AERSTDAF.                                       
             03 AERSTDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERSTDAI  PIC X(10).                                             
           02  AKENNL    COMP  PIC  S9(4).                                      
           02  AKENNF    PICTURE X.                                             
           02  FILLER REDEFINES AKENNF.                                         
             03 AKENNA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AKENNI  PIC X(8).                                                
           02  APARTBLL    COMP  PIC  S9(4).                                    
           02  APARTBLF    PICTURE X.                                           
           02  FILLER REDEFINES APARTBLF.                                       
             03 APARTBLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APARTBLI  PIC X(40).                                             
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  ATEXTL    COMP  PIC  S9(4).                                      
           02  ATEXTF    PICTURE X.                                             
           02  FILLER REDEFINES ATEXTF.                                         
             03 ATEXTA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ATEXTI  PIC X(79).                                               
           02  ATEXT2L    COMP  PIC  S9(4).                                     
           02  ATEXT2F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT2F.                                        
             03 ATEXT2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT2I  PIC X(79).                                              
           02  ATEXT3L    COMP  PIC  S9(4).                                     
           02  ATEXT3F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT3F.                                        
             03 ATEXT3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT3I  PIC X(79).                                              
           02  ATEXT4L    COMP  PIC  S9(4).                                     
           02  ATEXT4F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT4F.                                        
             03 ATEXT4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT4I  PIC X(79).                                              
           02  ATEXT5L    COMP  PIC  S9(4).                                     
           02  ATEXT5F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT5F.                                        
             03 ATEXT5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT5I  PIC X(79).                                              
           02  ATEXT6L    COMP  PIC  S9(4).                                     
           02  ATEXT6F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT6F.                                        
             03 ATEXT6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT6I  PIC X(79).                                              
           02  ATEXT7L    COMP  PIC  S9(4).                                     
           02  ATEXT7F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT7F.                                        
             03 ATEXT7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT7I  PIC X(79).                                              
           02  ATEXT8L    COMP  PIC  S9(4).                                     
           02  ATEXT8F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT8F.                                        
             03 ATEXT8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT8I  PIC X(79).                                              
           02  ATEXT9L    COMP  PIC  S9(4).                                     
           02  ATEXT9F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT9F.                                        
             03 ATEXT9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT9I  PIC X(79).                                              
           02  ATEXT92L    COMP  PIC  S9(4).                                    
           02  ATEXT92F    PICTURE X.                                           
           02  FILLER REDEFINES ATEXT92F.                                       
             03 ATEXT92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT92I  PIC X(79).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(79).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(79).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(79).                                             
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(79).                                             
       01  BPA0041O REDEFINES BPA0041I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  APOBJBKH    PICTURE X.                                           
           02  APOBJBKO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APAUSH    PICTURE X.                                             
           02  APAUSO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  APAUSBMH    PICTURE X.                                           
           02  APAUSBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERSTDAH    PICTURE X.                                           
           02  AERSTDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKENNH    PICTURE X.                                             
           02  AKENNO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  APARTBLH    PICTURE X.                                           
           02  APARTBLO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXTH    PICTURE X.                                             
           02  ATEXTO  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATEXT2H    PICTURE X.                                            
           02  ATEXT2O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT3H    PICTURE X.                                            
           02  ATEXT3O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT4H    PICTURE X.                                            
           02  ATEXT4O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT5H    PICTURE X.                                            
           02  ATEXT5O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT6H    PICTURE X.                                            
           02  ATEXT6O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT7H    PICTURE X.                                            
           02  ATEXT7O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT8H    PICTURE X.                                            
           02  ATEXT8O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT9H    PICTURE X.                                            
           02  ATEXT9O  PIC X(79).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT92H    PICTURE X.                                           
           02  ATEXT92O  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(79).                                             
