       01  BPA0071I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  APINFBL    COMP  PIC  S9(4).                                     
           02  APINFBF    PICTURE X.                                            
           02  FILLER REDEFINES APINFBF.                                        
             03 APINFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APINFBI  PIC X(4).                                               
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  AORDNRL    COMP  PIC  S9(4).                                     
           02  AORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES AORDNRF.                                        
             03 AORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AORDNRI  PIC X(2).                                               
           02  AFAEVDTL    COMP  PIC  S9(4).                                    
           02  AFAEVDTF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVDTF.                                       
             03 AFAEVDTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVDTI  PIC X(10).                                             
           02  AFAEBDTL    COMP  PIC  S9(4).                                    
           02  AFAEBDTF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBDTF.                                       
             03 AFAEBDTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBDTI  PIC X(10).                                             
           02  AFOLGNRL    COMP  PIC  S9(4).                                    
           02  AFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES AFOLGNRF.                                       
             03 AFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFOLGNRI  PIC X(3).                                              
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AHISTNRL    COMP  PIC  S9(4).                                    
           02  AHISTNRF    PICTURE X.                                           
           02  FILLER REDEFINES AHISTNRF.                                       
             03 AHISTNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISTNRI  PIC X(3).                                              
           02  APRSUFBL    COMP  PIC  S9(4).                                    
           02  APRSUFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRSUFBF.                                       
             03 APRSUFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRSUFBI  PIC X(24).                                             
           02  APRTASUL    COMP  PIC  S9(4).                                    
           02  APRTASUF    PICTURE X.                                           
           02  FILLER REDEFINES APRTASUF.                                       
             03 APRTASUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRTASUI  PIC X(13).                                             
           02  APRRAFBL    COMP  PIC  S9(4).                                    
           02  APRRAFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRRAFBF.                                       
             03 APRRAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRAFBI  PIC X(24).                                             
           02  EPRRAT1L    COMP  PIC  S9(4).                                    
           02  EPRRAT1F    PICTURE X.                                           
           02  FILLER REDEFINES EPRRAT1F.                                       
             03 EPRRAT1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPRRAT1I  PIC X(2).                                              
           02  APRRFB2L    COMP  PIC  S9(4).                                    
           02  APRRFB2F    PICTURE X.                                           
           02  FILLER REDEFINES APRRFB2F.                                       
             03 APRRFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRFB2I  PIC X(1).                                              
           02  APRRAT2L    COMP  PIC  S9(4).                                    
           02  APRRAT2F    PICTURE X.                                           
           02  FILLER REDEFINES APRRAT2F.                                       
             03 APRRAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRAT2I  PIC X(4).                                              
           02  AHFTFB1L    COMP  PIC  S9(4).                                    
           02  AHFTFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AHFTFB1F.                                       
             03 AHFTFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTFB1I  PIC X(12).                                             
           02  AHFTFB2L    COMP  PIC  S9(4).                                    
           02  AHFTFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AHFTFB2F.                                       
             03 AHFTFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTFB2I  PIC X(5).                                              
           02  AHFTVONL    COMP  PIC  S9(4).                                    
           02  AHFTVONF    PICTURE X.                                           
           02  FILLER REDEFINES AHFTVONF.                                       
             03 AHFTVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTVONI  PIC X(10).                                             
           02  AHFTFB3L    COMP  PIC  S9(4).                                    
           02  AHFTFB3F    PICTURE X.                                           
           02  FILLER REDEFINES AHFTFB3F.                                       
             03 AHFTFB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTFB3I  PIC X(3).                                              
           02  AHFTBISL    COMP  PIC  S9(4).                                    
           02  AHFTBISF    PICTURE X.                                           
           02  FILLER REDEFINES AHFTBISF.                                       
             03 AHFTBISA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTBISI  PIC X(10).                                             
           02  AKONDBML    COMP  PIC  S9(4).                                    
           02  AKONDBMF    PICTURE X.                                           
           02  FILLER REDEFINES AKONDBMF.                                       
             03 AKONDBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKONDBMI  PIC X(40).                                             
           02  ATNRFBL    COMP  PIC  S9(4).                                     
           02  ATNRFBF    PICTURE X.                                            
           02  FILLER REDEFINES ATNRFBF.                                        
             03 ATNRFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATNRFBI  PIC X(24).                                              
           02  ATNRPNL    COMP  PIC  S9(4).                                     
           02  ATNRPNF    PICTURE X.                                            
           02  FILLER REDEFINES ATNRPNF.                                        
             03 ATNRPNA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATNRPNI  PIC X(20).                                              
           02  AABRDATL    COMP  PIC  S9(4).                                    
           02  AABRDATF    PICTURE X.                                           
           02  FILLER REDEFINES AABRDATF.                                       
             03 AABRDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRDATI  PIC X(10).                                             
           02  AUPDDAL    COMP  PIC  S9(4).                                     
           02  AUPDDAF    PICTURE X.                                            
           02  FILLER REDEFINES AUPDDAF.                                        
             03 AUPDDAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUPDDAI  PIC X(10).                                              
           02  AUPDUIDL    COMP  PIC  S9(4).                                    
           02  AUPDUIDF    PICTURE X.                                           
           02  FILLER REDEFINES AUPDUIDF.                                       
             03 AUPDUIDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUPDUIDI  PIC X(8).                                              
       01  BPA0071O REDEFINES BPA0071I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  APINFBH    PICTURE X.                                            
           02  APINFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNRH    PICTURE X.                                            
           02  AORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVDTH    PICTURE X.                                           
           02  AFAEVDTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFAEBDTH    PICTURE X.                                           
           02  AFAEBDTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFOLGNRH    PICTURE X.                                           
           02  AFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AHISTNRH    PICTURE X.                                           
           02  AHISTNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRSUFBH    PICTURE X.                                           
           02  APRSUFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRTASUH    PICTURE X.                                           
           02  APRTASUO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRRAFBH    PICTURE X.                                           
           02  APRRAFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  EPRRAT1H    PICTURE X.                                           
           02  EPRRAT1O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRRFB2H    PICTURE X.                                           
           02  APRRFB2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRRAT2H    PICTURE X.                                           
           02  APRRAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHFTFB1H    PICTURE X.                                           
           02  AHFTFB1O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHFTFB2H    PICTURE X.                                           
           02  AHFTFB2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHFTVONH    PICTURE X.                                           
           02  AHFTVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHFTFB3H    PICTURE X.                                           
           02  AHFTFB3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHFTBISH    PICTURE X.                                           
           02  AHFTBISO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKONDBMH    PICTURE X.                                           
           02  AKONDBMO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATNRFBH    PICTURE X.                                            
           02  ATNRFBO  PIC X(24).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATNRPNH    PICTURE X.                                            
           02  ATNRPNO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABRDATH    PICTURE X.                                           
           02  AABRDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUPDDAH    PICTURE X.                                            
           02  AUPDDAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUPDUIDH    PICTURE X.                                           
           02  AUPDUIDO  PIC X(8).                                              
