       01  BPA0035I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(4).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(4).                                              
           02  AABRVDAL    COMP  PIC  S9(4).                                    
           02  AABRVDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABRVDAF.                                       
             03 AABRVDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRVDAI  PIC X(10).                                             
           02  AABRBDAL    COMP  PIC  S9(4).                                    
           02  AABRBDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABRBDAF.                                       
             03 AABRBDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRBDAI  PIC X(10).                                             
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(4).                                               
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(14).                                             
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  AFBPRO1L    COMP  PIC  S9(4).                                    
           02  AFBPRO1F    PICTURE X.                                           
           02  FILLER REDEFINES AFBPRO1F.                                       
             03 AFBPRO1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBPRO1I  PIC X(7).                                              
           02  AFBPRO2L    COMP  PIC  S9(4).                                    
           02  AFBPRO2F    PICTURE X.                                           
           02  FILLER REDEFINES AFBPRO2F.                                       
             03 AFBPRO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBPRO2I  PIC X(7).                                              
           02  AWAEBELL    COMP  PIC  S9(4).                                    
           02  AWAEBELF    PICTURE X.                                           
           02  FILLER REDEFINES AWAEBELF.                                       
             03 AWAEBELA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWAEBELI  PIC X(4).                                              
           02  EFCZL    COMP  PIC  S9(4).                                       
           02  EFCZF    PICTURE X.                                              
           02  FILLER REDEFINES EFCZF.                                          
             03 EFCZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCZI  PIC X(1).                                                 
           02  ANTZL    COMP  PIC  S9(4).                                       
           02  ANTZF    PICTURE X.                                              
           02  FILLER REDEFINES ANTZF.                                          
             03 ANTZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ANTZI  PIC X(1).                                                 
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  APRODS1L    COMP  PIC  S9(4).                                    
           02  APRODS1F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS1F.                                       
             03 APRODS1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS1I  PIC X(3).                                              
           02  APRODS2L    COMP  PIC  S9(4).                                    
           02  APRODS2F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS2F.                                       
             03 APRODS2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS2I  PIC X(3).                                              
           02  APRODS3L    COMP  PIC  S9(4).                                    
           02  APRODS3F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS3F.                                       
             03 APRODS3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS3I  PIC X(3).                                              
           02  APLUSL    COMP  PIC  S9(4).                                      
           02  APLUSF    PICTURE X.                                             
           02  FILLER REDEFINES APLUSF.                                         
             03 APLUSA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLUSI  PIC X(1).                                                
           02  APROVBL    COMP  PIC  S9(4).                                     
           02  APROVBF    PICTURE X.                                            
           02  FILLER REDEFINES APROVBF.                                        
             03 APROVBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROVBI  PIC X(15).                                              
           02  AFAEVDAL    COMP  PIC  S9(4).                                    
           02  AFAEVDAF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVDAF.                                       
             03 AFAEVDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVDAI  PIC X(10).                                             
           02  AABREDAL    COMP  PIC  S9(4).                                    
           02  AABREDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABREDAF.                                       
             03 AABREDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREDAI  PIC X(10).                                             
           02  EFCZ2L    COMP  PIC  S9(4).                                      
           02  EFCZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ2F.                                         
             03 EFCZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ2I  PIC X(1).                                                
           02  ANTZ2L    COMP  PIC  S9(4).                                      
           02  ANTZ2F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ2F.                                         
             03 ANTZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ2I  PIC X(1).                                                
           02  AVNR2L    COMP  PIC  S9(4).                                      
           02  AVNR2F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR2F.                                         
             03 AVNR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR2I  PIC X(15).                                               
           02  AVSTAT2L    COMP  PIC  S9(4).                                    
           02  AVSTAT2F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT2F.                                       
             03 AVSTAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT2I  PIC X(4).                                              
           02  APRODS6L    COMP  PIC  S9(4).                                    
           02  APRODS6F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS6F.                                       
             03 APRODS6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS6I  PIC X(3).                                              
           02  APRODS5L    COMP  PIC  S9(4).                                    
           02  APRODS5F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS5F.                                       
             03 APRODS5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS5I  PIC X(3).                                              
           02  APRODS4L    COMP  PIC  S9(4).                                    
           02  APRODS4F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS4F.                                       
             03 APRODS4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS4I  PIC X(3).                                              
           02  APLUS2L    COMP  PIC  S9(4).                                     
           02  APLUS2F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS2F.                                        
             03 APLUS2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS2I  PIC X(1).                                               
           02  APROVB2L    COMP  PIC  S9(4).                                    
           02  APROVB2F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB2F.                                       
             03 APROVB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB2I  PIC X(15).                                             
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(10).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(10).                                             
           02  EFCZ3L    COMP  PIC  S9(4).                                      
           02  EFCZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ3F.                                         
             03 EFCZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ3I  PIC X(1).                                                
           02  ANTZ3L    COMP  PIC  S9(4).                                      
           02  ANTZ3F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ3F.                                         
             03 ANTZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ3I  PIC X(1).                                                
           02  AVNR3L    COMP  PIC  S9(4).                                      
           02  AVNR3F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR3F.                                         
             03 AVNR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR3I  PIC X(15).                                               
           02  AVSTAT3L    COMP  PIC  S9(4).                                    
           02  AVSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT3F.                                       
             03 AVSTAT3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT3I  PIC X(4).                                              
           02  APRODS9L    COMP  PIC  S9(4).                                    
           02  APRODS9F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS9F.                                       
             03 APRODS9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS9I  PIC X(3).                                              
           02  APRODS8L    COMP  PIC  S9(4).                                    
           02  APRODS8F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS8F.                                       
             03 APRODS8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS8I  PIC X(3).                                              
           02  APRODS7L    COMP  PIC  S9(4).                                    
           02  APRODS7F    PICTURE X.                                           
           02  FILLER REDEFINES APRODS7F.                                       
             03 APRODS7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODS7I  PIC X(3).                                              
           02  APLUS3L    COMP  PIC  S9(4).                                     
           02  APLUS3F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS3F.                                        
             03 APLUS3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS3I  PIC X(1).                                               
           02  APROVB3L    COMP  PIC  S9(4).                                    
           02  APROVB3F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB3F.                                       
             03 APROVB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB3I  PIC X(15).                                             
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(10).                                             
           02  EFCZ4L    COMP  PIC  S9(4).                                      
           02  EFCZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ4F.                                         
             03 EFCZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ4I  PIC X(1).                                                
           02  ANTZ4L    COMP  PIC  S9(4).                                      
           02  ANTZ4F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ4F.                                         
             03 ANTZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ4I  PIC X(1).                                                
           02  AVNR4L    COMP  PIC  S9(4).                                      
           02  AVNR4F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR4F.                                         
             03 AVNR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR4I  PIC X(15).                                               
           02  AVSTAT4L    COMP  PIC  S9(4).                                    
           02  AVSTAT4F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT4F.                                       
             03 AVSTAT4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT4I  PIC X(4).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(3).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(3).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(3).                                              
           02  APLUS4L    COMP  PIC  S9(4).                                     
           02  APLUS4F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS4F.                                        
             03 APLUS4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS4I  PIC X(1).                                               
           02  APROVB4L    COMP  PIC  S9(4).                                    
           02  APROVB4F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB4F.                                       
             03 APROVB4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB4I  PIC X(15).                                             
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(10).                                             
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(10).                                             
           02  EFCZ5L    COMP  PIC  S9(4).                                      
           02  EFCZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ5F.                                         
             03 EFCZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ5I  PIC X(1).                                                
           02  ANTZ5L    COMP  PIC  S9(4).                                      
           02  ANTZ5F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ5F.                                         
             03 ANTZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ5I  PIC X(1).                                                
           02  AVNR5L    COMP  PIC  S9(4).                                      
           02  AVNR5F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR5F.                                         
             03 AVNR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR5I  PIC X(15).                                               
           02  AVSTAT5L    COMP  PIC  S9(4).                                    
           02  AVSTAT5F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT5F.                                       
             03 AVSTAT5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT5I  PIC X(4).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(3).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(3).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  APLUS5L    COMP  PIC  S9(4).                                     
           02  APLUS5F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS5F.                                        
             03 APLUS5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS5I  PIC X(1).                                               
           02  APROVB5L    COMP  PIC  S9(4).                                    
           02  APROVB5F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB5F.                                       
             03 APROVB5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB5I  PIC X(15).                                             
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(10).                                             
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(10).                                             
           02  EFCZ6L    COMP  PIC  S9(4).                                      
           02  EFCZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ6F.                                         
             03 EFCZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ6I  PIC X(1).                                                
           02  ANTZ6L    COMP  PIC  S9(4).                                      
           02  ANTZ6F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ6F.                                         
             03 ANTZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ6I  PIC X(1).                                                
           02  AVNR6L    COMP  PIC  S9(4).                                      
           02  AVNR6F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR6F.                                         
             03 AVNR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR6I  PIC X(15).                                               
           02  AVSTAT6L    COMP  PIC  S9(4).                                    
           02  AVSTAT6F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT6F.                                       
             03 AVSTAT6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT6I  PIC X(4).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(3).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(3).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(3).                                              
           02  APLUS6L    COMP  PIC  S9(4).                                     
           02  APLUS6F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS6F.                                        
             03 APLUS6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS6I  PIC X(1).                                               
           02  APROVB6L    COMP  PIC  S9(4).                                    
           02  APROVB6F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB6F.                                       
             03 APROVB6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB6I  PIC X(15).                                             
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(10).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  EFCZ7L    COMP  PIC  S9(4).                                      
           02  EFCZ7F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ7F.                                         
             03 EFCZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ7I  PIC X(1).                                                
           02  ANTZ7L    COMP  PIC  S9(4).                                      
           02  ANTZ7F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ7F.                                         
             03 ANTZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ7I  PIC X(1).                                                
           02  AVNR7L    COMP  PIC  S9(4).                                      
           02  AVNR7F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR7F.                                         
             03 AVNR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR7I  PIC X(15).                                               
           02  AVSTAT7L    COMP  PIC  S9(4).                                    
           02  AVSTAT7F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT7F.                                       
             03 AVSTAT7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT7I  PIC X(4).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(3).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(3).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(3).                                              
           02  APLUS7L    COMP  PIC  S9(4).                                     
           02  APLUS7F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS7F.                                        
             03 APLUS7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS7I  PIC X(1).                                               
           02  APROVB7L    COMP  PIC  S9(4).                                    
           02  APROVB7F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB7F.                                       
             03 APROVB7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB7I  PIC X(15).                                             
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(10).                                             
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(10).                                             
           02  EFCZ8L    COMP  PIC  S9(4).                                      
           02  EFCZ8F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ8F.                                         
             03 EFCZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ8I  PIC X(1).                                                
           02  ANTZ8L    COMP  PIC  S9(4).                                      
           02  ANTZ8F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ8F.                                         
             03 ANTZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ8I  PIC X(1).                                                
           02  AVNR8L    COMP  PIC  S9(4).                                      
           02  AVNR8F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR8F.                                         
             03 AVNR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR8I  PIC X(15).                                               
           02  AVSTAT8L    COMP  PIC  S9(4).                                    
           02  AVSTAT8F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT8F.                                       
             03 AVSTAT8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT8I  PIC X(4).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(3).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(3).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(3).                                              
           02  APLUS8L    COMP  PIC  S9(4).                                     
           02  APLUS8F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS8F.                                        
             03 APLUS8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS8I  PIC X(1).                                               
           02  APROVB8L    COMP  PIC  S9(4).                                    
           02  APROVB8F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB8F.                                       
             03 APROVB8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB8I  PIC X(15).                                             
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(10).                                             
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(10).                                             
           02  EFCZ9L    COMP  PIC  S9(4).                                      
           02  EFCZ9F    PICTURE X.                                             
           02  FILLER REDEFINES EFCZ9F.                                         
             03 EFCZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ9I  PIC X(1).                                                
           02  ANTZ9L    COMP  PIC  S9(4).                                      
           02  ANTZ9F    PICTURE X.                                             
           02  FILLER REDEFINES ANTZ9F.                                         
             03 ANTZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ9I  PIC X(1).                                                
           02  AVNR9L    COMP  PIC  S9(4).                                      
           02  AVNR9F    PICTURE X.                                             
           02  FILLER REDEFINES AVNR9F.                                         
             03 AVNR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVNR9I  PIC X(15).                                               
           02  AVSTAT9L    COMP  PIC  S9(4).                                    
           02  AVSTAT9F    PICTURE X.                                           
           02  FILLER REDEFINES AVSTAT9F.                                       
             03 AVSTAT9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTAT9I  PIC X(4).                                              
           02  F000033L    COMP  PIC  S9(4).                                    
           02  F000033F    PICTURE X.                                           
           02  FILLER REDEFINES F000033F.                                       
             03 F000033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000033I  PIC X(3).                                              
           02  F000032L    COMP  PIC  S9(4).                                    
           02  F000032F    PICTURE X.                                           
           02  FILLER REDEFINES F000032F.                                       
             03 F000032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000032I  PIC X(3).                                              
           02  F000031L    COMP  PIC  S9(4).                                    
           02  F000031F    PICTURE X.                                           
           02  FILLER REDEFINES F000031F.                                       
             03 F000031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000031I  PIC X(3).                                              
           02  APLUS9L    COMP  PIC  S9(4).                                     
           02  APLUS9F    PICTURE X.                                            
           02  FILLER REDEFINES APLUS9F.                                        
             03 APLUS9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APLUS9I  PIC X(1).                                               
           02  APROVB9L    COMP  PIC  S9(4).                                    
           02  APROVB9F    PICTURE X.                                           
           02  FILLER REDEFINES APROVB9F.                                       
             03 APROVB9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVB9I  PIC X(15).                                             
           02  F000030L    COMP  PIC  S9(4).                                    
           02  F000030F    PICTURE X.                                           
           02  FILLER REDEFINES F000030F.                                       
             03 F000030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000030I  PIC X(10).                                             
           02  F000029L    COMP  PIC  S9(4).                                    
           02  F000029F    PICTURE X.                                           
           02  FILLER REDEFINES F000029F.                                       
             03 F000029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000029I  PIC X(10).                                             
           02  EFCZ92L    COMP  PIC  S9(4).                                     
           02  EFCZ92F    PICTURE X.                                            
           02  FILLER REDEFINES EFCZ92F.                                        
             03 EFCZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ92I  PIC X(1).                                               
           02  ANTZ92L    COMP  PIC  S9(4).                                     
           02  ANTZ92F    PICTURE X.                                            
           02  FILLER REDEFINES ANTZ92F.                                        
             03 ANTZ92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ92I  PIC X(1).                                               
           02  AVNR92L    COMP  PIC  S9(4).                                     
           02  AVNR92F    PICTURE X.                                            
           02  FILLER REDEFINES AVNR92F.                                        
             03 AVNR92A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVNR92I  PIC X(15).                                              
           02  F000040L    COMP  PIC  S9(4).                                    
           02  F000040F    PICTURE X.                                           
           02  FILLER REDEFINES F000040F.                                       
             03 F000040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000040I  PIC X(4).                                              
           02  F000039L    COMP  PIC  S9(4).                                    
           02  F000039F    PICTURE X.                                           
           02  FILLER REDEFINES F000039F.                                       
             03 F000039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000039I  PIC X(3).                                              
           02  F000038L    COMP  PIC  S9(4).                                    
           02  F000038F    PICTURE X.                                           
           02  FILLER REDEFINES F000038F.                                       
             03 F000038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000038I  PIC X(3).                                              
           02  F000037L    COMP  PIC  S9(4).                                    
           02  F000037F    PICTURE X.                                           
           02  FILLER REDEFINES F000037F.                                       
             03 F000037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000037I  PIC X(3).                                              
           02  APLUS92L    COMP  PIC  S9(4).                                    
           02  APLUS92F    PICTURE X.                                           
           02  FILLER REDEFINES APLUS92F.                                       
             03 APLUS92A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APLUS92I  PIC X(1).                                              
           02  F000036L    COMP  PIC  S9(4).                                    
           02  F000036F    PICTURE X.                                           
           02  FILLER REDEFINES F000036F.                                       
             03 F000036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000036I  PIC X(15).                                             
           02  F000035L    COMP  PIC  S9(4).                                    
           02  F000035F    PICTURE X.                                           
           02  FILLER REDEFINES F000035F.                                       
             03 F000035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000035I  PIC X(10).                                             
           02  F000034L    COMP  PIC  S9(4).                                    
           02  F000034F    PICTURE X.                                           
           02  FILLER REDEFINES F000034F.                                       
             03 F000034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000034I  PIC X(10).                                             
           02  EFCZ922L    COMP  PIC  S9(4).                                    
           02  EFCZ922F    PICTURE X.                                           
           02  FILLER REDEFINES EFCZ922F.                                       
             03 EFCZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFCZ922I  PIC X(1).                                              
           02  ANTZ922L    COMP  PIC  S9(4).                                    
           02  ANTZ922F    PICTURE X.                                           
           02  FILLER REDEFINES ANTZ922F.                                       
             03 ANTZ922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANTZ922I  PIC X(1).                                              
           02  AVNR922L    COMP  PIC  S9(4).                                    
           02  AVNR922F    PICTURE X.                                           
           02  FILLER REDEFINES AVNR922F.                                       
             03 AVNR922A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVNR922I  PIC X(15).                                             
           02  F000048L    COMP  PIC  S9(4).                                    
           02  F000048F    PICTURE X.                                           
           02  FILLER REDEFINES F000048F.                                       
             03 F000048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000048I  PIC X(4).                                              
           02  F000047L    COMP  PIC  S9(4).                                    
           02  F000047F    PICTURE X.                                           
           02  FILLER REDEFINES F000047F.                                       
             03 F000047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000047I  PIC X(3).                                              
           02  F000046L    COMP  PIC  S9(4).                                    
           02  F000046F    PICTURE X.                                           
           02  FILLER REDEFINES F000046F.                                       
             03 F000046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000046I  PIC X(3).                                              
           02  F000045L    COMP  PIC  S9(4).                                    
           02  F000045F    PICTURE X.                                           
           02  FILLER REDEFINES F000045F.                                       
             03 F000045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000045I  PIC X(3).                                              
           02  F000044L    COMP  PIC  S9(4).                                    
           02  F000044F    PICTURE X.                                           
           02  FILLER REDEFINES F000044F.                                       
             03 F000044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000044I  PIC X(1).                                              
           02  F000043L    COMP  PIC  S9(4).                                    
           02  F000043F    PICTURE X.                                           
           02  FILLER REDEFINES F000043F.                                       
             03 F000043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000043I  PIC X(15).                                             
           02  F000042L    COMP  PIC  S9(4).                                    
           02  F000042F    PICTURE X.                                           
           02  FILLER REDEFINES F000042F.                                       
             03 F000042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000042I  PIC X(10).                                             
           02  F000041L    COMP  PIC  S9(4).                                    
           02  F000041F    PICTURE X.                                           
           02  FILLER REDEFINES F000041F.                                       
             03 F000041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000041I  PIC X(10).                                             
           02  AFCZANZL    COMP  PIC  S9(4).                                    
           02  AFCZANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCZANZF.                                       
             03 AFCZANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCZANZI  PIC X(79).                                             
       01  BPA0035O REDEFINES BPA0035I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AABRVDAH    PICTURE X.                                           
           02  AABRVDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABRBDAH    PICTURE X.                                           
           02  AABRBDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFBPRO1H    PICTURE X.                                           
           02  AFBPRO1O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFBPRO2H    PICTURE X.                                           
           02  AFBPRO2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWAEBELH    PICTURE X.                                           
           02  AWAEBELO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCZH    PICTURE X.                                              
           02  EFCZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANTZH    PICTURE X.                                              
           02  ANTZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRODS1H    PICTURE X.                                           
           02  APRODS1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS2H    PICTURE X.                                           
           02  APRODS2O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS3H    PICTURE X.                                           
           02  APRODS3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUSH    PICTURE X.                                             
           02  APLUSO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APROVBH    PICTURE X.                                            
           02  APROVBO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVDAH    PICTURE X.                                           
           02  AFAEVDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABREDAH    PICTURE X.                                           
           02  AABREDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ2H    PICTURE X.                                             
           02  EFCZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ2H    PICTURE X.                                             
           02  ANTZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR2H    PICTURE X.                                             
           02  AVNR2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT2H    PICTURE X.                                           
           02  AVSTAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS6H    PICTURE X.                                           
           02  APRODS6O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS5H    PICTURE X.                                           
           02  APRODS5O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS4H    PICTURE X.                                           
           02  APRODS4O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS2H    PICTURE X.                                            
           02  APLUS2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB2H    PICTURE X.                                           
           02  APROVB2O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ3H    PICTURE X.                                             
           02  EFCZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ3H    PICTURE X.                                             
           02  ANTZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR3H    PICTURE X.                                             
           02  AVNR3O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT3H    PICTURE X.                                           
           02  AVSTAT3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS9H    PICTURE X.                                           
           02  APRODS9O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS8H    PICTURE X.                                           
           02  APRODS8O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODS7H    PICTURE X.                                           
           02  APRODS7O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS3H    PICTURE X.                                            
           02  APLUS3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB3H    PICTURE X.                                           
           02  APROVB3O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ4H    PICTURE X.                                             
           02  EFCZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ4H    PICTURE X.                                             
           02  ANTZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR4H    PICTURE X.                                             
           02  AVNR4O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT4H    PICTURE X.                                           
           02  AVSTAT4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS4H    PICTURE X.                                            
           02  APLUS4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB4H    PICTURE X.                                           
           02  APROVB4O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ5H    PICTURE X.                                             
           02  EFCZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ5H    PICTURE X.                                             
           02  ANTZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR5H    PICTURE X.                                             
           02  AVNR5O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT5H    PICTURE X.                                           
           02  AVSTAT5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS5H    PICTURE X.                                            
           02  APLUS5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB5H    PICTURE X.                                           
           02  APROVB5O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ6H    PICTURE X.                                             
           02  EFCZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ6H    PICTURE X.                                             
           02  ANTZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR6H    PICTURE X.                                             
           02  AVNR6O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT6H    PICTURE X.                                           
           02  AVSTAT6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS6H    PICTURE X.                                            
           02  APLUS6O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB6H    PICTURE X.                                           
           02  APROVB6O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ7H    PICTURE X.                                             
           02  EFCZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ7H    PICTURE X.                                             
           02  ANTZ7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR7H    PICTURE X.                                             
           02  AVNR7O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT7H    PICTURE X.                                           
           02  AVSTAT7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS7H    PICTURE X.                                            
           02  APLUS7O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB7H    PICTURE X.                                           
           02  APROVB7O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ8H    PICTURE X.                                             
           02  EFCZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ8H    PICTURE X.                                             
           02  ANTZ8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR8H    PICTURE X.                                             
           02  AVNR8O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT8H    PICTURE X.                                           
           02  AVSTAT8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS8H    PICTURE X.                                            
           02  APLUS8O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB8H    PICTURE X.                                           
           02  APROVB8O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ9H    PICTURE X.                                             
           02  EFCZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANTZ9H    PICTURE X.                                             
           02  ANTZ9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVNR9H    PICTURE X.                                             
           02  AVNR9O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTAT9H    PICTURE X.                                           
           02  AVSTAT9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000033H    PICTURE X.                                           
           02  F000033O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000032H    PICTURE X.                                           
           02  F000032O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000031H    PICTURE X.                                           
           02  F000031O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS9H    PICTURE X.                                            
           02  APLUS9O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APROVB9H    PICTURE X.                                           
           02  APROVB9O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000030H    PICTURE X.                                           
           02  F000030O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000029H    PICTURE X.                                           
           02  F000029O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ92H    PICTURE X.                                            
           02  EFCZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANTZ92H    PICTURE X.                                            
           02  ANTZ92O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVNR92H    PICTURE X.                                            
           02  AVNR92O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000040H    PICTURE X.                                           
           02  F000040O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000039H    PICTURE X.                                           
           02  F000039O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000038H    PICTURE X.                                           
           02  F000038O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000037H    PICTURE X.                                           
           02  F000037O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APLUS92H    PICTURE X.                                           
           02  APLUS92O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000036H    PICTURE X.                                           
           02  F000036O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000035H    PICTURE X.                                           
           02  F000035O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000034H    PICTURE X.                                           
           02  F000034O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFCZ922H    PICTURE X.                                           
           02  EFCZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANTZ922H    PICTURE X.                                           
           02  ANTZ922O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNR922H    PICTURE X.                                           
           02  AVNR922O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000048H    PICTURE X.                                           
           02  F000048O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000047H    PICTURE X.                                           
           02  F000047O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000046H    PICTURE X.                                           
           02  F000046O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000045H    PICTURE X.                                           
           02  F000045O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000044H    PICTURE X.                                           
           02  F000044O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000043H    PICTURE X.                                           
           02  F000043O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000042H    PICTURE X.                                           
           02  F000042O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000041H    PICTURE X.                                           
           02  F000041O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCZANZH    PICTURE X.                                           
           02  AFCZANZO  PIC X(79).                                             
