       01  BPA0027I.                                                            
           02  FILLER PIC X(12).                                                
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  AVNRL    COMP  PIC  S9(4).                                       
           02  AVNRF    PICTURE X.                                              
           02  FILLER REDEFINES AVNRF.                                          
             03 AVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AVNRI  PIC X(15).                                                
           02  AUNTERL    COMP  PIC  S9(4).                                     
           02  AUNTERF    PICTURE X.                                            
           02  FILLER REDEFINES AUNTERF.                                        
             03 AUNTERA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUNTERI  PIC X(3).                                               
           02  ASCHICHL    COMP  PIC  S9(4).                                    
           02  ASCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ASCHICHF.                                       
             03 ASCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASCHICHI  PIC X(3).                                              
           02  APINFBL    COMP  PIC  S9(4).                                     
           02  APINFBF    PICTURE X.                                            
           02  FILLER REDEFINES APINFBF.                                        
             03 APINFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APINFBI  PIC X(4).                                               
           02  APINL    COMP  PIC  S9(4).                                       
           02  APINF    PICTURE X.                                              
           02  FILLER REDEFINES APINF.                                          
             03 APINA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APINI  PIC X(9).                                                 
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  AORDNRL    COMP  PIC  S9(4).                                     
           02  AORDNRF    PICTURE X.                                            
           02  FILLER REDEFINES AORDNRF.                                        
             03 AORDNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AORDNRI  PIC X(2).                                               
           02  AFAEVTTL    COMP  PIC  S9(4).                                    
           02  AFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVTTF.                                       
             03 AFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVTTI  PIC X(2).                                              
           02  AFAEVMML    COMP  PIC  S9(4).                                    
           02  AFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVMMF.                                       
             03 AFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVMMI  PIC X(2).                                              
           02  AFAEVJJL    COMP  PIC  S9(4).                                    
           02  AFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVJJF.                                       
             03 AFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVJJI  PIC X(4).                                              
           02  AFAEBTTL    COMP  PIC  S9(4).                                    
           02  AFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBTTF.                                       
             03 AFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBTTI  PIC X(2).                                              
           02  AFAEBMML    COMP  PIC  S9(4).                                    
           02  AFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBMMF.                                       
             03 AFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBMMI  PIC X(2).                                              
           02  AFAEBJJL    COMP  PIC  S9(4).                                    
           02  AFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEBJJF.                                       
             03 AFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEBJJI  PIC X(4).                                              
           02  AFOLGNRL    COMP  PIC  S9(4).                                    
           02  AFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES AFOLGNRF.                                       
             03 AFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFOLGNRI  PIC X(3).                                              
           02  AFBKENNL    COMP  PIC  S9(4).                                    
           02  AFBKENNF    PICTURE X.                                           
           02  FILLER REDEFINES AFBKENNF.                                       
             03 AFBKENNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFBKENNI  PIC X(8).                                              
           02  AGLKENNL    COMP  PIC  S9(4).                                    
           02  AGLKENNF    PICTURE X.                                           
           02  FILLER REDEFINES AGLKENNF.                                       
             03 AGLKENNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGLKENNI  PIC X(6).                                              
           02  ANAMEFBL    COMP  PIC  S9(4).                                    
           02  ANAMEFBF    PICTURE X.                                           
           02  FILLER REDEFINES ANAMEFBF.                                       
             03 ANAMEFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEFBI  PIC X(5).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AHISTNRL    COMP  PIC  S9(4).                                    
           02  AHISTNRF    PICTURE X.                                           
           02  FILLER REDEFINES AHISTNRF.                                       
             03 AHISTNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHISTNRI  PIC X(3).                                              
           02  AZAELFBL    COMP  PIC  S9(4).                                    
           02  AZAELFBF    PICTURE X.                                           
           02  FILLER REDEFINES AZAELFBF.                                       
             03 AZAELFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZAELFBI  PIC X(13).                                             
           02  AZAELNRL    COMP  PIC  S9(4).                                    
           02  AZAELNRF    PICTURE X.                                           
           02  FILLER REDEFINES AZAELNRF.                                       
             03 AZAELNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZAELNRI  PIC X(20).                                             
           02  AVERBFBL    COMP  PIC  S9(4).                                    
           02  AVERBFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVERBFBF.                                       
             03 AVERBFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVERBFBI  PIC X(10).                                             
           02  AVERBRL    COMP  PIC  S9(4).                                     
           02  AVERBRF    PICTURE X.                                            
           02  FILLER REDEFINES AVERBRF.                                        
             03 AVERBRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVERBRI  PIC X(10).                                              
           02  AVERPFBL    COMP  PIC  S9(4).                                    
           02  AVERPFBF    PICTURE X.                                           
           02  FILLER REDEFINES AVERPFBF.                                       
             03 AVERPFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVERPFBI  PIC X(24).                                             
           02  AVERSPNL    COMP  PIC  S9(4).                                    
           02  AVERSPNF    PICTURE X.                                           
           02  FILLER REDEFINES AVERSPNF.                                       
             03 AVERSPNA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVERSPNI  PIC X(2).                                              
           02  AFLXFB1L    COMP  PIC  S9(4).                                    
           02  AFLXFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AFLXFB1F.                                       
             03 AFLXFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLXFB1I  PIC X(18).                                             
           02  AFLEXRLL    COMP  PIC  S9(4).                                    
           02  AFLEXRLF    PICTURE X.                                           
           02  FILLER REDEFINES AFLEXRLF.                                       
             03 AFLEXRLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLEXRLI  PIC X(1).                                              
           02  APRSUFBL    COMP  PIC  S9(4).                                    
           02  APRSUFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRSUFBF.                                       
             03 APRSUFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRSUFBI  PIC X(24).                                             
           02  APRTASUL    COMP  PIC  S9(4).                                    
           02  APRTASUF    PICTURE X.                                           
           02  FILLER REDEFINES APRTASUF.                                       
             03 APRTASUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRTASUI  PIC X(13).                                             
           02  AFLXFB2L    COMP  PIC  S9(4).                                    
           02  AFLXFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AFLXFB2F.                                       
             03 AFLXFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLXFB2I  PIC X(18).                                             
           02  AVSPFKZL    COMP  PIC  S9(4).                                    
           02  AVSPFKZF    PICTURE X.                                           
           02  FILLER REDEFINES AVSPFKZF.                                       
             03 AVSPFKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSPFKZI  PIC X(1).                                              
           02  APRRAFBL    COMP  PIC  S9(4).                                    
           02  APRRAFBF    PICTURE X.                                           
           02  FILLER REDEFINES APRRAFBF.                                       
             03 APRRAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRAFBI  PIC X(24).                                             
           02  APRRAT1L    COMP  PIC  S9(4).                                    
           02  APRRAT1F    PICTURE X.                                           
           02  FILLER REDEFINES APRRAT1F.                                       
             03 APRRAT1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRAT1I  PIC X(4).                                              
           02  APRRFB2L    COMP  PIC  S9(4).                                    
           02  APRRFB2F    PICTURE X.                                           
           02  FILLER REDEFINES APRRFB2F.                                       
             03 APRRFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRFB2I  PIC X(1).                                              
           02  APRRAT2L    COMP  PIC  S9(4).                                    
           02  APRRAT2F    PICTURE X.                                           
           02  FILLER REDEFINES APRRAT2F.                                       
             03 APRRAT2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRRAT2I  PIC X(4).                                              
           02  AFLXFB3L    COMP  PIC  S9(4).                                    
           02  AFLXFB3F    PICTURE X.                                           
           02  FILLER REDEFINES AFLXFB3F.                                       
             03 AFLXFB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLXFB3I  PIC X(18).                                             
           02  APRKONRL    COMP  PIC  S9(4).                                    
           02  APRKONRF    PICTURE X.                                           
           02  FILLER REDEFINES APRKONRF.                                       
             03 APRKONRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRKONRI  PIC X(5).                                              
           02  APGKZFBL    COMP  PIC  S9(4).                                    
           02  APGKZFBF    PICTURE X.                                           
           02  FILLER REDEFINES APGKZFBF.                                       
             03 APGKZFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APGKZFBI  PIC X(24).                                             
           02  APGVKZL    COMP  PIC  S9(4).                                     
           02  APGVKZF    PICTURE X.                                            
           02  FILLER REDEFINES APGVKZF.                                        
             03 APGVKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APGVKZI  PIC X(1).                                               
           02  AFLXFB4L    COMP  PIC  S9(4).                                    
           02  AFLXFB4F    PICTURE X.                                           
           02  FILLER REDEFINES AFLXFB4F.                                       
             03 AFLXFB4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLXFB4I  PIC X(18).                                             
           02  APRKOBZL    COMP  PIC  S9(4).                                    
           02  APRKOBZF    PICTURE X.                                           
           02  FILLER REDEFINES APRKOBZF.                                       
             03 APRKOBZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRKOBZI  PIC X(3).                                              
           02  ASTRUFBL    COMP  PIC  S9(4).                                    
           02  ASTRUFBF    PICTURE X.                                           
           02  FILLER REDEFINES ASTRUFBF.                                       
             03 ASTRUFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTRUFBI  PIC X(24).                                             
           02  ASTRUKTL    COMP  PIC  S9(4).                                    
           02  ASTRUKTF    PICTURE X.                                           
           02  FILLER REDEFINES ASTRUKTF.                                       
             03 ASTRUKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTRUKTI  PIC X(10).                                             
           02  AFLXFB5L    COMP  PIC  S9(4).                                    
           02  AFLXFB5F    PICTURE X.                                           
           02  FILLER REDEFINES AFLXFB5F.                                       
             03 AFLXFB5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLXFB5I  PIC X(18).                                             
           02  AFLEXBRL    COMP  PIC  S9(4).                                    
           02  AFLEXBRF    PICTURE X.                                           
           02  FILLER REDEFINES AFLEXBRF.                                       
             03 AFLEXBRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFLEXBRI  PIC X(1).                                              
           02  AHFTFB1L    COMP  PIC  S9(4).                                    
           02  AHFTFB1F    PICTURE X.                                           
           02  FILLER REDEFINES AHFTFB1F.                                       
             03 AHFTFB1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTFB1I  PIC X(12).                                             
           02  AHFTFB2L    COMP  PIC  S9(4).                                    
           02  AHFTFB2F    PICTURE X.                                           
           02  FILLER REDEFINES AHFTFB2F.                                       
             03 AHFTFB2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTFB2I  PIC X(5).                                              
           02  AHFTVONL    COMP  PIC  S9(4).                                    
           02  AHFTVONF    PICTURE X.                                           
           02  FILLER REDEFINES AHFTVONF.                                       
             03 AHFTVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTVONI  PIC X(10).                                             
           02  AHFTFB3L    COMP  PIC  S9(4).                                    
           02  AHFTFB3F    PICTURE X.                                           
           02  FILLER REDEFINES AHFTFB3F.                                       
             03 AHFTFB3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTFB3I  PIC X(3).                                              
           02  AHFTBISL    COMP  PIC  S9(4).                                    
           02  AHFTBISF    PICTURE X.                                           
           02  FILLER REDEFINES AHFTBISF.                                       
             03 AHFTBISA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AHFTBISI  PIC X(10).                                             
           02  ALFZFBL    COMP  PIC  S9(4).                                     
           02  ALFZFBF    PICTURE X.                                            
           02  FILLER REDEFINES ALFZFBF.                                        
             03 ALFZFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ALFZFBI  PIC X(9).                                               
           02  ATLSLFZL    COMP  PIC  S9(4).                                    
           02  ATLSLFZF    PICTURE X.                                           
           02  FILLER REDEFINES ATLSLFZF.                                       
             03 ATLSLFZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATLSLFZI  PIC X(2).                                              
           02  AAUSSFBL    COMP  PIC  S9(4).                                    
           02  AAUSSFBF    PICTURE X.                                           
           02  FILLER REDEFINES AAUSSFBF.                                       
             03 AAUSSFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AAUSSFBI  PIC X(24).                                             
           02  AAUSSCHL    COMP  PIC  S9(4).                                    
           02  AAUSSCHF    PICTURE X.                                           
           02  FILLER REDEFINES AAUSSCHF.                                       
             03 AAUSSCHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AAUSSCHI  PIC X(18).                                             
           02  AKZEAFBL    COMP  PIC  S9(4).                                    
           02  AKZEAFBF    PICTURE X.                                           
           02  FILLER REDEFINES AKZEAFBF.                                       
             03 AKZEAFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKZEAFBI  PIC X(18).                                             
           02  AKZEANTL    COMP  PIC  S9(4).                                    
           02  AKZEANTF    PICTURE X.                                           
           02  FILLER REDEFINES AKZEANTF.                                       
             03 AKZEANTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKZEANTI  PIC X(1).                                              
           02  AKONDBML    COMP  PIC  S9(4).                                    
           02  AKONDBMF    PICTURE X.                                           
           02  FILLER REDEFINES AKONDBMF.                                       
             03 AKONDBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKONDBMI  PIC X(40).                                             
           02  APARTFBL    COMP  PIC  S9(4).                                    
           02  APARTFBF    PICTURE X.                                           
           02  FILLER REDEFINES APARTFBF.                                       
             03 APARTFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APARTFBI  PIC X(15).                                             
           02  APRPARTL    COMP  PIC  S9(4).                                    
           02  APRPARTF    PICTURE X.                                           
           02  FILLER REDEFINES APRPARTF.                                       
             03 APRPARTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRPARTI  PIC X(2).                                              
           02  APARTXTL    COMP  PIC  S9(4).                                    
           02  APARTXTF    PICTURE X.                                           
           02  FILLER REDEFINES APARTXTF.                                       
             03 APARTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APARTXTI  PIC X(20).                                             
           02  ASTOGFBL    COMP  PIC  S9(4).                                    
           02  ASTOGFBF    PICTURE X.                                           
           02  FILLER REDEFINES ASTOGFBF.                                       
             03 ASTOGFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTOGFBI  PIC X(12).                                             
           02  ASTOGRDL    COMP  PIC  S9(4).                                    
           02  ASTOGRDF    PICTURE X.                                           
           02  FILLER REDEFINES ASTOGRDF.                                       
             03 ASTOGRDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTOGRDI  PIC X(2).                                              
           02  ASTOTXTL    COMP  PIC  S9(4).                                    
           02  ASTOTXTF    PICTURE X.                                           
           02  FILLER REDEFINES ASTOTXTF.                                       
             03 ASTOTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTOTXTI  PIC X(20).                                             
           02  ATARIFBL    COMP  PIC  S9(4).                                    
           02  ATARIFBF    PICTURE X.                                           
           02  FILLER REDEFINES ATARIFBF.                                       
             03 ATARIFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATARIFBI  PIC X(17).                                             
           02  ATFBEZTL    COMP  PIC  S9(4).                                    
           02  ATFBEZTF    PICTURE X.                                           
           02  FILLER REDEFINES ATFBEZTF.                                       
             03 ATFBEZTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATFBEZTI  PIC X(50).                                             
           02  ATNRFBL    COMP  PIC  S9(4).                                     
           02  ATNRFBF    PICTURE X.                                            
           02  FILLER REDEFINES ATNRFBF.                                        
             03 ATNRFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATNRFBI  PIC X(24).                                              
           02  ATNRPNL    COMP  PIC  S9(4).                                     
           02  ATNRPNF    PICTURE X.                                            
           02  FILLER REDEFINES ATNRPNF.                                        
             03 ATNRPNA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATNRPNI  PIC X(20).                                              
           02  AMIGRFBL    COMP  PIC  S9(4).                                    
           02  AMIGRFBF    PICTURE X.                                           
           02  FILLER REDEFINES AMIGRFBF.                                       
             03 AMIGRFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AMIGRFBI  PIC X(14).                                             
           02  AMIGKZL    COMP  PIC  S9(4).                                     
           02  AMIGKZF    PICTURE X.                                            
           02  FILLER REDEFINES AMIGKZF.                                        
             03 AMIGKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AMIGKZI  PIC X(1).                                               
           02  AABRDATL    COMP  PIC  S9(4).                                    
           02  AABRDATF    PICTURE X.                                           
           02  FILLER REDEFINES AABRDATF.                                       
             03 AABRDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABRDATI  PIC X(10).                                             
           02  AUPDDAL    COMP  PIC  S9(4).                                     
           02  AUPDDAF    PICTURE X.                                            
           02  FILLER REDEFINES AUPDDAF.                                        
             03 AUPDDAA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AUPDDAI  PIC X(10).                                              
           02  AEINDFBL    COMP  PIC  S9(4).                                    
           02  AEINDFBF    PICTURE X.                                           
           02  FILLER REDEFINES AEINDFBF.                                       
             03 AEINDFBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINDFBI  PIC X(24).                                             
           02  AEINDATL    COMP  PIC  S9(4).                                    
           02  AEINDATF    PICTURE X.                                           
           02  FILLER REDEFINES AEINDATF.                                       
             03 AEINDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEINDATI  PIC X(10).                                             
           02  AUPDUIDL    COMP  PIC  S9(4).                                    
           02  AUPDUIDF    PICTURE X.                                           
           02  FILLER REDEFINES AUPDUIDF.                                       
             03 AUPDUIDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUPDUIDI  PIC X(8).                                              
       01  BPA0027O REDEFINES BPA0027I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVNRH    PICTURE X.                                              
           02  AVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUNTERH    PICTURE X.                                            
           02  AUNTERO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASCHICHH    PICTURE X.                                           
           02  ASCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APINFBH    PICTURE X.                                            
           02  APINFBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  APINH    PICTURE X.                                              
           02  APINO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORDNRH    PICTURE X.                                            
           02  AORDNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVTTH    PICTURE X.                                           
           02  AFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVMMH    PICTURE X.                                           
           02  AFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEVJJH    PICTURE X.                                           
           02  AFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBTTH    PICTURE X.                                           
           02  AFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBMMH    PICTURE X.                                           
           02  AFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFAEBJJH    PICTURE X.                                           
           02  AFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFOLGNRH    PICTURE X.                                           
           02  AFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFBKENNH    PICTURE X.                                           
           02  AFBKENNO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGLKENNH    PICTURE X.                                           
           02  AGLKENNO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEFBH    PICTURE X.                                           
           02  ANAMEFBO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AHISTNRH    PICTURE X.                                           
           02  AHISTNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZAELFBH    PICTURE X.                                           
           02  AZAELFBO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AZAELNRH    PICTURE X.                                           
           02  AZAELNRO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERBFBH    PICTURE X.                                           
           02  AVERBFBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERBRH    PICTURE X.                                            
           02  AVERBRO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVERPFBH    PICTURE X.                                           
           02  AVERPFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVERSPNH    PICTURE X.                                           
           02  AVERSPNO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFLXFB1H    PICTURE X.                                           
           02  AFLXFB1O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFLEXRLH    PICTURE X.                                           
           02  AFLEXRLO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRSUFBH    PICTURE X.                                           
           02  APRSUFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRTASUH    PICTURE X.                                           
           02  APRTASUO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFLXFB2H    PICTURE X.                                           
           02  AFLXFB2O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSPFKZH    PICTURE X.                                           
           02  AVSPFKZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRRAFBH    PICTURE X.                                           
           02  APRRAFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRRAT1H    PICTURE X.                                           
           02  APRRAT1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRRFB2H    PICTURE X.                                           
           02  APRRFB2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRRAT2H    PICTURE X.                                           
           02  APRRAT2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFLXFB3H    PICTURE X.                                           
           02  AFLXFB3O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRKONRH    PICTURE X.                                           
           02  APRKONRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  APGKZFBH    PICTURE X.                                           
           02  APGKZFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  APGVKZH    PICTURE X.                                            
           02  APGVKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFLXFB4H    PICTURE X.                                           
           02  AFLXFB4O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRKOBZH    PICTURE X.                                           
           02  APRKOBZO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTRUFBH    PICTURE X.                                           
           02  ASTRUFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTRUKTH    PICTURE X.                                           
           02  ASTRUKTO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFLXFB5H    PICTURE X.                                           
           02  AFLXFB5O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFLEXBRH    PICTURE X.                                           
           02  AFLEXBRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHFTFB1H    PICTURE X.                                           
           02  AHFTFB1O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHFTFB2H    PICTURE X.                                           
           02  AHFTFB2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHFTVONH    PICTURE X.                                           
           02  AHFTVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AHFTFB3H    PICTURE X.                                           
           02  AHFTFB3O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  AHFTBISH    PICTURE X.                                           
           02  AHFTBISO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ALFZFBH    PICTURE X.                                            
           02  ALFZFBO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATLSLFZH    PICTURE X.                                           
           02  ATLSLFZO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUSSFBH    PICTURE X.                                           
           02  AAUSSFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  AAUSSCHH    PICTURE X.                                           
           02  AAUSSCHO  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKZEAFBH    PICTURE X.                                           
           02  AKZEAFBO  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKZEANTH    PICTURE X.                                           
           02  AKZEANTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKONDBMH    PICTURE X.                                           
           02  AKONDBMO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  APARTFBH    PICTURE X.                                           
           02  APARTFBO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRPARTH    PICTURE X.                                           
           02  APRPARTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  APARTXTH    PICTURE X.                                           
           02  APARTXTO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTOGFBH    PICTURE X.                                           
           02  ASTOGFBO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTOGRDH    PICTURE X.                                           
           02  ASTOGRDO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTOTXTH    PICTURE X.                                           
           02  ASTOTXTO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATARIFBH    PICTURE X.                                           
           02  ATARIFBO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATFBEZTH    PICTURE X.                                           
           02  ATFBEZTO  PIC X(50).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATNRFBH    PICTURE X.                                            
           02  ATNRFBO  PIC X(24).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATNRPNH    PICTURE X.                                            
           02  ATNRPNO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMIGRFBH    PICTURE X.                                           
           02  AMIGRFBO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  AMIGKZH    PICTURE X.                                            
           02  AMIGKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AABRDATH    PICTURE X.                                           
           02  AABRDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUPDDAH    PICTURE X.                                            
           02  AUPDDAO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINDFBH    PICTURE X.                                           
           02  AEINDFBO  PIC X(24).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINDATH    PICTURE X.                                           
           02  AEINDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUPDUIDH    PICTURE X.                                           
           02  AUPDUIDO  PIC X(8).                                              
