       01  BPA0039I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESL    COMP  PIC  S9(4).                                       
           02  EGESF    PICTURE X.                                              
           02  FILLER REDEFINES EGESF.                                          
             03 EGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(9).                                               
           02  EVNRL    COMP  PIC  S9(4).                                       
           02  EVNRF    PICTURE X.                                              
           02  FILLER REDEFINES EVNRF.                                          
             03 EVNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EVNRI  PIC X(15).                                                
           02  EUNRL    COMP  PIC  S9(4).                                       
           02  EUNRF    PICTURE X.                                              
           02  FILLER REDEFINES EUNRF.                                          
             03 EUNRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EUNRI  PIC X(3).                                                 
           02  ESCHICHL    COMP  PIC  S9(4).                                    
           02  ESCHICHF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHICHF.                                       
             03 ESCHICHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESCHICHI  PIC X(3).                                              
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EPRODSLL    COMP  PIC  S9(4).                                    
           02  EPRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES EPRODSLF.                                       
             03 EPRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EPRODSLI  PIC X(3).                                              
           02  APRODBML    COMP  PIC  S9(4).                                    
           02  APRODBMF    PICTURE X.                                           
           02  FILLER REDEFINES APRODBMF.                                       
             03 APRODBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODBMI  PIC X(10).                                             
           02  EFAEVTTL    COMP  PIC  S9(4).                                    
           02  EFAEVTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVTTF.                                       
             03 EFAEVTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVTTI  PIC X(2).                                              
           02  EFAEVMML    COMP  PIC  S9(4).                                    
           02  EFAEVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVMMF.                                       
             03 EFAEVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVMMI  PIC X(2).                                              
           02  EFAEVJJL    COMP  PIC  S9(4).                                    
           02  EFAEVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEVJJF.                                       
             03 EFAEVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEVJJI  PIC X(4).                                              
           02  EFAEBTTL    COMP  PIC  S9(4).                                    
           02  EFAEBTTF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBTTF.                                       
             03 EFAEBTTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBTTI  PIC X(2).                                              
           02  EFAEBMML    COMP  PIC  S9(4).                                    
           02  EFAEBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBMMF.                                       
             03 EFAEBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBMMI  PIC X(2).                                              
           02  EFAEBJJL    COMP  PIC  S9(4).                                    
           02  EFAEBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EFAEBJJF.                                       
             03 EFAEBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFAEBJJI  PIC X(4).                                              
           02  EFOLGNRL    COMP  PIC  S9(4).                                    
           02  EFOLGNRF    PICTURE X.                                           
           02  FILLER REDEFINES EFOLGNRF.                                       
             03 EFOLGNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EFOLGNRI  PIC X(3).                                              
           02  EABRVMML    COMP  PIC  S9(4).                                    
           02  EABRVMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABRVMMF.                                       
             03 EABRVMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRVMMI  PIC X(2).                                              
           02  EABRVJJL    COMP  PIC  S9(4).                                    
           02  EABRVJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABRVJJF.                                       
             03 EABRVJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRVJJI  PIC X(4).                                              
           02  EABRBMML    COMP  PIC  S9(4).                                    
           02  EABRBMMF    PICTURE X.                                           
           02  FILLER REDEFINES EABRBMMF.                                       
             03 EABRBMMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRBMMI  PIC X(2).                                              
           02  EABRBJJL    COMP  PIC  S9(4).                                    
           02  EABRBJJF    PICTURE X.                                           
           02  FILLER REDEFINES EABRBJJF.                                       
             03 EABRBJJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EABRBJJI  PIC X(4).                                              
           02  AFCSFBL    COMP  PIC  S9(4).                                     
           02  AFCSFBF    PICTURE X.                                            
           02  FILLER REDEFINES AFCSFBF.                                        
             03 AFCSFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCSFBI  PIC X(5).                                               
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(17).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ANAMEI  PIC X(25).                                               
           02  AFCFBL    COMP  PIC  S9(4).                                      
           02  AFCFBF    PICTURE X.                                             
           02  FILLER REDEFINES AFCFBF.                                         
             03 AFCFBA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AFCFBI  PIC X(2).                                                
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  AZINFOL    COMP  PIC  S9(4).                                     
           02  AZINFOF    PICTURE X.                                            
           02  FILLER REDEFINES AZINFOF.                                        
             03 AZINFOA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AZINFOI  PIC X(2).                                               
           02  APRODSLL    COMP  PIC  S9(4).                                    
           02  APRODSLF    PICTURE X.                                           
           02  FILLER REDEFINES APRODSLF.                                       
             03 APRODSLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRODSLI  PIC X(3).                                              
           02  ANSTKZL    COMP  PIC  S9(4).                                     
           02  ANSTKZF    PICTURE X.                                            
           02  FILLER REDEFINES ANSTKZF.                                        
             03 ANSTKZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZI  PIC X(2).                                               
           02  AFAEVONL    COMP  PIC  S9(4).                                    
           02  AFAEVONF    PICTURE X.                                           
           02  FILLER REDEFINES AFAEVONF.                                       
             03 AFAEVONA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFAEVONI  PIC X(10).                                             
           02  APRSCHLL    COMP  PIC  S9(4).                                    
           02  APRSCHLF    PICTURE X.                                           
           02  FILLER REDEFINES APRSCHLF.                                       
             03 APRSCHLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APRSCHLI  PIC X(5).                                              
           02  ABWHKFTL    COMP  PIC  S9(4).                                    
           02  ABWHKFTF    PICTURE X.                                           
           02  FILLER REDEFINES ABWHKFTF.                                       
             03 ABWHKFTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABWHKFTI  PIC X(1).                                              
           02  ABWSCHLL    COMP  PIC  S9(4).                                    
           02  ABWSCHLF    PICTURE X.                                           
           02  FILLER REDEFINES ABWSCHLF.                                       
             03 ABWSCHLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABWSCHLI  PIC X(6).                                              
           02  ATARIKZL    COMP  PIC  S9(4).                                    
           02  ATARIKZF    PICTURE X.                                           
           02  FILLER REDEFINES ATARIKZF.                                       
             03 ATARIKZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATARIKZI  PIC X(2).                                              
           02  AKVBTXTL    COMP  PIC  S9(4).                                    
           02  AKVBTXTF    PICTURE X.                                           
           02  FILLER REDEFINES AKVBTXTF.                                       
             03 AKVBTXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AKVBTXTI  PIC X(29).                                             
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  AZINFO2L    COMP  PIC  S9(4).                                    
           02  AZINFO2F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO2F.                                       
             03 AZINFO2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO2I  PIC X(2).                                              
           02  F000070L    COMP  PIC  S9(4).                                    
           02  F000070F    PICTURE X.                                           
           02  FILLER REDEFINES F000070F.                                       
             03 F000070A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000070I  PIC X(3).                                              
           02  ANSTKZ2L    COMP  PIC  S9(4).                                    
           02  ANSTKZ2F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ2F.                                       
             03 ANSTKZ2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ2I  PIC X(2).                                              
           02  F000069L    COMP  PIC  S9(4).                                    
           02  F000069F    PICTURE X.                                           
           02  FILLER REDEFINES F000069F.                                       
             03 F000069A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000069I  PIC X(10).                                             
           02  F000068L    COMP  PIC  S9(4).                                    
           02  F000068F    PICTURE X.                                           
           02  FILLER REDEFINES F000068F.                                       
             03 F000068A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000068I  PIC X(5).                                              
           02  F000067L    COMP  PIC  S9(4).                                    
           02  F000067F    PICTURE X.                                           
           02  FILLER REDEFINES F000067F.                                       
             03 F000067A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000067I  PIC X(1).                                              
           02  F000066L    COMP  PIC  S9(4).                                    
           02  F000066F    PICTURE X.                                           
           02  FILLER REDEFINES F000066F.                                       
             03 F000066A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000066I  PIC X(6).                                              
           02  F000065L    COMP  PIC  S9(4).                                    
           02  F000065F    PICTURE X.                                           
           02  FILLER REDEFINES F000065F.                                       
             03 F000065A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000065I  PIC X(2).                                              
           02  F000064L    COMP  PIC  S9(4).                                    
           02  F000064F    PICTURE X.                                           
           02  FILLER REDEFINES F000064F.                                       
             03 F000064A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000064I  PIC X(29).                                             
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  AZINFO3L    COMP  PIC  S9(4).                                    
           02  AZINFO3F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO3F.                                       
             03 AZINFO3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO3I  PIC X(2).                                              
           02  F000077L    COMP  PIC  S9(4).                                    
           02  F000077F    PICTURE X.                                           
           02  FILLER REDEFINES F000077F.                                       
             03 F000077A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000077I  PIC X(3).                                              
           02  ANSTKZ3L    COMP  PIC  S9(4).                                    
           02  ANSTKZ3F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ3F.                                       
             03 ANSTKZ3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ3I  PIC X(2).                                              
           02  F000076L    COMP  PIC  S9(4).                                    
           02  F000076F    PICTURE X.                                           
           02  FILLER REDEFINES F000076F.                                       
             03 F000076A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000076I  PIC X(10).                                             
           02  F000075L    COMP  PIC  S9(4).                                    
           02  F000075F    PICTURE X.                                           
           02  FILLER REDEFINES F000075F.                                       
             03 F000075A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000075I  PIC X(5).                                              
           02  F000074L    COMP  PIC  S9(4).                                    
           02  F000074F    PICTURE X.                                           
           02  FILLER REDEFINES F000074F.                                       
             03 F000074A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000074I  PIC X(1).                                              
           02  F000073L    COMP  PIC  S9(4).                                    
           02  F000073F    PICTURE X.                                           
           02  FILLER REDEFINES F000073F.                                       
             03 F000073A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000073I  PIC X(6).                                              
           02  F000072L    COMP  PIC  S9(4).                                    
           02  F000072F    PICTURE X.                                           
           02  FILLER REDEFINES F000072F.                                       
             03 F000072A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000072I  PIC X(2).                                              
           02  F000071L    COMP  PIC  S9(4).                                    
           02  F000071F    PICTURE X.                                           
           02  FILLER REDEFINES F000071F.                                       
             03 F000071A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000071I  PIC X(29).                                             
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC4I  PIC X(1).                                                 
           02  AZINFO4L    COMP  PIC  S9(4).                                    
           02  AZINFO4F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO4F.                                       
             03 AZINFO4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO4I  PIC X(2).                                              
           02  F000084L    COMP  PIC  S9(4).                                    
           02  F000084F    PICTURE X.                                           
           02  FILLER REDEFINES F000084F.                                       
             03 F000084A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000084I  PIC X(3).                                              
           02  ANSTKZ4L    COMP  PIC  S9(4).                                    
           02  ANSTKZ4F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ4F.                                       
             03 ANSTKZ4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ4I  PIC X(2).                                              
           02  F000083L    COMP  PIC  S9(4).                                    
           02  F000083F    PICTURE X.                                           
           02  FILLER REDEFINES F000083F.                                       
             03 F000083A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000083I  PIC X(10).                                             
           02  F000082L    COMP  PIC  S9(4).                                    
           02  F000082F    PICTURE X.                                           
           02  FILLER REDEFINES F000082F.                                       
             03 F000082A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000082I  PIC X(5).                                              
           02  F000081L    COMP  PIC  S9(4).                                    
           02  F000081F    PICTURE X.                                           
           02  FILLER REDEFINES F000081F.                                       
             03 F000081A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000081I  PIC X(1).                                              
           02  F000080L    COMP  PIC  S9(4).                                    
           02  F000080F    PICTURE X.                                           
           02  FILLER REDEFINES F000080F.                                       
             03 F000080A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000080I  PIC X(6).                                              
           02  F000079L    COMP  PIC  S9(4).                                    
           02  F000079F    PICTURE X.                                           
           02  FILLER REDEFINES F000079F.                                       
             03 F000079A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000079I  PIC X(2).                                              
           02  F000078L    COMP  PIC  S9(4).                                    
           02  F000078F    PICTURE X.                                           
           02  FILLER REDEFINES F000078F.                                       
             03 F000078A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000078I  PIC X(29).                                             
           02  EFC5L    COMP  PIC  S9(4).                                       
           02  EFC5F    PICTURE X.                                              
           02  FILLER REDEFINES EFC5F.                                          
             03 EFC5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC5I  PIC X(1).                                                 
           02  AZINFO5L    COMP  PIC  S9(4).                                    
           02  AZINFO5F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO5F.                                       
             03 AZINFO5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO5I  PIC X(2).                                              
           02  F000091L    COMP  PIC  S9(4).                                    
           02  F000091F    PICTURE X.                                           
           02  FILLER REDEFINES F000091F.                                       
             03 F000091A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000091I  PIC X(3).                                              
           02  ANSTKZ5L    COMP  PIC  S9(4).                                    
           02  ANSTKZ5F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ5F.                                       
             03 ANSTKZ5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ5I  PIC X(2).                                              
           02  F000090L    COMP  PIC  S9(4).                                    
           02  F000090F    PICTURE X.                                           
           02  FILLER REDEFINES F000090F.                                       
             03 F000090A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000090I  PIC X(10).                                             
           02  F000089L    COMP  PIC  S9(4).                                    
           02  F000089F    PICTURE X.                                           
           02  FILLER REDEFINES F000089F.                                       
             03 F000089A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000089I  PIC X(5).                                              
           02  F000088L    COMP  PIC  S9(4).                                    
           02  F000088F    PICTURE X.                                           
           02  FILLER REDEFINES F000088F.                                       
             03 F000088A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000088I  PIC X(1).                                              
           02  F000087L    COMP  PIC  S9(4).                                    
           02  F000087F    PICTURE X.                                           
           02  FILLER REDEFINES F000087F.                                       
             03 F000087A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000087I  PIC X(6).                                              
           02  F000086L    COMP  PIC  S9(4).                                    
           02  F000086F    PICTURE X.                                           
           02  FILLER REDEFINES F000086F.                                       
             03 F000086A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000086I  PIC X(2).                                              
           02  F000085L    COMP  PIC  S9(4).                                    
           02  F000085F    PICTURE X.                                           
           02  FILLER REDEFINES F000085F.                                       
             03 F000085A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000085I  PIC X(29).                                             
           02  EFC6L    COMP  PIC  S9(4).                                       
           02  EFC6F    PICTURE X.                                              
           02  FILLER REDEFINES EFC6F.                                          
             03 EFC6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC6I  PIC X(1).                                                 
           02  AZINFO6L    COMP  PIC  S9(4).                                    
           02  AZINFO6F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO6F.                                       
             03 AZINFO6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO6I  PIC X(2).                                              
           02  F000098L    COMP  PIC  S9(4).                                    
           02  F000098F    PICTURE X.                                           
           02  FILLER REDEFINES F000098F.                                       
             03 F000098A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000098I  PIC X(3).                                              
           02  ANSTKZ6L    COMP  PIC  S9(4).                                    
           02  ANSTKZ6F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ6F.                                       
             03 ANSTKZ6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ6I  PIC X(2).                                              
           02  F000097L    COMP  PIC  S9(4).                                    
           02  F000097F    PICTURE X.                                           
           02  FILLER REDEFINES F000097F.                                       
             03 F000097A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000097I  PIC X(10).                                             
           02  F000096L    COMP  PIC  S9(4).                                    
           02  F000096F    PICTURE X.                                           
           02  FILLER REDEFINES F000096F.                                       
             03 F000096A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000096I  PIC X(5).                                              
           02  F000095L    COMP  PIC  S9(4).                                    
           02  F000095F    PICTURE X.                                           
           02  FILLER REDEFINES F000095F.                                       
             03 F000095A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000095I  PIC X(1).                                              
           02  F000094L    COMP  PIC  S9(4).                                    
           02  F000094F    PICTURE X.                                           
           02  FILLER REDEFINES F000094F.                                       
             03 F000094A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000094I  PIC X(6).                                              
           02  F000093L    COMP  PIC  S9(4).                                    
           02  F000093F    PICTURE X.                                           
           02  FILLER REDEFINES F000093F.                                       
             03 F000093A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000093I  PIC X(2).                                              
           02  F000092L    COMP  PIC  S9(4).                                    
           02  F000092F    PICTURE X.                                           
           02  FILLER REDEFINES F000092F.                                       
             03 F000092A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000092I  PIC X(29).                                             
           02  EFC7L    COMP  PIC  S9(4).                                       
           02  EFC7F    PICTURE X.                                              
           02  FILLER REDEFINES EFC7F.                                          
             03 EFC7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC7I  PIC X(1).                                                 
           02  AZINFO7L    COMP  PIC  S9(4).                                    
           02  AZINFO7F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO7F.                                       
             03 AZINFO7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO7I  PIC X(2).                                              
           02  F000105L    COMP  PIC  S9(4).                                    
           02  F000105F    PICTURE X.                                           
           02  FILLER REDEFINES F000105F.                                       
             03 F000105A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000105I  PIC X(3).                                              
           02  ANSTKZ7L    COMP  PIC  S9(4).                                    
           02  ANSTKZ7F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ7F.                                       
             03 ANSTKZ7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ7I  PIC X(2).                                              
           02  F000104L    COMP  PIC  S9(4).                                    
           02  F000104F    PICTURE X.                                           
           02  FILLER REDEFINES F000104F.                                       
             03 F000104A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000104I  PIC X(10).                                             
           02  F000103L    COMP  PIC  S9(4).                                    
           02  F000103F    PICTURE X.                                           
           02  FILLER REDEFINES F000103F.                                       
             03 F000103A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000103I  PIC X(5).                                              
           02  F000102L    COMP  PIC  S9(4).                                    
           02  F000102F    PICTURE X.                                           
           02  FILLER REDEFINES F000102F.                                       
             03 F000102A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000102I  PIC X(1).                                              
           02  F000101L    COMP  PIC  S9(4).                                    
           02  F000101F    PICTURE X.                                           
           02  FILLER REDEFINES F000101F.                                       
             03 F000101A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000101I  PIC X(6).                                              
           02  F000100L    COMP  PIC  S9(4).                                    
           02  F000100F    PICTURE X.                                           
           02  FILLER REDEFINES F000100F.                                       
             03 F000100A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000100I  PIC X(2).                                              
           02  F000099L    COMP  PIC  S9(4).                                    
           02  F000099F    PICTURE X.                                           
           02  FILLER REDEFINES F000099F.                                       
             03 F000099A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000099I  PIC X(29).                                             
           02  EFC8L    COMP  PIC  S9(4).                                       
           02  EFC8F    PICTURE X.                                              
           02  FILLER REDEFINES EFC8F.                                          
             03 EFC8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC8I  PIC X(1).                                                 
           02  AZINFO8L    COMP  PIC  S9(4).                                    
           02  AZINFO8F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO8F.                                       
             03 AZINFO8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO8I  PIC X(2).                                              
           02  F000112L    COMP  PIC  S9(4).                                    
           02  F000112F    PICTURE X.                                           
           02  FILLER REDEFINES F000112F.                                       
             03 F000112A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000112I  PIC X(3).                                              
           02  ANSTKZ8L    COMP  PIC  S9(4).                                    
           02  ANSTKZ8F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ8F.                                       
             03 ANSTKZ8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ8I  PIC X(2).                                              
           02  F000111L    COMP  PIC  S9(4).                                    
           02  F000111F    PICTURE X.                                           
           02  FILLER REDEFINES F000111F.                                       
             03 F000111A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000111I  PIC X(10).                                             
           02  F000110L    COMP  PIC  S9(4).                                    
           02  F000110F    PICTURE X.                                           
           02  FILLER REDEFINES F000110F.                                       
             03 F000110A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000110I  PIC X(5).                                              
           02  F000109L    COMP  PIC  S9(4).                                    
           02  F000109F    PICTURE X.                                           
           02  FILLER REDEFINES F000109F.                                       
             03 F000109A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000109I  PIC X(1).                                              
           02  F000108L    COMP  PIC  S9(4).                                    
           02  F000108F    PICTURE X.                                           
           02  FILLER REDEFINES F000108F.                                       
             03 F000108A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000108I  PIC X(6).                                              
           02  F000107L    COMP  PIC  S9(4).                                    
           02  F000107F    PICTURE X.                                           
           02  FILLER REDEFINES F000107F.                                       
             03 F000107A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000107I  PIC X(2).                                              
           02  F000106L    COMP  PIC  S9(4).                                    
           02  F000106F    PICTURE X.                                           
           02  FILLER REDEFINES F000106F.                                       
             03 F000106A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000106I  PIC X(29).                                             
           02  EFC9L    COMP  PIC  S9(4).                                       
           02  EFC9F    PICTURE X.                                              
           02  FILLER REDEFINES EFC9F.                                          
             03 EFC9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC9I  PIC X(1).                                                 
           02  AZINFO9L    COMP  PIC  S9(4).                                    
           02  AZINFO9F    PICTURE X.                                           
           02  FILLER REDEFINES AZINFO9F.                                       
             03 AZINFO9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZINFO9I  PIC X(2).                                              
           02  F000119L    COMP  PIC  S9(4).                                    
           02  F000119F    PICTURE X.                                           
           02  FILLER REDEFINES F000119F.                                       
             03 F000119A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000119I  PIC X(3).                                              
           02  ANSTKZ9L    COMP  PIC  S9(4).                                    
           02  ANSTKZ9F    PICTURE X.                                           
           02  FILLER REDEFINES ANSTKZ9F.                                       
             03 ANSTKZ9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANSTKZ9I  PIC X(2).                                              
           02  F000118L    COMP  PIC  S9(4).                                    
           02  F000118F    PICTURE X.                                           
           02  FILLER REDEFINES F000118F.                                       
             03 F000118A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000118I  PIC X(10).                                             
           02  F000117L    COMP  PIC  S9(4).                                    
           02  F000117F    PICTURE X.                                           
           02  FILLER REDEFINES F000117F.                                       
             03 F000117A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000117I  PIC X(5).                                              
           02  F000116L    COMP  PIC  S9(4).                                    
           02  F000116F    PICTURE X.                                           
           02  FILLER REDEFINES F000116F.                                       
             03 F000116A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000116I  PIC X(1).                                              
           02  F000115L    COMP  PIC  S9(4).                                    
           02  F000115F    PICTURE X.                                           
           02  FILLER REDEFINES F000115F.                                       
             03 F000115A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000115I  PIC X(6).                                              
           02  F000114L    COMP  PIC  S9(4).                                    
           02  F000114F    PICTURE X.                                           
           02  FILLER REDEFINES F000114F.                                       
             03 F000114A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000114I  PIC X(2).                                              
           02  F000113L    COMP  PIC  S9(4).                                    
           02  F000113F    PICTURE X.                                           
           02  FILLER REDEFINES F000113F.                                       
             03 F000113A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000113I  PIC X(29).                                             
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0039O REDEFINES BPA0039I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESH    PICTURE X.                                              
           02  EGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVNRH    PICTURE X.                                              
           02  EVNRO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  EUNRH    PICTURE X.                                              
           02  EUNRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESCHICHH    PICTURE X.                                           
           02  ESCHICHO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRODSLH    PICTURE X.                                           
           02  EPRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRODBMH    PICTURE X.                                           
           02  APRODBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFAEVTTH    PICTURE X.                                           
           02  EFAEVTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVMMH    PICTURE X.                                           
           02  EFAEVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEVJJH    PICTURE X.                                           
           02  EFAEVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBTTH    PICTURE X.                                           
           02  EFAEBTTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBMMH    PICTURE X.                                           
           02  EFAEBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFAEBJJH    PICTURE X.                                           
           02  EFAEBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFOLGNRH    PICTURE X.                                           
           02  EFOLGNRO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRVMMH    PICTURE X.                                           
           02  EABRVMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRVJJH    PICTURE X.                                           
           02  EABRVJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRBMMH    PICTURE X.                                           
           02  EABRBMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EABRBJJH    PICTURE X.                                           
           02  EABRBJJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCSFBH    PICTURE X.                                            
           02  AFCSFBO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEH    PICTURE X.                                             
           02  ANAMEO  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFCFBH    PICTURE X.                                             
           02  AFCFBO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AZINFOH    PICTURE X.                                            
           02  AZINFOO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRODSLH    PICTURE X.                                           
           02  APRODSLO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZH    PICTURE X.                                            
           02  ANSTKZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AFAEVONH    PICTURE X.                                           
           02  AFAEVONO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRSCHLH    PICTURE X.                                           
           02  APRSCHLO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABWHKFTH    PICTURE X.                                           
           02  ABWHKFTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABWSCHLH    PICTURE X.                                           
           02  ABWSCHLO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATARIKZH    PICTURE X.                                           
           02  ATARIKZO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AKVBTXTH    PICTURE X.                                           
           02  AKVBTXTO  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO2H    PICTURE X.                                           
           02  AZINFO2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000070H    PICTURE X.                                           
           02  F000070O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ2H    PICTURE X.                                           
           02  ANSTKZ2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000069H    PICTURE X.                                           
           02  F000069O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000068H    PICTURE X.                                           
           02  F000068O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000067H    PICTURE X.                                           
           02  F000067O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000066H    PICTURE X.                                           
           02  F000066O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000065H    PICTURE X.                                           
           02  F000065O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000064H    PICTURE X.                                           
           02  F000064O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO3H    PICTURE X.                                           
           02  AZINFO3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000077H    PICTURE X.                                           
           02  F000077O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ3H    PICTURE X.                                           
           02  ANSTKZ3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000076H    PICTURE X.                                           
           02  F000076O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000075H    PICTURE X.                                           
           02  F000075O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000074H    PICTURE X.                                           
           02  F000074O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000073H    PICTURE X.                                           
           02  F000073O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000072H    PICTURE X.                                           
           02  F000072O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000071H    PICTURE X.                                           
           02  F000071O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC4H    PICTURE X.                                              
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO4H    PICTURE X.                                           
           02  AZINFO4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000084H    PICTURE X.                                           
           02  F000084O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ4H    PICTURE X.                                           
           02  ANSTKZ4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000083H    PICTURE X.                                           
           02  F000083O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000082H    PICTURE X.                                           
           02  F000082O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000081H    PICTURE X.                                           
           02  F000081O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000080H    PICTURE X.                                           
           02  F000080O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000079H    PICTURE X.                                           
           02  F000079O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000078H    PICTURE X.                                           
           02  F000078O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC5H    PICTURE X.                                              
           02  EFC5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO5H    PICTURE X.                                           
           02  AZINFO5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000091H    PICTURE X.                                           
           02  F000091O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ5H    PICTURE X.                                           
           02  ANSTKZ5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000090H    PICTURE X.                                           
           02  F000090O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000089H    PICTURE X.                                           
           02  F000089O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000088H    PICTURE X.                                           
           02  F000088O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000087H    PICTURE X.                                           
           02  F000087O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000086H    PICTURE X.                                           
           02  F000086O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000085H    PICTURE X.                                           
           02  F000085O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC6H    PICTURE X.                                              
           02  EFC6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO6H    PICTURE X.                                           
           02  AZINFO6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000098H    PICTURE X.                                           
           02  F000098O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ6H    PICTURE X.                                           
           02  ANSTKZ6O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000097H    PICTURE X.                                           
           02  F000097O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000096H    PICTURE X.                                           
           02  F000096O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000095H    PICTURE X.                                           
           02  F000095O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000094H    PICTURE X.                                           
           02  F000094O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000093H    PICTURE X.                                           
           02  F000093O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000092H    PICTURE X.                                           
           02  F000092O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC7H    PICTURE X.                                              
           02  EFC7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO7H    PICTURE X.                                           
           02  AZINFO7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000105H    PICTURE X.                                           
           02  F000105O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ7H    PICTURE X.                                           
           02  ANSTKZ7O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000104H    PICTURE X.                                           
           02  F000104O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000103H    PICTURE X.                                           
           02  F000103O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000102H    PICTURE X.                                           
           02  F000102O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000101H    PICTURE X.                                           
           02  F000101O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000100H    PICTURE X.                                           
           02  F000100O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000099H    PICTURE X.                                           
           02  F000099O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC8H    PICTURE X.                                              
           02  EFC8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO8H    PICTURE X.                                           
           02  AZINFO8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000112H    PICTURE X.                                           
           02  F000112O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ8H    PICTURE X.                                           
           02  ANSTKZ8O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000111H    PICTURE X.                                           
           02  F000111O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000110H    PICTURE X.                                           
           02  F000110O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000109H    PICTURE X.                                           
           02  F000109O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000108H    PICTURE X.                                           
           02  F000108O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000107H    PICTURE X.                                           
           02  F000107O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000106H    PICTURE X.                                           
           02  F000106O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  EFC9H    PICTURE X.                                              
           02  EFC9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AZINFO9H    PICTURE X.                                           
           02  AZINFO9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000119H    PICTURE X.                                           
           02  F000119O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANSTKZ9H    PICTURE X.                                           
           02  ANSTKZ9O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000118H    PICTURE X.                                           
           02  F000118O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000117H    PICTURE X.                                           
           02  F000117O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000116H    PICTURE X.                                           
           02  F000116O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000115H    PICTURE X.                                           
           02  F000115O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000114H    PICTURE X.                                           
           02  F000114O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000113H    PICTURE X.                                           
           02  F000113O  PIC X(29).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
