       01  BPA0015I.                                                            
           02  FILLER PIC X(12).                                                
           02  EFCSL    COMP  PIC  S9(4).                                       
           02  EFCSF    PICTURE X.                                              
           02  FILLER REDEFINES EFCSF.                                          
             03 EFCSA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFCSI  PIC X(3).                                                 
           02  AFCSANZL    COMP  PIC  S9(4).                                    
           02  AFCSANZF    PICTURE X.                                           
           02  FILLER REDEFINES AFCSANZF.                                       
             03 AFCSANZA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AFCSANZI  PIC X(57).                                             
           02  AGESL    COMP  PIC  S9(4).                                       
           02  AGESF    PICTURE X.                                              
           02  FILLER REDEFINES AGESF.                                          
             03 AGESA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AGESI  PIC X(2).                                                 
           02  AGESBML    COMP  PIC  S9(4).                                     
           02  AGESBMF    PICTURE X.                                            
           02  FILLER REDEFINES AGESBMF.                                        
             03 AGESBMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AGESBMI  PIC X(10).                                              
           02  ADTAARTL    COMP  PIC  S9(4).                                    
           02  ADTAARTF    PICTURE X.                                           
           02  FILLER REDEFINES ADTAARTF.                                       
             03 ADTAARTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADTAARTI  PIC X(3).                                              
           02  ADARTNLL    COMP  PIC  S9(4).                                    
           02  ADARTNLF    PICTURE X.                                           
           02  FILLER REDEFINES ADARTNLF.                                       
             03 ADARTNLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADARTNLI  PIC X(10).                                             
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  AVSTEXTL    COMP  PIC  S9(4).                                    
           02  AVSTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AVSTEXTF.                                       
             03 AVSTEXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTEXTI  PIC X(48).                                             
           02  AABREDAL    COMP  PIC  S9(4).                                    
           02  AABREDAF    PICTURE X.                                           
           02  FILLER REDEFINES AABREDAF.                                       
             03 AABREDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AABREDAI  PIC X(10).                                             
           02  AUEBDATL    COMP  PIC  S9(4).                                    
           02  AUEBDATF    PICTURE X.                                           
           02  FILLER REDEFINES AUEBDATF.                                       
             03 AUEBDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AUEBDATI  PIC X(10).                                             
           02  ANZSAOFL    COMP  PIC  S9(4).                                    
           02  ANZSAOFF    PICTURE X.                                           
           02  FILLER REDEFINES ANZSAOFF.                                       
             03 ANZSAOFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANZSAOFI  PIC X(9).                                              
           02  ANZSAMFL    COMP  PIC  S9(4).                                    
           02  ANZSAMFF    PICTURE X.                                           
           02  FILLER REDEFINES ANZSAMFF.                                       
             03 ANZSAMFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ANZSAMFI  PIC X(9).                                              
           02  APROVOFL    COMP  PIC  S9(4).                                    
           02  APROVOFF    PICTURE X.                                           
           02  FILLER REDEFINES APROVOFF.                                       
             03 APROVOFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVOFI  PIC X(13).                                             
           02  APROVMFL    COMP  PIC  S9(4).                                    
           02  APROVMFF    PICTURE X.                                           
           02  FILLER REDEFINES APROVMFF.                                       
             03 APROVMFA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APROVMFI  PIC X(13).                                             
           02  AERSTELL    COMP  PIC  S9(4).                                    
           02  AERSTELF    PICTURE X.                                           
           02  FILLER REDEFINES AERSTELF.                                       
             03 AERSTELA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERSTELI  PIC X(8).                                              
           02  AERSDATL    COMP  PIC  S9(4).                                    
           02  AERSDATF    PICTURE X.                                           
           02  FILLER REDEFINES AERSDATF.                                       
             03 AERSDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AERSDATI  PIC X(10).                                             
           02  APVWFREL    COMP  PIC  S9(4).                                    
           02  APVWFREF    PICTURE X.                                           
           02  FILLER REDEFINES APVWFREF.                                       
             03 APVWFREA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APVWFREI  PIC X(8).                                              
           02  APVWDATL    COMP  PIC  S9(4).                                    
           02  APVWDATF    PICTURE X.                                           
           02  FILLER REDEFINES APVWDATF.                                       
             03 APVWDATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APVWDATI  PIC X(10).                                             
       01  BPA0015O REDEFINES BPA0015I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFCSH    PICTURE X.                                              
           02  EFCSO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFCSANZH    PICTURE X.                                           
           02  AFCSANZO  PIC X(57).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGESH    PICTURE X.                                              
           02  AGESO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AGESBMH    PICTURE X.                                            
           02  AGESBMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADTAARTH    PICTURE X.                                           
           02  ADTAARTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADARTNLH    PICTURE X.                                           
           02  ADARTNLO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTEXTH    PICTURE X.                                           
           02  AVSTEXTO  PIC X(48).                                             
           02  FILLER PICTURE X(3).                                             
           02  AABREDAH    PICTURE X.                                           
           02  AABREDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AUEBDATH    PICTURE X.                                           
           02  AUEBDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANZSAOFH    PICTURE X.                                           
           02  ANZSAOFO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANZSAMFH    PICTURE X.                                           
           02  ANZSAMFO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROVOFH    PICTURE X.                                           
           02  APROVOFO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  APROVMFH    PICTURE X.                                           
           02  APROVMFO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  AERSTELH    PICTURE X.                                           
           02  AERSTELO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AERSDATH    PICTURE X.                                           
           02  AERSDATO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  APVWFREH    PICTURE X.                                           
           02  APVWFREO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  APVWDATH    PICTURE X.                                           
           02  APVWDATO  PIC X(10).                                             
