       01  BPA0057I.                                                            
           02  FILLER PIC X(12).                                                
           02  LBL-GESL    COMP  PIC  S9(4).                                    
           02  LBL-GESF    PICTURE X.                                           
           02  FILLER REDEFINES LBL-GESF.                                       
             03 LBL-GESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-GESI  PIC X(13).                                             
           02  EIN-GESL    COMP  PIC  S9(4).                                    
           02  EIN-GESF    PICTURE X.                                           
           02  FILLER REDEFINES EIN-GESF.                                       
             03 EIN-GESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EIN-GESI  PIC X(2).                                              
           02  LBL-PRDL    COMP  PIC  S9(4).                                    
           02  LBL-PRDF    PICTURE X.                                           
           02  FILLER REDEFINES LBL-PRDF.                                       
             03 LBL-PRDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-PRDI  PIC X(17).                                             
           02  EIN-PRDL    COMP  PIC  S9(4).                                    
           02  EIN-PRDF    PICTURE X.                                           
           02  FILLER REDEFINES EIN-PRDF.                                       
             03 EIN-PRDA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EIN-PRDI  PIC X(3).                                              
           02  LBL-EG1L    COMP  PIC  S9(4).                                    
           02  LBL-EG1F    PICTURE X.                                           
           02  FILLER REDEFINES LBL-EG1F.                                       
             03 LBL-EG1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-EG1I  PIC X(50).                                             
           02  LBL-EG2L    COMP  PIC  S9(4).                                    
           02  LBL-EG2F    PICTURE X.                                           
           02  FILLER REDEFINES LBL-EG2F.                                       
             03 LBL-EG2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-EG2I  PIC X(51).                                             
           02  A-DATEGL    COMP  PIC  S9(4).                                    
           02  A-DATEGF    PICTURE X.                                           
           02  FILLER REDEFINES A-DATEGF.                                       
             03 A-DATEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-DATEGI  PIC X(10).                                             
           02  A-PRVEGL    COMP  PIC  S9(4).                                    
           02  A-PRVEGF    PICTURE X.                                           
           02  FILLER REDEFINES A-PRVEGF.                                       
             03 A-PRVEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-PRVEGI  PIC X(9).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(1).                                              
           02  A-VWFEGL    COMP  PIC  S9(4).                                    
           02  A-VWFEGF    PICTURE X.                                           
           02  FILLER REDEFINES A-VWFEGF.                                       
             03 A-VWFEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-VWFEGI  PIC X(9).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(1).                                              
           02  A-VTFEGL    COMP  PIC  S9(4).                                    
           02  A-VTFEGF    PICTURE X.                                           
           02  FILLER REDEFINES A-VTFEGF.                                       
             03 A-VTFEGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-VTFEGI  PIC X(9).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(1).                                              
           02  LBL-AG1L    COMP  PIC  S9(4).                                    
           02  LBL-AG1F    PICTURE X.                                           
           02  FILLER REDEFINES LBL-AG1F.                                       
             03 LBL-AG1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-AG1I  PIC X(50).                                             
           02  LBL-AG2L    COMP  PIC  S9(4).                                    
           02  LBL-AG2F    PICTURE X.                                           
           02  FILLER REDEFINES LBL-AG2F.                                       
             03 LBL-AG2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-AG2I  PIC X(51).                                             
           02  A-DATAGL    COMP  PIC  S9(4).                                    
           02  A-DATAGF    PICTURE X.                                           
           02  FILLER REDEFINES A-DATAGF.                                       
             03 A-DATAGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-DATAGI  PIC X(10).                                             
           02  A-PRVAGL    COMP  PIC  S9(4).                                    
           02  A-PRVAGF    PICTURE X.                                           
           02  FILLER REDEFINES A-PRVAGF.                                       
             03 A-PRVAGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-PRVAGI  PIC X(9).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(1).                                              
           02  A-VWFAGL    COMP  PIC  S9(4).                                    
           02  A-VWFAGF    PICTURE X.                                           
           02  FILLER REDEFINES A-VWFAGF.                                       
             03 A-VWFAGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-VWFAGI  PIC X(9).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(1).                                              
           02  A-VTFAGL    COMP  PIC  S9(4).                                    
           02  A-VTFAGF    PICTURE X.                                           
           02  FILLER REDEFINES A-VTFAGF.                                       
             03 A-VTFAGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-VTFAGI  PIC X(9).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(1).                                              
           02  LBL-GS1L    COMP  PIC  S9(4).                                    
           02  LBL-GS1F    PICTURE X.                                           
           02  FILLER REDEFINES LBL-GS1F.                                       
             03 LBL-GS1A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-GS1I  PIC X(51).                                             
           02  LBL-GS2L    COMP  PIC  S9(4).                                    
           02  LBL-GS2F    PICTURE X.                                           
           02  FILLER REDEFINES LBL-GS2F.                                       
             03 LBL-GS2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  LBL-GS2I  PIC X(26).                                             
           02  A-DATGSL    COMP  PIC  S9(4).                                    
           02  A-DATGSF    PICTURE X.                                           
           02  FILLER REDEFINES A-DATGSF.                                       
             03 A-DATGSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-DATGSI  PIC X(10).                                             
           02  A-PRVGSL    COMP  PIC  S9(4).                                    
           02  A-PRVGSF    PICTURE X.                                           
           02  FILLER REDEFINES A-PRVGSF.                                       
             03 A-PRVGSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  A-PRVGSI  PIC X(9).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(1).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0057O REDEFINES BPA0057I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  LBL-GESH    PICTURE X.                                           
           02  LBL-GESO  PIC X(13).                                             
           02  FILLER PICTURE X(3).                                             
           02  EIN-GESH    PICTURE X.                                           
           02  EIN-GESO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  LBL-PRDH    PICTURE X.                                           
           02  LBL-PRDO  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  EIN-PRDH    PICTURE X.                                           
           02  EIN-PRDO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  LBL-EG1H    PICTURE X.                                           
           02  LBL-EG1O  PIC X(50).                                             
           02  FILLER PICTURE X(3).                                             
           02  LBL-EG2H    PICTURE X.                                           
           02  LBL-EG2O  PIC X(51).                                             
           02  FILLER PICTURE X(3).                                             
           02  A-DATEGH    PICTURE X.                                           
           02  A-DATEGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A-PRVEGH    PICTURE X.                                           
           02  A-PRVEGO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  A-VWFEGH    PICTURE X.                                           
           02  A-VWFEGO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  A-VTFEGH    PICTURE X.                                           
           02  A-VTFEGO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  LBL-AG1H    PICTURE X.                                           
           02  LBL-AG1O  PIC X(50).                                             
           02  FILLER PICTURE X(3).                                             
           02  LBL-AG2H    PICTURE X.                                           
           02  LBL-AG2O  PIC X(51).                                             
           02  FILLER PICTURE X(3).                                             
           02  A-DATAGH    PICTURE X.                                           
           02  A-DATAGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A-PRVAGH    PICTURE X.                                           
           02  A-PRVAGO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  A-VWFAGH    PICTURE X.                                           
           02  A-VWFAGO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  A-VTFAGH    PICTURE X.                                           
           02  A-VTFAGO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  LBL-GS1H    PICTURE X.                                           
           02  LBL-GS1O  PIC X(51).                                             
           02  FILLER PICTURE X(3).                                             
           02  LBL-GS2H    PICTURE X.                                           
           02  LBL-GS2O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  A-DATGSH    PICTURE X.                                           
           02  A-DATGSO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  A-PRVGSH    PICTURE X.                                           
           02  A-PRVGSO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
