       01  BPA0003I.                                                            
           02  FILLER PIC X(12).                                                
           02  EGESELLL    COMP  PIC  S9(4).                                    
           02  EGESELLF    PICTURE X.                                           
           02  FILLER REDEFINES EGESELLF.                                       
             03 EGESELLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EGESELLI  PIC X(2).                                              
           02  AGESEBML    COMP  PIC  S9(4).                                    
           02  AGESEBMF    PICTURE X.                                           
           02  FILLER REDEFINES AGESEBMF.                                       
             03 AGESEBMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AGESEBMI  PIC X(10).                                             
           02  EVGRPL    COMP  PIC  S9(4).                                      
           02  EVGRPF    PICTURE X.                                             
           02  FILLER REDEFINES EVGRPF.                                         
             03 EVGRPA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVGRPI  PIC XXX.                                                 
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EVSTATL    COMP  PIC  S9(4).                                     
           02  EVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES EVSTATF.                                        
             03 EVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EVSTATI  PIC X(4).                                               
           02  AVSTEXTL    COMP  PIC  S9(4).                                    
           02  AVSTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AVSTEXTF.                                       
             03 AVSTEXTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVSTEXTI  PIC X(40).                                             
           02  APWAEBKL    COMP  PIC  S9(4).                                    
           02  APWAEBKF    PICTURE X.                                           
           02  FILLER REDEFINES APWAEBKF.                                       
             03 APWAEBKA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APWAEBKI  PIC X(4).                                              
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  FLD0001L    COMP  PIC  S9(4).                                    
           02  FLD0001F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0001F.                                       
             03 FLD0001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0001I  PIC X(1).                                              
           02  FLD0002L    COMP  PIC  S9(4).                                    
           02  FLD0002F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0002F.                                       
             03 FLD0002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0002I  PIC X(1).                                              
           02  FLD0003L    COMP  PIC  S9(4).                                    
           02  FLD0003F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0003F.                                       
             03 FLD0003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0003I  PIC X(1).                                              
           02  FLD0004L    COMP  PIC  S9(4).                                    
           02  FLD0004F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0004F.                                       
             03 FLD0004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0004I  PIC X(1).                                              
           02  FLD0005L    COMP  PIC  S9(4).                                    
           02  FLD0005F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0005F.                                       
             03 FLD0005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0005I  PIC X(1).                                              
           02  FLD0006L    COMP  PIC  S9(4).                                    
           02  FLD0006F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0006F.                                       
             03 FLD0006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0006I  PIC X(1).                                              
           02  FLD0007L    COMP  PIC  S9(4).                                    
           02  FLD0007F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0007F.                                       
             03 FLD0007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0007I  PIC X(1).                                              
           02  FLD0008L    COMP  PIC  S9(4).                                    
           02  FLD0008F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0008F.                                       
             03 FLD0008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0008I  PIC X(1).                                              
           02  FLD0009L    COMP  PIC  S9(4).                                    
           02  FLD0009F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0009F.                                       
             03 FLD0009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0009I  PIC X(1).                                              
           02  APINVNRL    COMP  PIC  S9(4).                                    
           02  APINVNRF    PICTURE X.                                           
           02  FILLER REDEFINES APINVNRF.                                       
             03 APINVNRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  APINVNRI  PIC X(15).                                             
           02  FLD0010L    COMP  PIC  S9(4).                                    
           02  FLD0010F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0010F.                                       
             03 FLD0010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0010I  PIC X(15).                                             
           02  FLD0011L    COMP  PIC  S9(4).                                    
           02  FLD0011F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0011F.                                       
             03 FLD0011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0011I  PIC X(15).                                             
           02  FLD0012L    COMP  PIC  S9(4).                                    
           02  FLD0012F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0012F.                                       
             03 FLD0012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0012I  PIC X(15).                                             
           02  FLD0013L    COMP  PIC  S9(4).                                    
           02  FLD0013F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0013F.                                       
             03 FLD0013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0013I  PIC X(15).                                             
           02  FLD0014L    COMP  PIC  S9(4).                                    
           02  FLD0014F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0014F.                                       
             03 FLD0014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0014I  PIC X(15).                                             
           02  FLD0015L    COMP  PIC  S9(4).                                    
           02  FLD0015F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0015F.                                       
             03 FLD0015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0015I  PIC X(15).                                             
           02  FLD0016L    COMP  PIC  S9(4).                                    
           02  FLD0016F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0016F.                                       
             03 FLD0016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0016I  PIC X(15).                                             
           02  FLD0017L    COMP  PIC  S9(4).                                    
           02  FLD0017F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0017F.                                       
             03 FLD0017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0017I  PIC X(15).                                             
           02  FLD0018L    COMP  PIC  S9(4).                                    
           02  FLD0018F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0018F.                                       
             03 FLD0018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0018I  PIC X(15).                                             
           02  AKDNKL    COMP  PIC  S9(4).                                      
           02  AKDNKF    PICTURE X.                                             
           02  FILLER REDEFINES AKDNKF.                                         
             03 AKDNKA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AKDNKI  PIC X(20).                                               
           02  FLD0019L    COMP  PIC  S9(4).                                    
           02  FLD0019F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0019F.                                       
             03 FLD0019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0019I  PIC X(20).                                             
           02  FLD0020L    COMP  PIC  S9(4).                                    
           02  FLD0020F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0020F.                                       
             03 FLD0020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0020I  PIC X(20).                                             
           02  FLD0021L    COMP  PIC  S9(4).                                    
           02  FLD0021F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0021F.                                       
             03 FLD0021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0021I  PIC X(20).                                             
           02  FLD0022L    COMP  PIC  S9(4).                                    
           02  FLD0022F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0022F.                                       
             03 FLD0022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0022I  PIC X(20).                                             
           02  FLD0023L    COMP  PIC  S9(4).                                    
           02  FLD0023F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0023F.                                       
             03 FLD0023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0023I  PIC X(20).                                             
           02  FLD0024L    COMP  PIC  S9(4).                                    
           02  FLD0024F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0024F.                                       
             03 FLD0024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0024I  PIC X(20).                                             
           02  FLD0025L    COMP  PIC  S9(4).                                    
           02  FLD0025F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0025F.                                       
             03 FLD0025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0025I  PIC X(20).                                             
           02  FLD0026L    COMP  PIC  S9(4).                                    
           02  FLD0026F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0026F.                                       
             03 FLD0026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0026I  PIC X(20).                                             
           02  FLD0027L    COMP  PIC  S9(4).                                    
           02  FLD0027F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0027F.                                       
             03 FLD0027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0027I  PIC X(20).                                             
           02  AVSTATL    COMP  PIC  S9(4).                                     
           02  AVSTATF    PICTURE X.                                            
           02  FILLER REDEFINES AVSTATF.                                        
             03 AVSTATA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVSTATI  PIC X(4).                                               
           02  FLD0028L    COMP  PIC  S9(4).                                    
           02  FLD0028F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0028F.                                       
             03 FLD0028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0028I  PIC X(4).                                              
           02  FLD0029L    COMP  PIC  S9(4).                                    
           02  FLD0029F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0029F.                                       
             03 FLD0029A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0029I  PIC X(4).                                              
           02  FLD0030L    COMP  PIC  S9(4).                                    
           02  FLD0030F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0030F.                                       
             03 FLD0030A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0030I  PIC X(4).                                              
           02  FLD0031L    COMP  PIC  S9(4).                                    
           02  FLD0031F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0031F.                                       
             03 FLD0031A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0031I  PIC X(4).                                              
           02  FLD0032L    COMP  PIC  S9(4).                                    
           02  FLD0032F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0032F.                                       
             03 FLD0032A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0032I  PIC X(4).                                              
           02  FLD0033L    COMP  PIC  S9(4).                                    
           02  FLD0033F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0033F.                                       
             03 FLD0033A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0033I  PIC X(4).                                              
           02  FLD0034L    COMP  PIC  S9(4).                                    
           02  FLD0034F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0034F.                                       
             03 FLD0034A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0034I  PIC X(4).                                              
           02  FLD0035L    COMP  PIC  S9(4).                                    
           02  FLD0035F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0035F.                                       
             03 FLD0035A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0035I  PIC X(4).                                              
           02  FLD0036L    COMP  PIC  S9(4).                                    
           02  FLD0036F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0036F.                                       
             03 FLD0036A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0036I  PIC X(4).                                              
           02  AWVORDAL    COMP  PIC  S9(4).                                    
           02  AWVORDAF    PICTURE X.                                           
           02  FILLER REDEFINES AWVORDAF.                                       
             03 AWVORDAA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AWVORDAI  PIC X(10).                                             
           02  FLD0037L    COMP  PIC  S9(4).                                    
           02  FLD0037F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0037F.                                       
             03 FLD0037A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0037I  PIC X(10).                                             
           02  FLD0038L    COMP  PIC  S9(4).                                    
           02  FLD0038F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0038F.                                       
             03 FLD0038A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0038I  PIC X(10).                                             
           02  FLD0039L    COMP  PIC  S9(4).                                    
           02  FLD0039F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0039F.                                       
             03 FLD0039A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0039I  PIC X(10).                                             
           02  FLD0040L    COMP  PIC  S9(4).                                    
           02  FLD0040F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0040F.                                       
             03 FLD0040A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0040I  PIC X(10).                                             
           02  FLD0041L    COMP  PIC  S9(4).                                    
           02  FLD0041F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0041F.                                       
             03 FLD0041A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0041I  PIC X(10).                                             
           02  FLD0042L    COMP  PIC  S9(4).                                    
           02  FLD0042F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0042F.                                       
             03 FLD0042A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0042I  PIC X(10).                                             
           02  FLD0043L    COMP  PIC  S9(4).                                    
           02  FLD0043F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0043F.                                       
             03 FLD0043A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0043I  PIC X(10).                                             
           02  FLD0044L    COMP  PIC  S9(4).                                    
           02  FLD0044F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0044F.                                       
             03 FLD0044A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0044I  PIC X(10).                                             
           02  FLD0045L    COMP  PIC  S9(4).                                    
           02  FLD0045F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0045F.                                       
             03 FLD0045A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0045I  PIC X(10).                                             
           02  AEINHL    COMP  PIC  S9(4).                                      
           02  AEINHF    PICTURE X.                                             
           02  FILLER REDEFINES AEINHF.                                         
             03 AEINHA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AEINHI  PIC X(8).                                                
           02  FLD0046L    COMP  PIC  S9(4).                                    
           02  FLD0046F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0046F.                                       
             03 FLD0046A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0046I  PIC X(8).                                              
           02  FLD0047L    COMP  PIC  S9(4).                                    
           02  FLD0047F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0047F.                                       
             03 FLD0047A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0047I  PIC X(8).                                              
           02  FLD0048L    COMP  PIC  S9(4).                                    
           02  FLD0048F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0048F.                                       
             03 FLD0048A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0048I  PIC X(8).                                              
           02  FLD0049L    COMP  PIC  S9(4).                                    
           02  FLD0049F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0049F.                                       
             03 FLD0049A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0049I  PIC X(8).                                              
           02  FLD0050L    COMP  PIC  S9(4).                                    
           02  FLD0050F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0050F.                                       
             03 FLD0050A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0050I  PIC X(8).                                              
           02  FLD0051L    COMP  PIC  S9(4).                                    
           02  FLD0051F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0051F.                                       
             03 FLD0051A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0051I  PIC X(8).                                              
           02  FLD0052L    COMP  PIC  S9(4).                                    
           02  FLD0052F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0052F.                                       
             03 FLD0052A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0052I  PIC X(8).                                              
           02  FLD0053L    COMP  PIC  S9(4).                                    
           02  FLD0053F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0053F.                                       
             03 FLD0053A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0053I  PIC X(8).                                              
           02  FLD0054L    COMP  PIC  S9(4).                                    
           02  FLD0054F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0054F.                                       
             03 FLD0054A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0054I  PIC X(8).                                              
           02  APROVBL    COMP  PIC  S9(4).                                     
           02  APROVBF    PICTURE X.                                            
           02  FILLER REDEFINES APROVBF.                                        
             03 APROVBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  APROVBI  PIC X(11).                                              
           02  FLD0055L    COMP  PIC  S9(4).                                    
           02  FLD0055F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0055F.                                       
             03 FLD0055A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0055I  PIC X(11).                                             
           02  FLD0056L    COMP  PIC  S9(4).                                    
           02  FLD0056F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0056F.                                       
             03 FLD0056A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0056I  PIC X(11).                                             
           02  FLD0057L    COMP  PIC  S9(4).                                    
           02  FLD0057F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0057F.                                       
             03 FLD0057A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0057I  PIC X(11).                                             
           02  FLD0058L    COMP  PIC  S9(4).                                    
           02  FLD0058F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0058F.                                       
             03 FLD0058A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0058I  PIC X(11).                                             
           02  FLD0059L    COMP  PIC  S9(4).                                    
           02  FLD0059F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0059F.                                       
             03 FLD0059A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0059I  PIC X(11).                                             
           02  FLD0060L    COMP  PIC  S9(4).                                    
           02  FLD0060F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0060F.                                       
             03 FLD0060A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0060I  PIC X(11).                                             
           02  FLD0061L    COMP  PIC  S9(4).                                    
           02  FLD0061F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0061F.                                       
             03 FLD0061A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0061I  PIC X(11).                                             
           02  FLD0062L    COMP  PIC  S9(4).                                    
           02  FLD0062F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0062F.                                       
             03 FLD0062A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0062I  PIC X(11).                                             
           02  FLD0063L    COMP  PIC  S9(4).                                    
           02  FLD0063F    PICTURE X.                                           
           02  FILLER REDEFINES FLD0063F.                                       
             03 FLD0063A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  FLD0063I  PIC X(11).                                             
           02  ATEXTGSL    COMP  PIC  S9(4).                                    
           02  ATEXTGSF    PICTURE X.                                           
           02  FILLER REDEFINES ATEXTGSF.                                       
             03 ATEXTGSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATEXTGSI  PIC X(11).                                             
           02  ASPROVBL    COMP  PIC  S9(4).                                    
           02  ASPROVBF    PICTURE X.                                           
           02  FILLER REDEFINES ASPROVBF.                                       
             03 ASPROVBA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASPROVBI  PIC X(15).                                             
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BPA0003O REDEFINES BPA0003I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EGESELLH    PICTURE X.                                           
           02  EGESELLO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGESEBMH    PICTURE X.                                           
           02  AGESEBMO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EVGRPH    PICTURE X.                                             
           02  EVGRPO PIC XXX.                                                  
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVSTATH    PICTURE X.                                            
           02  EVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSTEXTH    PICTURE X.                                           
           02  AVSTEXTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  APWAEBKH    PICTURE X.                                           
           02  APWAEBKO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  FLD0001H    PICTURE X.                                           
           02  FLD0001O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0002H    PICTURE X.                                           
           02  FLD0002O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0003H    PICTURE X.                                           
           02  FLD0003O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0004H    PICTURE X.                                           
           02  FLD0004O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0005H    PICTURE X.                                           
           02  FLD0005O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0006H    PICTURE X.                                           
           02  FLD0006O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0007H    PICTURE X.                                           
           02  FLD0007O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0008H    PICTURE X.                                           
           02  FLD0008O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0009H    PICTURE X.                                           
           02  FLD0009O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APINVNRH    PICTURE X.                                           
           02  APINVNRO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0010H    PICTURE X.                                           
           02  FLD0010O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0011H    PICTURE X.                                           
           02  FLD0011O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0012H    PICTURE X.                                           
           02  FLD0012O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0013H    PICTURE X.                                           
           02  FLD0013O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0014H    PICTURE X.                                           
           02  FLD0014O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0015H    PICTURE X.                                           
           02  FLD0015O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0016H    PICTURE X.                                           
           02  FLD0016O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0017H    PICTURE X.                                           
           02  FLD0017O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0018H    PICTURE X.                                           
           02  FLD0018O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AKDNKH    PICTURE X.                                             
           02  AKDNKO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0019H    PICTURE X.                                           
           02  FLD0019O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0020H    PICTURE X.                                           
           02  FLD0020O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0021H    PICTURE X.                                           
           02  FLD0021O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0022H    PICTURE X.                                           
           02  FLD0022O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0023H    PICTURE X.                                           
           02  FLD0023O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0024H    PICTURE X.                                           
           02  FLD0024O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0025H    PICTURE X.                                           
           02  FLD0025O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0026H    PICTURE X.                                           
           02  FLD0026O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0027H    PICTURE X.                                           
           02  FLD0027O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVSTATH    PICTURE X.                                            
           02  AVSTATO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  FLD0028H    PICTURE X.                                           
           02  FLD0028O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0029H    PICTURE X.                                           
           02  FLD0029O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0030H    PICTURE X.                                           
           02  FLD0030O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0031H    PICTURE X.                                           
           02  FLD0031O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0032H    PICTURE X.                                           
           02  FLD0032O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0033H    PICTURE X.                                           
           02  FLD0033O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0034H    PICTURE X.                                           
           02  FLD0034O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0035H    PICTURE X.                                           
           02  FLD0035O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0036H    PICTURE X.                                           
           02  FLD0036O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AWVORDAH    PICTURE X.                                           
           02  AWVORDAO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0037H    PICTURE X.                                           
           02  FLD0037O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0038H    PICTURE X.                                           
           02  FLD0038O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0039H    PICTURE X.                                           
           02  FLD0039O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0040H    PICTURE X.                                           
           02  FLD0040O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0041H    PICTURE X.                                           
           02  FLD0041O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0042H    PICTURE X.                                           
           02  FLD0042O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0043H    PICTURE X.                                           
           02  FLD0043O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0044H    PICTURE X.                                           
           02  FLD0044O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0045H    PICTURE X.                                           
           02  FLD0045O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINHH    PICTURE X.                                             
           02  AEINHO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  FLD0046H    PICTURE X.                                           
           02  FLD0046O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0047H    PICTURE X.                                           
           02  FLD0047O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0048H    PICTURE X.                                           
           02  FLD0048O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0049H    PICTURE X.                                           
           02  FLD0049O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0050H    PICTURE X.                                           
           02  FLD0050O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0051H    PICTURE X.                                           
           02  FLD0051O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0052H    PICTURE X.                                           
           02  FLD0052O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0053H    PICTURE X.                                           
           02  FLD0053O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0054H    PICTURE X.                                           
           02  FLD0054O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  APROVBH    PICTURE X.                                            
           02  APROVBO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  FLD0055H    PICTURE X.                                           
           02  FLD0055O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0056H    PICTURE X.                                           
           02  FLD0056O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0057H    PICTURE X.                                           
           02  FLD0057O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0058H    PICTURE X.                                           
           02  FLD0058O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0059H    PICTURE X.                                           
           02  FLD0059O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0060H    PICTURE X.                                           
           02  FLD0060O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0061H    PICTURE X.                                           
           02  FLD0061O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0062H    PICTURE X.                                           
           02  FLD0062O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  FLD0063H    PICTURE X.                                           
           02  FLD0063O  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATEXTGSH    PICTURE X.                                           
           02  ATEXTGSO  PIC X(11).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASPROVBH    PICTURE X.                                           
           02  ASPROVBO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
