       01  BSL0017I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(20).                                               
           02  AVORNAML    COMP  PIC  S9(4).                                    
           02  AVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVORNAMF.                                       
             03 AVORNAMA    PICTURE X.                                          
           02  AVORNAMI  PIC X(15).                                             
           02  ABDVL    COMP  PIC  S9(4).                                       
           02  ABDVF    PICTURE X.                                              
           02  FILLER REDEFINES ABDVF.                                          
             03 ABDVA    PICTURE X.                                             
           02  ABDVI  PIC X(1).                                                 
           02  ASTFABL    COMP  PIC  S9(4).                                     
           02  ASTFABF    PICTURE X.                                            
           02  FILLER REDEFINES ASTFABF.                                        
             03 ASTFABA    PICTURE X.                                           
           02  ASTFABI  PIC X(10).                                              
           02  ATEXT1L    COMP  PIC  S9(4).                                     
           02  ATEXT1F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT1F.                                        
             03 ATEXT1A    PICTURE X.                                           
           02  ATEXT1I  PIC X(30).                                              
           02  EANZ1L    COMP  PIC  S9(4).                                      
           02  EANZ1F    PICTURE X.                                             
           02  FILLER REDEFINES EANZ1F.                                         
             03 EANZ1A    PICTURE X.                                            
           02  EANZ1I  PIC X(1).                                                
           02  EBEG1TL    COMP  PIC  S9(4).                                     
           02  EBEG1TF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG1TF.                                        
             03 EBEG1TA    PICTURE X.                                           
           02  EBEG1TI  PIC X(2).                                               
           02  EBEG1ML    COMP  PIC  S9(4).                                     
           02  EBEG1MF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG1MF.                                        
             03 EBEG1MA    PICTURE X.                                           
           02  EBEG1MI  PIC X(2).                                               
           02  EBEG1JL    COMP  PIC  S9(4).                                     
           02  EBEG1JF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG1JF.                                        
             03 EBEG1JA    PICTURE X.                                           
           02  EBEG1JI  PIC X(4).                                               
           02  EEND1TL    COMP  PIC  S9(4).                                     
           02  EEND1TF    PICTURE X.                                            
           02  FILLER REDEFINES EEND1TF.                                        
             03 EEND1TA    PICTURE X.                                           
           02  EEND1TI  PIC X(2).                                               
           02  EEND1ML    COMP  PIC  S9(4).                                     
           02  EEND1MF    PICTURE X.                                            
           02  FILLER REDEFINES EEND1MF.                                        
             03 EEND1MA    PICTURE X.                                           
           02  EEND1MI  PIC X(2).                                               
           02  EEND1JL    COMP  PIC  S9(4).                                     
           02  EEND1JF    PICTURE X.                                            
           02  FILLER REDEFINES EEND1JF.                                        
             03 EEND1JA    PICTURE X.                                           
           02  EEND1JI  PIC X(4).                                               
           02  ABETR1L    COMP  PIC  S9(4).                                     
           02  ABETR1F    PICTURE X.                                            
           02  FILLER REDEFINES ABETR1F.                                        
             03 ABETR1A    PICTURE X.                                           
           02  ABETR1I  PIC X(7).                                               
           02  AVSNR1L    COMP  PIC  S9(4).                                     
           02  AVSNR1F    PICTURE X.                                            
           02  FILLER REDEFINES AVSNR1F.                                        
             03 AVSNR1A    PICTURE X.                                           
           02  AVSNR1I  PIC X(9).                                               
           02  ATEXT2L    COMP  PIC  S9(4).                                     
           02  ATEXT2F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT2F.                                        
             03 ATEXT2A    PICTURE X.                                           
           02  ATEXT2I  PIC X(30).                                              
           02  EANZ2L    COMP  PIC  S9(4).                                      
           02  EANZ2F    PICTURE X.                                             
           02  FILLER REDEFINES EANZ2F.                                         
             03 EANZ2A    PICTURE X.                                            
           02  EANZ2I  PIC X(1).                                                
           02  EBEG2TL    COMP  PIC  S9(4).                                     
           02  EBEG2TF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG2TF.                                        
             03 EBEG2TA    PICTURE X.                                           
           02  EBEG2TI  PIC X(2).                                               
           02  EBEG2ML    COMP  PIC  S9(4).                                     
           02  EBEG2MF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG2MF.                                        
             03 EBEG2MA    PICTURE X.                                           
           02  EBEG2MI  PIC X(2).                                               
           02  EBEG2JL    COMP  PIC  S9(4).                                     
           02  EBEG2JF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG2JF.                                        
             03 EBEG2JA    PICTURE X.                                           
           02  EBEG2JI  PIC X(4).                                               
           02  EEND2TL    COMP  PIC  S9(4).                                     
           02  EEND2TF    PICTURE X.                                            
           02  FILLER REDEFINES EEND2TF.                                        
             03 EEND2TA    PICTURE X.                                           
           02  EEND2TI  PIC X(2).                                               
           02  EEND2ML    COMP  PIC  S9(4).                                     
           02  EEND2MF    PICTURE X.                                            
           02  FILLER REDEFINES EEND2MF.                                        
             03 EEND2MA    PICTURE X.                                           
           02  EEND2MI  PIC X(2).                                               
           02  EEND2JL    COMP  PIC  S9(4).                                     
           02  EEND2JF    PICTURE X.                                            
           02  FILLER REDEFINES EEND2JF.                                        
             03 EEND2JA    PICTURE X.                                           
           02  EEND2JI  PIC X(4).                                               
           02  ABETR2L    COMP  PIC  S9(4).                                     
           02  ABETR2F    PICTURE X.                                            
           02  FILLER REDEFINES ABETR2F.                                        
             03 ABETR2A    PICTURE X.                                           
           02  ABETR2I  PIC X(7).                                               
           02  AVSNR2L    COMP  PIC  S9(4).                                     
           02  AVSNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVSNR2F.                                        
             03 AVSNR2A    PICTURE X.                                           
           02  AVSNR2I  PIC X(9).                                               
           02  ATEXT3L    COMP  PIC  S9(4).                                     
           02  ATEXT3F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT3F.                                        
             03 ATEXT3A    PICTURE X.                                           
           02  ATEXT3I  PIC X(30).                                              
           02  EANZ3L    COMP  PIC  S9(4).                                      
           02  EANZ3F    PICTURE X.                                             
           02  FILLER REDEFINES EANZ3F.                                         
             03 EANZ3A    PICTURE X.                                            
           02  EANZ3I  PIC X(1).                                                
           02  EBEG3TL    COMP  PIC  S9(4).                                     
           02  EBEG3TF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG3TF.                                        
             03 EBEG3TA    PICTURE X.                                           
           02  EBEG3TI  PIC X(2).                                               
           02  EBEG3ML    COMP  PIC  S9(4).                                     
           02  EBEG3MF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG3MF.                                        
             03 EBEG3MA    PICTURE X.                                           
           02  EBEG3MI  PIC X(2).                                               
           02  EBEG3JL    COMP  PIC  S9(4).                                     
           02  EBEG3JF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG3JF.                                        
             03 EBEG3JA    PICTURE X.                                           
           02  EBEG3JI  PIC X(4).                                               
           02  EEND3TL    COMP  PIC  S9(4).                                     
           02  EEND3TF    PICTURE X.                                            
           02  FILLER REDEFINES EEND3TF.                                        
             03 EEND3TA    PICTURE X.                                           
           02  EEND3TI  PIC X(2).                                               
           02  EEND3ML    COMP  PIC  S9(4).                                     
           02  EEND3MF    PICTURE X.                                            
           02  FILLER REDEFINES EEND3MF.                                        
             03 EEND3MA    PICTURE X.                                           
           02  EEND3MI  PIC X(2).                                               
           02  EEND3JL    COMP  PIC  S9(4).                                     
           02  EEND3JF    PICTURE X.                                            
           02  FILLER REDEFINES EEND3JF.                                        
             03 EEND3JA    PICTURE X.                                           
           02  EEND3JI  PIC X(4).                                               
           02  ABETR3L    COMP  PIC  S9(4).                                     
           02  ABETR3F    PICTURE X.                                            
           02  FILLER REDEFINES ABETR3F.                                        
             03 ABETR3A    PICTURE X.                                           
           02  ABETR3I  PIC X(7).                                               
           02  AVSNR3L    COMP  PIC  S9(4).                                     
           02  AVSNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVSNR3F.                                        
             03 AVSNR3A    PICTURE X.                                           
           02  AVSNR3I  PIC X(9).                                               
           02  ATEXT4L    COMP  PIC  S9(4).                                     
           02  ATEXT4F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT4F.                                        
             03 ATEXT4A    PICTURE X.                                           
           02  ATEXT4I  PIC X(30).                                              
           02  EANZ4L    COMP  PIC  S9(4).                                      
           02  EANZ4F    PICTURE X.                                             
           02  FILLER REDEFINES EANZ4F.                                         
             03 EANZ4A    PICTURE X.                                            
           02  EANZ4I  PIC X(1).                                                
           02  EBEG4TL    COMP  PIC  S9(4).                                     
           02  EBEG4TF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG4TF.                                        
             03 EBEG4TA    PICTURE X.                                           
           02  EBEG4TI  PIC X(2).                                               
           02  EBEG4ML    COMP  PIC  S9(4).                                     
           02  EBEG4MF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG4MF.                                        
             03 EBEG4MA    PICTURE X.                                           
           02  EBEG4MI  PIC X(2).                                               
           02  EBEG4JL    COMP  PIC  S9(4).                                     
           02  EBEG4JF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG4JF.                                        
             03 EBEG4JA    PICTURE X.                                           
           02  EBEG4JI  PIC X(4).                                               
           02  EEND4TL    COMP  PIC  S9(4).                                     
           02  EEND4TF    PICTURE X.                                            
           02  FILLER REDEFINES EEND4TF.                                        
             03 EEND4TA    PICTURE X.                                           
           02  EEND4TI  PIC X(2).                                               
           02  EEND4ML    COMP  PIC  S9(4).                                     
           02  EEND4MF    PICTURE X.                                            
           02  FILLER REDEFINES EEND4MF.                                        
             03 EEND4MA    PICTURE X.                                           
           02  EEND4MI  PIC X(2).                                               
           02  EEND4JL    COMP  PIC  S9(4).                                     
           02  EEND4JF    PICTURE X.                                            
           02  FILLER REDEFINES EEND4JF.                                        
             03 EEND4JA    PICTURE X.                                           
           02  EEND4JI  PIC X(4).                                               
           02  ABETR4L    COMP  PIC  S9(4).                                     
           02  ABETR4F    PICTURE X.                                            
           02  FILLER REDEFINES ABETR4F.                                        
             03 ABETR4A    PICTURE X.                                           
           02  ABETR4I  PIC X(7).                                               
           02  AVSNR4L    COMP  PIC  S9(4).                                     
           02  AVSNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVSNR4F.                                        
             03 AVSNR4A    PICTURE X.                                           
           02  AVSNR4I  PIC X(9).                                               
           02  ATEXT5L    COMP  PIC  S9(4).                                     
           02  ATEXT5F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT5F.                                        
             03 ATEXT5A    PICTURE X.                                           
           02  ATEXT5I  PIC X(30).                                              
           02  EANZ5L    COMP  PIC  S9(4).                                      
           02  EANZ5F    PICTURE X.                                             
           02  FILLER REDEFINES EANZ5F.                                         
             03 EANZ5A    PICTURE X.                                            
           02  EANZ5I  PIC X(1).                                                
           02  EBEG5TL    COMP  PIC  S9(4).                                     
           02  EBEG5TF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG5TF.                                        
             03 EBEG5TA    PICTURE X.                                           
           02  EBEG5TI  PIC X(2).                                               
           02  EBEG5ML    COMP  PIC  S9(4).                                     
           02  EBEG5MF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG5MF.                                        
             03 EBEG5MA    PICTURE X.                                           
           02  EBEG5MI  PIC X(2).                                               
           02  EBEG5JL    COMP  PIC  S9(4).                                     
           02  EBEG5JF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG5JF.                                        
             03 EBEG5JA    PICTURE X.                                           
           02  EBEG5JI  PIC X(4).                                               
           02  EEND5TL    COMP  PIC  S9(4).                                     
           02  EEND5TF    PICTURE X.                                            
           02  FILLER REDEFINES EEND5TF.                                        
             03 EEND5TA    PICTURE X.                                           
           02  EEND5TI  PIC X(2).                                               
           02  EEND5ML    COMP  PIC  S9(4).                                     
           02  EEND5MF    PICTURE X.                                            
           02  FILLER REDEFINES EEND5MF.                                        
             03 EEND5MA    PICTURE X.                                           
           02  EEND5MI  PIC X(2).                                               
           02  EEND5JL    COMP  PIC  S9(4).                                     
           02  EEND5JF    PICTURE X.                                            
           02  FILLER REDEFINES EEND5JF.                                        
             03 EEND5JA    PICTURE X.                                           
           02  EEND5JI  PIC X(4).                                               
           02  ABETR5L    COMP  PIC  S9(4).                                     
           02  ABETR5F    PICTURE X.                                            
           02  FILLER REDEFINES ABETR5F.                                        
             03 ABETR5A    PICTURE X.                                           
           02  ABETR5I  PIC X(7).                                               
           02  AVSNR5L    COMP  PIC  S9(4).                                     
           02  AVSNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVSNR5F.                                        
             03 AVSNR5A    PICTURE X.                                           
           02  AVSNR5I  PIC X(9).                                               
           02  ATEXT6L    COMP  PIC  S9(4).                                     
           02  ATEXT6F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT6F.                                        
             03 ATEXT6A    PICTURE X.                                           
           02  ATEXT6I  PIC X(30).                                              
           02  EANZ6L    COMP  PIC  S9(4).                                      
           02  EANZ6F    PICTURE X.                                             
           02  FILLER REDEFINES EANZ6F.                                         
             03 EANZ6A    PICTURE X.                                            
           02  EANZ6I  PIC X(1).                                                
           02  EBEG6TL    COMP  PIC  S9(4).                                     
           02  EBEG6TF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG6TF.                                        
             03 EBEG6TA    PICTURE X.                                           
           02  EBEG6TI  PIC X(2).                                               
           02  EBEG6ML    COMP  PIC  S9(4).                                     
           02  EBEG6MF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG6MF.                                        
             03 EBEG6MA    PICTURE X.                                           
           02  EBEG6MI  PIC X(2).                                               
           02  EBEG6JL    COMP  PIC  S9(4).                                     
           02  EBEG6JF    PICTURE X.                                            
           02  FILLER REDEFINES EBEG6JF.                                        
             03 EBEG6JA    PICTURE X.                                           
           02  EBEG6JI  PIC X(4).                                               
           02  EEND6TL    COMP  PIC  S9(4).                                     
           02  EEND6TF    PICTURE X.                                            
           02  FILLER REDEFINES EEND6TF.                                        
             03 EEND6TA    PICTURE X.                                           
           02  EEND6TI  PIC X(2).                                               
           02  EEND6ML    COMP  PIC  S9(4).                                     
           02  EEND6MF    PICTURE X.                                            
           02  FILLER REDEFINES EEND6MF.                                        
             03 EEND6MA    PICTURE X.                                           
           02  EEND6MI  PIC X(2).                                               
           02  EEND6JL    COMP  PIC  S9(4).                                     
           02  EEND6JF    PICTURE X.                                            
           02  FILLER REDEFINES EEND6JF.                                        
             03 EEND6JA    PICTURE X.                                           
           02  EEND6JI  PIC X(4).                                               
           02  ABETR6L    COMP  PIC  S9(4).                                     
           02  ABETR6F    PICTURE X.                                            
           02  FILLER REDEFINES ABETR6F.                                        
             03 ABETR6A    PICTURE X.                                           
           02  ABETR6I  PIC X(7).                                               
           02  AVSNR6L    COMP  PIC  S9(4).                                     
           02  AVSNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVSNR6F.                                        
             03 AVSNR6A    PICTURE X.                                           
           02  AVSNR6I  PIC X(9).                                               
           02  EEINVTL    COMP  PIC  S9(4).                                     
           02  EEINVTF    PICTURE X.                                            
           02  FILLER REDEFINES EEINVTF.                                        
             03 EEINVTA    PICTURE X.                                           
           02  EEINVTI  PIC X(50).                                              
           02  EINFO1L    COMP  PIC  S9(4).                                     
           02  EINFO1F    PICTURE X.                                            
           02  FILLER REDEFINES EINFO1F.                                        
             03 EINFO1A    PICTURE X.                                           
           02  EINFO1I  PIC X(50).                                              
           02  EINFO2L    COMP  PIC  S9(4).                                     
           02  EINFO2F    PICTURE X.                                            
           02  FILLER REDEFINES EINFO2F.                                        
             03 EINFO2A    PICTURE X.                                           
           02  EINFO2I  PIC X(50).                                              
           02  EBETREL    COMP  PIC  S9(4).                                     
           02  EBETREF    PICTURE X.                                            
           02  FILLER REDEFINES EBETREF.                                        
             03 EBETREA    PICTURE X.                                           
           02  EBETREI  PIC X(7).                                               
           02  EERSTTL    COMP  PIC  S9(4).                                     
           02  EERSTTF    PICTURE X.                                            
           02  FILLER REDEFINES EERSTTF.                                        
             03 EERSTTA    PICTURE X.                                           
           02  EERSTTI  PIC X(2).                                               
           02  EERSTML    COMP  PIC  S9(4).                                     
           02  EERSTMF    PICTURE X.                                            
           02  FILLER REDEFINES EERSTMF.                                        
             03 EERSTMA    PICTURE X.                                           
           02  EERSTMI  PIC X(2).                                               
           02  EERSTJL    COMP  PIC  S9(4).                                     
           02  EERSTJF    PICTURE X.                                            
           02  FILLER REDEFINES EERSTJF.                                        
             03 EERSTJA    PICTURE X.                                           
           02  EERSTJI  PIC X(4).                                               
       01  BSL0017O REDEFINES BSL0017I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORNAMO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABDVO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ASTFABO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT1O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEG1TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG1MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG1JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND1TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND1MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND1JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETR1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSNR1O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATEXT2O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEG2TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG2MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG2JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND2TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND2MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND2JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSNR2O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATEXT3O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEG3TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG3MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG3JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND3TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND3MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND3JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETR3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSNR3O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATEXT4O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZ4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEG4TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG4MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG4JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND4TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND4MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND4JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETR4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSNR4O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATEXT5O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZ5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEG5TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG5MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG5JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND5TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND5MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND5JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETR5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSNR5O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATEXT6O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANZ6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBEG6TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG6MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBEG6JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND6TO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND6MO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEND6JO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETR6O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVSNR6O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  EEINVTO  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  EINFO1O  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  EINFO2O  PIC X(50).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBETREO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  EERSTTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EERSTMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EERSTJO  PIC X(4).                                               
