       01  BSL0012I.                                                            
           02  FILLER PIC X(12).                                                
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(76).                                              
           02  EVBNRDLL    COMP  PIC  S9(4).                                    
           02  EVBNRDLF    PICTURE X.                                           
           02  FILLER REDEFINES EVBNRDLF.                                       
             03 EVBNRDLA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRDLI  PIC X(7).                                              
           02  EDLPRZL    COMP  PIC  S9(4).                                     
           02  EDLPRZF    PICTURE X.                                            
           02  FILLER REDEFINES EDLPRZF.                                        
             03 EDLPRZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EDLPRZI  PIC X(1).                                               
           02  ADIRNRL    COMP  PIC  S9(4).                                     
           02  ADIRNRF    PICTURE X.                                            
           02  FILLER REDEFINES ADIRNRF.                                        
             03 ADIRNRA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADIRNRI  PIC X(3).                                               
           02  AQUARTL    COMP  PIC  S9(4).                                     
           02  AQUARTF    PICTURE X.                                            
           02  FILLER REDEFINES AQUARTF.                                        
             03 AQUARTA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AQUARTI  PIC X(17).                                              
           02  ASUMDLL    COMP  PIC  S9(4).                                     
           02  ASUMDLF    PICTURE X.                                            
           02  FILLER REDEFINES ASUMDLF.                                        
             03 ASUMDLA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASUMDLI  PIC X(11).                                              
           02  ADLNAMEL    COMP  PIC  S9(4).                                    
           02  ADLNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES ADLNAMEF.                                       
             03 ADLNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADLNAMEI  PIC X(26).                                             
           02  EEDKTOL    COMP  PIC  S9(4).                                     
           02  EEDKTOF    PICTURE X.                                            
           02  FILLER REDEFINES EEDKTOF.                                        
             03 EEDKTOA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EEDKTOI  PIC X(7).                                               
           02  AEDKNAML    COMP  PIC  S9(4).                                    
           02  AEDKNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AEDKNAMF.                                       
             03 AEDKNAMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEDKNAMI  PIC X(20).                                             
           02  ASTSTATL    COMP  PIC  S9(4).                                    
           02  ASTSTATF    PICTURE X.                                           
           02  FILLER REDEFINES ASTSTATF.                                       
             03 ASTSTATA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTSTATI  PIC X(2).                                              
           02  ABETRAGL    COMP  PIC  S9(4).                                    
           02  ABETRAGF    PICTURE X.                                           
           02  FILLER REDEFINES ABETRAGF.                                       
             03 ABETRAGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABETRAGI  PIC X(10).                                             
           02  EBETRUL    COMP  PIC  S9(4).                                     
           02  EBETRUF    PICTURE X.                                            
           02  FILLER REDEFINES EBETRUF.                                        
             03 EBETRUA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EBETRUI  PIC X(10).                                              
           02  ASTATUSL    COMP  PIC  S9(4).                                    
           02  ASTATUSF    PICTURE X.                                           
           02  FILLER REDEFINES ASTATUSF.                                       
             03 ASTATUSA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTATUSI  PIC X(5).                                              
           02  ATEXTL    COMP  PIC  S9(4).                                      
           02  ATEXTF    PICTURE X.                                             
           02  FILLER REDEFINES ATEXTF.                                         
             03 ATEXTA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ATEXTI  PIC X(30).                                               
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(10).                                             
           02  EBETRU2L    COMP  PIC  S9(4).                                    
           02  EBETRU2F    PICTURE X.                                           
           02  FILLER REDEFINES EBETRU2F.                                       
             03 EBETRU2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBETRU2I  PIC X(10).                                             
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(5).                                              
           02  ATEXT2L    COMP  PIC  S9(4).                                     
           02  ATEXT2F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT2F.                                        
             03 ATEXT2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT2I  PIC X(30).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(10).                                             
           02  EBETRU3L    COMP  PIC  S9(4).                                    
           02  EBETRU3F    PICTURE X.                                           
           02  FILLER REDEFINES EBETRU3F.                                       
             03 EBETRU3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBETRU3I  PIC X(10).                                             
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(5).                                              
           02  ATEXT3L    COMP  PIC  S9(4).                                     
           02  ATEXT3F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT3F.                                        
             03 ATEXT3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT3I  PIC X(30).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(10).                                             
           02  EBETRU4L    COMP  PIC  S9(4).                                    
           02  EBETRU4F    PICTURE X.                                           
           02  FILLER REDEFINES EBETRU4F.                                       
             03 EBETRU4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBETRU4I  PIC X(10).                                             
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(5).                                              
           02  ATEXT4L    COMP  PIC  S9(4).                                     
           02  ATEXT4F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT4F.                                        
             03 ATEXT4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT4I  PIC X(30).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(10).                                             
           02  EBETRU5L    COMP  PIC  S9(4).                                    
           02  EBETRU5F    PICTURE X.                                           
           02  FILLER REDEFINES EBETRU5F.                                       
             03 EBETRU5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBETRU5I  PIC X(10).                                             
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(5).                                              
           02  ATEXT5L    COMP  PIC  S9(4).                                     
           02  ATEXT5F    PICTURE X.                                            
           02  FILLER REDEFINES ATEXT5F.                                        
             03 ATEXT5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATEXT5I  PIC X(30).                                              
           02  ATOTALL    COMP  PIC  S9(4).                                     
           02  ATOTALF    PICTURE X.                                            
           02  FILLER REDEFINES ATOTALF.                                        
             03 ATOTALA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ATOTALI  PIC X(11).                                              
           02  ATOTALUL    COMP  PIC  S9(4).                                    
           02  ATOTALUF    PICTURE X.                                           
           02  FILLER REDEFINES ATOTALUF.                                       
             03 ATOTALUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ATOTALUI  PIC X(11).                                             
       01  BSL0012O REDEFINES BSL0012I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(76).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBNRDLH    PICTURE X.                                           
           02  EVBNRDLO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDLPRZH    PICTURE X.                                            
           02  EDLPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIRNRH    PICTURE X.                                            
           02  ADIRNRO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  AQUARTH    PICTURE X.                                            
           02  AQUARTO  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASUMDLH    PICTURE X.                                            
           02  ASUMDLO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADLNAMEH    PICTURE X.                                           
           02  ADLNAMEO  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  EEDKTOH    PICTURE X.                                            
           02  EEDKTOO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEDKNAMH    PICTURE X.                                           
           02  AEDKNAMO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTSTATH    PICTURE X.                                           
           02  ASTSTATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABETRAGH    PICTURE X.                                           
           02  ABETRAGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETRUH    PICTURE X.                                            
           02  EBETRUO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTATUSH    PICTURE X.                                           
           02  ASTATUSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXTH    PICTURE X.                                             
           02  ATEXTO  PIC X(30).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETRU2H    PICTURE X.                                           
           02  EBETRU2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT2H    PICTURE X.                                            
           02  ATEXT2O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETRU3H    PICTURE X.                                           
           02  EBETRU3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT3H    PICTURE X.                                            
           02  ATEXT3O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETRU4H    PICTURE X.                                           
           02  EBETRU4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT4H    PICTURE X.                                            
           02  ATEXT4O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBETRU5H    PICTURE X.                                           
           02  EBETRU5O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATEXT5H    PICTURE X.                                            
           02  ATEXT5O  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATOTALH    PICTURE X.                                            
           02  ATOTALO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATOTALUH    PICTURE X.                                           
           02  ATOTALUO  PIC X(11).                                             
