       01  BSL0014I.                                                            
           02  FILLER PIC X(12).                                                
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(76).                                              
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EVBNRI  PIC X(7).                                                
           02  EPRZL    COMP  PIC  S9(4).                                       
           02  EPRZF    PICTURE X.                                              
           02  FILLER REDEFINES EPRZF.                                          
             03 EPRZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPRZI  PIC X(1).                                                 
           02  AEQFEIGL    COMP  PIC  S9(4).                                    
           02  AEQFEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AEQFEIGF.                                       
             03 AEQFEIGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEQFEIGI  PIC X(5).                                              
           02  AMINEHL    COMP  PIC  S9(4).                                     
           02  AMINEHF    PICTURE X.                                            
           02  FILLER REDEFINES AMINEHF.                                        
             03 AMINEHA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AMINEHI  PIC X(5).                                               
           02  EMONATML    COMP  PIC  S9(4).                                    
           02  EMONATMF    PICTURE X.                                           
           02  FILLER REDEFINES EMONATMF.                                       
             03 EMONATMA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EMONATMI  PIC X(2).                                              
           02  EMONATJL    COMP  PIC  S9(4).                                    
           02  EMONATJF    PICTURE X.                                           
           02  FILLER REDEFINES EMONATJF.                                       
             03 EMONATJA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EMONATJI  PIC X(2).                                              
           02  EKZERFL    COMP  PIC  S9(4).                                     
           02  EKZERFF    PICTURE X.                                            
           02  FILLER REDEFINES EKZERFF.                                        
             03 EKZERFA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  EKZERFI  PIC X(4).                                               
           02  EVERGEHL    COMP  PIC  S9(4).                                    
           02  EVERGEHF    PICTURE X.                                           
           02  FILLER REDEFINES EVERGEHF.                                       
             03 EVERGEHA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EVERGEHI  PIC X(7).                                              
           02  ABETREUL    COMP  PIC  S9(4).                                    
           02  ABETREUF    PICTURE X.                                           
           02  FILLER REDEFINES ABETREUF.                                       
             03 ABETREUA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ABETREUI  PIC X(7).                                              
           02  AEBENEL    COMP  PIC  S9(4).                                     
           02  AEBENEF    PICTURE X.                                            
           02  FILLER REDEFINES AEBENEF.                                        
             03 AEBENEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AEBENEI  PIC X(1).                                               
           02  ADATUML    COMP  PIC  S9(4).                                     
           02  ADATUMF    PICTURE X.                                            
           02  FILLER REDEFINES ADATUMF.                                        
             03 ADATUMA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ADATUMI  PIC X(6).                                               
           02  EBETRAGL    COMP  PIC  S9(4).                                    
           02  EBETRAGF    PICTURE X.                                           
           02  FILLER REDEFINES EBETRAGF.                                       
             03 EBETRAGA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBETRAGI  PIC X(8).                                              
           02  EBETRUPL    COMP  PIC  S9(4).                                    
           02  EBETRUPF    PICTURE X.                                           
           02  FILLER REDEFINES EBETRUPF.                                       
             03 EBETRUPA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  EBETRUPI  PIC X(8).                                              
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(7).                                              
           02  AEBENE2L    COMP  PIC  S9(4).                                    
           02  AEBENE2F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE2F.                                       
             03 AEBENE2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE2I  PIC X(1).                                              
           02  ADATUM2L    COMP  PIC  S9(4).                                    
           02  ADATUM2F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM2F.                                       
             03 ADATUM2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM2I  PIC X(6).                                              
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(8).                                              
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(8).                                              
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(7).                                              
           02  AEBENE3L    COMP  PIC  S9(4).                                    
           02  AEBENE3F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE3F.                                       
             03 AEBENE3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE3I  PIC X(1).                                              
           02  ADATUM3L    COMP  PIC  S9(4).                                    
           02  ADATUM3F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM3F.                                       
             03 ADATUM3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM3I  PIC X(6).                                              
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(8).                                              
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(8).                                              
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(7).                                              
           02  AEBENE4L    COMP  PIC  S9(4).                                    
           02  AEBENE4F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE4F.                                       
             03 AEBENE4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE4I  PIC X(1).                                              
           02  ADATUM4L    COMP  PIC  S9(4).                                    
           02  ADATUM4F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM4F.                                       
             03 ADATUM4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM4I  PIC X(6).                                              
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(8).                                              
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(8).                                              
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(7).                                              
           02  AEBENE5L    COMP  PIC  S9(4).                                    
           02  AEBENE5F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE5F.                                       
             03 AEBENE5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE5I  PIC X(1).                                              
           02  ADATUM5L    COMP  PIC  S9(4).                                    
           02  ADATUM5F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM5F.                                       
             03 ADATUM5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM5I  PIC X(6).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(8).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(8).                                              
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(7).                                              
           02  AEBENE6L    COMP  PIC  S9(4).                                    
           02  AEBENE6F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE6F.                                       
             03 AEBENE6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE6I  PIC X(1).                                              
           02  ADATUM6L    COMP  PIC  S9(4).                                    
           02  ADATUM6F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM6F.                                       
             03 ADATUM6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM6I  PIC X(6).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(8).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(8).                                              
           02  F000017L    COMP  PIC  S9(4).                                    
           02  F000017F    PICTURE X.                                           
           02  FILLER REDEFINES F000017F.                                       
             03 F000017A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000017I  PIC X(7).                                              
           02  AEBENE7L    COMP  PIC  S9(4).                                    
           02  AEBENE7F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE7F.                                       
             03 AEBENE7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE7I  PIC X(1).                                              
           02  ADATUM7L    COMP  PIC  S9(4).                                    
           02  ADATUM7F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM7F.                                       
             03 ADATUM7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM7I  PIC X(6).                                              
           02  F000016L    COMP  PIC  S9(4).                                    
           02  F000016F    PICTURE X.                                           
           02  FILLER REDEFINES F000016F.                                       
             03 F000016A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000016I  PIC X(8).                                              
           02  F000015L    COMP  PIC  S9(4).                                    
           02  F000015F    PICTURE X.                                           
           02  FILLER REDEFINES F000015F.                                       
             03 F000015A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000015I  PIC X(8).                                              
           02  F000020L    COMP  PIC  S9(4).                                    
           02  F000020F    PICTURE X.                                           
           02  FILLER REDEFINES F000020F.                                       
             03 F000020A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000020I  PIC X(7).                                              
           02  AEBENE8L    COMP  PIC  S9(4).                                    
           02  AEBENE8F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE8F.                                       
             03 AEBENE8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE8I  PIC X(1).                                              
           02  ADATUM8L    COMP  PIC  S9(4).                                    
           02  ADATUM8F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM8F.                                       
             03 ADATUM8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM8I  PIC X(6).                                              
           02  F000019L    COMP  PIC  S9(4).                                    
           02  F000019F    PICTURE X.                                           
           02  FILLER REDEFINES F000019F.                                       
             03 F000019A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000019I  PIC X(8).                                              
           02  F000018L    COMP  PIC  S9(4).                                    
           02  F000018F    PICTURE X.                                           
           02  FILLER REDEFINES F000018F.                                       
             03 F000018A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000018I  PIC X(8).                                              
           02  F000023L    COMP  PIC  S9(4).                                    
           02  F000023F    PICTURE X.                                           
           02  FILLER REDEFINES F000023F.                                       
             03 F000023A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000023I  PIC X(7).                                              
           02  AEBENE9L    COMP  PIC  S9(4).                                    
           02  AEBENE9F    PICTURE X.                                           
           02  FILLER REDEFINES AEBENE9F.                                       
             03 AEBENE9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AEBENE9I  PIC X(1).                                              
           02  ADATUM9L    COMP  PIC  S9(4).                                    
           02  ADATUM9F    PICTURE X.                                           
           02  FILLER REDEFINES ADATUM9F.                                       
             03 ADATUM9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ADATUM9I  PIC X(6).                                              
           02  F000022L    COMP  PIC  S9(4).                                    
           02  F000022F    PICTURE X.                                           
           02  FILLER REDEFINES F000022F.                                       
             03 F000022A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000022I  PIC X(8).                                              
           02  F000021L    COMP  PIC  S9(4).                                    
           02  F000021F    PICTURE X.                                           
           02  FILLER REDEFINES F000021F.                                       
             03 F000021A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000021I  PIC X(8).                                              
           02  F000028L    COMP  PIC  S9(4).                                    
           02  F000028F    PICTURE X.                                           
           02  FILLER REDEFINES F000028F.                                       
             03 F000028A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000028I  PIC X(7).                                              
           02  F000027L    COMP  PIC  S9(4).                                    
           02  F000027F    PICTURE X.                                           
           02  FILLER REDEFINES F000027F.                                       
             03 F000027A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000027I  PIC X(1).                                              
           02  F000026L    COMP  PIC  S9(4).                                    
           02  F000026F    PICTURE X.                                           
           02  FILLER REDEFINES F000026F.                                       
             03 F000026A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000026I  PIC X(6).                                              
           02  F000025L    COMP  PIC  S9(4).                                    
           02  F000025F    PICTURE X.                                           
           02  FILLER REDEFINES F000025F.                                       
             03 F000025A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000025I  PIC X(8).                                              
           02  F000024L    COMP  PIC  S9(4).                                    
           02  F000024F    PICTURE X.                                           
           02  FILLER REDEFINES F000024F.                                       
             03 F000024A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000024I  PIC X(8).                                              
       01  BSL0014O REDEFINES BSL0014I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(76).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBNRH    PICTURE X.                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPRZH    PICTURE X.                                              
           02  EPRZO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AEQFEIGH    PICTURE X.                                           
           02  AEQFEIGO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMINEHH    PICTURE X.                                            
           02  AMINEHO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  EMONATMH    PICTURE X.                                           
           02  EMONATMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMONATJH    PICTURE X.                                           
           02  EMONATJO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKZERFH    PICTURE X.                                            
           02  EKZERFO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVERGEHH    PICTURE X.                                           
           02  EVERGEHO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABETREUH    PICTURE X.                                           
           02  ABETREUO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENEH    PICTURE X.                                            
           02  AEBENEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADATUMH    PICTURE X.                                            
           02  ADATUMO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBETRAGH    PICTURE X.                                           
           02  EBETRAGO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBETRUPH    PICTURE X.                                           
           02  EBETRUPO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE2H    PICTURE X.                                           
           02  AEBENE2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM2H    PICTURE X.                                           
           02  ADATUM2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE3H    PICTURE X.                                           
           02  AEBENE3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM3H    PICTURE X.                                           
           02  ADATUM3O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE4H    PICTURE X.                                           
           02  AEBENE4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM4H    PICTURE X.                                           
           02  ADATUM4O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE5H    PICTURE X.                                           
           02  AEBENE5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM5H    PICTURE X.                                           
           02  ADATUM5O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE6H    PICTURE X.                                           
           02  AEBENE6O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM6H    PICTURE X.                                           
           02  ADATUM6O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000017H    PICTURE X.                                           
           02  F000017O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE7H    PICTURE X.                                           
           02  AEBENE7O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM7H    PICTURE X.                                           
           02  ADATUM7O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000016H    PICTURE X.                                           
           02  F000016O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000015H    PICTURE X.                                           
           02  F000015O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000020H    PICTURE X.                                           
           02  F000020O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE8H    PICTURE X.                                           
           02  AEBENE8O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM8H    PICTURE X.                                           
           02  ADATUM8O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000019H    PICTURE X.                                           
           02  F000019O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000018H    PICTURE X.                                           
           02  F000018O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000023H    PICTURE X.                                           
           02  F000023O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEBENE9H    PICTURE X.                                           
           02  AEBENE9O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATUM9H    PICTURE X.                                           
           02  ADATUM9O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000022H    PICTURE X.                                           
           02  F000022O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000021H    PICTURE X.                                           
           02  F000021O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000028H    PICTURE X.                                           
           02  F000028O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000027H    PICTURE X.                                           
           02  F000027O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000026H    PICTURE X.                                           
           02  F000026O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000025H    PICTURE X.                                           
           02  F000025O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000024H    PICTURE X.                                           
           02  F000024O  PIC X(8).                                              
