       01  BVB0044I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  ABEDNRL    COMP  PIC  S9(4).                                     
           02  ABEDNRF    PICTURE X.                                            
           02  FILLER REDEFINES ABEDNRF.                                        
             03 ABEDNRA    PICTURE X.                                           
           02  ABEDNRI  PIC X(4).                                               
           02  ABEFAML    COMP  PIC  S9(4).                                     
           02  ABEFAMF    PICTURE X.                                            
           02  FILLER REDEFINES ABEFAMF.                                        
             03 ABEFAMA    PICTURE X.                                           
           02  ABEFAMI  PIC X(10).                                              
           02  AISTATL    COMP  PIC  S9(4).                                     
           02  AISTATF    PICTURE X.                                            
           02  FILLER REDEFINES AISTATF.                                        
             03 AISTATA    PICTURE X.                                           
           02  AISTATI  PIC X(5).                                               
           02  AIEHVONL    COMP  PIC  S9(4).                                    
           02  AIEHVONF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHVONF.                                       
             03 AIEHVONA    PICTURE X.                                          
           02  AIEHVONI  PIC X(5).                                              
           02  AIEHBISL    COMP  PIC  S9(4).                                    
           02  AIEHBISF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHBISF.                                       
             03 AIEHBISA    PICTURE X.                                          
           02  AIEHBISI  PIC X(5).                                              
           02  AZRANZL    COMP  PIC  S9(4).                                     
           02  AZRANZF    PICTURE X.                                            
           02  FILLER REDEFINES AZRANZF.                                        
             03 AZRANZA    PICTURE X.                                           
           02  AZRANZI  PIC X(2).                                               
           02  ASEHEIZL    COMP  PIC  S9(4).                                    
           02  ASEHEIZF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHEIZF.                                       
             03 ASEHEIZA    PICTURE X.                                          
           02  ASEHEIZI  PIC X(10).                                             
           02  ASEQFEIL    COMP  PIC  S9(4).                                    
           02  ASEQFEIF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFEIF.                                       
             03 ASEQFEIA    PICTURE X.                                          
           02  ASEQFEII  PIC X(5).                                              
           02  AIEHEIZL    COMP  PIC  S9(4).                                    
           02  AIEHEIZF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHEIZF.                                       
             03 AIEHEIZA    PICTURE X.                                          
           02  AIEHEIZI  PIC X(10).                                             
           02  AIEQFEIL    COMP  PIC  S9(4).                                    
           02  AIEQFEIF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFEIF.                                       
             03 AIEQFEIA    PICTURE X.                                          
           02  AIEQFEII  PIC X(5).                                              
           02  ASEHGRUL    COMP  PIC  S9(4).                                    
           02  ASEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHGRUF.                                       
             03 ASEHGRUA    PICTURE X.                                          
           02  ASEHGRUI  PIC X(10).                                             
           02  ASEQFGRL    COMP  PIC  S9(4).                                    
           02  ASEQFGRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFGRF.                                       
             03 ASEQFGRA    PICTURE X.                                          
           02  ASEQFGRI  PIC X(5).                                              
           02  AIEHGRUL    COMP  PIC  S9(4).                                    
           02  AIEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHGRUF.                                       
             03 AIEHGRUA    PICTURE X.                                          
           02  AIEHGRUI  PIC X(10).                                             
           02  AIEQFGRL    COMP  PIC  S9(4).                                    
           02  AIEQFGRF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFGRF.                                       
             03 AIEQFGRA    PICTURE X.                                          
           02  AIEQFGRI  PIC X(5).                                              
           02  ASEHGESL    COMP  PIC  S9(4).                                    
           02  ASEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHGESF.                                       
             03 ASEHGESA    PICTURE X.                                          
           02  ASEHGESI  PIC X(10).                                             
           02  ASEQFGSL    COMP  PIC  S9(4).                                    
           02  ASEQFGSF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFGSF.                                       
             03 ASEQFGSA    PICTURE X.                                          
           02  ASEQFGSI  PIC X(5).                                              
           02  AIEHGESL    COMP  PIC  S9(4).                                    
           02  AIEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHGESF.                                       
             03 AIEHGESA    PICTURE X.                                          
           02  AIEHGESI  PIC X(10).                                             
           02  ABEHGESL    COMP  PIC  S9(4).                                    
           02  ABEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES ABEHGESF.                                       
             03 ABEHGESA    PICTURE X.                                          
           02  ABEHGESI  PIC X(10).                                             
           02  AIEQFGSL    COMP  PIC  S9(4).                                    
           02  AIEQFGSF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFGSF.                                       
             03 AIEQFGSA    PICTURE X.                                          
           02  AIEQFGSI  PIC X(5).                                              
           02  AMAXEIGL    COMP  PIC  S9(4).                                    
           02  AMAXEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AMAXEIGF.                                       
             03 AMAXEIGA    PICTURE X.                                          
           02  AMAXEIGI  PIC X(10).                                             
           02  AIEHEIGL    COMP  PIC  S9(4).                                    
           02  AIEHEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHEIGF.                                       
             03 AIEHEIGA    PICTURE X.                                          
           02  AIEHEIGI  PIC X(10).                                             
           02  AEIGABZL    COMP  PIC  S9(4).                                    
           02  AEIGABZF    PICTURE X.                                           
           02  FILLER REDEFINES AEIGABZF.                                       
             03 AEIGABZA    PICTURE X.                                          
           02  AEIGABZI  PIC X(10).                                             
           02  ASNEUTXL    COMP  PIC  S9(4).                                    
           02  ASNEUTXF    PICTURE X.                                           
           02  FILLER REDEFINES ASNEUTXF.                                       
             03 ASNEUTXA    PICTURE X.                                          
           02  ASNEUTXI  PIC X(16).                                             
           02  ASGSNEUL    COMP  PIC  S9(4).                                    
           02  ASGSNEUF    PICTURE X.                                           
           02  FILLER REDEFINES ASGSNEUF.                                       
             03 ASGSNEUA    PICTURE X.                                          
           02  ASGSNEUI  PIC X(10).                                             
           02  AINEUTXL    COMP  PIC  S9(4).                                    
           02  AINEUTXF    PICTURE X.                                           
           02  FILLER REDEFINES AINEUTXF.                                       
             03 AINEUTXA    PICTURE X.                                          
           02  AINEUTXI  PIC X(6).                                              
           02  AIGSNEUL    COMP  PIC  S9(4).                                    
           02  AIGSNEUF    PICTURE X.                                           
           02  FILLER REDEFINES AIGSNEUF.                                       
             03 AIGSNEUA    PICTURE X.                                          
           02  AIGSNEUI  PIC X(10).                                             
           02  ASEHNPL    COMP  PIC  S9(4).                                     
           02  ASEHNPF    PICTURE X.                                            
           02  FILLER REDEFINES ASEHNPF.                                        
             03 ASEHNPA    PICTURE X.                                           
           02  ASEHNPI  PIC X(10).                                              
           02  AIEHNPL    COMP  PIC  S9(4).                                     
           02  AIEHNPF    PICTURE X.                                            
           02  FILLER REDEFINES AIEHNPF.                                        
             03 AIEHNPA    PICTURE X.                                           
           02  AIEHNPI  PIC X(10).                                              
           02  ABEHNPL    COMP  PIC  S9(4).                                     
           02  ABEHNPF    PICTURE X.                                            
           02  FILLER REDEFINES ABEHNPF.                                        
             03 ABEHNPA    PICTURE X.                                           
           02  ABEHNPI  PIC X(10).                                              
           02  A34CL    COMP  PIC  S9(4).                                       
           02  A34CF    PICTURE X.                                              
           02  FILLER REDEFINES A34CF.                                          
             03 A34CA    PICTURE X.                                             
           02  A34CI  PIC X(4).                                                 
           02  AS34CL    COMP  PIC  S9(4).                                      
           02  AS34CF    PICTURE X.                                             
           02  FILLER REDEFINES AS34CF.                                         
             03 AS34CA    PICTURE X.                                            
           02  AS34CI  PIC X(1).                                                
           02  AI34CL    COMP  PIC  S9(4).                                      
           02  AI34CF    PICTURE X.                                             
           02  FILLER REDEFINES AI34CF.                                         
             03 AI34CA    PICTURE X.                                            
           02  AI34CI  PIC X(1).                                                
           02  AS34FL    COMP  PIC  S9(4).                                      
           02  AS34FF    PICTURE X.                                             
           02  FILLER REDEFINES AS34FF.                                         
             03 AS34FA    PICTURE X.                                            
           02  AS34FI  PIC X(1).                                                
           02  AI34FL    COMP  PIC  S9(4).                                      
           02  AI34FF    PICTURE X.                                             
           02  FILLER REDEFINES AI34FF.                                         
             03 AI34FA    PICTURE X.                                            
           02  AI34FI  PIC X(1).                                                
           02  AS34IL    COMP  PIC  S9(4).                                      
           02  AS34IF    PICTURE X.                                             
           02  FILLER REDEFINES AS34IF.                                         
             03 AS34IA    PICTURE X.                                            
           02  AS34II  PIC X(1).                                                
           02  AI34IL    COMP  PIC  S9(4).                                      
           02  AI34IF    PICTURE X.                                             
           02  FILLER REDEFINES AI34IF.                                         
             03 AI34IA    PICTURE X.                                            
           02  AI34II  PIC X(1).                                                
           02  AALPRFL    COMP  PIC  S9(4).                                     
           02  AALPRFF    PICTURE X.                                            
           02  FILLER REDEFINES AALPRFF.                                        
             03 AALPRFA    PICTURE X.                                           
           02  AALPRFI  PIC X(5).                                               
           02  ASALPRFL    COMP  PIC  S9(4).                                    
           02  ASALPRFF    PICTURE X.                                           
           02  FILLER REDEFINES ASALPRFF.                                       
             03 ASALPRFA    PICTURE X.                                          
           02  ASALPRFI  PIC X(1).                                              
           02  AIALPRFL    COMP  PIC  S9(4).                                    
           02  AIALPRFF    PICTURE X.                                           
           02  FILLER REDEFINES AIALPRFF.                                       
             03 AIALPRFA    PICTURE X.                                          
           02  AIALPRFI  PIC X(1).                                              
       01  BVB0044O REDEFINES BVB0044I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABEDNRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABEFAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AISTATO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHVONO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHBISO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZRANZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEHEIZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFEIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHEIZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFEIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFGRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFGRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFGSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFGSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAXEIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEHEIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEIGABZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASNEUTXO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASGSNEUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AINEUTXO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIGSNEUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEHNPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHNPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABEHNPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34CO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AS34CO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AI34CO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AS34FO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AI34FO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AS34IO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AI34IO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AALPRFO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASALPRFO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIALPRFO  PIC X(1).                                              
