       01  BVB0019I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  AANREDEL    COMP  PIC  S9(4).                                    
           02  AANREDEF    PICTURE X.                                           
           02  FILLER REDEFINES AANREDEF.                                       
             03 AANREDEA    PICTURE X.                                          
           02  AANREDEI  PIC X(1).                                              
           02  EANREDEL    COMP  PIC  S9(4).                                    
           02  EANREDEF    PICTURE X.                                           
           02  FILLER REDEFINES EANREDEF.                                       
             03 EANREDEA    PICTURE X.                                          
           02  EANREDEI  PIC X(1).                                              
           02  AAKADL    COMP  PIC  S9(4).                                      
           02  AAKADF    PICTURE X.                                             
           02  FILLER REDEFINES AAKADF.                                         
             03 AAKADA    PICTURE X.                                            
           02  AAKADI  PIC X(1).                                                
           02  EAKADL    COMP  PIC  S9(4).                                      
           02  EAKADF    PICTURE X.                                             
           02  FILLER REDEFINES EAKADF.                                         
             03 EAKADA    PICTURE X.                                            
           02  EAKADI  PIC X(10).                                               
           02  AADELL    COMP  PIC  S9(4).                                      
           02  AADELF    PICTURE X.                                             
           02  FILLER REDEFINES AADELF.                                         
             03 AADELA    PICTURE X.                                            
           02  AADELI  PIC X(1).                                                
           02  EADELL    COMP  PIC  S9(4).                                      
           02  EADELF    PICTURE X.                                             
           02  FILLER REDEFINES EADELF.                                         
             03 EADELA    PICTURE X.                                            
           02  EADELI  PIC X(10).                                               
           02  AVORNAML    COMP  PIC  S9(4).                                    
           02  AVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVORNAMF.                                       
             03 AVORNAMA    PICTURE X.                                          
           02  AVORNAMI  PIC X(1).                                              
           02  EVORNAML    COMP  PIC  S9(4).                                    
           02  EVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES EVORNAMF.                                       
             03 EVORNAMA    PICTURE X.                                          
           02  EVORNAMI  PIC X(20).                                             
           02  AGEBDATL    COMP  PIC  S9(4).                                    
           02  AGEBDATF    PICTURE X.                                           
           02  FILLER REDEFINES AGEBDATF.                                       
             03 AGEBDATA    PICTURE X.                                          
           02  AGEBDATI  PIC X(2).                                              
           02  AGEBDAML    COMP  PIC  S9(4).                                    
           02  AGEBDAMF    PICTURE X.                                           
           02  FILLER REDEFINES AGEBDAMF.                                       
             03 AGEBDAMA    PICTURE X.                                          
           02  AGEBDAMI  PIC X(2).                                              
           02  AGEBDAJL    COMP  PIC  S9(4).                                    
           02  AGEBDAJF    PICTURE X.                                           
           02  FILLER REDEFINES AGEBDAJF.                                       
             03 AGEBDAJA    PICTURE X.                                          
           02  AGEBDAJI  PIC X(4).                                              
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(1).                                                
           02  ENAMEL    COMP  PIC  S9(4).                                      
           02  ENAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ENAMEF.                                         
             03 ENAMEA    PICTURE X.                                            
           02  ENAMEI  PIC X(40).                                               
           02  AMANVOTL    COMP  PIC  S9(4).                                    
           02  AMANVOTF    PICTURE X.                                           
           02  FILLER REDEFINES AMANVOTF.                                       
             03 AMANVOTA    PICTURE X.                                          
           02  AMANVOTI  PIC X(2).                                              
           02  AMANVOML    COMP  PIC  S9(4).                                    
           02  AMANVOMF    PICTURE X.                                           
           02  FILLER REDEFINES AMANVOMF.                                       
             03 AMANVOMA    PICTURE X.                                          
           02  AMANVOMI  PIC X(2).                                              
           02  AMANVOJL    COMP  PIC  S9(4).                                    
           02  AMANVOJF    PICTURE X.                                           
           02  FILLER REDEFINES AMANVOJF.                                       
             03 AMANVOJA    PICTURE X.                                          
           02  AMANVOJI  PIC X(4).                                              
           02  AMAANTPL    COMP  PIC  S9(4).                                    
           02  AMAANTPF    PICTURE X.                                           
           02  FILLER REDEFINES AMAANTPF.                                       
             03 AMAANTPA    PICTURE X.                                          
           02  AMAANTPI  PIC X(1).                                              
           02  AMAANVTL    COMP  PIC  S9(4).                                    
           02  AMAANVTF    PICTURE X.                                           
           02  FILLER REDEFINES AMAANVTF.                                       
             03 AMAANVTA    PICTURE X.                                          
           02  AMAANVTI  PIC X(2).                                              
           02  AMAANVML    COMP  PIC  S9(4).                                    
           02  AMAANVMF    PICTURE X.                                           
           02  FILLER REDEFINES AMAANVMF.                                       
             03 AMAANVMA    PICTURE X.                                          
           02  AMAANVMI  PIC X(2).                                              
           02  AMAANVJL    COMP  PIC  S9(4).                                    
           02  AMAANVJF    PICTURE X.                                           
           02  FILLER REDEFINES AMAANVJF.                                       
             03 AMAANVJA    PICTURE X.                                          
           02  AMAANVJI  PIC X(4).                                              
           02  AZUSTLL    COMP  PIC  S9(4).                                     
           02  AZUSTLF    PICTURE X.                                            
           02  FILLER REDEFINES AZUSTLF.                                        
             03 AZUSTLA    PICTURE X.                                           
           02  AZUSTLI  PIC X(2).                                               
           02  AGRUNDL    COMP  PIC  S9(4).                                     
           02  AGRUNDF    PICTURE X.                                            
           02  FILLER REDEFINES AGRUNDF.                                        
             03 AGRUNDA    PICTURE X.                                           
           02  AGRUNDI  PIC X(1).                                               
           02  ASTRASSL    COMP  PIC  S9(4).                                    
           02  ASTRASSF    PICTURE X.                                           
           02  FILLER REDEFINES ASTRASSF.                                       
             03 ASTRASSA    PICTURE X.                                          
           02  ASTRASSI  PIC X(1).                                              
           02  ESTRASSL    COMP  PIC  S9(4).                                    
           02  ESTRASSF    PICTURE X.                                           
           02  FILLER REDEFINES ESTRASSF.                                       
             03 ESTRASSA    PICTURE X.                                          
           02  ESTRASSI  PIC X(40).                                             
           02  APLZAKTL    COMP  PIC  S9(4).                                    
           02  APLZAKTF    PICTURE X.                                           
           02  FILLER REDEFINES APLZAKTF.                                       
             03 APLZAKTA    PICTURE X.                                          
           02  APLZAKTI  PIC X(1).                                              
           02  EPLZAKTL    COMP  PIC  S9(4).                                    
           02  EPLZAKTF    PICTURE X.                                           
           02  FILLER REDEFINES EPLZAKTF.                                       
             03 EPLZAKTA    PICTURE X.                                          
           02  EPLZAKTI  PIC X(5).                                              
           02  AORTL    COMP  PIC  S9(4).                                       
           02  AORTF    PICTURE X.                                              
           02  FILLER REDEFINES AORTF.                                          
             03 AORTA    PICTURE X.                                             
           02  AORTI  PIC X(1).                                                 
           02  EORTL    COMP  PIC  S9(4).                                       
           02  EORTF    PICTURE X.                                              
           02  FILLER REDEFINES EORTF.                                          
             03 EORTA    PICTURE X.                                             
           02  EORTI  PIC X(40).                                                
           02  AAUSLL    COMP  PIC  S9(4).                                      
           02  AAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES AAUSLF.                                         
             03 AAUSLA    PICTURE X.                                            
           02  AAUSLI  PIC X(1).                                                
           02  EAUSLL    COMP  PIC  S9(4).                                      
           02  EAUSLF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSLF.                                         
             03 EAUSLA    PICTURE X.                                            
           02  EAUSLI  PIC X(3).                                                
           02  ATELFONL    COMP  PIC  S9(4).                                    
           02  ATELFONF    PICTURE X.                                           
           02  FILLER REDEFINES ATELFONF.                                       
             03 ATELFONA    PICTURE X.                                          
           02  ATELFONI  PIC X(1).                                              
           02  ETELFONL    COMP  PIC  S9(4).                                    
           02  ETELFONF    PICTURE X.                                           
           02  FILLER REDEFINES ETELFONF.                                       
             03 ETELFONA    PICTURE X.                                          
           02  ETELFONI  PIC X(26).                                             
           02  ATELFAXL    COMP  PIC  S9(4).                                    
           02  ATELFAXF    PICTURE X.                                           
           02  FILLER REDEFINES ATELFAXF.                                       
             03 ATELFAXA    PICTURE X.                                          
           02  ATELFAXI  PIC X(1).                                              
           02  ETELFAXL    COMP  PIC  S9(4).                                    
           02  ETELFAXF    PICTURE X.                                           
           02  FILLER REDEFINES ETELFAXF.                                       
             03 ETELFAXA    PICTURE X.                                          
           02  ETELFAXI  PIC X(26).                                             
           02  AEINDATL    COMP  PIC  S9(4).                                    
           02  AEINDATF    PICTURE X.                                           
           02  FILLER REDEFINES AEINDATF.                                       
             03 AEINDATA    PICTURE X.                                          
           02  AEINDATI  PIC X(2).                                              
           02  AEINDAML    COMP  PIC  S9(4).                                    
           02  AEINDAMF    PICTURE X.                                           
           02  FILLER REDEFINES AEINDAMF.                                       
             03 AEINDAMA    PICTURE X.                                          
           02  AEINDAMI  PIC X(2).                                              
           02  AEINDAJL    COMP  PIC  S9(4).                                    
           02  AEINDAJF    PICTURE X.                                           
           02  FILLER REDEFINES AEINDAJF.                                       
             03 AEINDAJA    PICTURE X.                                          
           02  AEINDAJI  PIC X(4).                                              
           02  AAUSDATL    COMP  PIC  S9(4).                                    
           02  AAUSDATF    PICTURE X.                                           
           02  FILLER REDEFINES AAUSDATF.                                       
             03 AAUSDATA    PICTURE X.                                          
           02  AAUSDATI  PIC X(2).                                              
           02  AAUSDAML    COMP  PIC  S9(4).                                    
           02  AAUSDAMF    PICTURE X.                                           
           02  FILLER REDEFINES AAUSDAMF.                                       
             03 AAUSDAMA    PICTURE X.                                          
           02  AAUSDAMI  PIC X(2).                                              
           02  AAUSDAJL    COMP  PIC  S9(4).                                    
           02  AAUSDAJF    PICTURE X.                                           
           02  FILLER REDEFINES AAUSDAJF.                                       
             03 AAUSDAJA    PICTURE X.                                          
           02  AAUSDAJI  PIC X(4).                                              
           02  AAUSGRDL    COMP  PIC  S9(4).                                    
           02  AAUSGRDF    PICTURE X.                                           
           02  FILLER REDEFINES AAUSGRDF.                                       
             03 AAUSGRDA    PICTURE X.                                          
           02  AAUSGRDI  PIC X(2).                                              
           02  ASTUFEL    COMP  PIC  S9(4).                                     
           02  ASTUFEF    PICTURE X.                                            
           02  FILLER REDEFINES ASTUFEF.                                        
             03 ASTUFEA    PICTURE X.                                           
           02  ASTUFEI  PIC X(1).                                               
           02  ESTUFEL    COMP  PIC  S9(4).                                     
           02  ESTUFEF    PICTURE X.                                            
           02  FILLER REDEFINES ESTUFEF.                                        
             03 ESTUFEA    PICTURE X.                                           
           02  ESTUFEI  PIC X(4).                                               
           02  ABETRL    COMP  PIC  S9(4).                                      
           02  ABETRF    PICTURE X.                                             
           02  FILLER REDEFINES ABETRF.                                         
             03 ABETRA    PICTURE X.                                            
           02  ABETRI  PIC X(1).                                                
           02  EBETRL    COMP  PIC  S9(4).                                      
           02  EBETRF    PICTURE X.                                             
           02  FILLER REDEFINES EBETRF.                                         
             03 EBETRA    PICTURE X.                                            
           02  EBETRI  PIC X(7).                                                
           02  EBETPRZL    COMP  PIC  S9(4).                                    
           02  EBETPRZF    PICTURE X.                                           
           02  FILLER REDEFINES EBETPRZF.                                       
             03 EBETPRZA    PICTURE X.                                          
           02  EBETPRZI  PIC X(1).                                              
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  ADIRI  PIC X(3).                                                 
           02  AFUEHRZL    COMP  PIC  S9(4).                                    
           02  AFUEHRZF    PICTURE X.                                           
           02  FILLER REDEFINES AFUEHRZF.                                       
             03 AFUEHRZA    PICTURE X.                                          
           02  AFUEHRZI  PIC X(1).                                              
           02  EFUEHRTL    COMP  PIC  S9(4).                                    
           02  EFUEHRTF    PICTURE X.                                           
           02  FILLER REDEFINES EFUEHRTF.                                       
             03 EFUEHRTA    PICTURE X.                                          
           02  EFUEHRTI  PIC X(2).                                              
           02  EFUEHRML    COMP  PIC  S9(4).                                    
           02  EFUEHRMF    PICTURE X.                                           
           02  FILLER REDEFINES EFUEHRMF.                                       
             03 EFUEHRMA    PICTURE X.                                          
           02  EFUEHRMI  PIC X(2).                                              
           02  EFUEHRJL    COMP  PIC  S9(4).                                    
           02  EFUEHRJF    PICTURE X.                                           
           02  FILLER REDEFINES EFUEHRJF.                                       
             03 EFUEHRJA    PICTURE X.                                          
           02  EFUEHRJI  PIC X(4).                                              
           02  ASCHUFAL    COMP  PIC  S9(4).                                    
           02  ASCHUFAF    PICTURE X.                                           
           02  FILLER REDEFINES ASCHUFAF.                                       
             03 ASCHUFAA    PICTURE X.                                          
           02  ASCHUFAI  PIC X(1).                                              
           02  ESCHUFTL    COMP  PIC  S9(4).                                    
           02  ESCHUFTF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHUFTF.                                       
             03 ESCHUFTA    PICTURE X.                                          
           02  ESCHUFTI  PIC X(2).                                              
           02  ESCHUFML    COMP  PIC  S9(4).                                    
           02  ESCHUFMF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHUFMF.                                       
             03 ESCHUFMA    PICTURE X.                                          
           02  ESCHUFMI  PIC X(2).                                              
           02  ESCHUFJL    COMP  PIC  S9(4).                                    
           02  ESCHUFJF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHUFJF.                                       
             03 ESCHUFJA    PICTURE X.                                          
           02  ESCHUFJI  PIC X(4).                                              
           02  ARCKSTZL    COMP  PIC  S9(4).                                    
           02  ARCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKSTZF.                                       
             03 ARCKSTZA    PICTURE X.                                          
           02  ARCKSTZI  PIC X(1).                                              
           02  ERCKSTZL    COMP  PIC  S9(4).                                    
           02  ERCKSTZF    PICTURE X.                                           
           02  FILLER REDEFINES ERCKSTZF.                                       
             03 ERCKSTZA    PICTURE X.                                          
           02  ERCKSTZI  PIC X(6).                                              
           02  ARCKDATL    COMP  PIC  S9(4).                                    
           02  ARCKDATF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKDATF.                                       
             03 ARCKDATA    PICTURE X.                                          
           02  ARCKDATI  PIC X(2).                                              
           02  ARCKDAML    COMP  PIC  S9(4).                                    
           02  ARCKDAMF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKDAMF.                                       
             03 ARCKDAMA    PICTURE X.                                          
           02  ARCKDAMI  PIC X(2).                                              
           02  ARCKDAJL    COMP  PIC  S9(4).                                    
           02  ARCKDAJF    PICTURE X.                                           
           02  FILLER REDEFINES ARCKDAJF.                                       
             03 ARCKDAJA    PICTURE X.                                          
           02  ARCKDAJI  PIC X(4).                                              
           02  ECTVDRL    COMP  PIC  S9(4).                                     
           02  ECTVDRF    PICTURE X.                                            
           02  FILLER REDEFINES ECTVDRF.                                        
             03 ECTVDRA    PICTURE X.                                           
           02  ECTVDRI  PIC X(1).                                               
       01  BVB0019O REDEFINES BVB0019I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  AANREDEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EANREDEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAKADO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAKADO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  AADELO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EADELO  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORNAMO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVORNAMO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGEBDATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEBDAMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGEBDAJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ENAMEO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  AMANVOTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMANVOMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMANVOJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAANTPO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAANVTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAANVMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAANVJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZUSTLO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGRUNDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTRASSO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTRASSO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  APLZAKTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPLZAKTO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AORTO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EORTO  PIC X(40).                                                
           02  FILLER PICTURE X(3).                                             
           02  AAUSLO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EAUSLO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  ATELFONO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETELFONO  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATELFAXO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ETELFAXO  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEINDATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINDAMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEINDAJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUSDATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUSDAMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUSDAJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUSGRDO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTUFEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTUFEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABETRO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBETRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBETPRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AFUEHRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFUEHRTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFUEHRMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFUEHRJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASCHUFAO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESCHUFTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESCHUFMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESCHUFJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKSTZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERCKSTZO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKDATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKDAMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARCKDAJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ECTVDRO  PIC X(1).                                               
