       01  BVB0036I.                                                            
           02  FILLER PIC X(12).                                                
           02  EPLZL    COMP  PIC  S9(4).                                       
           02  EPLZF    PICTURE X.                                              
           02  FILLER REDEFINES EPLZF.                                          
             03 EPLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EPLZI  PIC X(5).                                                 
           02  ESTVONL    COMP  PIC  S9(4).                                     
           02  ESTVONF    PICTURE X.                                            
           02  FILLER REDEFINES ESTVONF.                                        
             03 ESTVONA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTVONI  PIC X(4).                                               
           02  ESTBISL    COMP  PIC  S9(4).                                     
           02  ESTBISF    PICTURE X.                                            
           02  FILLER REDEFINES ESTBISF.                                        
             03 ESTBISA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ESTBISI  PIC X(4).                                               
           02  ASEIFBL    COMP  PIC  S9(4).                                     
           02  ASEIFBF    PICTURE X.                                            
           02  FILLER REDEFINES ASEIFBF.                                        
             03 ASEIFBA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASEIFBI  PIC X(6).                                               
           02  ESEIAKTL    COMP  PIC  S9(4).                                    
           02  ESEIAKTF    PICTURE X.                                           
           02  FILLER REDEFINES ESEIAKTF.                                       
             03 ESEIAKTA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ESEIAKTI  PIC X(3).                                              
           02  ASEISTRL    COMP  PIC  S9(4).                                    
           02  ASEISTRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEISTRF.                                       
             03 ASEISTRA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEISTRI  PIC X(1).                                              
           02  ASEIGESL    COMP  PIC  S9(4).                                    
           02  ASEIGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEIGESF.                                       
             03 ASEIGESA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASEIGESI  PIC X(3).                                              
           02  EEINHL    COMP  PIC  S9(4).                                      
           02  EEINHF    PICTURE X.                                             
           02  FILLER REDEFINES EEINHF.                                         
             03 EEINHA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  EEINHI  PIC X(7).                                                
           02  EDIRL    COMP  PIC  S9(4).                                       
           02  EDIRF    PICTURE X.                                              
           02  FILLER REDEFINES EDIRF.                                          
             03 EDIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EDIRI  PIC X(3).                                                 
           02  EFCL    COMP  PIC  S9(4).                                        
           02  EFCF    PICTURE X.                                               
           02  FILLER REDEFINES EFCF.                                           
             03 EFCA    PICTURE X.                                              
           02  FILLER   PICTURE X(1).                                           
           02  EFCI  PIC X(1).                                                  
           02  APLZL    COMP  PIC  S9(4).                                       
           02  APLZF    PICTURE X.                                              
           02  FILLER REDEFINES APLZF.                                          
             03 APLZA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  APLZI  PIC X(5).                                                 
           02  AORTL    COMP  PIC  S9(4).                                       
           02  AORTF    PICTURE X.                                              
           02  FILLER REDEFINES AORTF.                                          
             03 AORTA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  AORTI  PIC X(12).                                                
           02  ADIRL    COMP  PIC  S9(4).                                       
           02  ADIRF    PICTURE X.                                              
           02  FILLER REDEFINES ADIRF.                                          
             03 ADIRA    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  ADIRI  PIC X(3).                                                 
           02  AVBNRL    COMP  PIC  S9(4).                                      
           02  AVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES AVBNRF.                                         
             03 AVBNRA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVBNRI  PIC X(7).                                                
           02  AZUNAMEL    COMP  PIC  S9(4).                                    
           02  AZUNAMEF    PICTURE X.                                           
           02  FILLER REDEFINES AZUNAMEF.                                       
             03 AZUNAMEA    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AZUNAMEI  PIC X(15).                                             
           02  ASTUFEL    COMP  PIC  S9(4).                                     
           02  ASTUFEF    PICTURE X.                                            
           02  FILLER REDEFINES ASTUFEF.                                        
             03 ASTUFEA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFEI  PIC X(10).                                              
           02  AVGESL    COMP  PIC  S9(4).                                      
           02  AVGESF    PICTURE X.                                             
           02  FILLER REDEFINES AVGESF.                                         
             03 AVGESA    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AVGESI  PIC X(6).                                                
           02  EFC2L    COMP  PIC  S9(4).                                       
           02  EFC2F    PICTURE X.                                              
           02  FILLER REDEFINES EFC2F.                                          
             03 EFC2A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC2I  PIC X(1).                                                 
           02  APLZ2L    COMP  PIC  S9(4).                                      
           02  APLZ2F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ2F.                                         
             03 APLZ2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ2I  PIC X(5).                                                
           02  AORT2L    COMP  PIC  S9(4).                                      
           02  AORT2F    PICTURE X.                                             
           02  FILLER REDEFINES AORT2F.                                         
             03 AORT2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT2I  PIC X(12).                                               
           02  ADIR2L    COMP  PIC  S9(4).                                      
           02  ADIR2F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR2F.                                         
             03 ADIR2A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR2I  PIC X(3).                                                
           02  AVBNR2L    COMP  PIC  S9(4).                                     
           02  AVBNR2F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR2F.                                        
             03 AVBNR2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR2I  PIC X(7).                                               
           02  F000000L    COMP  PIC  S9(4).                                    
           02  F000000F    PICTURE X.                                           
           02  FILLER REDEFINES F000000F.                                       
             03 F000000A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000000I  PIC X(15).                                             
           02  ASTUFE2L    COMP  PIC  S9(4).                                    
           02  ASTUFE2F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE2F.                                       
             03 ASTUFE2A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE2I  PIC X(10).                                             
           02  AVGES2L    COMP  PIC  S9(4).                                     
           02  AVGES2F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES2F.                                        
             03 AVGES2A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES2I  PIC X(6).                                               
           02  EFC3L    COMP  PIC  S9(4).                                       
           02  EFC3F    PICTURE X.                                              
           02  FILLER REDEFINES EFC3F.                                          
             03 EFC3A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC3I  PIC X(1).                                                 
           02  APLZ3L    COMP  PIC  S9(4).                                      
           02  APLZ3F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ3F.                                         
             03 APLZ3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ3I  PIC X(5).                                                
           02  AORT3L    COMP  PIC  S9(4).                                      
           02  AORT3F    PICTURE X.                                             
           02  FILLER REDEFINES AORT3F.                                         
             03 AORT3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT3I  PIC X(12).                                               
           02  ADIR3L    COMP  PIC  S9(4).                                      
           02  ADIR3F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR3F.                                         
             03 ADIR3A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR3I  PIC X(3).                                                
           02  AVBNR3L    COMP  PIC  S9(4).                                     
           02  AVBNR3F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR3F.                                        
             03 AVBNR3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR3I  PIC X(7).                                               
           02  F000001L    COMP  PIC  S9(4).                                    
           02  F000001F    PICTURE X.                                           
           02  FILLER REDEFINES F000001F.                                       
             03 F000001A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000001I  PIC X(15).                                             
           02  ASTUFE3L    COMP  PIC  S9(4).                                    
           02  ASTUFE3F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE3F.                                       
             03 ASTUFE3A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE3I  PIC X(10).                                             
           02  AVGES3L    COMP  PIC  S9(4).                                     
           02  AVGES3F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES3F.                                        
             03 AVGES3A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES3I  PIC X(6).                                               
           02  EFC4L    COMP  PIC  S9(4).                                       
           02  EFC4F    PICTURE X.                                              
           02  FILLER REDEFINES EFC4F.                                          
             03 EFC4A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC4I  PIC X(1).                                                 
           02  APLZ4L    COMP  PIC  S9(4).                                      
           02  APLZ4F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ4F.                                         
             03 APLZ4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ4I  PIC X(5).                                                
           02  AORT4L    COMP  PIC  S9(4).                                      
           02  AORT4F    PICTURE X.                                             
           02  FILLER REDEFINES AORT4F.                                         
             03 AORT4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT4I  PIC X(12).                                               
           02  ADIR4L    COMP  PIC  S9(4).                                      
           02  ADIR4F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR4F.                                         
             03 ADIR4A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR4I  PIC X(3).                                                
           02  AVBNR4L    COMP  PIC  S9(4).                                     
           02  AVBNR4F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR4F.                                        
             03 AVBNR4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR4I  PIC X(7).                                               
           02  F000002L    COMP  PIC  S9(4).                                    
           02  F000002F    PICTURE X.                                           
           02  FILLER REDEFINES F000002F.                                       
             03 F000002A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000002I  PIC X(15).                                             
           02  ASTUFE4L    COMP  PIC  S9(4).                                    
           02  ASTUFE4F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE4F.                                       
             03 ASTUFE4A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE4I  PIC X(10).                                             
           02  AVGES4L    COMP  PIC  S9(4).                                     
           02  AVGES4F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES4F.                                        
             03 AVGES4A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES4I  PIC X(6).                                               
           02  EFC5L    COMP  PIC  S9(4).                                       
           02  EFC5F    PICTURE X.                                              
           02  FILLER REDEFINES EFC5F.                                          
             03 EFC5A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC5I  PIC X(1).                                                 
           02  APLZ5L    COMP  PIC  S9(4).                                      
           02  APLZ5F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ5F.                                         
             03 APLZ5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ5I  PIC X(5).                                                
           02  AORT5L    COMP  PIC  S9(4).                                      
           02  AORT5F    PICTURE X.                                             
           02  FILLER REDEFINES AORT5F.                                         
             03 AORT5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT5I  PIC X(12).                                               
           02  ADIR5L    COMP  PIC  S9(4).                                      
           02  ADIR5F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR5F.                                         
             03 ADIR5A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR5I  PIC X(3).                                                
           02  AVBNR5L    COMP  PIC  S9(4).                                     
           02  AVBNR5F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR5F.                                        
             03 AVBNR5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR5I  PIC X(7).                                               
           02  F000003L    COMP  PIC  S9(4).                                    
           02  F000003F    PICTURE X.                                           
           02  FILLER REDEFINES F000003F.                                       
             03 F000003A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000003I  PIC X(15).                                             
           02  ASTUFE5L    COMP  PIC  S9(4).                                    
           02  ASTUFE5F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE5F.                                       
             03 ASTUFE5A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE5I  PIC X(10).                                             
           02  AVGES5L    COMP  PIC  S9(4).                                     
           02  AVGES5F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES5F.                                        
             03 AVGES5A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES5I  PIC X(6).                                               
           02  EFC6L    COMP  PIC  S9(4).                                       
           02  EFC6F    PICTURE X.                                              
           02  FILLER REDEFINES EFC6F.                                          
             03 EFC6A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC6I  PIC X(1).                                                 
           02  APLZ6L    COMP  PIC  S9(4).                                      
           02  APLZ6F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ6F.                                         
             03 APLZ6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ6I  PIC X(5).                                                
           02  AORT6L    COMP  PIC  S9(4).                                      
           02  AORT6F    PICTURE X.                                             
           02  FILLER REDEFINES AORT6F.                                         
             03 AORT6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT6I  PIC X(12).                                               
           02  ADIR6L    COMP  PIC  S9(4).                                      
           02  ADIR6F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR6F.                                         
             03 ADIR6A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR6I  PIC X(3).                                                
           02  AVBNR6L    COMP  PIC  S9(4).                                     
           02  AVBNR6F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR6F.                                        
             03 AVBNR6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR6I  PIC X(7).                                               
           02  F000004L    COMP  PIC  S9(4).                                    
           02  F000004F    PICTURE X.                                           
           02  FILLER REDEFINES F000004F.                                       
             03 F000004A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000004I  PIC X(15).                                             
           02  ASTUFE6L    COMP  PIC  S9(4).                                    
           02  ASTUFE6F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE6F.                                       
             03 ASTUFE6A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE6I  PIC X(10).                                             
           02  AVGES6L    COMP  PIC  S9(4).                                     
           02  AVGES6F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES6F.                                        
             03 AVGES6A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES6I  PIC X(6).                                               
           02  EFC7L    COMP  PIC  S9(4).                                       
           02  EFC7F    PICTURE X.                                              
           02  FILLER REDEFINES EFC7F.                                          
             03 EFC7A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC7I  PIC X(1).                                                 
           02  APLZ7L    COMP  PIC  S9(4).                                      
           02  APLZ7F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ7F.                                         
             03 APLZ7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ7I  PIC X(5).                                                
           02  AORT7L    COMP  PIC  S9(4).                                      
           02  AORT7F    PICTURE X.                                             
           02  FILLER REDEFINES AORT7F.                                         
             03 AORT7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT7I  PIC X(12).                                               
           02  ADIR7L    COMP  PIC  S9(4).                                      
           02  ADIR7F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR7F.                                         
             03 ADIR7A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR7I  PIC X(3).                                                
           02  AVBNR7L    COMP  PIC  S9(4).                                     
           02  AVBNR7F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR7F.                                        
             03 AVBNR7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR7I  PIC X(7).                                               
           02  F000005L    COMP  PIC  S9(4).                                    
           02  F000005F    PICTURE X.                                           
           02  FILLER REDEFINES F000005F.                                       
             03 F000005A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000005I  PIC X(15).                                             
           02  ASTUFE7L    COMP  PIC  S9(4).                                    
           02  ASTUFE7F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE7F.                                       
             03 ASTUFE7A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE7I  PIC X(10).                                             
           02  AVGES7L    COMP  PIC  S9(4).                                     
           02  AVGES7F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES7F.                                        
             03 AVGES7A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES7I  PIC X(6).                                               
           02  EFC8L    COMP  PIC  S9(4).                                       
           02  EFC8F    PICTURE X.                                              
           02  FILLER REDEFINES EFC8F.                                          
             03 EFC8A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC8I  PIC X(1).                                                 
           02  APLZ8L    COMP  PIC  S9(4).                                      
           02  APLZ8F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ8F.                                         
             03 APLZ8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ8I  PIC X(5).                                                
           02  AORT8L    COMP  PIC  S9(4).                                      
           02  AORT8F    PICTURE X.                                             
           02  FILLER REDEFINES AORT8F.                                         
             03 AORT8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT8I  PIC X(12).                                               
           02  ADIR8L    COMP  PIC  S9(4).                                      
           02  ADIR8F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR8F.                                         
             03 ADIR8A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR8I  PIC X(3).                                                
           02  AVBNR8L    COMP  PIC  S9(4).                                     
           02  AVBNR8F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR8F.                                        
             03 AVBNR8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR8I  PIC X(7).                                               
           02  F000006L    COMP  PIC  S9(4).                                    
           02  F000006F    PICTURE X.                                           
           02  FILLER REDEFINES F000006F.                                       
             03 F000006A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000006I  PIC X(15).                                             
           02  ASTUFE8L    COMP  PIC  S9(4).                                    
           02  ASTUFE8F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE8F.                                       
             03 ASTUFE8A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE8I  PIC X(10).                                             
           02  AVGES8L    COMP  PIC  S9(4).                                     
           02  AVGES8F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES8F.                                        
             03 AVGES8A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES8I  PIC X(6).                                               
           02  EFC9L    COMP  PIC  S9(4).                                       
           02  EFC9F    PICTURE X.                                              
           02  FILLER REDEFINES EFC9F.                                          
             03 EFC9A    PICTURE X.                                             
           02  FILLER   PICTURE X(1).                                           
           02  EFC9I  PIC X(1).                                                 
           02  APLZ9L    COMP  PIC  S9(4).                                      
           02  APLZ9F    PICTURE X.                                             
           02  FILLER REDEFINES APLZ9F.                                         
             03 APLZ9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  APLZ9I  PIC X(5).                                                
           02  AORT9L    COMP  PIC  S9(4).                                      
           02  AORT9F    PICTURE X.                                             
           02  FILLER REDEFINES AORT9F.                                         
             03 AORT9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  AORT9I  PIC X(12).                                               
           02  ADIR9L    COMP  PIC  S9(4).                                      
           02  ADIR9F    PICTURE X.                                             
           02  FILLER REDEFINES ADIR9F.                                         
             03 ADIR9A    PICTURE X.                                            
           02  FILLER   PICTURE X(1).                                           
           02  ADIR9I  PIC X(3).                                                
           02  AVBNR9L    COMP  PIC  S9(4).                                     
           02  AVBNR9F    PICTURE X.                                            
           02  FILLER REDEFINES AVBNR9F.                                        
             03 AVBNR9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVBNR9I  PIC X(7).                                               
           02  F000007L    COMP  PIC  S9(4).                                    
           02  F000007F    PICTURE X.                                           
           02  FILLER REDEFINES F000007F.                                       
             03 F000007A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000007I  PIC X(15).                                             
           02  ASTUFE9L    COMP  PIC  S9(4).                                    
           02  ASTUFE9F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE9F.                                       
             03 ASTUFE9A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  ASTUFE9I  PIC X(10).                                             
           02  AVGES9L    COMP  PIC  S9(4).                                     
           02  AVGES9F    PICTURE X.                                            
           02  FILLER REDEFINES AVGES9F.                                        
             03 AVGES9A    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AVGES9I  PIC X(6).                                               
           02  F000008L    COMP  PIC  S9(4).                                    
           02  F000008F    PICTURE X.                                           
           02  FILLER REDEFINES F000008F.                                       
             03 F000008A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000008I  PIC X(1).                                              
           02  F000009L    COMP  PIC  S9(4).                                    
           02  F000009F    PICTURE X.                                           
           02  FILLER REDEFINES F000009F.                                       
             03 F000009A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000009I  PIC X(5).                                              
           02  F000010L    COMP  PIC  S9(4).                                    
           02  F000010F    PICTURE X.                                           
           02  FILLER REDEFINES F000010F.                                       
             03 F000010A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000010I  PIC X(12).                                             
           02  F000011L    COMP  PIC  S9(4).                                    
           02  F000011F    PICTURE X.                                           
           02  FILLER REDEFINES F000011F.                                       
             03 F000011A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000011I  PIC X(3).                                              
           02  F000012L    COMP  PIC  S9(4).                                    
           02  F000012F    PICTURE X.                                           
           02  FILLER REDEFINES F000012F.                                       
             03 F000012A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000012I  PIC X(7).                                              
           02  F000013L    COMP  PIC  S9(4).                                    
           02  F000013F    PICTURE X.                                           
           02  FILLER REDEFINES F000013F.                                       
             03 F000013A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000013I  PIC X(15).                                             
           02  F000014L    COMP  PIC  S9(4).                                    
           02  F000014F    PICTURE X.                                           
           02  FILLER REDEFINES F000014F.                                       
             03 F000014A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  F000014I  PIC X(10).                                             
           02  AVGES10L    COMP  PIC  S9(4).                                    
           02  AVGES10F    PICTURE X.                                           
           02  FILLER REDEFINES AVGES10F.                                       
             03 AVGES10A    PICTURE X.                                          
           02  FILLER   PICTURE X(1).                                           
           02  AVGES10I  PIC X(6).                                              
           02  AFCANZL    COMP  PIC  S9(4).                                     
           02  AFCANZF    PICTURE X.                                            
           02  FILLER REDEFINES AFCANZF.                                        
             03 AFCANZA    PICTURE X.                                           
           02  FILLER   PICTURE X(1).                                           
           02  AFCANZI  PIC X(79).                                              
       01  BVB0036O REDEFINES BVB0036I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPLZH    PICTURE X.                                              
           02  EPLZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ESTVONH    PICTURE X.                                            
           02  ESTVONO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTBISH    PICTURE X.                                            
           02  ESTBISO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEIFBH    PICTURE X.                                            
           02  ASEIFBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESEIAKTH    PICTURE X.                                           
           02  ESEIAKTO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEISTRH    PICTURE X.                                           
           02  ASEISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEIGESH    PICTURE X.                                           
           02  ASEIGESO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EEINHH    PICTURE X.                                             
           02  EEINHO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDIRH    PICTURE X.                                              
           02  EDIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EFCH    PICTURE X.                                               
           02  EFCO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  APLZH    PICTURE X.                                              
           02  APLZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AORTH    PICTURE X.                                              
           02  AORTO  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ADIRH    PICTURE X.                                              
           02  ADIRO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBNRH    PICTURE X.                                             
           02  AVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AZUNAMEH    PICTURE X.                                           
           02  AZUNAMEO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFEH    PICTURE X.                                            
           02  ASTUFEO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVGESH    PICTURE X.                                             
           02  AVGESO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  EFC2H    PICTURE X.                                              
           02  EFC2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ2H    PICTURE X.                                             
           02  APLZ2O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT2H    PICTURE X.                                             
           02  AORT2O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR2H    PICTURE X.                                             
           02  ADIR2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR2H    PICTURE X.                                            
           02  AVBNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000000H    PICTURE X.                                           
           02  F000000O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE2H    PICTURE X.                                           
           02  ASTUFE2O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES2H    PICTURE X.                                            
           02  AVGES2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC3H    PICTURE X.                                              
           02  EFC3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ3H    PICTURE X.                                             
           02  APLZ3O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT3H    PICTURE X.                                             
           02  AORT3O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR3H    PICTURE X.                                             
           02  ADIR3O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR3H    PICTURE X.                                            
           02  AVBNR3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000001H    PICTURE X.                                           
           02  F000001O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE3H    PICTURE X.                                           
           02  ASTUFE3O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES3H    PICTURE X.                                            
           02  AVGES3O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC4H    PICTURE X.                                              
           02  EFC4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ4H    PICTURE X.                                             
           02  APLZ4O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT4H    PICTURE X.                                             
           02  AORT4O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR4H    PICTURE X.                                             
           02  ADIR4O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR4H    PICTURE X.                                            
           02  AVBNR4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000002H    PICTURE X.                                           
           02  F000002O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE4H    PICTURE X.                                           
           02  ASTUFE4O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES4H    PICTURE X.                                            
           02  AVGES4O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC5H    PICTURE X.                                              
           02  EFC5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ5H    PICTURE X.                                             
           02  APLZ5O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT5H    PICTURE X.                                             
           02  AORT5O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR5H    PICTURE X.                                             
           02  ADIR5O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR5H    PICTURE X.                                            
           02  AVBNR5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000003H    PICTURE X.                                           
           02  F000003O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE5H    PICTURE X.                                           
           02  ASTUFE5O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES5H    PICTURE X.                                            
           02  AVGES5O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC6H    PICTURE X.                                              
           02  EFC6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ6H    PICTURE X.                                             
           02  APLZ6O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT6H    PICTURE X.                                             
           02  AORT6O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR6H    PICTURE X.                                             
           02  ADIR6O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR6H    PICTURE X.                                            
           02  AVBNR6O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000004H    PICTURE X.                                           
           02  F000004O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE6H    PICTURE X.                                           
           02  ASTUFE6O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES6H    PICTURE X.                                            
           02  AVGES6O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC7H    PICTURE X.                                              
           02  EFC7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ7H    PICTURE X.                                             
           02  APLZ7O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT7H    PICTURE X.                                             
           02  AORT7O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR7H    PICTURE X.                                             
           02  ADIR7O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR7H    PICTURE X.                                            
           02  AVBNR7O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000005H    PICTURE X.                                           
           02  F000005O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE7H    PICTURE X.                                           
           02  ASTUFE7O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES7H    PICTURE X.                                            
           02  AVGES7O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC8H    PICTURE X.                                              
           02  EFC8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ8H    PICTURE X.                                             
           02  APLZ8O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT8H    PICTURE X.                                             
           02  AORT8O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR8H    PICTURE X.                                             
           02  ADIR8O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR8H    PICTURE X.                                            
           02  AVBNR8O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000006H    PICTURE X.                                           
           02  F000006O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE8H    PICTURE X.                                           
           02  ASTUFE8O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES8H    PICTURE X.                                            
           02  AVGES8O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  EFC9H    PICTURE X.                                              
           02  EFC9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APLZ9H    PICTURE X.                                             
           02  APLZ9O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  AORT9H    PICTURE X.                                             
           02  AORT9O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADIR9H    PICTURE X.                                             
           02  ADIR9O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  AVBNR9H    PICTURE X.                                            
           02  AVBNR9O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000007H    PICTURE X.                                           
           02  F000007O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE9H    PICTURE X.                                           
           02  ASTUFE9O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES9H    PICTURE X.                                            
           02  AVGES9O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  F000008H    PICTURE X.                                           
           02  F000008O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000009H    PICTURE X.                                           
           02  F000009O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000010H    PICTURE X.                                           
           02  F000010O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000011H    PICTURE X.                                           
           02  F000011O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000012H    PICTURE X.                                           
           02  F000012O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  F000013H    PICTURE X.                                           
           02  F000013O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  F000014H    PICTURE X.                                           
           02  F000014O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVGES10H    PICTURE X.                                           
           02  AVGES10O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AFCANZH    PICTURE X.                                            
           02  AFCANZO  PIC X(79).                                              
