       01  BVB0006I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  ABEDNRL    COMP  PIC  S9(4).                                     
           02  ABEDNRF    PICTURE X.                                            
           02  FILLER REDEFINES ABEDNRF.                                        
             03 ABEDNRA    PICTURE X.                                           
           02  ABEDNRI  PIC X(4).                                               
           02  ABEFAML    COMP  PIC  S9(4).                                     
           02  ABEFAMF    PICTURE X.                                            
           02  FILLER REDEFINES ABEFAMF.                                        
             03 ABEFAMA    PICTURE X.                                           
           02  ABEFAMI  PIC X(10).                                              
           02  AISTATL    COMP  PIC  S9(4).                                     
           02  AISTATF    PICTURE X.                                            
           02  FILLER REDEFINES AISTATF.                                        
             03 AISTATA    PICTURE X.                                           
           02  AISTATI  PIC X(5).                                               
           02  AIEHVONL    COMP  PIC  S9(4).                                    
           02  AIEHVONF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHVONF.                                       
             03 AIEHVONA    PICTURE X.                                          
           02  AIEHVONI  PIC X(5).                                              
           02  AIEHBISL    COMP  PIC  S9(4).                                    
           02  AIEHBISF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHBISF.                                       
             03 AIEHBISA    PICTURE X.                                          
           02  AIEHBISI  PIC X(5).                                              
           02  AZRANZL    COMP  PIC  S9(4).                                     
           02  AZRANZF    PICTURE X.                                            
           02  FILLER REDEFINES AZRANZF.                                        
             03 AZRANZA    PICTURE X.                                           
           02  AZRANZI  PIC X(2).                                               
           02  ASEHEIZL    COMP  PIC  S9(4).                                    
           02  ASEHEIZF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHEIZF.                                       
             03 ASEHEIZA    PICTURE X.                                          
           02  ASEHEIZI  PIC X(10).                                             
           02  ASEQFEIL    COMP  PIC  S9(4).                                    
           02  ASEQFEIF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFEIF.                                       
             03 ASEQFEIA    PICTURE X.                                          
           02  ASEQFEII  PIC X(5).                                              
           02  AIEHEIZL    COMP  PIC  S9(4).                                    
           02  AIEHEIZF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHEIZF.                                       
             03 AIEHEIZA    PICTURE X.                                          
           02  AIEHEIZI  PIC X(10).                                             
           02  AIEQFEIL    COMP  PIC  S9(4).                                    
           02  AIEQFEIF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFEIF.                                       
             03 AIEQFEIA    PICTURE X.                                          
           02  AIEQFEII  PIC X(5).                                              
           02  ASEHGRUL    COMP  PIC  S9(4).                                    
           02  ASEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHGRUF.                                       
             03 ASEHGRUA    PICTURE X.                                          
           02  ASEHGRUI  PIC X(10).                                             
           02  ASEQFGRL    COMP  PIC  S9(4).                                    
           02  ASEQFGRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFGRF.                                       
             03 ASEQFGRA    PICTURE X.                                          
           02  ASEQFGRI  PIC X(5).                                              
           02  AIEHGRUL    COMP  PIC  S9(4).                                    
           02  AIEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHGRUF.                                       
             03 AIEHGRUA    PICTURE X.                                          
           02  AIEHGRUI  PIC X(10).                                             
           02  ABEHGRUL    COMP  PIC  S9(4).                                    
           02  ABEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES ABEHGRUF.                                       
             03 ABEHGRUA    PICTURE X.                                          
           02  ABEHGRUI  PIC X(10).                                             
           02  AIEQFGRL    COMP  PIC  S9(4).                                    
           02  AIEQFGRF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFGRF.                                       
             03 AIEQFGRA    PICTURE X.                                          
           02  AIEQFGRI  PIC X(5).                                              
           02  ASEHGESL    COMP  PIC  S9(4).                                    
           02  ASEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHGESF.                                       
             03 ASEHGESA    PICTURE X.                                          
           02  ASEHGESI  PIC X(10).                                             
           02  ASEQFGSL    COMP  PIC  S9(4).                                    
           02  ASEQFGSF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFGSF.                                       
             03 ASEQFGSA    PICTURE X.                                          
           02  ASEQFGSI  PIC X(5).                                              
           02  AIEHGESL    COMP  PIC  S9(4).                                    
           02  AIEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHGESF.                                       
             03 AIEHGESA    PICTURE X.                                          
           02  AIEHGESI  PIC X(10).                                             
           02  ABEHGESL    COMP  PIC  S9(4).                                    
           02  ABEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES ABEHGESF.                                       
             03 ABEHGESA    PICTURE X.                                          
           02  ABEHGESI  PIC X(10).                                             
           02  AIEQFGSL    COMP  PIC  S9(4).                                    
           02  AIEQFGSF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFGSF.                                       
             03 AIEQFGSA    PICTURE X.                                          
           02  AIEQFGSI  PIC X(5).                                              
           02  AMAXEIGL    COMP  PIC  S9(4).                                    
           02  AMAXEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AMAXEIGF.                                       
             03 AMAXEIGA    PICTURE X.                                          
           02  AMAXEIGI  PIC X(10).                                             
           02  AIEHEIGL    COMP  PIC  S9(4).                                    
           02  AIEHEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHEIGF.                                       
             03 AIEHEIGA    PICTURE X.                                          
           02  AIEHEIGI  PIC X(10).                                             
           02  AEIGABZL    COMP  PIC  S9(4).                                    
           02  AEIGABZF    PICTURE X.                                           
           02  FILLER REDEFINES AEIGABZF.                                       
             03 AEIGABZA    PICTURE X.                                          
           02  AEIGABZI  PIC X(10).                                             
           02  ASWEHTXL    COMP  PIC  S9(4).                                    
           02  ASWEHTXF    PICTURE X.                                           
           02  FILLER REDEFINES ASWEHTXF.                                       
             03 ASWEHTXA    PICTURE X.                                          
           02  ASWEHTXI  PIC X(16).                                             
           02  ASWEHEIL    COMP  PIC  S9(4).                                    
           02  ASWEHEIF    PICTURE X.                                           
           02  FILLER REDEFINES ASWEHEIF.                                       
             03 ASWEHEIA    PICTURE X.                                          
           02  ASWEHEII  PIC X(10).                                             
           02  AIWEHTXL    COMP  PIC  S9(4).                                    
           02  AIWEHTXF    PICTURE X.                                           
           02  FILLER REDEFINES AIWEHTXF.                                       
             03 AIWEHTXA    PICTURE X.                                          
           02  AIWEHTXI  PIC X(6).                                              
           02  AIWEHEIL    COMP  PIC  S9(4).                                    
           02  AIWEHEIF    PICTURE X.                                           
           02  FILLER REDEFINES AIWEHEIF.                                       
             03 AIWEHEIA    PICTURE X.                                          
           02  AIWEHEII  PIC X(10).                                             
           02  AS12EIGL    COMP  PIC  S9(4).                                    
           02  AS12EIGF    PICTURE X.                                           
           02  FILLER REDEFINES AS12EIGF.                                       
             03 AS12EIGA    PICTURE X.                                          
           02  AS12EIGI  PIC X(10).                                             
           02  AI12EIGL    COMP  PIC  S9(4).                                    
           02  AI12EIGF    PICTURE X.                                           
           02  FILLER REDEFINES AI12EIGF.                                       
             03 AI12EIGA    PICTURE X.                                          
           02  AI12EIGI  PIC X(10).                                             
           02  ASOLISTL    COMP  PIC  S9(4).                                    
           02  ASOLISTF    PICTURE X.                                           
           02  FILLER REDEFINES ASOLISTF.                                       
             03 ASOLISTA    PICTURE X.                                          
           02  ASOLISTI  PIC X(79).                                             
           02  A34IL    COMP  PIC  S9(4).                                       
           02  A34IF    PICTURE X.                                              
           02  FILLER REDEFINES A34IF.                                          
             03 A34IA    PICTURE X.                                             
           02  A34II  PIC X(8).                                                 
           02  AS34IL    COMP  PIC  S9(4).                                      
           02  AS34IF    PICTURE X.                                             
           02  FILLER REDEFINES AS34IF.                                         
             03 AS34IA    PICTURE X.                                            
           02  AS34II  PIC X(1).                                                
           02  AI34IL    COMP  PIC  S9(4).                                      
           02  AI34IF    PICTURE X.                                             
           02  FILLER REDEFINES AI34IF.                                         
             03 AI34IA    PICTURE X.                                            
           02  AI34II  PIC X(1).                                                
           02  A34CL    COMP  PIC  S9(4).                                       
           02  A34CF    PICTURE X.                                              
           02  FILLER REDEFINES A34CF.                                          
             03 A34CA    PICTURE X.                                             
           02  A34CI  PIC X(8).                                                 
           02  AS34CL    COMP  PIC  S9(4).                                      
           02  AS34CF    PICTURE X.                                             
           02  FILLER REDEFINES AS34CF.                                         
             03 AS34CA    PICTURE X.                                            
           02  AS34CI  PIC X(1).                                                
           02  AI34CL    COMP  PIC  S9(4).                                      
           02  AI34CF    PICTURE X.                                             
           02  FILLER REDEFINES AI34CF.                                         
             03 AI34CA    PICTURE X.                                            
           02  AI34CI  PIC X(1).                                                
           02  AALPRFL    COMP  PIC  S9(4).                                     
           02  AALPRFF    PICTURE X.                                            
           02  FILLER REDEFINES AALPRFF.                                        
             03 AALPRFA    PICTURE X.                                           
           02  AALPRFI  PIC X(10).                                              
           02  ASALPRFL    COMP  PIC  S9(4).                                    
           02  ASALPRFF    PICTURE X.                                           
           02  FILLER REDEFINES ASALPRFF.                                       
             03 ASALPRFA    PICTURE X.                                          
           02  ASALPRFI  PIC X(1).                                              
           02  AIALPRFL    COMP  PIC  S9(4).                                    
           02  AIALPRFF    PICTURE X.                                           
           02  FILLER REDEFINES AIALPRFF.                                       
             03 AIALPRFA    PICTURE X.                                          
           02  AIALPRFI  PIC X(1).                                              
           02  A34FL    COMP  PIC  S9(4).                                       
           02  A34FF    PICTURE X.                                              
           02  FILLER REDEFINES A34FF.                                          
             03 A34FA    PICTURE X.                                             
           02  A34FI  PIC X(4).                                                 
           02  AS34FL    COMP  PIC  S9(4).                                      
           02  AS34FF    PICTURE X.                                             
           02  FILLER REDEFINES AS34FF.                                         
             03 AS34FA    PICTURE X.                                            
           02  AS34FI  PIC X(1).                                                
           02  AI34FL    COMP  PIC  S9(4).                                      
           02  AI34FF    PICTURE X.                                             
           02  FILLER REDEFINES AI34FF.                                         
             03 AI34FA    PICTURE X.                                            
           02  AI34FI  PIC X(1).                                                
           02  AFGTEXTL    COMP  PIC  S9(4).                                    
           02  AFGTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AFGTEXTF.                                       
             03 AFGTEXTA    PICTURE X.                                          
           02  AFGTEXTI  PIC X(5).                                              
           02  ASFGL    COMP  PIC  S9(4).                                       
           02  ASFGF    PICTURE X.                                              
           02  FILLER REDEFINES ASFGF.                                          
             03 ASFGA    PICTURE X.                                             
           02  ASFGI  PIC X(1).                                                 
           02  AIFGL    COMP  PIC  S9(4).                                       
           02  AIFGF    PICTURE X.                                              
           02  FILLER REDEFINES AIFGF.                                          
             03 AIFGA    PICTURE X.                                             
           02  AIFGI  PIC X(1).                                                 
           02  AVBTEXTL    COMP  PIC  S9(4).                                    
           02  AVBTEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AVBTEXTF.                                       
             03 AVBTEXTA    PICTURE X.                                          
           02  AVBTEXTI  PIC X(5).                                              
           02  ASVBL    COMP  PIC  S9(4).                                       
           02  ASVBF    PICTURE X.                                              
           02  FILLER REDEFINES ASVBF.                                          
             03 ASVBA    PICTURE X.                                             
           02  ASVBI  PIC X(1).                                                 
           02  AIVBL    COMP  PIC  S9(4).                                       
           02  AIVBF    PICTURE X.                                              
           02  FILLER REDEFINES AIVBF.                                          
             03 AIVBA    PICTURE X.                                             
           02  AIVBI  PIC X(1).                                                 
           02  AVBPKTXL    COMP  PIC  S9(4).                                    
           02  AVBPKTXF    PICTURE X.                                           
           02  FILLER REDEFINES AVBPKTXF.                                       
             03 AVBPKTXA    PICTURE X.                                          
           02  AVBPKTXI  PIC X(5).                                              
           02  ASVBPKL    COMP  PIC  S9(4).                                     
           02  ASVBPKF    PICTURE X.                                            
           02  FILLER REDEFINES ASVBPKF.                                        
             03 ASVBPKA    PICTURE X.                                           
           02  ASVBPKI  PIC X(1).                                               
           02  AIVBPKL    COMP  PIC  S9(4).                                     
           02  AIVBPKF    PICTURE X.                                            
           02  FILLER REDEFINES AIVBPKF.                                        
             03 AIVBPKA    PICTURE X.                                           
           02  AIVBPKI  PIC X(1).                                               
           02  AVATEXTL    COMP  PIC  S9(4).                                    
           02  AVATEXTF    PICTURE X.                                           
           02  FILLER REDEFINES AVATEXTF.                                       
             03 AVATEXTA    PICTURE X.                                          
           02  AVATEXTI  PIC X(5).                                              
           02  ASVAL    COMP  PIC  S9(4).                                       
           02  ASVAF    PICTURE X.                                              
           02  FILLER REDEFINES ASVAF.                                          
             03 ASVAA    PICTURE X.                                             
           02  ASVAI  PIC X(1).                                                 
           02  AIVAL    COMP  PIC  S9(4).                                       
           02  AIVAF    PICTURE X.                                              
           02  FILLER REDEFINES AIVAF.                                          
             03 AIVAA    PICTURE X.                                             
           02  AIVAI  PIC X(1).                                                 
           02  APR1TEXL    COMP  PIC  S9(4).                                    
           02  APR1TEXF    PICTURE X.                                           
           02  FILLER REDEFINES APR1TEXF.                                       
             03 APR1TEXA    PICTURE X.                                          
           02  APR1TEXI  PIC X(6).                                              
           02  ASPRUE1L    COMP  PIC  S9(4).                                    
           02  ASPRUE1F    PICTURE X.                                           
           02  FILLER REDEFINES ASPRUE1F.                                       
             03 ASPRUE1A    PICTURE X.                                          
           02  ASPRUE1I  PIC X(1).                                              
           02  AIPRUE1L    COMP  PIC  S9(4).                                    
           02  AIPRUE1F    PICTURE X.                                           
           02  FILLER REDEFINES AIPRUE1F.                                       
             03 AIPRUE1A    PICTURE X.                                          
           02  AIPRUE1I  PIC X(1).                                              
           02  APR2TEXL    COMP  PIC  S9(4).                                    
           02  APR2TEXF    PICTURE X.                                           
           02  FILLER REDEFINES APR2TEXF.                                       
             03 APR2TEXA    PICTURE X.                                          
           02  APR2TEXI  PIC X(6).                                              
           02  ASPRUE2L    COMP  PIC  S9(4).                                    
           02  ASPRUE2F    PICTURE X.                                           
           02  FILLER REDEFINES ASPRUE2F.                                       
             03 ASPRUE2A    PICTURE X.                                          
           02  ASPRUE2I  PIC X(1).                                              
           02  AIPRUE2L    COMP  PIC  S9(4).                                    
           02  AIPRUE2F    PICTURE X.                                           
           02  FILLER REDEFINES AIPRUE2F.                                       
             03 AIPRUE2A    PICTURE X.                                          
           02  AIPRUE2I  PIC X(1).                                              
       01  BVB0006O REDEFINES BVB0006I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABEDNRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABEFAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AISTATO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHVONO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHBISO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZRANZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEHEIZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFEIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHEIZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFEIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFGRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFGRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFGSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFGSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAXEIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEHEIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AEIGABZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASWEHTXO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASWEHEIO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIWEHTXO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIWEHEIO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AS12EIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AI12EIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASOLISTO  PIC X(79).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34IO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AS34IO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AI34IO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  A34CO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AS34CO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AI34CO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AALPRFO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASALPRFO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIALPRFO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34FO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AS34FO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AI34FO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AFGTEXTO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASFGO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AIFGO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBTEXTO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASVBO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AIVBO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AVBPKTXO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASVBPKO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIVBPKO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVATEXTO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASVAO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AIVAO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APR1TEXO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASPRUE1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIPRUE1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  APR2TEXO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASPRUE2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIPRUE2O  PIC X(1).                                              
