       01  BVB0003I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1TTL    COMP  PIC  S9(4).                                       
           02  E1TTF    PICTURE X.                                              
           02  FILLER REDEFINES E1TTF.                                          
             03 E1TTA    PICTURE X.                                             
           02  E1TTI  PIC X(2).                                                 
           02  E1MML    COMP  PIC  S9(4).                                       
           02  E1MMF    PICTURE X.                                              
           02  FILLER REDEFINES E1MMF.                                          
             03 E1MMA    PICTURE X.                                             
           02  E1MMI  PIC X(2).                                                 
           02  E1JJL    COMP  PIC  S9(4).                                       
           02  E1JJF    PICTURE X.                                              
           02  FILLER REDEFINES E1JJF.                                          
             03 E1JJA    PICTURE X.                                             
           02  E1JJI  PIC X(4).                                                 
           02  E1GRDL    COMP  PIC  S9(4).                                      
           02  E1GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E1GRDF.                                         
             03 E1GRDA    PICTURE X.                                            
           02  E1GRDI  PIC X(3).                                                
           02  A1HINDL    COMP  PIC  S9(4).                                     
           02  A1HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A1HINDF.                                        
             03 A1HINDA    PICTURE X.                                           
           02  A1HINDI  PIC X(1).                                               
           02  E1BZNRL    COMP  PIC  S9(4).                                     
           02  E1BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E1BZNRF.                                        
             03 E1BZNRA    PICTURE X.                                           
           02  E1BZNRI  PIC X(7).                                               
           02  E1INFOL    COMP  PIC  S9(4).                                     
           02  E1INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E1INFOF.                                        
             03 E1INFOA    PICTURE X.                                           
           02  E1INFOI  PIC X(49).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2TTL    COMP  PIC  S9(4).                                       
           02  E2TTF    PICTURE X.                                              
           02  FILLER REDEFINES E2TTF.                                          
             03 E2TTA    PICTURE X.                                             
           02  E2TTI  PIC X(2).                                                 
           02  E2MML    COMP  PIC  S9(4).                                       
           02  E2MMF    PICTURE X.                                              
           02  FILLER REDEFINES E2MMF.                                          
             03 E2MMA    PICTURE X.                                             
           02  E2MMI  PIC X(2).                                                 
           02  E2JJL    COMP  PIC  S9(4).                                       
           02  E2JJF    PICTURE X.                                              
           02  FILLER REDEFINES E2JJF.                                          
             03 E2JJA    PICTURE X.                                             
           02  E2JJI  PIC X(4).                                                 
           02  E2GRDL    COMP  PIC  S9(4).                                      
           02  E2GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E2GRDF.                                         
             03 E2GRDA    PICTURE X.                                            
           02  E2GRDI  PIC X(3).                                                
           02  A2HINDL    COMP  PIC  S9(4).                                     
           02  A2HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A2HINDF.                                        
             03 A2HINDA    PICTURE X.                                           
           02  A2HINDI  PIC X(1).                                               
           02  E2BZNRL    COMP  PIC  S9(4).                                     
           02  E2BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E2BZNRF.                                        
             03 E2BZNRA    PICTURE X.                                           
           02  E2BZNRI  PIC X(7).                                               
           02  E2INFOL    COMP  PIC  S9(4).                                     
           02  E2INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E2INFOF.                                        
             03 E2INFOA    PICTURE X.                                           
           02  E2INFOI  PIC X(49).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3TTL    COMP  PIC  S9(4).                                       
           02  E3TTF    PICTURE X.                                              
           02  FILLER REDEFINES E3TTF.                                          
             03 E3TTA    PICTURE X.                                             
           02  E3TTI  PIC X(2).                                                 
           02  E3MML    COMP  PIC  S9(4).                                       
           02  E3MMF    PICTURE X.                                              
           02  FILLER REDEFINES E3MMF.                                          
             03 E3MMA    PICTURE X.                                             
           02  E3MMI  PIC X(2).                                                 
           02  E3JJL    COMP  PIC  S9(4).                                       
           02  E3JJF    PICTURE X.                                              
           02  FILLER REDEFINES E3JJF.                                          
             03 E3JJA    PICTURE X.                                             
           02  E3JJI  PIC X(4).                                                 
           02  E3GRDL    COMP  PIC  S9(4).                                      
           02  E3GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E3GRDF.                                         
             03 E3GRDA    PICTURE X.                                            
           02  E3GRDI  PIC X(3).                                                
           02  A3HINDL    COMP  PIC  S9(4).                                     
           02  A3HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A3HINDF.                                        
             03 A3HINDA    PICTURE X.                                           
           02  A3HINDI  PIC X(1).                                               
           02  E3BZNRL    COMP  PIC  S9(4).                                     
           02  E3BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E3BZNRF.                                        
             03 E3BZNRA    PICTURE X.                                           
           02  E3BZNRI  PIC X(7).                                               
           02  E3INFOL    COMP  PIC  S9(4).                                     
           02  E3INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E3INFOF.                                        
             03 E3INFOA    PICTURE X.                                           
           02  E3INFOI  PIC X(49).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4TTL    COMP  PIC  S9(4).                                       
           02  E4TTF    PICTURE X.                                              
           02  FILLER REDEFINES E4TTF.                                          
             03 E4TTA    PICTURE X.                                             
           02  E4TTI  PIC X(2).                                                 
           02  E4MML    COMP  PIC  S9(4).                                       
           02  E4MMF    PICTURE X.                                              
           02  FILLER REDEFINES E4MMF.                                          
             03 E4MMA    PICTURE X.                                             
           02  E4MMI  PIC X(2).                                                 
           02  E4JJL    COMP  PIC  S9(4).                                       
           02  E4JJF    PICTURE X.                                              
           02  FILLER REDEFINES E4JJF.                                          
             03 E4JJA    PICTURE X.                                             
           02  E4JJI  PIC X(4).                                                 
           02  E4GRDL    COMP  PIC  S9(4).                                      
           02  E4GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E4GRDF.                                         
             03 E4GRDA    PICTURE X.                                            
           02  E4GRDI  PIC X(3).                                                
           02  A4HINDL    COMP  PIC  S9(4).                                     
           02  A4HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A4HINDF.                                        
             03 A4HINDA    PICTURE X.                                           
           02  A4HINDI  PIC X(1).                                               
           02  E4BZNRL    COMP  PIC  S9(4).                                     
           02  E4BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E4BZNRF.                                        
             03 E4BZNRA    PICTURE X.                                           
           02  E4BZNRI  PIC X(7).                                               
           02  E4INFOL    COMP  PIC  S9(4).                                     
           02  E4INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E4INFOF.                                        
             03 E4INFOA    PICTURE X.                                           
           02  E4INFOI  PIC X(49).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5TTL    COMP  PIC  S9(4).                                       
           02  E5TTF    PICTURE X.                                              
           02  FILLER REDEFINES E5TTF.                                          
             03 E5TTA    PICTURE X.                                             
           02  E5TTI  PIC X(2).                                                 
           02  E5MML    COMP  PIC  S9(4).                                       
           02  E5MMF    PICTURE X.                                              
           02  FILLER REDEFINES E5MMF.                                          
             03 E5MMA    PICTURE X.                                             
           02  E5MMI  PIC X(2).                                                 
           02  E5JJL    COMP  PIC  S9(4).                                       
           02  E5JJF    PICTURE X.                                              
           02  FILLER REDEFINES E5JJF.                                          
             03 E5JJA    PICTURE X.                                             
           02  E5JJI  PIC X(4).                                                 
           02  E5GRDL    COMP  PIC  S9(4).                                      
           02  E5GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E5GRDF.                                         
             03 E5GRDA    PICTURE X.                                            
           02  E5GRDI  PIC X(3).                                                
           02  A5HINDL    COMP  PIC  S9(4).                                     
           02  A5HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A5HINDF.                                        
             03 A5HINDA    PICTURE X.                                           
           02  A5HINDI  PIC X(1).                                               
           02  E5BZNRL    COMP  PIC  S9(4).                                     
           02  E5BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E5BZNRF.                                        
             03 E5BZNRA    PICTURE X.                                           
           02  E5BZNRI  PIC X(7).                                               
           02  E5INFOL    COMP  PIC  S9(4).                                     
           02  E5INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E5INFOF.                                        
             03 E5INFOA    PICTURE X.                                           
           02  E5INFOI  PIC X(49).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6TTL    COMP  PIC  S9(4).                                       
           02  E6TTF    PICTURE X.                                              
           02  FILLER REDEFINES E6TTF.                                          
             03 E6TTA    PICTURE X.                                             
           02  E6TTI  PIC X(2).                                                 
           02  E6MML    COMP  PIC  S9(4).                                       
           02  E6MMF    PICTURE X.                                              
           02  FILLER REDEFINES E6MMF.                                          
             03 E6MMA    PICTURE X.                                             
           02  E6MMI  PIC X(2).                                                 
           02  E6JJL    COMP  PIC  S9(4).                                       
           02  E6JJF    PICTURE X.                                              
           02  FILLER REDEFINES E6JJF.                                          
             03 E6JJA    PICTURE X.                                             
           02  E6JJI  PIC X(4).                                                 
           02  E6GRDL    COMP  PIC  S9(4).                                      
           02  E6GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E6GRDF.                                         
             03 E6GRDA    PICTURE X.                                            
           02  E6GRDI  PIC X(3).                                                
           02  A6HINDL    COMP  PIC  S9(4).                                     
           02  A6HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A6HINDF.                                        
             03 A6HINDA    PICTURE X.                                           
           02  A6HINDI  PIC X(1).                                               
           02  E6BZNRL    COMP  PIC  S9(4).                                     
           02  E6BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E6BZNRF.                                        
             03 E6BZNRA    PICTURE X.                                           
           02  E6BZNRI  PIC X(7).                                               
           02  E6INFOL    COMP  PIC  S9(4).                                     
           02  E6INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E6INFOF.                                        
             03 E6INFOA    PICTURE X.                                           
           02  E6INFOI  PIC X(49).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7TTL    COMP  PIC  S9(4).                                       
           02  E7TTF    PICTURE X.                                              
           02  FILLER REDEFINES E7TTF.                                          
             03 E7TTA    PICTURE X.                                             
           02  E7TTI  PIC X(2).                                                 
           02  E7MML    COMP  PIC  S9(4).                                       
           02  E7MMF    PICTURE X.                                              
           02  FILLER REDEFINES E7MMF.                                          
             03 E7MMA    PICTURE X.                                             
           02  E7MMI  PIC X(2).                                                 
           02  E7JJL    COMP  PIC  S9(4).                                       
           02  E7JJF    PICTURE X.                                              
           02  FILLER REDEFINES E7JJF.                                          
             03 E7JJA    PICTURE X.                                             
           02  E7JJI  PIC X(4).                                                 
           02  E7GRDL    COMP  PIC  S9(4).                                      
           02  E7GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E7GRDF.                                         
             03 E7GRDA    PICTURE X.                                            
           02  E7GRDI  PIC X(3).                                                
           02  A7HINDL    COMP  PIC  S9(4).                                     
           02  A7HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A7HINDF.                                        
             03 A7HINDA    PICTURE X.                                           
           02  A7HINDI  PIC X(1).                                               
           02  E7BZNRL    COMP  PIC  S9(4).                                     
           02  E7BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E7BZNRF.                                        
             03 E7BZNRA    PICTURE X.                                           
           02  E7BZNRI  PIC X(7).                                               
           02  E7INFOL    COMP  PIC  S9(4).                                     
           02  E7INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E7INFOF.                                        
             03 E7INFOA    PICTURE X.                                           
           02  E7INFOI  PIC X(49).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8TTL    COMP  PIC  S9(4).                                       
           02  E8TTF    PICTURE X.                                              
           02  FILLER REDEFINES E8TTF.                                          
             03 E8TTA    PICTURE X.                                             
           02  E8TTI  PIC X(2).                                                 
           02  E8MML    COMP  PIC  S9(4).                                       
           02  E8MMF    PICTURE X.                                              
           02  FILLER REDEFINES E8MMF.                                          
             03 E8MMA    PICTURE X.                                             
           02  E8MMI  PIC X(2).                                                 
           02  E8JJL    COMP  PIC  S9(4).                                       
           02  E8JJF    PICTURE X.                                              
           02  FILLER REDEFINES E8JJF.                                          
             03 E8JJA    PICTURE X.                                             
           02  E8JJI  PIC X(4).                                                 
           02  E8GRDL    COMP  PIC  S9(4).                                      
           02  E8GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E8GRDF.                                         
             03 E8GRDA    PICTURE X.                                            
           02  E8GRDI  PIC X(3).                                                
           02  A8HINDL    COMP  PIC  S9(4).                                     
           02  A8HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A8HINDF.                                        
             03 A8HINDA    PICTURE X.                                           
           02  A8HINDI  PIC X(1).                                               
           02  E8BZNRL    COMP  PIC  S9(4).                                     
           02  E8BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E8BZNRF.                                        
             03 E8BZNRA    PICTURE X.                                           
           02  E8BZNRI  PIC X(7).                                               
           02  E8INFOL    COMP  PIC  S9(4).                                     
           02  E8INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E8INFOF.                                        
             03 E8INFOA    PICTURE X.                                           
           02  E8INFOI  PIC X(49).                                              
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9TTL    COMP  PIC  S9(4).                                       
           02  E9TTF    PICTURE X.                                              
           02  FILLER REDEFINES E9TTF.                                          
             03 E9TTA    PICTURE X.                                             
           02  E9TTI  PIC X(2).                                                 
           02  E9MML    COMP  PIC  S9(4).                                       
           02  E9MMF    PICTURE X.                                              
           02  FILLER REDEFINES E9MMF.                                          
             03 E9MMA    PICTURE X.                                             
           02  E9MMI  PIC X(2).                                                 
           02  E9JJL    COMP  PIC  S9(4).                                       
           02  E9JJF    PICTURE X.                                              
           02  FILLER REDEFINES E9JJF.                                          
             03 E9JJA    PICTURE X.                                             
           02  E9JJI  PIC X(4).                                                 
           02  E9GRDL    COMP  PIC  S9(4).                                      
           02  E9GRDF    PICTURE X.                                             
           02  FILLER REDEFINES E9GRDF.                                         
             03 E9GRDA    PICTURE X.                                            
           02  E9GRDI  PIC X(3).                                                
           02  A9HINDL    COMP  PIC  S9(4).                                     
           02  A9HINDF    PICTURE X.                                            
           02  FILLER REDEFINES A9HINDF.                                        
             03 A9HINDA    PICTURE X.                                           
           02  A9HINDI  PIC X(1).                                               
           02  E9BZNRL    COMP  PIC  S9(4).                                     
           02  E9BZNRF    PICTURE X.                                            
           02  FILLER REDEFINES E9BZNRF.                                        
             03 E9BZNRA    PICTURE X.                                           
           02  E9BZNRI  PIC X(7).                                               
           02  E9INFOL    COMP  PIC  S9(4).                                     
           02  E9INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E9INFOF.                                        
             03 E9INFOA    PICTURE X.                                           
           02  E9INFOI  PIC X(49).                                              
           02  E10FCL    COMP  PIC  S9(4).                                      
           02  E10FCF    PICTURE X.                                             
           02  FILLER REDEFINES E10FCF.                                         
             03 E10FCA    PICTURE X.                                            
           02  E10FCI  PIC X(1).                                                
           02  E10TTL    COMP  PIC  S9(4).                                      
           02  E10TTF    PICTURE X.                                             
           02  FILLER REDEFINES E10TTF.                                         
             03 E10TTA    PICTURE X.                                            
           02  E10TTI  PIC X(2).                                                
           02  E10MML    COMP  PIC  S9(4).                                      
           02  E10MMF    PICTURE X.                                             
           02  FILLER REDEFINES E10MMF.                                         
             03 E10MMA    PICTURE X.                                            
           02  E10MMI  PIC X(2).                                                
           02  E10JJL    COMP  PIC  S9(4).                                      
           02  E10JJF    PICTURE X.                                             
           02  FILLER REDEFINES E10JJF.                                         
             03 E10JJA    PICTURE X.                                            
           02  E10JJI  PIC X(4).                                                
           02  E10GRDL    COMP  PIC  S9(4).                                     
           02  E10GRDF    PICTURE X.                                            
           02  FILLER REDEFINES E10GRDF.                                        
             03 E10GRDA    PICTURE X.                                           
           02  E10GRDI  PIC X(3).                                               
           02  A10HINDL    COMP  PIC  S9(4).                                    
           02  A10HINDF    PICTURE X.                                           
           02  FILLER REDEFINES A10HINDF.                                       
             03 A10HINDA    PICTURE X.                                          
           02  A10HINDI  PIC X(1).                                              
           02  E10BZNRL    COMP  PIC  S9(4).                                    
           02  E10BZNRF    PICTURE X.                                           
           02  FILLER REDEFINES E10BZNRF.                                       
             03 E10BZNRA    PICTURE X.                                          
           02  E10BZNRI  PIC X(7).                                              
           02  E10INFOL    COMP  PIC  S9(4).                                    
           02  E10INFOF    PICTURE X.                                           
           02  FILLER REDEFINES E10INFOF.                                       
             03 E10INFOA    PICTURE X.                                          
           02  E10INFOI  PIC X(49).                                             
       01  BVB0003O REDEFINES BVB0003I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A1HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A2HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A3HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A4HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A5HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A6HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A7HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A8HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9TTO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9MMO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9JJO  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9GRDO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  A9HINDO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  E9BZNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  E9INFOO  PIC X(49).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10TTO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10MMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10JJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10GRDO  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  A10HINDO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10BZNRO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10INFOO  PIC X(49).                                             
