       01  BVB0012I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(30).                                               
           02  AVORNAML    COMP  PIC  S9(4).                                    
           02  AVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVORNAMF.                                       
             03 AVORNAMA    PICTURE X.                                          
           02  AVORNAMI  PIC X(30).                                             
           02  AVBSEML    COMP  PIC  S9(4).                                     
           02  AVBSEMF    PICTURE X.                                            
           02  FILLER REDEFINES AVBSEMF.                                        
             03 AVBSEMA    PICTURE X.                                           
           02  AVBSEMI  PIC X(1).                                               
           02  EVBSEMTL    COMP  PIC  S9(4).                                    
           02  EVBSEMTF    PICTURE X.                                           
           02  FILLER REDEFINES EVBSEMTF.                                       
             03 EVBSEMTA    PICTURE X.                                          
           02  EVBSEMTI  PIC X(2).                                              
           02  EVBSEMML    COMP  PIC  S9(4).                                    
           02  EVBSEMMF    PICTURE X.                                           
           02  FILLER REDEFINES EVBSEMMF.                                       
             03 EVBSEMMA    PICTURE X.                                          
           02  EVBSEMMI  PIC X(2).                                              
           02  EVBSEMJL    COMP  PIC  S9(4).                                    
           02  EVBSEMJF    PICTURE X.                                           
           02  FILLER REDEFINES EVBSEMJF.                                       
             03 EVBSEMJA    PICTURE X.                                          
           02  EVBSEMJI  PIC X(4).                                              
           02  EALSEML    COMP  PIC  S9(4).                                     
           02  EALSEMF    PICTURE X.                                            
           02  FILLER REDEFINES EALSEMF.                                        
             03 EALSEMA    PICTURE X.                                           
           02  EALSEMI  PIC X(1).                                               
           02  EALSEMTL    COMP  PIC  S9(4).                                    
           02  EALSEMTF    PICTURE X.                                           
           02  FILLER REDEFINES EALSEMTF.                                       
             03 EALSEMTA    PICTURE X.                                          
           02  EALSEMTI  PIC X(2).                                              
           02  EALSEMML    COMP  PIC  S9(4).                                    
           02  EALSEMMF    PICTURE X.                                           
           02  FILLER REDEFINES EALSEMMF.                                       
             03 EALSEMMA    PICTURE X.                                          
           02  EALSEMMI  PIC X(2).                                              
           02  EALSEMJL    COMP  PIC  S9(4).                                    
           02  EALSEMJF    PICTURE X.                                           
           02  FILLER REDEFINES EALSEMJF.                                       
             03 EALSEMJA    PICTURE X.                                          
           02  EALSEMJI  PIC X(4).                                              
           02  EALSEMEL    COMP  PIC  S9(4).                                    
           02  EALSEMEF    PICTURE X.                                           
           02  FILLER REDEFINES EALSEMEF.                                       
             03 EALSEMEA    PICTURE X.                                          
           02  EALSEMEI  PIC X(1).                                              
           02  AVBPRFL    COMP  PIC  S9(4).                                     
           02  AVBPRFF    PICTURE X.                                            
           02  FILLER REDEFINES AVBPRFF.                                        
             03 AVBPRFA    PICTURE X.                                           
           02  AVBPRFI  PIC X(1).                                               
           02  EVBPRFTL    COMP  PIC  S9(4).                                    
           02  EVBPRFTF    PICTURE X.                                           
           02  FILLER REDEFINES EVBPRFTF.                                       
             03 EVBPRFTA    PICTURE X.                                          
           02  EVBPRFTI  PIC X(2).                                              
           02  EVBPRFML    COMP  PIC  S9(4).                                    
           02  EVBPRFMF    PICTURE X.                                           
           02  FILLER REDEFINES EVBPRFMF.                                       
             03 EVBPRFMA    PICTURE X.                                          
           02  EVBPRFMI  PIC X(2).                                              
           02  EVBPRFJL    COMP  PIC  S9(4).                                    
           02  EVBPRFJF    PICTURE X.                                           
           02  FILLER REDEFINES EVBPRFJF.                                       
             03 EVBPRFJA    PICTURE X.                                          
           02  EVBPRFJI  PIC X(4).                                              
           02  EKASEML    COMP  PIC  S9(4).                                     
           02  EKASEMF    PICTURE X.                                            
           02  FILLER REDEFINES EKASEMF.                                        
             03 EKASEMA    PICTURE X.                                           
           02  EKASEMI  PIC X(1).                                               
           02  EKASEMTL    COMP  PIC  S9(4).                                    
           02  EKASEMTF    PICTURE X.                                           
           02  FILLER REDEFINES EKASEMTF.                                       
             03 EKASEMTA    PICTURE X.                                          
           02  EKASEMTI  PIC X(2).                                              
           02  EKASEMML    COMP  PIC  S9(4).                                    
           02  EKASEMMF    PICTURE X.                                           
           02  FILLER REDEFINES EKASEMMF.                                       
             03 EKASEMMA    PICTURE X.                                          
           02  EKASEMMI  PIC X(2).                                              
           02  EKASEMJL    COMP  PIC  S9(4).                                    
           02  EKASEMJF    PICTURE X.                                           
           02  FILLER REDEFINES EKASEMJF.                                       
             03 EKASEMJA    PICTURE X.                                          
           02  EKASEMJI  PIC X(4).                                              
           02  EKASEMEL    COMP  PIC  S9(4).                                    
           02  EKASEMEF    PICTURE X.                                           
           02  FILLER REDEFINES EKASEMEF.                                       
             03 EKASEMEA    PICTURE X.                                          
           02  EKASEMEI  PIC X(1).                                              
           02  ABDVPRFL    COMP  PIC  S9(4).                                    
           02  ABDVPRFF    PICTURE X.                                           
           02  FILLER REDEFINES ABDVPRFF.                                       
             03 ABDVPRFA    PICTURE X.                                          
           02  ABDVPRFI  PIC X(1).                                              
           02  EBDVPRTL    COMP  PIC  S9(4).                                    
           02  EBDVPRTF    PICTURE X.                                           
           02  FILLER REDEFINES EBDVPRTF.                                       
             03 EBDVPRTA    PICTURE X.                                          
           02  EBDVPRTI  PIC X(2).                                              
           02  EBDVPRML    COMP  PIC  S9(4).                                    
           02  EBDVPRMF    PICTURE X.                                           
           02  FILLER REDEFINES EBDVPRMF.                                       
             03 EBDVPRMA    PICTURE X.                                          
           02  EBDVPRMI  PIC X(2).                                              
           02  EBDVPRJL    COMP  PIC  S9(4).                                    
           02  EBDVPRJF    PICTURE X.                                           
           02  FILLER REDEFINES EBDVPRJF.                                       
             03 EBDVPRJA    PICTURE X.                                          
           02  EBDVPRJI  PIC X(4).                                              
           02  ARGSEML    COMP  PIC  S9(4).                                     
           02  ARGSEMF    PICTURE X.                                            
           02  FILLER REDEFINES ARGSEMF.                                        
             03 ARGSEMA    PICTURE X.                                           
           02  ARGSEMI  PIC X(1).                                               
           02  ERGSEMTL    COMP  PIC  S9(4).                                    
           02  ERGSEMTF    PICTURE X.                                           
           02  FILLER REDEFINES ERGSEMTF.                                       
             03 ERGSEMTA    PICTURE X.                                          
           02  ERGSEMTI  PIC X(2).                                              
           02  ERGSEMML    COMP  PIC  S9(4).                                    
           02  ERGSEMMF    PICTURE X.                                           
           02  FILLER REDEFINES ERGSEMMF.                                       
             03 ERGSEMMA    PICTURE X.                                          
           02  ERGSEMMI  PIC X(2).                                              
           02  ERGSEMJL    COMP  PIC  S9(4).                                    
           02  ERGSEMJF    PICTURE X.                                           
           02  FILLER REDEFINES ERGSEMJF.                                       
             03 ERGSEMJA    PICTURE X.                                          
           02  ERGSEMJI  PIC X(4).                                              
           02  ERGSEML    COMP  PIC  S9(4).                                     
           02  ERGSEMF    PICTURE X.                                            
           02  FILLER REDEFINES ERGSEMF.                                        
             03 ERGSEMA    PICTURE X.                                           
           02  ERGSEMI  PIC X(1).                                               
           02  ABDVMGL    COMP  PIC  S9(4).                                     
           02  ABDVMGF    PICTURE X.                                            
           02  FILLER REDEFINES ABDVMGF.                                        
             03 ABDVMGA    PICTURE X.                                           
           02  ABDVMGI  PIC X(1).                                               
           02  EBDVMGL    COMP  PIC  S9(4).                                     
           02  EBDVMGF    PICTURE X.                                            
           02  FILLER REDEFINES EBDVMGF.                                        
             03 EBDVMGA    PICTURE X.                                           
           02  EBDVMGI  PIC X(1).                                               
           02  ARAUT1L    COMP  PIC  S9(4).                                     
           02  ARAUT1F    PICTURE X.                                            
           02  FILLER REDEFINES ARAUT1F.                                        
             03 ARAUT1A    PICTURE X.                                           
           02  ARAUT1I  PIC X(1).                                               
           02  ERAUT1TL    COMP  PIC  S9(4).                                    
           02  ERAUT1TF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT1TF.                                       
             03 ERAUT1TA    PICTURE X.                                          
           02  ERAUT1TI  PIC X(2).                                              
           02  ERAUT1ML    COMP  PIC  S9(4).                                    
           02  ERAUT1MF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT1MF.                                       
             03 ERAUT1MA    PICTURE X.                                          
           02  ERAUT1MI  PIC X(2).                                              
           02  ERAUT1JL    COMP  PIC  S9(4).                                    
           02  ERAUT1JF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT1JF.                                       
             03 ERAUT1JA    PICTURE X.                                          
           02  ERAUT1JI  PIC X(4).                                              
           02  ADBBVBL    COMP  PIC  S9(4).                                     
           02  ADBBVBF    PICTURE X.                                            
           02  FILLER REDEFINES ADBBVBF.                                        
             03 ADBBVBA    PICTURE X.                                           
           02  ADBBVBI  PIC X(1).                                               
           02  ADBBVBTL    COMP  PIC  S9(4).                                    
           02  ADBBVBTF    PICTURE X.                                           
           02  FILLER REDEFINES ADBBVBTF.                                       
             03 ADBBVBTA    PICTURE X.                                          
           02  ADBBVBTI  PIC X(2).                                              
           02  ADBBVBML    COMP  PIC  S9(4).                                    
           02  ADBBVBMF    PICTURE X.                                           
           02  FILLER REDEFINES ADBBVBMF.                                       
             03 ADBBVBMA    PICTURE X.                                          
           02  ADBBVBMI  PIC X(2).                                              
           02  ADBBVBJL    COMP  PIC  S9(4).                                    
           02  ADBBVBJF    PICTURE X.                                           
           02  FILLER REDEFINES ADBBVBJF.                                       
             03 ADBBVBJA    PICTURE X.                                          
           02  ADBBVBJI  PIC X(4).                                              
           02  ARAUT2L    COMP  PIC  S9(4).                                     
           02  ARAUT2F    PICTURE X.                                            
           02  FILLER REDEFINES ARAUT2F.                                        
             03 ARAUT2A    PICTURE X.                                           
           02  ARAUT2I  PIC X(1).                                               
           02  ERAUT2TL    COMP  PIC  S9(4).                                    
           02  ERAUT2TF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT2TF.                                       
             03 ERAUT2TA    PICTURE X.                                          
           02  ERAUT2TI  PIC X(2).                                              
           02  ERAUT2ML    COMP  PIC  S9(4).                                    
           02  ERAUT2MF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT2MF.                                       
             03 ERAUT2MA    PICTURE X.                                          
           02  ERAUT2MI  PIC X(2).                                              
           02  ERAUT2JL    COMP  PIC  S9(4).                                    
           02  ERAUT2JF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT2JF.                                       
             03 ERAUT2JA    PICTURE X.                                          
           02  ERAUT2JI  PIC X(4).                                              
           02  ADBBVAL    COMP  PIC  S9(4).                                     
           02  ADBBVAF    PICTURE X.                                            
           02  FILLER REDEFINES ADBBVAF.                                        
             03 ADBBVAA    PICTURE X.                                           
           02  ADBBVAI  PIC X(1).                                               
           02  ADBBVATL    COMP  PIC  S9(4).                                    
           02  ADBBVATF    PICTURE X.                                           
           02  FILLER REDEFINES ADBBVATF.                                       
             03 ADBBVATA    PICTURE X.                                          
           02  ADBBVATI  PIC X(2).                                              
           02  ADBBVAML    COMP  PIC  S9(4).                                    
           02  ADBBVAMF    PICTURE X.                                           
           02  FILLER REDEFINES ADBBVAMF.                                       
             03 ADBBVAMA    PICTURE X.                                          
           02  ADBBVAMI  PIC X(2).                                              
           02  ADBBVAJL    COMP  PIC  S9(4).                                    
           02  ADBBVAJF    PICTURE X.                                           
           02  FILLER REDEFINES ADBBVAJF.                                       
             03 ADBBVAJA    PICTURE X.                                          
           02  ADBBVAJI  PIC X(4).                                              
           02  ARAUT3L    COMP  PIC  S9(4).                                     
           02  ARAUT3F    PICTURE X.                                            
           02  FILLER REDEFINES ARAUT3F.                                        
             03 ARAUT3A    PICTURE X.                                           
           02  ARAUT3I  PIC X(1).                                               
           02  ERAUT3TL    COMP  PIC  S9(4).                                    
           02  ERAUT3TF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT3TF.                                       
             03 ERAUT3TA    PICTURE X.                                          
           02  ERAUT3TI  PIC X(2).                                              
           02  ERAUT3ML    COMP  PIC  S9(4).                                    
           02  ERAUT3MF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT3MF.                                       
             03 ERAUT3MA    PICTURE X.                                          
           02  ERAUT3MI  PIC X(2).                                              
           02  ERAUT3JL    COMP  PIC  S9(4).                                    
           02  ERAUT3JF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT3JF.                                       
             03 ERAUT3JA    PICTURE X.                                          
           02  ERAUT3JI  PIC X(4).                                              
           02  ARAUT4L    COMP  PIC  S9(4).                                     
           02  ARAUT4F    PICTURE X.                                            
           02  FILLER REDEFINES ARAUT4F.                                        
             03 ARAUT4A    PICTURE X.                                           
           02  ARAUT4I  PIC X(1).                                               
           02  ERAUT4TL    COMP  PIC  S9(4).                                    
           02  ERAUT4TF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT4TF.                                       
             03 ERAUT4TA    PICTURE X.                                          
           02  ERAUT4TI  PIC X(2).                                              
           02  ERAUT4ML    COMP  PIC  S9(4).                                    
           02  ERAUT4MF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT4MF.                                       
             03 ERAUT4MA    PICTURE X.                                          
           02  ERAUT4MI  PIC X(2).                                              
           02  ERAUT4JL    COMP  PIC  S9(4).                                    
           02  ERAUT4JF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT4JF.                                       
             03 ERAUT4JA    PICTURE X.                                          
           02  ERAUT4JI  PIC X(4).                                              
           02  AAUFB1TL    COMP  PIC  S9(4).                                    
           02  AAUFB1TF    PICTURE X.                                           
           02  FILLER REDEFINES AAUFB1TF.                                       
             03 AAUFB1TA    PICTURE X.                                          
           02  AAUFB1TI  PIC X(15).                                             
           02  AAUFB1L    COMP  PIC  S9(4).                                     
           02  AAUFB1F    PICTURE X.                                            
           02  FILLER REDEFINES AAUFB1F.                                        
             03 AAUFB1A    PICTURE X.                                           
           02  AAUFB1I  PIC X(1).                                               
           02  EAUFB1TL    COMP  PIC  S9(4).                                    
           02  EAUFB1TF    PICTURE X.                                           
           02  FILLER REDEFINES EAUFB1TF.                                       
             03 EAUFB1TA    PICTURE X.                                          
           02  EAUFB1TI  PIC X(2).                                              
           02  EAUFB1ML    COMP  PIC  S9(4).                                    
           02  EAUFB1MF    PICTURE X.                                           
           02  FILLER REDEFINES EAUFB1MF.                                       
             03 EAUFB1MA    PICTURE X.                                          
           02  EAUFB1MI  PIC X(2).                                              
           02  EAUFB1JL    COMP  PIC  S9(4).                                    
           02  EAUFB1JF    PICTURE X.                                           
           02  FILLER REDEFINES EAUFB1JF.                                       
             03 EAUFB1JA    PICTURE X.                                          
           02  EAUFB1JI  PIC X(4).                                              
           02  ARAUT5L    COMP  PIC  S9(4).                                     
           02  ARAUT5F    PICTURE X.                                            
           02  FILLER REDEFINES ARAUT5F.                                        
             03 ARAUT5A    PICTURE X.                                           
           02  ARAUT5I  PIC X(1).                                               
           02  ERAUT5TL    COMP  PIC  S9(4).                                    
           02  ERAUT5TF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT5TF.                                       
             03 ERAUT5TA    PICTURE X.                                          
           02  ERAUT5TI  PIC X(2).                                              
           02  ERAUT5ML    COMP  PIC  S9(4).                                    
           02  ERAUT5MF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT5MF.                                       
             03 ERAUT5MA    PICTURE X.                                          
           02  ERAUT5MI  PIC X(2).                                              
           02  ERAUT5JL    COMP  PIC  S9(4).                                    
           02  ERAUT5JF    PICTURE X.                                           
           02  FILLER REDEFINES ERAUT5JF.                                       
             03 ERAUT5JA    PICTURE X.                                          
           02  ERAUT5JI  PIC X(4).                                              
           02  APRUE1TL    COMP  PIC  S9(4).                                    
           02  APRUE1TF    PICTURE X.                                           
           02  FILLER REDEFINES APRUE1TF.                                       
             03 APRUE1TA    PICTURE X.                                          
           02  APRUE1TI  PIC X(15).                                             
           02  APRUEF1L    COMP  PIC  S9(4).                                    
           02  APRUEF1F    PICTURE X.                                           
           02  FILLER REDEFINES APRUEF1F.                                       
             03 APRUEF1A    PICTURE X.                                          
           02  APRUEF1I  PIC X(1).                                              
           02  EPRUE1TL    COMP  PIC  S9(4).                                    
           02  EPRUE1TF    PICTURE X.                                           
           02  FILLER REDEFINES EPRUE1TF.                                       
             03 EPRUE1TA    PICTURE X.                                          
           02  EPRUE1TI  PIC X(2).                                              
           02  EPRUE1ML    COMP  PIC  S9(4).                                    
           02  EPRUE1MF    PICTURE X.                                           
           02  FILLER REDEFINES EPRUE1MF.                                       
             03 EPRUE1MA    PICTURE X.                                          
           02  EPRUE1MI  PIC X(2).                                              
           02  EPRUE1JL    COMP  PIC  S9(4).                                    
           02  EPRUE1JF    PICTURE X.                                           
           02  FILLER REDEFINES EPRUE1JF.                                       
             03 EPRUE1JA    PICTURE X.                                          
           02  EPRUE1JI  PIC X(4).                                              
           02  AAUFB2TL    COMP  PIC  S9(4).                                    
           02  AAUFB2TF    PICTURE X.                                           
           02  FILLER REDEFINES AAUFB2TF.                                       
             03 AAUFB2TA    PICTURE X.                                          
           02  AAUFB2TI  PIC X(15).                                             
           02  AAUFB2L    COMP  PIC  S9(4).                                     
           02  AAUFB2F    PICTURE X.                                            
           02  FILLER REDEFINES AAUFB2F.                                        
             03 AAUFB2A    PICTURE X.                                           
           02  AAUFB2I  PIC X(1).                                               
           02  EAUFB2TL    COMP  PIC  S9(4).                                    
           02  EAUFB2TF    PICTURE X.                                           
           02  FILLER REDEFINES EAUFB2TF.                                       
             03 EAUFB2TA    PICTURE X.                                          
           02  EAUFB2TI  PIC X(2).                                              
           02  EAUFB2ML    COMP  PIC  S9(4).                                    
           02  EAUFB2MF    PICTURE X.                                           
           02  FILLER REDEFINES EAUFB2MF.                                       
             03 EAUFB2MA    PICTURE X.                                          
           02  EAUFB2MI  PIC X(2).                                              
           02  EAUFB2JL    COMP  PIC  S9(4).                                    
           02  EAUFB2JF    PICTURE X.                                           
           02  FILLER REDEFINES EAUFB2JF.                                       
             03 EAUFB2JA    PICTURE X.                                          
           02  EAUFB2JI  PIC X(4).                                              
           02  ACORREL    COMP  PIC  S9(4).                                     
           02  ACORREF    PICTURE X.                                            
           02  FILLER REDEFINES ACORREF.                                        
             03 ACORREA    PICTURE X.                                           
           02  ACORREI  PIC X(1).                                               
           02  ECORRETL    COMP  PIC  S9(4).                                    
           02  ECORRETF    PICTURE X.                                           
           02  FILLER REDEFINES ECORRETF.                                       
             03 ECORRETA    PICTURE X.                                          
           02  ECORRETI  PIC X(2).                                              
           02  ECORREML    COMP  PIC  S9(4).                                    
           02  ECORREMF    PICTURE X.                                           
           02  FILLER REDEFINES ECORREMF.                                       
             03 ECORREMA    PICTURE X.                                          
           02  ECORREMI  PIC X(2).                                              
           02  ECORREJL    COMP  PIC  S9(4).                                    
           02  ECORREJF    PICTURE X.                                           
           02  FILLER REDEFINES ECORREJF.                                       
             03 ECORREJA    PICTURE X.                                          
           02  ECORREJI  PIC X(4).                                              
           02  APRUE2TL    COMP  PIC  S9(4).                                    
           02  APRUE2TF    PICTURE X.                                           
           02  FILLER REDEFINES APRUE2TF.                                       
             03 APRUE2TA    PICTURE X.                                          
           02  APRUE2TI  PIC X(15).                                             
           02  APRUEF2L    COMP  PIC  S9(4).                                    
           02  APRUEF2F    PICTURE X.                                           
           02  FILLER REDEFINES APRUEF2F.                                       
             03 APRUEF2A    PICTURE X.                                          
           02  APRUEF2I  PIC X(1).                                              
           02  EPRUE2TL    COMP  PIC  S9(4).                                    
           02  EPRUE2TF    PICTURE X.                                           
           02  FILLER REDEFINES EPRUE2TF.                                       
             03 EPRUE2TA    PICTURE X.                                          
           02  EPRUE2TI  PIC X(2).                                              
           02  EPRUE2ML    COMP  PIC  S9(4).                                    
           02  EPRUE2MF    PICTURE X.                                           
           02  FILLER REDEFINES EPRUE2MF.                                       
             03 EPRUE2MA    PICTURE X.                                          
           02  EPRUE2MI  PIC X(2).                                              
           02  EPRUE2JL    COMP  PIC  S9(4).                                    
           02  EPRUE2JF    PICTURE X.                                           
           02  FILLER REDEFINES EPRUE2JF.                                       
             03 EPRUE2JA    PICTURE X.                                          
           02  EPRUE2JI  PIC X(4).                                              
           02  AGAPRFL    COMP  PIC  S9(4).                                     
           02  AGAPRFF    PICTURE X.                                            
           02  FILLER REDEFINES AGAPRFF.                                        
             03 AGAPRFA    PICTURE X.                                           
           02  AGAPRFI  PIC X(1).                                               
           02  EGAPRFTL    COMP  PIC  S9(4).                                    
           02  EGAPRFTF    PICTURE X.                                           
           02  FILLER REDEFINES EGAPRFTF.                                       
             03 EGAPRFTA    PICTURE X.                                          
           02  EGAPRFTI  PIC X(2).                                              
           02  EGAPRFML    COMP  PIC  S9(4).                                    
           02  EGAPRFMF    PICTURE X.                                           
           02  FILLER REDEFINES EGAPRFMF.                                       
             03 EGAPRFMA    PICTURE X.                                          
           02  EGAPRFMI  PIC X(2).                                              
           02  EGAPRFJL    COMP  PIC  S9(4).                                    
           02  EGAPRFJF    PICTURE X.                                           
           02  FILLER REDEFINES EGAPRFJF.                                       
             03 EGAPRFJA    PICTURE X.                                          
           02  EGAPRFJI  PIC X(4).                                              
           02  AGASTUDL    COMP  PIC  S9(4).                                    
           02  AGASTUDF    PICTURE X.                                           
           02  FILLER REDEFINES AGASTUDF.                                       
             03 AGASTUDA    PICTURE X.                                          
           02  AGASTUDI  PIC X(1).                                              
           02  EGASTUTL    COMP  PIC  S9(4).                                    
           02  EGASTUTF    PICTURE X.                                           
           02  FILLER REDEFINES EGASTUTF.                                       
             03 EGASTUTA    PICTURE X.                                          
           02  EGASTUTI  PIC X(2).                                              
           02  EGASTUML    COMP  PIC  S9(4).                                    
           02  EGASTUMF    PICTURE X.                                           
           02  FILLER REDEFINES EGASTUMF.                                       
             03 EGASTUMA    PICTURE X.                                          
           02  EGASTUMI  PIC X(2).                                              
           02  EGASTUJL    COMP  PIC  S9(4).                                    
           02  EGASTUJF    PICTURE X.                                           
           02  FILLER REDEFINES EGASTUJF.                                       
             03 EGASTUJA    PICTURE X.                                          
           02  EGASTUJI  PIC X(4).                                              
           02  AIHKPRFL    COMP  PIC  S9(4).                                    
           02  AIHKPRFF    PICTURE X.                                           
           02  FILLER REDEFINES AIHKPRFF.                                       
             03 AIHKPRFA    PICTURE X.                                          
           02  AIHKPRFI  PIC X(1).                                              
           02  EIHKPRTL    COMP  PIC  S9(4).                                    
           02  EIHKPRTF    PICTURE X.                                           
           02  FILLER REDEFINES EIHKPRTF.                                       
             03 EIHKPRTA    PICTURE X.                                          
           02  EIHKPRTI  PIC X(2).                                              
           02  EIHKPRML    COMP  PIC  S9(4).                                    
           02  EIHKPRMF    PICTURE X.                                           
           02  FILLER REDEFINES EIHKPRMF.                                       
             03 EIHKPRMA    PICTURE X.                                          
           02  EIHKPRMI  PIC X(2).                                              
           02  EIHKPRJL    COMP  PIC  S9(4).                                    
           02  EIHKPRJF    PICTURE X.                                           
           02  FILLER REDEFINES EIHKPRJF.                                       
             03 EIHKPRJA    PICTURE X.                                          
           02  EIHKPRJI  PIC X(4).                                              
           02  ADAVL    COMP  PIC  S9(4).                                       
           02  ADAVF    PICTURE X.                                              
           02  FILLER REDEFINES ADAVF.                                          
             03 ADAVA    PICTURE X.                                             
           02  ADAVI  PIC X(1).                                                 
           02  EDAVTL    COMP  PIC  S9(4).                                      
           02  EDAVTF    PICTURE X.                                             
           02  FILLER REDEFINES EDAVTF.                                         
             03 EDAVTA    PICTURE X.                                            
           02  EDAVTI  PIC X(2).                                                
           02  EDAVML    COMP  PIC  S9(4).                                      
           02  EDAVMF    PICTURE X.                                             
           02  FILLER REDEFINES EDAVMF.                                         
             03 EDAVMA    PICTURE X.                                            
           02  EDAVMI  PIC X(2).                                                
           02  EDAVJL    COMP  PIC  S9(4).                                      
           02  EDAVJF    PICTURE X.                                             
           02  FILLER REDEFINES EDAVJF.                                         
             03 EDAVJA    PICTURE X.                                            
           02  EDAVJI  PIC X(4).                                                
       01  BVB0012O REDEFINES BVB0012I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(30).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORNAMO  PIC X(30).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBSEMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBSEMTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBSEMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBSEMJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EALSEMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EALSEMTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EALSEMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EALSEMJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EALSEMEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVBPRFO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVBPRFTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBPRFMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EVBPRFJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKASEMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKASEMTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKASEMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKASEMJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKASEMEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABDVPRFO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBDVPRTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBDVPRMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBDVPRJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARGSEMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERGSEMTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERGSEMMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERGSEMJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERGSEMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABDVMGO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EBDVMGO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ARAUT1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERAUT1TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT1MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT1JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBBVBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADBBVBTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBBVBMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBBVBJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARAUT2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERAUT2TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT2MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT2JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBBVAO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADBBVATO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBBVAMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADBBVAJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARAUT3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERAUT3TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT3MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT3JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARAUT4O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERAUT4TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT4MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT4JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUFB1TO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AAUFB1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUFB1TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUFB1MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUFB1JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARAUT5O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERAUT5TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT5MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERAUT5JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRUE1TO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRUEF1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRUE1TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRUE1MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRUE1JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AAUFB2TO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AAUFB2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EAUFB2TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUFB2MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EAUFB2JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ACORREO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ECORRETO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ECORREMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ECORREJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  APRUE2TO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  APRUEF2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRUE2TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRUE2MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EPRUE2JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGAPRFO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  EGAPRFTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGAPRFMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGAPRFJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AGASTUDO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGASTUTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGASTUMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EGASTUJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIHKPRFO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIHKPRTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIHKPRMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIHKPRJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADAVO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EDAVTO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDAVMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDAVJO  PIC X(4).                                                
