       01  BVB0016I.                                                            
           02  FILLER PIC X(12).                                                
           02  A2STNRL    COMP  PIC  S9(4).                                     
           02  A2STNRF    PICTURE X.                                            
           02  FILLER REDEFINES A2STNRF.                                        
             03 A2STNRA    PICTURE X.                                           
           02  A2STNRI  PIC X(7).                                               
           02  A2STPRZL    COMP  PIC  S9(4).                                    
           02  A2STPRZF    PICTURE X.                                           
           02  FILLER REDEFINES A2STPRZF.                                       
             03 A2STPRZA    PICTURE X.                                          
           02  A2STPRZI  PIC X(1).                                              
           02  EIBANL    COMP  PIC  S9(4).                                      
           02  EIBANF    PICTURE X.                                             
           02  FILLER REDEFINES EIBANF.                                         
             03 EIBANA    PICTURE X.                                            
           02  EIBANI  PIC X(22).                                               
           02  ABICL    COMP  PIC  S9(4).                                       
           02  ABICF    PICTURE X.                                              
           02  FILLER REDEFINES ABICF.                                          
             03 ABICA    PICTURE X.                                             
           02  ABICI  PIC X(11).                                                
           02  EBLZL    COMP  PIC  S9(4).                                       
           02  EBLZF    PICTURE X.                                              
           02  FILLER REDEFINES EBLZF.                                          
             03 EBLZA    PICTURE X.                                             
           02  EBLZI  PIC X(8).                                                 
           02  EBANKL    COMP  PIC  S9(4).                                      
           02  EBANKF    PICTURE X.                                             
           02  FILLER REDEFINES EBANKF.                                         
             03 EBANKA    PICTURE X.                                            
           02  EBANKI  PIC X(40).                                               
           02  EKTONRL    COMP  PIC  S9(4).                                     
           02  EKTONRF    PICTURE X.                                            
           02  FILLER REDEFINES EKTONRF.                                        
             03 EKTONRA    PICTURE X.                                           
           02  EKTONRI  PIC X(20).                                              
           02  EBVINHL    COMP  PIC  S9(4).                                     
           02  EBVINHF    PICTURE X.                                            
           02  FILLER REDEFINES EBVINHF.                                        
             03 EBVINHA    PICTURE X.                                           
           02  EBVINHI  PIC X(40).                                              
           02  ESPERREL    COMP  PIC  S9(4).                                    
           02  ESPERREF    PICTURE X.                                           
           02  FILLER REDEFINES ESPERREF.                                       
             03 ESPERREA    PICTURE X.                                          
           02  ESPERREI  PIC X(1).                                              
           02  ATSTSOZL    COMP  PIC  S9(4).                                    
           02  ATSTSOZF    PICTURE X.                                           
           02  FILLER REDEFINES ATSTSOZF.                                       
             03 ATSTSOZA    PICTURE X.                                          
           02  ATSTSOZI  PIC X(16).                                             
           02  ESNRL    COMP  PIC  S9(4).                                       
           02  ESNRF    PICTURE X.                                              
           02  FILLER REDEFINES ESNRF.                                          
             03 ESNRA    PICTURE X.                                             
           02  ESNRI  PIC X(13).                                                
           02  ATSTSTL    COMP  PIC  S9(4).                                     
           02  ATSTSTF    PICTURE X.                                            
           02  FILLER REDEFINES ATSTSTF.                                        
             03 ATSTSTA    PICTURE X.                                           
           02  ATSTSTI  PIC X(15).                                              
           02  ESTSTATL    COMP  PIC  S9(4).                                    
           02  ESTSTATF    PICTURE X.                                           
           02  FILLER REDEFINES ESTSTATF.                                       
             03 ESTSTATA    PICTURE X.                                          
           02  ESTSTATI  PIC X(1).                                              
           02  ATSTEUJL    COMP  PIC  S9(4).                                    
           02  ATSTEUJF    PICTURE X.                                           
           02  FILLER REDEFINES ATSTEUJF.                                       
             03 ATSTEUJA    PICTURE X.                                          
           02  ATSTEUJI  PIC X(3).                                              
           02  ASTJAHRL    COMP  PIC  S9(4).                                    
           02  ASTJAHRF    PICTURE X.                                           
           02  FILLER REDEFINES ASTJAHRF.                                       
             03 ASTJAHRA    PICTURE X.                                          
           02  ASTJAHRI  PIC X(4).                                              
           02  ESCHUDTL    COMP  PIC  S9(4).                                    
           02  ESCHUDTF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHUDTF.                                       
             03 ESCHUDTA    PICTURE X.                                          
           02  ESCHUDTI  PIC X(2).                                              
           02  ESCHUDML    COMP  PIC  S9(4).                                    
           02  ESCHUDMF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHUDMF.                                       
             03 ESCHUDMA    PICTURE X.                                          
           02  ESCHUDMI  PIC X(2).                                              
           02  ESCHUDJL    COMP  PIC  S9(4).                                    
           02  ESCHUDJF    PICTURE X.                                           
           02  FILLER REDEFINES ESCHUDJF.                                       
             03 ESCHUDJA    PICTURE X.                                          
           02  ESCHUDJI  PIC X(4).                                              
           02  EFUEHDTL    COMP  PIC  S9(4).                                    
           02  EFUEHDTF    PICTURE X.                                           
           02  FILLER REDEFINES EFUEHDTF.                                       
             03 EFUEHDTA    PICTURE X.                                          
           02  EFUEHDTI  PIC X(2).                                              
           02  EFUEHDML    COMP  PIC  S9(4).                                    
           02  EFUEHDMF    PICTURE X.                                           
           02  FILLER REDEFINES EFUEHDMF.                                       
             03 EFUEHDMA    PICTURE X.                                          
           02  EFUEHDMI  PIC X(2).                                              
           02  EFUEHDJL    COMP  PIC  S9(4).                                    
           02  EFUEHDJF    PICTURE X.                                           
           02  FILLER REDEFINES EFUEHDJF.                                       
             03 EFUEHDJA    PICTURE X.                                          
           02  EFUEHDJI  PIC X(4).                                              
           02  ATBRANL    COMP  PIC  S9(4).                                     
           02  ATBRANF    PICTURE X.                                            
           02  FILLER REDEFINES ATBRANF.                                        
             03 ATBRANA    PICTURE X.                                           
           02  ATBRANI  PIC X(16).                                              
           02  EBRANCHL    COMP  PIC  S9(4).                                    
           02  EBRANCHF    PICTURE X.                                           
           02  FILLER REDEFINES EBRANCHF.                                       
             03 EBRANCHA    PICTURE X.                                          
           02  EBRANCHI  PIC X(2).                                              
           02  ATUNTL    COMP  PIC  S9(4).                                      
           02  ATUNTF    PICTURE X.                                             
           02  FILLER REDEFINES ATUNTF.                                         
             03 ATUNTA    PICTURE X.                                            
           02  ATUNTI  PIC X(12).                                               
           02  EUNTERNL    COMP  PIC  S9(4).                                    
           02  EUNTERNF    PICTURE X.                                           
           02  FILLER REDEFINES EUNTERNF.                                       
             03 EUNTERNA    PICTURE X.                                          
           02  EUNTERNI  PIC X(2).                                              
           02  ATKUNDEL    COMP  PIC  S9(4).                                    
           02  ATKUNDEF    PICTURE X.                                           
           02  FILLER REDEFINES ATKUNDEF.                                       
             03 ATKUNDEA    PICTURE X.                                          
           02  ATKUNDEI  PIC X(6).                                              
           02  EKUNDEL    COMP  PIC  S9(4).                                     
           02  EKUNDEF    PICTURE X.                                            
           02  FILLER REDEFINES EKUNDEF.                                        
             03 EKUNDEA    PICTURE X.                                           
           02  EKUNDEI  PIC X(1).                                               
           02  ATVMAILL    COMP  PIC  S9(4).                                    
           02  ATVMAILF    PICTURE X.                                           
           02  FILLER REDEFINES ATVMAILF.                                       
             03 ATVMAILA    PICTURE X.                                          
           02  ATVMAILI  PIC X(16).                                             
           02  EVMMAILL    COMP  PIC  S9(4).                                    
           02  EVMMAILF    PICTURE X.                                           
           02  FILLER REDEFINES EVMMAILF.                                       
             03 EVMMAILA    PICTURE X.                                          
           02  EVMMAILI  PIC X(59).                                             
           02  EBESCHRL    COMP  PIC  S9(4).                                    
           02  EBESCHRF    PICTURE X.                                           
           02  FILLER REDEFINES EBESCHRF.                                       
             03 EBESCHRA    PICTURE X.                                          
           02  EBESCHRI  PIC X(1).                                              
           02  ECTVDRL    COMP  PIC  S9(4).                                     
           02  ECTVDRF    PICTURE X.                                            
           02  FILLER REDEFINES ECTVDRF.                                        
             03 ECTVDRA    PICTURE X.                                           
           02  ECTVDRI  PIC X(1).                                               
       01  BVB0016O REDEFINES BVB0016I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  A2STNRO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  A2STPRZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIBANO  PIC X(22).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABICO  PIC X(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  EBLZO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EBANKO  PIC X(40).                                               
           02  FILLER PICTURE X(3).                                             
           02  EKTONRO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBVINHO  PIC X(40).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESPERREO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATSTSOZO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  ESNRO  PIC X(13).                                                
           02  FILLER PICTURE X(3).                                             
           02  ATSTSTO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESTSTATO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATSTEUJO  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTJAHRO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESCHUDTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESCHUDMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ESCHUDJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFUEHDTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFUEHDMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFUEHDJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATBRANO  PIC X(16).                                              
           02  FILLER PICTURE X(3).                                             
           02  EBRANCHO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATUNTO  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  EUNTERNO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ATKUNDEO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  EKUNDEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ATVMAILO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  EVMMAILO  PIC X(59).                                             
           02  FILLER PICTURE X(3).                                             
           02  EBESCHRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ECTVDRO  PIC X(1).                                               
