       01  BVB0060I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ACDARLL    COMP  PIC  S9(4).                                     
           02  ACDARLF    PICTURE X.                                            
           02  FILLER REDEFINES ACDARLF.                                        
             03 ACDARLA    PICTURE X.                                           
           02  ACDARLI  PIC X(1).                                               
           02  ECDARLL    COMP  PIC  S9(4).                                     
           02  ECDARLF    PICTURE X.                                            
           02  FILLER REDEFINES ECDARLF.                                        
             03 ECDARLA    PICTURE X.                                           
           02  ECDARLI  PIC X(1).                                               
           02  ACGRDSTL    COMP  PIC  S9(4).                                    
           02  ACGRDSTF    PICTURE X.                                           
           02  FILLER REDEFINES ACGRDSTF.                                       
             03 ACGRDSTA    PICTURE X.                                          
           02  ACGRDSTI  PIC X(1).                                              
           02  ECGRDSTL    COMP  PIC  S9(4).                                    
           02  ECGRDSTF    PICTURE X.                                           
           02  FILLER REDEFINES ECGRDSTF.                                       
             03 ECGRDSTA    PICTURE X.                                          
           02  ECGRDSTI  PIC X(1).                                              
           02  ACANTSL    COMP  PIC  S9(4).                                     
           02  ACANTSF    PICTURE X.                                            
           02  FILLER REDEFINES ACANTSF.                                        
             03 ACANTSA    PICTURE X.                                           
           02  ACANTSI  PIC X(1).                                               
           02  ECANTSL    COMP  PIC  S9(4).                                     
           02  ECANTSF    PICTURE X.                                            
           02  FILLER REDEFINES ECANTSF.                                        
             03 ECANTSA    PICTURE X.                                           
           02  ECANTSI  PIC X(1).                                               
           02  ACAFOL    COMP  PIC  S9(4).                                      
           02  ACAFOF    PICTURE X.                                             
           02  FILLER REDEFINES ACAFOF.                                         
             03 ACAFOA    PICTURE X.                                            
           02  ACAFOI  PIC X(1).                                                
           02  ECAFOL    COMP  PIC  S9(4).                                      
           02  ECAFOF    PICTURE X.                                             
           02  FILLER REDEFINES ECAFOF.                                         
             03 ECAFOA    PICTURE X.                                            
           02  ECAFOI  PIC X(1).                                                
           02  ACANLBL    COMP  PIC  S9(4).                                     
           02  ACANLBF    PICTURE X.                                            
           02  FILLER REDEFINES ACANLBF.                                        
             03 ACANLBA    PICTURE X.                                           
           02  ACANLBI  PIC X(1).                                               
           02  ECANLBL    COMP  PIC  S9(4).                                     
           02  ECANLBF    PICTURE X.                                            
           02  FILLER REDEFINES ECANLBF.                                        
             03 ECANLBA    PICTURE X.                                           
           02  ECANLBI  PIC X(1).                                               
           02  A34CTXL    COMP  PIC  S9(4).                                     
           02  A34CTXF    PICTURE X.                                            
           02  FILLER REDEFINES A34CTXF.                                        
             03 A34CTXA    PICTURE X.                                           
           02  A34CTXI  PIC X(8).                                               
           02  A34CDATL    COMP  PIC  S9(4).                                    
           02  A34CDATF    PICTURE X.                                           
           02  FILLER REDEFINES A34CDATF.                                       
             03 A34CDATA    PICTURE X.                                          
           02  A34CDATI  PIC X(1).                                              
           02  E34CDTL    COMP  PIC  S9(4).                                     
           02  E34CDTF    PICTURE X.                                            
           02  FILLER REDEFINES E34CDTF.                                        
             03 E34CDTA    PICTURE X.                                           
           02  E34CDTI  PIC X(2).                                               
           02  E34CDML    COMP  PIC  S9(4).                                     
           02  E34CDMF    PICTURE X.                                            
           02  FILLER REDEFINES E34CDMF.                                        
             03 E34CDMA    PICTURE X.                                           
           02  E34CDMI  PIC X(2).                                               
           02  E34CDJL    COMP  PIC  S9(4).                                     
           02  E34CDJF    PICTURE X.                                            
           02  FILLER REDEFINES E34CDJF.                                        
             03 E34CDJA    PICTURE X.                                           
           02  E34CDJI  PIC X(4).                                               
           02  A34CAMTL    COMP  PIC  S9(4).                                    
           02  A34CAMTF    PICTURE X.                                           
           02  FILLER REDEFINES A34CAMTF.                                       
             03 A34CAMTA    PICTURE X.                                          
           02  A34CAMTI  PIC X(1).                                              
           02  E34CAMTL    COMP  PIC  S9(4).                                    
           02  E34CAMTF    PICTURE X.                                           
           02  FILLER REDEFINES E34CAMTF.                                       
             03 E34CAMTA    PICTURE X.                                          
           02  E34CAMTI  PIC X(40).                                             
           02  A34CSTRL    COMP  PIC  S9(4).                                    
           02  A34CSTRF    PICTURE X.                                           
           02  FILLER REDEFINES A34CSTRF.                                       
             03 A34CSTRA    PICTURE X.                                          
           02  A34CSTRI  PIC X(1).                                              
           02  E34CSTRL    COMP  PIC  S9(4).                                    
           02  E34CSTRF    PICTURE X.                                           
           02  FILLER REDEFINES E34CSTRF.                                       
             03 E34CSTRA    PICTURE X.                                          
           02  E34CSTRI  PIC X(40).                                             
           02  A34CPLZL    COMP  PIC  S9(4).                                    
           02  A34CPLZF    PICTURE X.                                           
           02  FILLER REDEFINES A34CPLZF.                                       
             03 A34CPLZA    PICTURE X.                                          
           02  A34CPLZI  PIC X(1).                                              
           02  E34CPLZL    COMP  PIC  S9(4).                                    
           02  E34CPLZF    PICTURE X.                                           
           02  FILLER REDEFINES E34CPLZF.                                       
             03 E34CPLZA    PICTURE X.                                          
           02  E34CPLZI  PIC X(5).                                              
           02  A34CORTL    COMP  PIC  S9(4).                                    
           02  A34CORTF    PICTURE X.                                           
           02  FILLER REDEFINES A34CORTF.                                       
             03 A34CORTA    PICTURE X.                                          
           02  A34CORTI  PIC X(1).                                              
           02  E34CORTL    COMP  PIC  S9(4).                                    
           02  E34CORTF    PICTURE X.                                           
           02  FILLER REDEFINES E34CORTF.                                       
             03 E34CORTA    PICTURE X.                                          
           02  E34CORTI  PIC X(40).                                             
           02  A34FDATL    COMP  PIC  S9(4).                                    
           02  A34FDATF    PICTURE X.                                           
           02  FILLER REDEFINES A34FDATF.                                       
             03 A34FDATA    PICTURE X.                                          
           02  A34FDATI  PIC X(1).                                              
           02  E34FDTL    COMP  PIC  S9(4).                                     
           02  E34FDTF    PICTURE X.                                            
           02  FILLER REDEFINES E34FDTF.                                        
             03 E34FDTA    PICTURE X.                                           
           02  E34FDTI  PIC X(2).                                               
           02  E34FDML    COMP  PIC  S9(4).                                     
           02  E34FDMF    PICTURE X.                                            
           02  FILLER REDEFINES E34FDMF.                                        
             03 E34FDMA    PICTURE X.                                           
           02  E34FDMI  PIC X(2).                                               
           02  E34FDJL    COMP  PIC  S9(4).                                     
           02  E34FDJF    PICTURE X.                                            
           02  FILLER REDEFINES E34FDJF.                                        
             03 E34FDJA    PICTURE X.                                           
           02  E34FDJI  PIC X(4).                                               
           02  A34FAMTL    COMP  PIC  S9(4).                                    
           02  A34FAMTF    PICTURE X.                                           
           02  FILLER REDEFINES A34FAMTF.                                       
             03 A34FAMTA    PICTURE X.                                          
           02  A34FAMTI  PIC X(1).                                              
           02  E34FAMTL    COMP  PIC  S9(4).                                    
           02  E34FAMTF    PICTURE X.                                           
           02  FILLER REDEFINES E34FAMTF.                                       
             03 E34FAMTA    PICTURE X.                                          
           02  E34FAMTI  PIC X(40).                                             
           02  AFREGNRL    COMP  PIC  S9(4).                                    
           02  AFREGNRF    PICTURE X.                                           
           02  FILLER REDEFINES AFREGNRF.                                       
             03 AFREGNRA    PICTURE X.                                          
           02  AFREGNRI  PIC X(1).                                              
           02  EFRGNR1L    COMP  PIC  S9(4).                                    
           02  EFRGNR1F    PICTURE X.                                           
           02  FILLER REDEFINES EFRGNR1F.                                       
             03 EFRGNR1A    PICTURE X.                                          
           02  EFRGNR1I  PIC X(3).                                              
           02  EFRGNR2L    COMP  PIC  S9(4).                                    
           02  EFRGNR2F    PICTURE X.                                           
           02  FILLER REDEFINES EFRGNR2F.                                       
             03 EFRGNR2A    PICTURE X.                                          
           02  EFRGNR2I  PIC X(4).                                              
           02  EFRGNR3L    COMP  PIC  S9(4).                                    
           02  EFRGNR3F    PICTURE X.                                           
           02  FILLER REDEFINES EFRGNR3F.                                       
             03 EFRGNR3A    PICTURE X.                                          
           02  EFRGNR3I  PIC X(2).                                              
           02  A34FSTRL    COMP  PIC  S9(4).                                    
           02  A34FSTRF    PICTURE X.                                           
           02  FILLER REDEFINES A34FSTRF.                                       
             03 A34FSTRA    PICTURE X.                                          
           02  A34FSTRI  PIC X(1).                                              
           02  E34FSTRL    COMP  PIC  S9(4).                                    
           02  E34FSTRF    PICTURE X.                                           
           02  FILLER REDEFINES E34FSTRF.                                       
             03 E34FSTRA    PICTURE X.                                          
           02  E34FSTRI  PIC X(40).                                             
           02  A34FPLZL    COMP  PIC  S9(4).                                    
           02  A34FPLZF    PICTURE X.                                           
           02  FILLER REDEFINES A34FPLZF.                                       
             03 A34FPLZA    PICTURE X.                                          
           02  A34FPLZI  PIC X(1).                                              
           02  E34FPLZL    COMP  PIC  S9(4).                                    
           02  E34FPLZF    PICTURE X.                                           
           02  FILLER REDEFINES E34FPLZF.                                       
             03 E34FPLZA    PICTURE X.                                          
           02  E34FPLZI  PIC X(5).                                              
           02  A34FORTL    COMP  PIC  S9(4).                                    
           02  A34FORTF    PICTURE X.                                           
           02  FILLER REDEFINES A34FORTF.                                       
             03 A34FORTA    PICTURE X.                                          
           02  A34FORTI  PIC X(1).                                              
           02  E34FORTL    COMP  PIC  S9(4).                                    
           02  E34FORTF    PICTURE X.                                           
           02  FILLER REDEFINES E34FORTF.                                       
             03 E34FORTA    PICTURE X.                                          
           02  E34FORTI  PIC X(40).                                             
           02  A34IDATL    COMP  PIC  S9(4).                                    
           02  A34IDATF    PICTURE X.                                           
           02  FILLER REDEFINES A34IDATF.                                       
             03 A34IDATA    PICTURE X.                                          
           02  A34IDATI  PIC X(1).                                              
           02  E34IDTL    COMP  PIC  S9(4).                                     
           02  E34IDTF    PICTURE X.                                            
           02  FILLER REDEFINES E34IDTF.                                        
             03 E34IDTA    PICTURE X.                                           
           02  E34IDTI  PIC X(2).                                               
           02  E34IDML    COMP  PIC  S9(4).                                     
           02  E34IDMF    PICTURE X.                                            
           02  FILLER REDEFINES E34IDMF.                                        
             03 E34IDMA    PICTURE X.                                           
           02  E34IDMI  PIC X(2).                                               
           02  E34IDJL    COMP  PIC  S9(4).                                     
           02  E34IDJF    PICTURE X.                                            
           02  FILLER REDEFINES E34IDJF.                                        
             03 E34IDJA    PICTURE X.                                           
           02  E34IDJI  PIC X(4).                                               
           02  A34IAMTL    COMP  PIC  S9(4).                                    
           02  A34IAMTF    PICTURE X.                                           
           02  FILLER REDEFINES A34IAMTF.                                       
             03 A34IAMTA    PICTURE X.                                          
           02  A34IAMTI  PIC X(1).                                              
           02  E34IAMTL    COMP  PIC  S9(4).                                    
           02  E34IAMTF    PICTURE X.                                           
           02  FILLER REDEFINES E34IAMTF.                                       
             03 E34IAMTA    PICTURE X.                                          
           02  E34IAMTI  PIC X(40).                                             
           02  AIREGNRL    COMP  PIC  S9(4).                                    
           02  AIREGNRF    PICTURE X.                                           
           02  FILLER REDEFINES AIREGNRF.                                       
             03 AIREGNRA    PICTURE X.                                          
           02  AIREGNRI  PIC X(1).                                              
           02  EIRGNR1L    COMP  PIC  S9(4).                                    
           02  EIRGNR1F    PICTURE X.                                           
           02  FILLER REDEFINES EIRGNR1F.                                       
             03 EIRGNR1A    PICTURE X.                                          
           02  EIRGNR1I  PIC X(3).                                              
           02  EIRGNR2L    COMP  PIC  S9(4).                                    
           02  EIRGNR2F    PICTURE X.                                           
           02  FILLER REDEFINES EIRGNR2F.                                       
             03 EIRGNR2A    PICTURE X.                                          
           02  EIRGNR2I  PIC X(4).                                              
           02  EIRGNR3L    COMP  PIC  S9(4).                                    
           02  EIRGNR3F    PICTURE X.                                           
           02  FILLER REDEFINES EIRGNR3F.                                       
             03 EIRGNR3A    PICTURE X.                                          
           02  EIRGNR3I  PIC X(2).                                              
           02  A34ISTRL    COMP  PIC  S9(4).                                    
           02  A34ISTRF    PICTURE X.                                           
           02  FILLER REDEFINES A34ISTRF.                                       
             03 A34ISTRA    PICTURE X.                                          
           02  A34ISTRI  PIC X(1).                                              
           02  E34ISTRL    COMP  PIC  S9(4).                                    
           02  E34ISTRF    PICTURE X.                                           
           02  FILLER REDEFINES E34ISTRF.                                       
             03 E34ISTRA    PICTURE X.                                          
           02  E34ISTRI  PIC X(40).                                             
           02  A34IPLZL    COMP  PIC  S9(4).                                    
           02  A34IPLZF    PICTURE X.                                           
           02  FILLER REDEFINES A34IPLZF.                                       
             03 A34IPLZA    PICTURE X.                                          
           02  A34IPLZI  PIC X(1).                                              
           02  E34IPLZL    COMP  PIC  S9(4).                                    
           02  E34IPLZF    PICTURE X.                                           
           02  FILLER REDEFINES E34IPLZF.                                       
             03 E34IPLZA    PICTURE X.                                          
           02  E34IPLZI  PIC X(5).                                              
           02  A34IORTL    COMP  PIC  S9(4).                                    
           02  A34IORTF    PICTURE X.                                           
           02  FILLER REDEFINES A34IORTF.                                       
             03 A34IORTA    PICTURE X.                                          
           02  A34IORTI  PIC X(1).                                              
           02  E34IORTL    COMP  PIC  S9(4).                                    
           02  E34IORTF    PICTURE X.                                           
           02  FILLER REDEFINES E34IORTF.                                       
             03 E34IORTA    PICTURE X.                                          
           02  E34IORTI  PIC X(40).                                             
           02  ARLAND1L    COMP  PIC  S9(4).                                    
           02  ARLAND1F    PICTURE X.                                           
           02  FILLER REDEFINES ARLAND1F.                                       
             03 ARLAND1A    PICTURE X.                                          
           02  ARLAND1I  PIC X(1).                                              
           02  ERLAND1L    COMP  PIC  S9(4).                                    
           02  ERLAND1F    PICTURE X.                                           
           02  FILLER REDEFINES ERLAND1F.                                       
             03 ERLAND1A    PICTURE X.                                          
           02  ERLAND1I  PIC X(2).                                              
           02  ARLAND2L    COMP  PIC  S9(4).                                    
           02  ARLAND2F    PICTURE X.                                           
           02  FILLER REDEFINES ARLAND2F.                                       
             03 ARLAND2A    PICTURE X.                                          
           02  ARLAND2I  PIC X(1).                                              
           02  ERLAND2L    COMP  PIC  S9(4).                                    
           02  ERLAND2F    PICTURE X.                                           
           02  FILLER REDEFINES ERLAND2F.                                       
             03 ERLAND2A    PICTURE X.                                          
           02  ERLAND2I  PIC X(2).                                              
           02  ARLAND3L    COMP  PIC  S9(4).                                    
           02  ARLAND3F    PICTURE X.                                           
           02  FILLER REDEFINES ARLAND3F.                                       
             03 ARLAND3A    PICTURE X.                                          
           02  ARLAND3I  PIC X(1).                                              
           02  ERLAND3L    COMP  PIC  S9(4).                                    
           02  ERLAND3F    PICTURE X.                                           
           02  FILLER REDEFINES ERLAND3F.                                       
             03 ERLAND3A    PICTURE X.                                          
           02  ERLAND3I  PIC X(2).                                              
           02  ARLAND4L    COMP  PIC  S9(4).                                    
           02  ARLAND4F    PICTURE X.                                           
           02  FILLER REDEFINES ARLAND4F.                                       
             03 ARLAND4A    PICTURE X.                                          
           02  ARLAND4I  PIC X(1).                                              
           02  ERLAND4L    COMP  PIC  S9(4).                                    
           02  ERLAND4F    PICTURE X.                                           
           02  FILLER REDEFINES ERLAND4F.                                       
             03 ERLAND4A    PICTURE X.                                          
           02  ERLAND4I  PIC X(2).                                              
           02  ARLAND5L    COMP  PIC  S9(4).                                    
           02  ARLAND5F    PICTURE X.                                           
           02  FILLER REDEFINES ARLAND5F.                                       
             03 ARLAND5A    PICTURE X.                                          
           02  ARLAND5I  PIC X(1).                                              
           02  ERLAND5L    COMP  PIC  S9(4).                                    
           02  ERLAND5F    PICTURE X.                                           
           02  FILLER REDEFINES ERLAND5F.                                       
             03 ERLAND5A    PICTURE X.                                          
           02  ERLAND5I  PIC X(2).                                              
           02  AREGARTL    COMP  PIC  S9(4).                                    
           02  AREGARTF    PICTURE X.                                           
           02  FILLER REDEFINES AREGARTF.                                       
             03 AREGARTA    PICTURE X.                                          
           02  AREGARTI  PIC X(1).                                              
           02  EREGARTL    COMP  PIC  S9(4).                                    
           02  EREGARTF    PICTURE X.                                           
           02  FILLER REDEFINES EREGARTF.                                       
             03 EREGARTA    PICTURE X.                                          
           02  EREGARTI  PIC X(1).                                              
           02  A34DDATL    COMP  PIC  S9(4).                                    
           02  A34DDATF    PICTURE X.                                           
           02  FILLER REDEFINES A34DDATF.                                       
             03 A34DDATA    PICTURE X.                                          
           02  A34DDATI  PIC X(1).                                              
           02  E34DDTL    COMP  PIC  S9(4).                                     
           02  E34DDTF    PICTURE X.                                            
           02  FILLER REDEFINES E34DDTF.                                        
             03 E34DDTA    PICTURE X.                                           
           02  E34DDTI  PIC X(2).                                               
           02  E34DDML    COMP  PIC  S9(4).                                     
           02  E34DDMF    PICTURE X.                                            
           02  FILLER REDEFINES E34DDMF.                                        
             03 E34DDMA    PICTURE X.                                           
           02  E34DDMI  PIC X(2).                                               
           02  E34DDJL    COMP  PIC  S9(4).                                     
           02  E34DDJF    PICTURE X.                                            
           02  FILLER REDEFINES E34DDJF.                                        
             03 E34DDJA    PICTURE X.                                           
           02  E34DDJI  PIC X(4).                                               
           02  A34DAMTL    COMP  PIC  S9(4).                                    
           02  A34DAMTF    PICTURE X.                                           
           02  FILLER REDEFINES A34DAMTF.                                       
             03 A34DAMTA    PICTURE X.                                          
           02  A34DAMTI  PIC X(1).                                              
           02  E34DAMTL    COMP  PIC  S9(4).                                    
           02  E34DAMTF    PICTURE X.                                           
           02  FILLER REDEFINES E34DAMTF.                                       
             03 E34DAMTA    PICTURE X.                                          
           02  E34DAMTI  PIC X(40).                                             
           02  ADREGNRL    COMP  PIC  S9(4).                                    
           02  ADREGNRF    PICTURE X.                                           
           02  FILLER REDEFINES ADREGNRF.                                       
             03 ADREGNRA    PICTURE X.                                          
           02  ADREGNRI  PIC X(1).                                              
           02  EDRGNR1L    COMP  PIC  S9(4).                                    
           02  EDRGNR1F    PICTURE X.                                           
           02  FILLER REDEFINES EDRGNR1F.                                       
             03 EDRGNR1A    PICTURE X.                                          
           02  EDRGNR1I  PIC X(4).                                              
           02  EDRGNR2L    COMP  PIC  S9(4).                                    
           02  EDRGNR2F    PICTURE X.                                           
           02  FILLER REDEFINES EDRGNR2F.                                       
             03 EDRGNR2A    PICTURE X.                                          
           02  EDRGNR2I  PIC X(5).                                              
           02  EDRGNR3L    COMP  PIC  S9(4).                                    
           02  EDRGNR3F    PICTURE X.                                           
           02  FILLER REDEFINES EDRGNR3F.                                       
             03 EDRGNR3A    PICTURE X.                                          
           02  EDRGNR3I  PIC X(2).                                              
           02  A34DSTRL    COMP  PIC  S9(4).                                    
           02  A34DSTRF    PICTURE X.                                           
           02  FILLER REDEFINES A34DSTRF.                                       
             03 A34DSTRA    PICTURE X.                                          
           02  A34DSTRI  PIC X(1).                                              
           02  E34DSTRL    COMP  PIC  S9(4).                                    
           02  E34DSTRF    PICTURE X.                                           
           02  FILLER REDEFINES E34DSTRF.                                       
             03 E34DSTRA    PICTURE X.                                          
           02  E34DSTRI  PIC X(40).                                             
           02  A34DPLZL    COMP  PIC  S9(4).                                    
           02  A34DPLZF    PICTURE X.                                           
           02  FILLER REDEFINES A34DPLZF.                                       
             03 A34DPLZA    PICTURE X.                                          
           02  A34DPLZI  PIC X(1).                                              
           02  E34DPLZL    COMP  PIC  S9(4).                                    
           02  E34DPLZF    PICTURE X.                                           
           02  FILLER REDEFINES E34DPLZF.                                       
             03 E34DPLZA    PICTURE X.                                          
           02  E34DPLZI  PIC X(5).                                              
           02  A34DORTL    COMP  PIC  S9(4).                                    
           02  A34DORTF    PICTURE X.                                           
           02  FILLER REDEFINES A34DORTF.                                       
             03 A34DORTA    PICTURE X.                                          
           02  A34DORTI  PIC X(1).                                              
           02  E34DORTL    COMP  PIC  S9(4).                                    
           02  E34DORTF    PICTURE X.                                           
           02  FILLER REDEFINES E34DORTF.                                       
             03 E34DORTA    PICTURE X.                                          
           02  E34DORTI  PIC X(40).                                             
       01  BVB0060O REDEFINES BVB0060I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ACDARLO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ECDARLO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ACGRDSTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ECGRDSTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ACANTSO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ECANTSO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ACAFOO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ECAFOO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ACANLBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ECANLBO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  A34CTXO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  A34CDATO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34CDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34CDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34CDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A34CAMTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34CAMTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34CSTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34CSTRO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34CPLZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34CPLZO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34CORTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34CORTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34FDATO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34FDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34FDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34FDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A34FAMTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34FAMTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AFREGNRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFRGNR1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFRGNR2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EFRGNR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34FSTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34FSTRO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34FPLZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34FPLZO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34FORTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34FORTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34IDATO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34IDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34IDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34IDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A34IAMTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34IAMTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIREGNRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIRGNR1O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIRGNR2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EIRGNR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34ISTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34ISTRO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34IPLZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34IPLZO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34IORTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34IORTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  ARLAND1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERLAND1O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARLAND2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERLAND2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARLAND3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERLAND3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARLAND4O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERLAND4O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ARLAND5O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERLAND5O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  AREGARTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EREGARTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34DDATO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34DDTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34DDMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E34DDJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  A34DAMTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34DAMTO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  ADREGNRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDRGNR1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDRGNR2O  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDRGNR3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34DSTRO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34DSTRO  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  A34DPLZO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34DPLZO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  A34DORTO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  E34DORTO  PIC X(40).                                             
