       01  BVB0062I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZ1L    COMP  PIC  S9(4).                                    
           02  AINFOZ1F    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZ1F.                                       
             03 AINFOZ1A    PICTURE X.                                          
           02  AINFOZ1I  PIC X(52).                                             
           02  AVBNAM1L    COMP  PIC  S9(4).                                    
           02  AVBNAM1F    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAM1F.                                       
             03 AVBNAM1A    PICTURE X.                                          
           02  AVBNAM1I  PIC X(40).                                             
           02  AVBVOR1L    COMP  PIC  S9(4).                                    
           02  AVBVOR1F    PICTURE X.                                           
           02  FILLER REDEFINES AVBVOR1F.                                       
             03 AVBVOR1A    PICTURE X.                                          
           02  AVBVOR1I  PIC X(20).                                             
           02  EAUSWL    COMP  PIC  S9(4).                                      
           02  EAUSWF    PICTURE X.                                             
           02  FILLER REDEFINES EAUSWF.                                         
             03 EAUSWA    PICTURE X.                                            
           02  EAUSWI  PIC X(1).                                                
           02  ESTNR2L    COMP  PIC  S9(4).                                     
           02  ESTNR2F    PICTURE X.                                            
           02  FILLER REDEFINES ESTNR2F.                                        
             03 ESTNR2A    PICTURE X.                                           
           02  ESTNR2I  PIC X(7).                                               
           02  ESTPZ2L    COMP  PIC  S9(4).                                     
           02  ESTPZ2F    PICTURE X.                                            
           02  FILLER REDEFINES ESTPZ2F.                                        
             03 ESTPZ2A    PICTURE X.                                           
           02  ESTPZ2I  PIC X(1).                                               
           02  AINFOZ2L    COMP  PIC  S9(4).                                    
           02  AINFOZ2F    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZ2F.                                       
             03 AINFOZ2A    PICTURE X.                                          
           02  AINFOZ2I  PIC X(52).                                             
           02  AVBNAM2L    COMP  PIC  S9(4).                                    
           02  AVBNAM2F    PICTURE X.                                           
           02  FILLER REDEFINES AVBNAM2F.                                       
             03 AVBNAM2A    PICTURE X.                                          
           02  AVBNAM2I  PIC X(40).                                             
           02  AVBVOR2L    COMP  PIC  S9(4).                                    
           02  AVBVOR2F    PICTURE X.                                           
           02  FILLER REDEFINES AVBVOR2F.                                       
             03 AVBVOR2A    PICTURE X.                                          
           02  AVBVOR2I  PIC X(20).                                             
           02  ENFRML    COMP  PIC  S9(4).                                      
           02  ENFRMF    PICTURE X.                                             
           02  FILLER REDEFINES ENFRMF.                                         
             03 ENFRMA    PICTURE X.                                            
           02  ENFRMI  PIC X(1).                                                
           02  EPROJNRL    COMP  PIC  S9(4).                                    
           02  EPROJNRF    PICTURE X.                                           
           02  FILLER REDEFINES EPROJNRF.                                       
             03 EPROJNRA    PICTURE X.                                          
           02  EPROJNRI  PIC X(10).                                             
           02  ENRVONTL    COMP  PIC  S9(4).                                    
           02  ENRVONTF    PICTURE X.                                           
           02  FILLER REDEFINES ENRVONTF.                                       
             03 ENRVONTA    PICTURE X.                                          
           02  ENRVONTI  PIC X(2).                                              
           02  ENRVONML    COMP  PIC  S9(4).                                    
           02  ENRVONMF    PICTURE X.                                           
           02  FILLER REDEFINES ENRVONMF.                                       
             03 ENRVONMA    PICTURE X.                                          
           02  ENRVONMI  PIC X(2).                                              
           02  ENRVONJL    COMP  PIC  S9(4).                                    
           02  ENRVONJF    PICTURE X.                                           
           02  FILLER REDEFINES ENRVONJF.                                       
             03 ENRVONJA    PICTURE X.                                          
           02  ENRVONJI  PIC X(4).                                              
           02  ENRENDTL    COMP  PIC  S9(4).                                    
           02  ENRENDTF    PICTURE X.                                           
           02  FILLER REDEFINES ENRENDTF.                                       
             03 ENRENDTA    PICTURE X.                                          
           02  ENRENDTI  PIC X(2).                                              
           02  ENRENDML    COMP  PIC  S9(4).                                    
           02  ENRENDMF    PICTURE X.                                           
           02  FILLER REDEFINES ENRENDMF.                                       
             03 ENRENDMA    PICTURE X.                                          
           02  ENRENDMI  PIC X(2).                                              
           02  ENRENDJL    COMP  PIC  S9(4).                                    
           02  ENRENDJF    PICTURE X.                                           
           02  FILLER REDEFINES ENRENDJF.                                       
             03 ENRENDJA    PICTURE X.                                          
           02  ENRENDJI  PIC X(4).                                              
           02  EMO1L    COMP  PIC  S9(4).                                       
           02  EMO1F    PICTURE X.                                              
           02  FILLER REDEFINES EMO1F.                                          
             03 EMO1A    PICTURE X.                                             
           02  EMO1I  PIC X(2).                                                 
           02  EVONT1L    COMP  PIC  S9(4).                                     
           02  EVONT1F    PICTURE X.                                            
           02  FILLER REDEFINES EVONT1F.                                        
             03 EVONT1A    PICTURE X.                                           
           02  EVONT1I  PIC X(2).                                               
           02  EVONM1L    COMP  PIC  S9(4).                                     
           02  EVONM1F    PICTURE X.                                            
           02  FILLER REDEFINES EVONM1F.                                        
             03 EVONM1A    PICTURE X.                                           
           02  EVONM1I  PIC X(2).                                               
           02  EVONJ1L    COMP  PIC  S9(4).                                     
           02  EVONJ1F    PICTURE X.                                            
           02  FILLER REDEFINES EVONJ1F.                                        
             03 EVONJ1A    PICTURE X.                                           
           02  EVONJ1I  PIC X(4).                                               
           02  AVON1L    COMP  PIC  S9(4).                                      
           02  AVON1F    PICTURE X.                                             
           02  FILLER REDEFINES AVON1F.                                         
             03 AVON1A    PICTURE X.                                            
           02  AVON1I  PIC X(10).                                               
           02  EABBTR1L    COMP  PIC  S9(4).                                    
           02  EABBTR1F    PICTURE X.                                           
           02  FILLER REDEFINES EABBTR1F.                                       
             03 EABBTR1A    PICTURE X.                                          
           02  EABBTR1I  PIC X(9).                                              
           02  EMO2L    COMP  PIC  S9(4).                                       
           02  EMO2F    PICTURE X.                                              
           02  FILLER REDEFINES EMO2F.                                          
             03 EMO2A    PICTURE X.                                             
           02  EMO2I  PIC X(2).                                                 
           02  EVONT2L    COMP  PIC  S9(4).                                     
           02  EVONT2F    PICTURE X.                                            
           02  FILLER REDEFINES EVONT2F.                                        
             03 EVONT2A    PICTURE X.                                           
           02  EVONT2I  PIC X(2).                                               
           02  EVONM2L    COMP  PIC  S9(4).                                     
           02  EVONM2F    PICTURE X.                                            
           02  FILLER REDEFINES EVONM2F.                                        
             03 EVONM2A    PICTURE X.                                           
           02  EVONM2I  PIC X(2).                                               
           02  EVONJ2L    COMP  PIC  S9(4).                                     
           02  EVONJ2F    PICTURE X.                                            
           02  FILLER REDEFINES EVONJ2F.                                        
             03 EVONJ2A    PICTURE X.                                           
           02  EVONJ2I  PIC X(4).                                               
           02  AVON2L    COMP  PIC  S9(4).                                      
           02  AVON2F    PICTURE X.                                             
           02  FILLER REDEFINES AVON2F.                                         
             03 AVON2A    PICTURE X.                                            
           02  AVON2I  PIC X(10).                                               
           02  EABBTR2L    COMP  PIC  S9(4).                                    
           02  EABBTR2F    PICTURE X.                                           
           02  FILLER REDEFINES EABBTR2F.                                       
             03 EABBTR2A    PICTURE X.                                          
           02  EABBTR2I  PIC X(9).                                              
           02  EMO3L    COMP  PIC  S9(4).                                       
           02  EMO3F    PICTURE X.                                              
           02  FILLER REDEFINES EMO3F.                                          
             03 EMO3A    PICTURE X.                                             
           02  EMO3I  PIC X(2).                                                 
           02  EVONT3L    COMP  PIC  S9(4).                                     
           02  EVONT3F    PICTURE X.                                            
           02  FILLER REDEFINES EVONT3F.                                        
             03 EVONT3A    PICTURE X.                                           
           02  EVONT3I  PIC X(2).                                               
           02  EVONM3L    COMP  PIC  S9(4).                                     
           02  EVONM3F    PICTURE X.                                            
           02  FILLER REDEFINES EVONM3F.                                        
             03 EVONM3A    PICTURE X.                                           
           02  EVONM3I  PIC X(2).                                               
           02  EVONJ3L    COMP  PIC  S9(4).                                     
           02  EVONJ3F    PICTURE X.                                            
           02  FILLER REDEFINES EVONJ3F.                                        
             03 EVONJ3A    PICTURE X.                                           
           02  EVONJ3I  PIC X(4).                                               
           02  AVON3L    COMP  PIC  S9(4).                                      
           02  AVON3F    PICTURE X.                                             
           02  FILLER REDEFINES AVON3F.                                         
             03 AVON3A    PICTURE X.                                            
           02  AVON3I  PIC X(10).                                               
           02  EABBTR3L    COMP  PIC  S9(4).                                    
           02  EABBTR3F    PICTURE X.                                           
           02  FILLER REDEFINES EABBTR3F.                                       
             03 EABBTR3A    PICTURE X.                                          
           02  EABBTR3I  PIC X(9).                                              
           02  EMO4L    COMP  PIC  S9(4).                                       
           02  EMO4F    PICTURE X.                                              
           02  FILLER REDEFINES EMO4F.                                          
             03 EMO4A    PICTURE X.                                             
           02  EMO4I  PIC X(2).                                                 
           02  EVONT4L    COMP  PIC  S9(4).                                     
           02  EVONT4F    PICTURE X.                                            
           02  FILLER REDEFINES EVONT4F.                                        
             03 EVONT4A    PICTURE X.                                           
           02  EVONT4I  PIC X(2).                                               
           02  EVONM4L    COMP  PIC  S9(4).                                     
           02  EVONM4F    PICTURE X.                                            
           02  FILLER REDEFINES EVONM4F.                                        
             03 EVONM4A    PICTURE X.                                           
           02  EVONM4I  PIC X(2).                                               
           02  EVONJ4L    COMP  PIC  S9(4).                                     
           02  EVONJ4F    PICTURE X.                                            
           02  FILLER REDEFINES EVONJ4F.                                        
             03 EVONJ4A    PICTURE X.                                           
           02  EVONJ4I  PIC X(4).                                               
           02  AVON4L    COMP  PIC  S9(4).                                      
           02  AVON4F    PICTURE X.                                             
           02  FILLER REDEFINES AVON4F.                                         
             03 AVON4A    PICTURE X.                                            
           02  AVON4I  PIC X(10).                                               
           02  EABBTR4L    COMP  PIC  S9(4).                                    
           02  EABBTR4F    PICTURE X.                                           
           02  FILLER REDEFINES EABBTR4F.                                       
             03 EABBTR4A    PICTURE X.                                          
           02  EABBTR4I  PIC X(9).                                              
           02  EMO5L    COMP  PIC  S9(4).                                       
           02  EMO5F    PICTURE X.                                              
           02  FILLER REDEFINES EMO5F.                                          
             03 EMO5A    PICTURE X.                                             
           02  EMO5I  PIC X(2).                                                 
           02  EVONT5L    COMP  PIC  S9(4).                                     
           02  EVONT5F    PICTURE X.                                            
           02  FILLER REDEFINES EVONT5F.                                        
             03 EVONT5A    PICTURE X.                                           
           02  EVONT5I  PIC X(2).                                               
           02  EVONM5L    COMP  PIC  S9(4).                                     
           02  EVONM5F    PICTURE X.                                            
           02  FILLER REDEFINES EVONM5F.                                        
             03 EVONM5A    PICTURE X.                                           
           02  EVONM5I  PIC X(2).                                               
           02  EVONJ5L    COMP  PIC  S9(4).                                     
           02  EVONJ5F    PICTURE X.                                            
           02  FILLER REDEFINES EVONJ5F.                                        
             03 EVONJ5A    PICTURE X.                                           
           02  EVONJ5I  PIC X(4).                                               
           02  AVON5L    COMP  PIC  S9(4).                                      
           02  AVON5F    PICTURE X.                                             
           02  FILLER REDEFINES AVON5F.                                         
             03 AVON5A    PICTURE X.                                            
           02  AVON5I  PIC X(10).                                               
           02  EABBTR5L    COMP  PIC  S9(4).                                    
           02  EABBTR5F    PICTURE X.                                           
           02  FILLER REDEFINES EABBTR5F.                                       
             03 EABBTR5A    PICTURE X.                                          
           02  EABBTR5I  PIC X(9).                                              
           02  EMO6L    COMP  PIC  S9(4).                                       
           02  EMO6F    PICTURE X.                                              
           02  FILLER REDEFINES EMO6F.                                          
             03 EMO6A    PICTURE X.                                             
           02  EMO6I  PIC X(2).                                                 
           02  EVONT6L    COMP  PIC  S9(4).                                     
           02  EVONT6F    PICTURE X.                                            
           02  FILLER REDEFINES EVONT6F.                                        
             03 EVONT6A    PICTURE X.                                           
           02  EVONT6I  PIC X(2).                                               
           02  EVONM6L    COMP  PIC  S9(4).                                     
           02  EVONM6F    PICTURE X.                                            
           02  FILLER REDEFINES EVONM6F.                                        
             03 EVONM6A    PICTURE X.                                           
           02  EVONM6I  PIC X(2).                                               
           02  EVONJ6L    COMP  PIC  S9(4).                                     
           02  EVONJ6F    PICTURE X.                                            
           02  FILLER REDEFINES EVONJ6F.                                        
             03 EVONJ6A    PICTURE X.                                           
           02  EVONJ6I  PIC X(4).                                               
           02  AVON6L    COMP  PIC  S9(4).                                      
           02  AVON6F    PICTURE X.                                             
           02  FILLER REDEFINES AVON6F.                                         
             03 AVON6A    PICTURE X.                                            
           02  AVON6I  PIC X(10).                                               
           02  EABBTR6L    COMP  PIC  S9(4).                                    
           02  EABBTR6F    PICTURE X.                                           
           02  FILLER REDEFINES EABBTR6F.                                       
             03 EABBTR6A    PICTURE X.                                          
           02  EABBTR6I  PIC X(9).                                              
           02  EZAHL1TL    COMP  PIC  S9(4).                                    
           02  EZAHL1TF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL1TF.                                       
             03 EZAHL1TA    PICTURE X.                                          
           02  EZAHL1TI  PIC X(2).                                              
           02  EZAHL1ML    COMP  PIC  S9(4).                                    
           02  EZAHL1MF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL1MF.                                       
             03 EZAHL1MA    PICTURE X.                                          
           02  EZAHL1MI  PIC X(2).                                              
           02  EZAHL1JL    COMP  PIC  S9(4).                                    
           02  EZAHL1JF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL1JF.                                       
             03 EZAHL1JA    PICTURE X.                                          
           02  EZAHL1JI  PIC X(4).                                              
           02  EZAHL2TL    COMP  PIC  S9(4).                                    
           02  EZAHL2TF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL2TF.                                       
             03 EZAHL2TA    PICTURE X.                                          
           02  EZAHL2TI  PIC X(2).                                              
           02  EZAHL2ML    COMP  PIC  S9(4).                                    
           02  EZAHL2MF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL2MF.                                       
             03 EZAHL2MA    PICTURE X.                                          
           02  EZAHL2MI  PIC X(2).                                              
           02  EZAHL2JL    COMP  PIC  S9(4).                                    
           02  EZAHL2JF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL2JF.                                       
             03 EZAHL2JA    PICTURE X.                                          
           02  EZAHL2JI  PIC X(4).                                              
           02  EZAHL3TL    COMP  PIC  S9(4).                                    
           02  EZAHL3TF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL3TF.                                       
             03 EZAHL3TA    PICTURE X.                                          
           02  EZAHL3TI  PIC X(2).                                              
           02  EZAHL3ML    COMP  PIC  S9(4).                                    
           02  EZAHL3MF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL3MF.                                       
             03 EZAHL3MA    PICTURE X.                                          
           02  EZAHL3MI  PIC X(2).                                              
           02  EZAHL3JL    COMP  PIC  S9(4).                                    
           02  EZAHL3JF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL3JF.                                       
             03 EZAHL3JA    PICTURE X.                                          
           02  EZAHL3JI  PIC X(4).                                              
           02  EZAHL4TL    COMP  PIC  S9(4).                                    
           02  EZAHL4TF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL4TF.                                       
             03 EZAHL4TA    PICTURE X.                                          
           02  EZAHL4TI  PIC X(2).                                              
           02  EZAHL4ML    COMP  PIC  S9(4).                                    
           02  EZAHL4MF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL4MF.                                       
             03 EZAHL4MA    PICTURE X.                                          
           02  EZAHL4MI  PIC X(2).                                              
           02  EZAHL4JL    COMP  PIC  S9(4).                                    
           02  EZAHL4JF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL4JF.                                       
             03 EZAHL4JA    PICTURE X.                                          
           02  EZAHL4JI  PIC X(4).                                              
           02  EZAHL5TL    COMP  PIC  S9(4).                                    
           02  EZAHL5TF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL5TF.                                       
             03 EZAHL5TA    PICTURE X.                                          
           02  EZAHL5TI  PIC X(2).                                              
           02  EZAHL5ML    COMP  PIC  S9(4).                                    
           02  EZAHL5MF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL5MF.                                       
             03 EZAHL5MA    PICTURE X.                                          
           02  EZAHL5MI  PIC X(2).                                              
           02  EZAHL5JL    COMP  PIC  S9(4).                                    
           02  EZAHL5JF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL5JF.                                       
             03 EZAHL5JA    PICTURE X.                                          
           02  EZAHL5JI  PIC X(4).                                              
           02  EZAHL1BL    COMP  PIC  S9(4).                                    
           02  EZAHL1BF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL1BF.                                       
             03 EZAHL1BA    PICTURE X.                                          
           02  EZAHL1BI  PIC X(9).                                              
           02  EZAHL2BL    COMP  PIC  S9(4).                                    
           02  EZAHL2BF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL2BF.                                       
             03 EZAHL2BA    PICTURE X.                                          
           02  EZAHL2BI  PIC X(9).                                              
           02  EZAHL3BL    COMP  PIC  S9(4).                                    
           02  EZAHL3BF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL3BF.                                       
             03 EZAHL3BA    PICTURE X.                                          
           02  EZAHL3BI  PIC X(9).                                              
           02  EZAHL4BL    COMP  PIC  S9(4).                                    
           02  EZAHL4BF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL4BF.                                       
             03 EZAHL4BA    PICTURE X.                                          
           02  EZAHL4BI  PIC X(9).                                              
           02  EZAHL5BL    COMP  PIC  S9(4).                                    
           02  EZAHL5BF    PICTURE X.                                           
           02  FILLER REDEFINES EZAHL5BF.                                       
             03 EZAHL5BA    PICTURE X.                                          
           02  EZAHL5BI  PIC X(9).                                              
       01  BVB0062O REDEFINES BVB0062I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZ1O  PIC X(52).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBNAM1O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBVOR1O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  EAUSWO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNR2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  ESTPZ2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZ2O  PIC X(52).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBNAM2O  PIC X(40).                                             
           02  FILLER PICTURE X(3).                                             
           02  AVBVOR2O  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ENFRMO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROJNRO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ENRVONTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENRVONMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENRVONJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENRENDTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENRENDMO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  ENRENDJO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMO1O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVONT1O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONM1O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJ1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVON1O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABBTR1O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMO2O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVONT2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONM2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJ2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVON2O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABBTR2O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMO3O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVONT3O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONM3O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJ3O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVON3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABBTR3O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMO4O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVONT4O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONM4O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJ4O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVON4O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABBTR4O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMO5O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVONT5O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONM5O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJ5O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVON5O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABBTR5O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EMO6O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVONT6O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONM6O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  EVONJ6O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVON6O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  EABBTR6O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL1TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL1MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL1JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL2TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL2MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL2JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL3TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL3MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL3JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL4TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL4MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL4JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL5TO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL5MO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL5JO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL1BO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL2BO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL3BO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL4BO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  EZAHL5BO  PIC X(9).                                              
