      *   Micro Focus Enterprise Developer for Eclipse  5.0.00256
      *   Micro Focus BMS Screen Painter (ver BMSIDE_5-0-01)
      *   MapSet Name   BVB0054
      *   Date Created  03/14/2022
      *   Time Created  09:08:23

      *  Input Data For Map BVB0054
         01 BVB0054I.
            03 FILLER                         PIC X(12).
            03 EFUNKL                         PIC S9(4) COMP.
            03 EFUNKF                         PIC X.
            03 FILLER REDEFINES EFUNKF.
               05 EFUNKA                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFUNKI                         PIC X(1).
            03 ATXT1L                         PIC S9(4) COMP.
            03 ATXT1F                         PIC X.
            03 FILLER REDEFINES ATXT1F.
               05 ATXT1A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ATXT1I                         PIC X(45).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER REDEFINES ESEIAKTF.
               05 ESEIAKTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(3).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER REDEFINES ASEIGESF.
               05 ASEIGESA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(3).
            03 ATXT2L                         PIC S9(4) COMP.
            03 ATXT2F                         PIC X.
            03 FILLER REDEFINES ATXT2F.
               05 ATXT2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ATXT2I                         PIC X(3).
            03 EFC1L                          PIC S9(4) COMP.
            03 EFC1F                          PIC X.
            03 FILLER REDEFINES EFC1F.
               05 EFC1A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC1I                          PIC X(1).
            03 ADG1L                          PIC S9(4) COMP.
            03 ADG1F                          PIC X.
            03 FILLER REDEFINES ADG1F.
               05 ADG1A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG1I                          PIC X(10).
            03 ADIR1L                         PIC S9(4) COMP.
            03 ADIR1F                         PIC X.
            03 FILLER REDEFINES ADIR1F.
               05 ADIR1A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR1I                         PIC X(3).
            03 EANR1L                         PIC S9(4) COMP.
            03 EANR1F                         PIC X.
            03 FILLER REDEFINES EANR1F.
               05 EANR1A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR1I                         PIC X(4).
            03 ETIT1L                         PIC S9(4) COMP.
            03 ETIT1F                         PIC X.
            03 FILLER REDEFINES ETIT1F.
               05 ETIT1A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT1I                         PIC X(5).
            03 EVNAM1L                        PIC S9(4) COMP.
            03 EVNAM1F                        PIC X.
            03 FILLER REDEFINES EVNAM1F.
               05 EVNAM1A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM1I                        PIC X(15).
            03 ENNAM1L                        PIC S9(4) COMP.
            03 ENNAM1F                        PIC X.
            03 FILLER REDEFINES ENNAM1F.
               05 ENNAM1A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM1I                        PIC X(20).
            03 EFC2L                          PIC S9(4) COMP.
            03 EFC2F                          PIC X.
            03 FILLER REDEFINES EFC2F.
               05 EFC2A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC2I                          PIC X(1).
            03 ADG2L                          PIC S9(4) COMP.
            03 ADG2F                          PIC X.
            03 FILLER REDEFINES ADG2F.
               05 ADG2A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG2I                          PIC X(10).
            03 ADIR2L                         PIC S9(4) COMP.
            03 ADIR2F                         PIC X.
            03 FILLER REDEFINES ADIR2F.
               05 ADIR2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR2I                         PIC X(3).
            03 EANR2L                         PIC S9(4) COMP.
            03 EANR2F                         PIC X.
            03 FILLER REDEFINES EANR2F.
               05 EANR2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR2I                         PIC X(4).
            03 ETIT2L                         PIC S9(4) COMP.
            03 ETIT2F                         PIC X.
            03 FILLER REDEFINES ETIT2F.
               05 ETIT2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT2I                         PIC X(5).
            03 EVNAM3L                        PIC S9(4) COMP.
            03 EVNAM3F                        PIC X.
            03 FILLER REDEFINES EVNAM3F.
               05 EVNAM3A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM3I                        PIC X(15).
            03 ENNAM2L                        PIC S9(4) COMP.
            03 ENNAM2F                        PIC X.
            03 FILLER REDEFINES ENNAM2F.
               05 ENNAM2A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM2I                        PIC X(20).
            03 EFC3L                          PIC S9(4) COMP.
            03 EFC3F                          PIC X.
            03 FILLER REDEFINES EFC3F.
               05 EFC3A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC3I                          PIC X(1).
            03 ADG3L                          PIC S9(4) COMP.
            03 ADG3F                          PIC X.
            03 FILLER REDEFINES ADG3F.
               05 ADG3A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG3I                          PIC X(10).
            03 ADIR3L                         PIC S9(4) COMP.
            03 ADIR3F                         PIC X.
            03 FILLER REDEFINES ADIR3F.
               05 ADIR3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR3I                         PIC X(3).
            03 EANR3L                         PIC S9(4) COMP.
            03 EANR3F                         PIC X.
            03 FILLER REDEFINES EANR3F.
               05 EANR3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR3I                         PIC X(4).
            03 ETIT3L                         PIC S9(4) COMP.
            03 ETIT3F                         PIC X.
            03 FILLER REDEFINES ETIT3F.
               05 ETIT3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT3I                         PIC X(5).
            03 EVNAM4L                        PIC S9(4) COMP.
            03 EVNAM4F                        PIC X.
            03 FILLER REDEFINES EVNAM4F.
               05 EVNAM4A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM4I                        PIC X(15).
            03 ENNAM3L                        PIC S9(4) COMP.
            03 ENNAM3F                        PIC X.
            03 FILLER REDEFINES ENNAM3F.
               05 ENNAM3A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM3I                        PIC X(20).
            03 EFC4L                          PIC S9(4) COMP.
            03 EFC4F                          PIC X.
            03 FILLER REDEFINES EFC4F.
               05 EFC4A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC4I                          PIC X(1).
            03 ADG4L                          PIC S9(4) COMP.
            03 ADG4F                          PIC X.
            03 FILLER REDEFINES ADG4F.
               05 ADG4A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG4I                          PIC X(10).
            03 ADIR4L                         PIC S9(4) COMP.
            03 ADIR4F                         PIC X.
            03 FILLER REDEFINES ADIR4F.
               05 ADIR4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR4I                         PIC X(3).
            03 EANR4L                         PIC S9(4) COMP.
            03 EANR4F                         PIC X.
            03 FILLER REDEFINES EANR4F.
               05 EANR4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR4I                         PIC X(4).
            03 ETIT4L                         PIC S9(4) COMP.
            03 ETIT4F                         PIC X.
            03 FILLER REDEFINES ETIT4F.
               05 ETIT4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT4I                         PIC X(5).
            03 EVNAM5L                        PIC S9(4) COMP.
            03 EVNAM5F                        PIC X.
            03 FILLER REDEFINES EVNAM5F.
               05 EVNAM5A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM5I                        PIC X(15).
            03 ENNAM4L                        PIC S9(4) COMP.
            03 ENNAM4F                        PIC X.
            03 FILLER REDEFINES ENNAM4F.
               05 ENNAM4A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM4I                        PIC X(20).
            03 EFC5L                          PIC S9(4) COMP.
            03 EFC5F                          PIC X.
            03 FILLER REDEFINES EFC5F.
               05 EFC5A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC5I                          PIC X(1).
            03 ADG5L                          PIC S9(4) COMP.
            03 ADG5F                          PIC X.
            03 FILLER REDEFINES ADG5F.
               05 ADG5A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG5I                          PIC X(10).
            03 ADIR5L                         PIC S9(4) COMP.
            03 ADIR5F                         PIC X.
            03 FILLER REDEFINES ADIR5F.
               05 ADIR5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR5I                         PIC X(3).
            03 EANR5L                         PIC S9(4) COMP.
            03 EANR5F                         PIC X.
            03 FILLER REDEFINES EANR5F.
               05 EANR5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR5I                         PIC X(4).
            03 ETIT5L                         PIC S9(4) COMP.
            03 ETIT5F                         PIC X.
            03 FILLER REDEFINES ETIT5F.
               05 ETIT5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT5I                         PIC X(5).
            03 EVNAM6L                        PIC S9(4) COMP.
            03 EVNAM6F                        PIC X.
            03 FILLER REDEFINES EVNAM6F.
               05 EVNAM6A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM6I                        PIC X(15).
            03 ENNAM5L                        PIC S9(4) COMP.
            03 ENNAM5F                        PIC X.
            03 FILLER REDEFINES ENNAM5F.
               05 ENNAM5A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM5I                        PIC X(20).
            03 EFC6L                          PIC S9(4) COMP.
            03 EFC6F                          PIC X.
            03 FILLER REDEFINES EFC6F.
               05 EFC6A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC6I                          PIC X(1).
            03 ADG6L                          PIC S9(4) COMP.
            03 ADG6F                          PIC X.
            03 FILLER REDEFINES ADG6F.
               05 ADG6A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG6I                          PIC X(10).
            03 ADIR6L                         PIC S9(4) COMP.
            03 ADIR6F                         PIC X.
            03 FILLER REDEFINES ADIR6F.
               05 ADIR6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR6I                         PIC X(3).
            03 EANR6L                         PIC S9(4) COMP.
            03 EANR6F                         PIC X.
            03 FILLER REDEFINES EANR6F.
               05 EANR6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR6I                         PIC X(4).
            03 ETIT6L                         PIC S9(4) COMP.
            03 ETIT6F                         PIC X.
            03 FILLER REDEFINES ETIT6F.
               05 ETIT6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT6I                         PIC X(5).
            03 EVNAM7L                        PIC S9(4) COMP.
            03 EVNAM7F                        PIC X.
            03 FILLER REDEFINES EVNAM7F.
               05 EVNAM7A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM7I                        PIC X(15).
            03 ENNAM6L                        PIC S9(4) COMP.
            03 ENNAM6F                        PIC X.
            03 FILLER REDEFINES ENNAM6F.
               05 ENNAM6A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM6I                        PIC X(20).
            03 EFC7L                          PIC S9(4) COMP.
            03 EFC7F                          PIC X.
            03 FILLER REDEFINES EFC7F.
               05 EFC7A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC7I                          PIC X(1).
            03 ADG7L                          PIC S9(4) COMP.
            03 ADG7F                          PIC X.
            03 FILLER REDEFINES ADG7F.
               05 ADG7A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG7I                          PIC X(10).
            03 ADIR7L                         PIC S9(4) COMP.
            03 ADIR7F                         PIC X.
            03 FILLER REDEFINES ADIR7F.
               05 ADIR7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR7I                         PIC X(3).
            03 EANR7L                         PIC S9(4) COMP.
            03 EANR7F                         PIC X.
            03 FILLER REDEFINES EANR7F.
               05 EANR7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR7I                         PIC X(4).
            03 ETIT7L                         PIC S9(4) COMP.
            03 ETIT7F                         PIC X.
            03 FILLER REDEFINES ETIT7F.
               05 ETIT7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT7I                         PIC X(5).
            03 EVNAM8L                        PIC S9(4) COMP.
            03 EVNAM8F                        PIC X.
            03 FILLER REDEFINES EVNAM8F.
               05 EVNAM8A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM8I                        PIC X(15).
            03 ENNAM7L                        PIC S9(4) COMP.
            03 ENNAM7F                        PIC X.
            03 FILLER REDEFINES ENNAM7F.
               05 ENNAM7A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM7I                        PIC X(20).
            03 EFC8L                          PIC S9(4) COMP.
            03 EFC8F                          PIC X.
            03 FILLER REDEFINES EFC8F.
               05 EFC8A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC8I                          PIC X(1).
            03 ADG8L                          PIC S9(4) COMP.
            03 ADG8F                          PIC X.
            03 FILLER REDEFINES ADG8F.
               05 ADG8A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG8I                          PIC X(10).
            03 ADIR8L                         PIC S9(4) COMP.
            03 ADIR8F                         PIC X.
            03 FILLER REDEFINES ADIR8F.
               05 ADIR8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR8I                         PIC X(3).
            03 EANR8L                         PIC S9(4) COMP.
            03 EANR8F                         PIC X.
            03 FILLER REDEFINES EANR8F.
               05 EANR8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR8I                         PIC X(4).
            03 ETIT8L                         PIC S9(4) COMP.
            03 ETIT8F                         PIC X.
            03 FILLER REDEFINES ETIT8F.
               05 ETIT8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT8I                         PIC X(5).
            03 EVNAM9L                        PIC S9(4) COMP.
            03 EVNAM9F                        PIC X.
            03 FILLER REDEFINES EVNAM9F.
               05 EVNAM9A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM9I                        PIC X(15).
            03 ENNAM8L                        PIC S9(4) COMP.
            03 ENNAM8F                        PIC X.
            03 FILLER REDEFINES ENNAM8F.
               05 ENNAM8A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM8I                        PIC X(20).
            03 EFC9L                          PIC S9(4) COMP.
            03 EFC9F                          PIC X.
            03 FILLER REDEFINES EFC9F.
               05 EFC9A                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFC9I                          PIC X(1).
            03 ADG9L                          PIC S9(4) COMP.
            03 ADG9F                          PIC X.
            03 FILLER REDEFINES ADG9F.
               05 ADG9A                          PIC X.
            03 FILLER                         PIC X(1).
            03 ADG9I                          PIC X(10).
            03 ADIR9L                         PIC S9(4) COMP.
            03 ADIR9F                         PIC X.
            03 FILLER REDEFINES ADIR9F.
               05 ADIR9A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR9I                         PIC X(3).
            03 EANR9L                         PIC S9(4) COMP.
            03 EANR9F                         PIC X.
            03 FILLER REDEFINES EANR9F.
               05 EANR9A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EANR9I                         PIC X(4).
            03 ETIT9L                         PIC S9(4) COMP.
            03 ETIT9F                         PIC X.
            03 FILLER REDEFINES ETIT9F.
               05 ETIT9A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT9I                         PIC X(5).
            03 EVNAM12L                       PIC S9(4) COMP.
            03 EVNAM12F                       PIC X.
            03 FILLER REDEFINES EVNAM12F.
               05 EVNAM12A                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM12I                       PIC X(15).
            03 ENNAM9L                        PIC S9(4) COMP.
            03 ENNAM9F                        PIC X.
            03 FILLER REDEFINES ENNAM9F.
               05 ENNAM9A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM9I                        PIC X(20).
            03 EFC12L                         PIC S9(4) COMP.
            03 EFC12F                         PIC X.
            03 FILLER REDEFINES EFC12F.
               05 EFC12A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFC12I                         PIC X(1).
            03 ADG12L                         PIC S9(4) COMP.
            03 ADG12F                         PIC X.
            03 FILLER REDEFINES ADG12F.
               05 ADG12A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADG12I                         PIC X(10).
            03 ADIR12L                        PIC S9(4) COMP.
            03 ADIR12F                        PIC X.
            03 FILLER REDEFINES ADIR12F.
               05 ADIR12A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR12I                        PIC X(3).
            03 EANR12L                        PIC S9(4) COMP.
            03 EANR12F                        PIC X.
            03 FILLER REDEFINES EANR12F.
               05 EANR12A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EANR12I                        PIC X(4).
            03 ETIT12L                        PIC S9(4) COMP.
            03 ETIT12F                        PIC X.
            03 FILLER REDEFINES ETIT12F.
               05 ETIT12A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT12I                        PIC X(5).
            03 EVNAM13L                       PIC S9(4) COMP.
            03 EVNAM13F                       PIC X.
            03 FILLER REDEFINES EVNAM13F.
               05 EVNAM13A                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM13I                       PIC X(15).
            03 ENNAM12L                       PIC S9(4) COMP.
            03 ENNAM12F                       PIC X.
            03 FILLER REDEFINES ENNAM12F.
               05 ENNAM12A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM12I                       PIC X(20).
            03 EFC13L                         PIC S9(4) COMP.
            03 EFC13F                         PIC X.
            03 FILLER REDEFINES EFC13F.
               05 EFC13A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFC13I                         PIC X(1).
            03 ADG13L                         PIC S9(4) COMP.
            03 ADG13F                         PIC X.
            03 FILLER REDEFINES ADG13F.
               05 ADG13A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADG13I                         PIC X(10).
            03 ADIR13L                        PIC S9(4) COMP.
            03 ADIR13F                        PIC X.
            03 FILLER REDEFINES ADIR13F.
               05 ADIR13A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR13I                        PIC X(3).
            03 EANR13L                        PIC S9(4) COMP.
            03 EANR13F                        PIC X.
            03 FILLER REDEFINES EANR13F.
               05 EANR13A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EANR13I                        PIC X(4).
            03 ETIT13L                        PIC S9(4) COMP.
            03 ETIT13F                        PIC X.
            03 FILLER REDEFINES ETIT13F.
               05 ETIT13A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT13I                        PIC X(5).
            03 EVNAM14L                       PIC S9(4) COMP.
            03 EVNAM14F                       PIC X.
            03 FILLER REDEFINES EVNAM14F.
               05 EVNAM14A                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM14I                       PIC X(15).
            03 ENNAM13L                       PIC S9(4) COMP.
            03 ENNAM13F                       PIC X.
            03 FILLER REDEFINES ENNAM13F.
               05 ENNAM13A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM13I                       PIC X(20).
            03 EFC14L                         PIC S9(4) COMP.
            03 EFC14F                         PIC X.
            03 FILLER REDEFINES EFC14F.
               05 EFC14A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFC14I                         PIC X(1).
            03 ADG14L                         PIC S9(4) COMP.
            03 ADG14F                         PIC X.
            03 FILLER REDEFINES ADG14F.
               05 ADG14A                         PIC X.
            03 FILLER                         PIC X(1).
            03 ADG14I                         PIC X(10).
            03 ADIR14L                        PIC S9(4) COMP.
            03 ADIR14F                        PIC X.
            03 FILLER REDEFINES ADIR14F.
               05 ADIR14A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ADIR14I                        PIC X(3).
            03 EANR14L                        PIC S9(4) COMP.
            03 EANR14F                        PIC X.
            03 FILLER REDEFINES EANR14F.
               05 EANR14A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EANR14I                        PIC X(4).
            03 ETIT14L                        PIC S9(4) COMP.
            03 ETIT14F                        PIC X.
            03 FILLER REDEFINES ETIT14F.
               05 ETIT14A                        PIC X.
            03 FILLER                         PIC X(1).
            03 ETIT14I                        PIC X(5).
            03 EVNAM15L                       PIC S9(4) COMP.
            03 EVNAM15F                       PIC X.
            03 FILLER REDEFINES EVNAM15F.
               05 EVNAM15A                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVNAM15I                       PIC X(15).
            03 ENNAM14L                       PIC S9(4) COMP.
            03 ENNAM14F                       PIC X.
            03 FILLER REDEFINES ENNAM14F.
               05 ENNAM14A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ENNAM14I                       PIC X(20).
            03 AMAILTL                        PIC S9(4) COMP.
            03 AMAILTF                        PIC X.
            03 FILLER REDEFINES AMAILTF.
               05 AMAILTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AMAILTI                        PIC X(30).
            03 EMAILL                         PIC S9(4) COMP.
            03 EMAILF                         PIC X.
            03 FILLER REDEFINES EMAILF.
               05 EMAILA                         PIC X.
            03 FILLER                         PIC X(1).
            03 EMAILI                         PIC X(46).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER REDEFINES AFCANZF.
               05 AFCANZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(76).

      *  Output Data For Map BVB0054
         01 BVB0054O REDEFINES BVB0054I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 EFUNKH                         PIC X.
            03 EFUNKO                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ATXT1H                         PIC X.
            03 ATXT1O                         PIC X(45).
            03 FILLER                         PIC X(3).
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ATXT2H                         PIC X.
            03 ATXT2O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFC1H                          PIC X.
            03 EFC1O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG1H                          PIC X.
            03 ADG1O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR1H                         PIC X.
            03 ADIR1O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR1H                         PIC X.
            03 EANR1O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT1H                         PIC X.
            03 ETIT1O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM1H                        PIC X.
            03 EVNAM1O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM1H                        PIC X.
            03 ENNAM1O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC2H                          PIC X.
            03 EFC2O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG2H                          PIC X.
            03 ADG2O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR2H                         PIC X.
            03 ADIR2O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR2H                         PIC X.
            03 EANR2O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT2H                         PIC X.
            03 ETIT2O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM3H                        PIC X.
            03 EVNAM3O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM2H                        PIC X.
            03 ENNAM2O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC3H                          PIC X.
            03 EFC3O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG3H                          PIC X.
            03 ADG3O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR3H                         PIC X.
            03 ADIR3O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR3H                         PIC X.
            03 EANR3O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT3H                         PIC X.
            03 ETIT3O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM4H                        PIC X.
            03 EVNAM4O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM3H                        PIC X.
            03 ENNAM3O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC4H                          PIC X.
            03 EFC4O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG4H                          PIC X.
            03 ADG4O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR4H                         PIC X.
            03 ADIR4O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR4H                         PIC X.
            03 EANR4O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT4H                         PIC X.
            03 ETIT4O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM5H                        PIC X.
            03 EVNAM5O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM4H                        PIC X.
            03 ENNAM4O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC5H                          PIC X.
            03 EFC5O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG5H                          PIC X.
            03 ADG5O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR5H                         PIC X.
            03 ADIR5O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR5H                         PIC X.
            03 EANR5O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT5H                         PIC X.
            03 ETIT5O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM6H                        PIC X.
            03 EVNAM6O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM5H                        PIC X.
            03 ENNAM5O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC6H                          PIC X.
            03 EFC6O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG6H                          PIC X.
            03 ADG6O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR6H                         PIC X.
            03 ADIR6O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR6H                         PIC X.
            03 EANR6O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT6H                         PIC X.
            03 ETIT6O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM7H                        PIC X.
            03 EVNAM7O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM6H                        PIC X.
            03 ENNAM6O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC7H                          PIC X.
            03 EFC7O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG7H                          PIC X.
            03 ADG7O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR7H                         PIC X.
            03 ADIR7O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR7H                         PIC X.
            03 EANR7O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT7H                         PIC X.
            03 ETIT7O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM8H                        PIC X.
            03 EVNAM8O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM7H                        PIC X.
            03 ENNAM7O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC8H                          PIC X.
            03 EFC8O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG8H                          PIC X.
            03 ADG8O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR8H                         PIC X.
            03 ADIR8O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR8H                         PIC X.
            03 EANR8O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT8H                         PIC X.
            03 ETIT8O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM9H                        PIC X.
            03 EVNAM9O                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM8H                        PIC X.
            03 ENNAM8O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC9H                          PIC X.
            03 EFC9O                          PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG9H                          PIC X.
            03 ADG9O                          PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR9H                         PIC X.
            03 ADIR9O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR9H                         PIC X.
            03 EANR9O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT9H                         PIC X.
            03 ETIT9O                         PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM12H                       PIC X.
            03 EVNAM12O                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM9H                        PIC X.
            03 ENNAM9O                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC12H                         PIC X.
            03 EFC12O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG12H                         PIC X.
            03 ADG12O                         PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR12H                        PIC X.
            03 ADIR12O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR12H                        PIC X.
            03 EANR12O                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT12H                        PIC X.
            03 ETIT12O                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM13H                       PIC X.
            03 EVNAM13O                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM12H                       PIC X.
            03 ENNAM12O                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC13H                         PIC X.
            03 EFC13O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG13H                         PIC X.
            03 ADG13O                         PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR13H                        PIC X.
            03 ADIR13O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR13H                        PIC X.
            03 EANR13O                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT13H                        PIC X.
            03 ETIT13O                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM14H                       PIC X.
            03 EVNAM14O                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM13H                       PIC X.
            03 ENNAM13O                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 EFC14H                         PIC X.
            03 EFC14O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADG14H                         PIC X.
            03 ADG14O                         PIC X(10).
            03 FILLER                         PIC X(3).
            03 ADIR14H                        PIC X.
            03 ADIR14O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 EANR14H                        PIC X.
            03 EANR14O                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 ETIT14H                        PIC X.
            03 ETIT14O                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 EVNAM15H                       PIC X.
            03 EVNAM15O                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ENNAM14H                       PIC X.
            03 ENNAM14O                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 AMAILTH                        PIC X.
            03 AMAILTO                        PIC X(30).
            03 FILLER                         PIC X(3).
            03 EMAILH                         PIC X.
            03 EMAILO                         PIC X(46).
            03 FILLER                         PIC X(3).
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(76).

