       01  BVB0022I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  AINFOZLL    COMP  PIC  S9(4).                                    
           02  AINFOZLF    PICTURE X.                                           
           02  FILLER REDEFINES AINFOZLF.                                       
             03 AINFOZLA    PICTURE X.                                          
           02  AINFOZLI  PIC X(65).                                             
           02  ANAMEL    COMP  PIC  S9(4).                                      
           02  ANAMEF    PICTURE X.                                             
           02  FILLER REDEFINES ANAMEF.                                         
             03 ANAMEA    PICTURE X.                                            
           02  ANAMEI  PIC X(30).                                               
           02  AVORNAML    COMP  PIC  S9(4).                                    
           02  AVORNAMF    PICTURE X.                                           
           02  FILLER REDEFINES AVORNAMF.                                       
             03 AVORNAMA    PICTURE X.                                          
           02  AVORNAMI  PIC X(20).                                             
           02  ASTATL    COMP  PIC  S9(4).                                      
           02  ASTATF    PICTURE X.                                             
           02  FILLER REDEFINES ASTATF.                                         
             03 ASTATA    PICTURE X.                                            
           02  ASTATI  PIC X(1).                                                
           02  E1FCL    COMP  PIC  S9(4).                                       
           02  E1FCF    PICTURE X.                                              
           02  FILLER REDEFINES E1FCF.                                          
             03 E1FCA    PICTURE X.                                             
           02  E1FCI  PIC X(1).                                                 
           02  E1DATL    COMP  PIC  S9(4).                                      
           02  E1DATF    PICTURE X.                                             
           02  FILLER REDEFINES E1DATF.                                         
             03 E1DATA    PICTURE X.                                            
           02  E1DATI  PIC X(2).                                                
           02  E1DAML    COMP  PIC  S9(4).                                      
           02  E1DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E1DAMF.                                         
             03 E1DAMA    PICTURE X.                                            
           02  E1DAMI  PIC X(2).                                                
           02  E1DAJL    COMP  PIC  S9(4).                                      
           02  E1DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E1DAJF.                                         
             03 E1DAJA    PICTURE X.                                            
           02  E1DAJI  PIC X(4).                                                
           02  E1SLZTL    COMP  PIC  S9(4).                                     
           02  E1SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E1SLZTF.                                        
             03 E1SLZTA    PICTURE X.                                           
           02  E1SLZTI  PIC X(2).                                               
           02  E1INFOL    COMP  PIC  S9(4).                                     
           02  E1INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E1INFOF.                                        
             03 E1INFOA    PICTURE X.                                           
           02  E1INFOI  PIC X(10).                                              
           02  E2FCL    COMP  PIC  S9(4).                                       
           02  E2FCF    PICTURE X.                                              
           02  FILLER REDEFINES E2FCF.                                          
             03 E2FCA    PICTURE X.                                             
           02  E2FCI  PIC X(1).                                                 
           02  E2DATL    COMP  PIC  S9(4).                                      
           02  E2DATF    PICTURE X.                                             
           02  FILLER REDEFINES E2DATF.                                         
             03 E2DATA    PICTURE X.                                            
           02  E2DATI  PIC X(2).                                                
           02  E2DAML    COMP  PIC  S9(4).                                      
           02  E2DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E2DAMF.                                         
             03 E2DAMA    PICTURE X.                                            
           02  E2DAMI  PIC X(2).                                                
           02  E2DAJL    COMP  PIC  S9(4).                                      
           02  E2DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E2DAJF.                                         
             03 E2DAJA    PICTURE X.                                            
           02  E2DAJI  PIC X(4).                                                
           02  E2SLZTL    COMP  PIC  S9(4).                                     
           02  E2SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E2SLZTF.                                        
             03 E2SLZTA    PICTURE X.                                           
           02  E2SLZTI  PIC X(2).                                               
           02  E2INFOL    COMP  PIC  S9(4).                                     
           02  E2INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E2INFOF.                                        
             03 E2INFOA    PICTURE X.                                           
           02  E2INFOI  PIC X(10).                                              
           02  E3FCL    COMP  PIC  S9(4).                                       
           02  E3FCF    PICTURE X.                                              
           02  FILLER REDEFINES E3FCF.                                          
             03 E3FCA    PICTURE X.                                             
           02  E3FCI  PIC X(1).                                                 
           02  E3DATL    COMP  PIC  S9(4).                                      
           02  E3DATF    PICTURE X.                                             
           02  FILLER REDEFINES E3DATF.                                         
             03 E3DATA    PICTURE X.                                            
           02  E3DATI  PIC X(2).                                                
           02  E3DAML    COMP  PIC  S9(4).                                      
           02  E3DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E3DAMF.                                         
             03 E3DAMA    PICTURE X.                                            
           02  E3DAMI  PIC X(2).                                                
           02  E3DAJL    COMP  PIC  S9(4).                                      
           02  E3DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E3DAJF.                                         
             03 E3DAJA    PICTURE X.                                            
           02  E3DAJI  PIC X(4).                                                
           02  E3SLZTL    COMP  PIC  S9(4).                                     
           02  E3SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E3SLZTF.                                        
             03 E3SLZTA    PICTURE X.                                           
           02  E3SLZTI  PIC X(2).                                               
           02  E3INFOL    COMP  PIC  S9(4).                                     
           02  E3INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E3INFOF.                                        
             03 E3INFOA    PICTURE X.                                           
           02  E3INFOI  PIC X(10).                                              
           02  E4FCL    COMP  PIC  S9(4).                                       
           02  E4FCF    PICTURE X.                                              
           02  FILLER REDEFINES E4FCF.                                          
             03 E4FCA    PICTURE X.                                             
           02  E4FCI  PIC X(1).                                                 
           02  E4DATL    COMP  PIC  S9(4).                                      
           02  E4DATF    PICTURE X.                                             
           02  FILLER REDEFINES E4DATF.                                         
             03 E4DATA    PICTURE X.                                            
           02  E4DATI  PIC X(2).                                                
           02  E4DAML    COMP  PIC  S9(4).                                      
           02  E4DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E4DAMF.                                         
             03 E4DAMA    PICTURE X.                                            
           02  E4DAMI  PIC X(2).                                                
           02  E4DAJL    COMP  PIC  S9(4).                                      
           02  E4DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E4DAJF.                                         
             03 E4DAJA    PICTURE X.                                            
           02  E4DAJI  PIC X(4).                                                
           02  E4SLZTL    COMP  PIC  S9(4).                                     
           02  E4SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E4SLZTF.                                        
             03 E4SLZTA    PICTURE X.                                           
           02  E4SLZTI  PIC X(2).                                               
           02  E4INFOL    COMP  PIC  S9(4).                                     
           02  E4INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E4INFOF.                                        
             03 E4INFOA    PICTURE X.                                           
           02  E4INFOI  PIC X(10).                                              
           02  E5FCL    COMP  PIC  S9(4).                                       
           02  E5FCF    PICTURE X.                                              
           02  FILLER REDEFINES E5FCF.                                          
             03 E5FCA    PICTURE X.                                             
           02  E5FCI  PIC X(1).                                                 
           02  E5DATL    COMP  PIC  S9(4).                                      
           02  E5DATF    PICTURE X.                                             
           02  FILLER REDEFINES E5DATF.                                         
             03 E5DATA    PICTURE X.                                            
           02  E5DATI  PIC X(2).                                                
           02  E5DAML    COMP  PIC  S9(4).                                      
           02  E5DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E5DAMF.                                         
             03 E5DAMA    PICTURE X.                                            
           02  E5DAMI  PIC X(2).                                                
           02  E5DAJL    COMP  PIC  S9(4).                                      
           02  E5DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E5DAJF.                                         
             03 E5DAJA    PICTURE X.                                            
           02  E5DAJI  PIC X(4).                                                
           02  E5SLZTL    COMP  PIC  S9(4).                                     
           02  E5SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E5SLZTF.                                        
             03 E5SLZTA    PICTURE X.                                           
           02  E5SLZTI  PIC X(2).                                               
           02  E5INFOL    COMP  PIC  S9(4).                                     
           02  E5INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E5INFOF.                                        
             03 E5INFOA    PICTURE X.                                           
           02  E5INFOI  PIC X(10).                                              
           02  E6FCL    COMP  PIC  S9(4).                                       
           02  E6FCF    PICTURE X.                                              
           02  FILLER REDEFINES E6FCF.                                          
             03 E6FCA    PICTURE X.                                             
           02  E6FCI  PIC X(1).                                                 
           02  E6DATL    COMP  PIC  S9(4).                                      
           02  E6DATF    PICTURE X.                                             
           02  FILLER REDEFINES E6DATF.                                         
             03 E6DATA    PICTURE X.                                            
           02  E6DATI  PIC X(2).                                                
           02  E6DAML    COMP  PIC  S9(4).                                      
           02  E6DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E6DAMF.                                         
             03 E6DAMA    PICTURE X.                                            
           02  E6DAMI  PIC X(2).                                                
           02  E6DAJL    COMP  PIC  S9(4).                                      
           02  E6DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E6DAJF.                                         
             03 E6DAJA    PICTURE X.                                            
           02  E6DAJI  PIC X(4).                                                
           02  E6SLZTL    COMP  PIC  S9(4).                                     
           02  E6SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E6SLZTF.                                        
             03 E6SLZTA    PICTURE X.                                           
           02  E6SLZTI  PIC X(2).                                               
           02  E6INFOL    COMP  PIC  S9(4).                                     
           02  E6INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E6INFOF.                                        
             03 E6INFOA    PICTURE X.                                           
           02  E6INFOI  PIC X(10).                                              
           02  E7FCL    COMP  PIC  S9(4).                                       
           02  E7FCF    PICTURE X.                                              
           02  FILLER REDEFINES E7FCF.                                          
             03 E7FCA    PICTURE X.                                             
           02  E7FCI  PIC X(1).                                                 
           02  E7DATL    COMP  PIC  S9(4).                                      
           02  E7DATF    PICTURE X.                                             
           02  FILLER REDEFINES E7DATF.                                         
             03 E7DATA    PICTURE X.                                            
           02  E7DATI  PIC X(2).                                                
           02  E7DAML    COMP  PIC  S9(4).                                      
           02  E7DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E7DAMF.                                         
             03 E7DAMA    PICTURE X.                                            
           02  E7DAMI  PIC X(2).                                                
           02  E7DAJL    COMP  PIC  S9(4).                                      
           02  E7DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E7DAJF.                                         
             03 E7DAJA    PICTURE X.                                            
           02  E7DAJI  PIC X(4).                                                
           02  E7SLZTL    COMP  PIC  S9(4).                                     
           02  E7SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E7SLZTF.                                        
             03 E7SLZTA    PICTURE X.                                           
           02  E7SLZTI  PIC X(2).                                               
           02  E7INFOL    COMP  PIC  S9(4).                                     
           02  E7INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E7INFOF.                                        
             03 E7INFOA    PICTURE X.                                           
           02  E7INFOI  PIC X(10).                                              
           02  E8FCL    COMP  PIC  S9(4).                                       
           02  E8FCF    PICTURE X.                                              
           02  FILLER REDEFINES E8FCF.                                          
             03 E8FCA    PICTURE X.                                             
           02  E8FCI  PIC X(1).                                                 
           02  E8DATL    COMP  PIC  S9(4).                                      
           02  E8DATF    PICTURE X.                                             
           02  FILLER REDEFINES E8DATF.                                         
             03 E8DATA    PICTURE X.                                            
           02  E8DATI  PIC X(2).                                                
           02  E8DAML    COMP  PIC  S9(4).                                      
           02  E8DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E8DAMF.                                         
             03 E8DAMA    PICTURE X.                                            
           02  E8DAMI  PIC X(2).                                                
           02  E8DAJL    COMP  PIC  S9(4).                                      
           02  E8DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E8DAJF.                                         
             03 E8DAJA    PICTURE X.                                            
           02  E8DAJI  PIC X(4).                                                
           02  E8SLZTL    COMP  PIC  S9(4).                                     
           02  E8SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E8SLZTF.                                        
             03 E8SLZTA    PICTURE X.                                           
           02  E8SLZTI  PIC X(2).                                               
           02  E8INFOL    COMP  PIC  S9(4).                                     
           02  E8INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E8INFOF.                                        
             03 E8INFOA    PICTURE X.                                           
           02  E8INFOI  PIC X(10).                                              
           02  E9FCL    COMP  PIC  S9(4).                                       
           02  E9FCF    PICTURE X.                                              
           02  FILLER REDEFINES E9FCF.                                          
             03 E9FCA    PICTURE X.                                             
           02  E9FCI  PIC X(1).                                                 
           02  E9DATL    COMP  PIC  S9(4).                                      
           02  E9DATF    PICTURE X.                                             
           02  FILLER REDEFINES E9DATF.                                         
             03 E9DATA    PICTURE X.                                            
           02  E9DATI  PIC X(2).                                                
           02  E9DAML    COMP  PIC  S9(4).                                      
           02  E9DAMF    PICTURE X.                                             
           02  FILLER REDEFINES E9DAMF.                                         
             03 E9DAMA    PICTURE X.                                            
           02  E9DAMI  PIC X(2).                                                
           02  E9DAJL    COMP  PIC  S9(4).                                      
           02  E9DAJF    PICTURE X.                                             
           02  FILLER REDEFINES E9DAJF.                                         
             03 E9DAJA    PICTURE X.                                            
           02  E9DAJI  PIC X(4).                                                
           02  E9SLZTL    COMP  PIC  S9(4).                                     
           02  E9SLZTF    PICTURE X.                                            
           02  FILLER REDEFINES E9SLZTF.                                        
             03 E9SLZTA    PICTURE X.                                           
           02  E9SLZTI  PIC X(2).                                               
           02  E9INFOL    COMP  PIC  S9(4).                                     
           02  E9INFOF    PICTURE X.                                            
           02  FILLER REDEFINES E9INFOF.                                        
             03 E9INFOA    PICTURE X.                                           
           02  E9INFOI  PIC X(10).                                              
           02  E10FCL    COMP  PIC  S9(4).                                      
           02  E10FCF    PICTURE X.                                             
           02  FILLER REDEFINES E10FCF.                                         
             03 E10FCA    PICTURE X.                                            
           02  E10FCI  PIC X(1).                                                
           02  E10DATL    COMP  PIC  S9(4).                                     
           02  E10DATF    PICTURE X.                                            
           02  FILLER REDEFINES E10DATF.                                        
             03 E10DATA    PICTURE X.                                           
           02  E10DATI  PIC X(2).                                               
           02  E10DAML    COMP  PIC  S9(4).                                     
           02  E10DAMF    PICTURE X.                                            
           02  FILLER REDEFINES E10DAMF.                                        
             03 E10DAMA    PICTURE X.                                           
           02  E10DAMI  PIC X(2).                                               
           02  E10DAJL    COMP  PIC  S9(4).                                     
           02  E10DAJF    PICTURE X.                                            
           02  FILLER REDEFINES E10DAJF.                                        
             03 E10DAJA    PICTURE X.                                           
           02  E10DAJI  PIC X(4).                                               
           02  E10SLZTL    COMP  PIC  S9(4).                                    
           02  E10SLZTF    PICTURE X.                                           
           02  FILLER REDEFINES E10SLZTF.                                       
             03 E10SLZTA    PICTURE X.                                          
           02  E10SLZTI  PIC X(2).                                              
           02  E10INFOL    COMP  PIC  S9(4).                                    
           02  E10INFOF    PICTURE X.                                           
           02  FILLER REDEFINES E10INFOF.                                       
             03 E10INFOA    PICTURE X.                                          
           02  E10INFOI  PIC X(10).                                             
       01  BVB0022O REDEFINES BVB0022I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AINFOZLO  PIC X(65).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANAMEO  PIC X(30).                                               
           02  FILLER PICTURE X(3).                                             
           02  AVORNAMO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTATO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E1DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E1SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E1INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E2FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E2DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E2SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E2INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E3FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E3DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E3SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E3INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E4FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E4DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E4SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E4INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E5FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E5DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E5SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E5INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E6FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E6DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E6SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E6INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E7FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E7DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E7SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E7INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E8FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E8DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E8SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E8INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E9FCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  E9DATO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9DAMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9DAJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  E9SLZTO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E9INFOO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10FCO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  E10DATO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10DAMO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10DAJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  E10SLZTO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  E10INFOO  PIC X(10).                                             
