       01  BVB0066I.                                                            
           02  FILLER PIC X(12).                                                
           02  ESTNRL    COMP  PIC  S9(4).                                      
           02  ESTNRF    PICTURE X.                                             
           02  FILLER REDEFINES ESTNRF.                                         
             03 ESTNRA    PICTURE X.                                            
           02  ESTNRI  PIC X(7).                                                
           02  ESTPRZL    COMP  PIC  S9(4).                                     
           02  ESTPRZF    PICTURE X.                                            
           02  FILLER REDEFINES ESTPRZF.                                        
             03 ESTPRZA    PICTURE X.                                           
           02  ESTPRZI  PIC X(1).                                               
           02  APRFTXTL    COMP  PIC  S9(4).                                    
           02  APRFTXTF    PICTURE X.                                           
           02  FILLER REDEFINES APRFTXTF.                                       
             03 APRFTXTA    PICTURE X.                                          
           02  APRFTXTI  PIC X(14).                                             
           02  ABEFAML    COMP  PIC  S9(4).                                     
           02  ABEFAMF    PICTURE X.                                            
           02  FILLER REDEFINES ABEFAMF.                                        
             03 ABEFAMA    PICTURE X.                                           
           02  ABEFAMI  PIC X(10).                                              
           02  AISTATL    COMP  PIC  S9(4).                                     
           02  AISTATF    PICTURE X.                                            
           02  FILLER REDEFINES AISTATF.                                        
             03 AISTATA    PICTURE X.                                           
           02  AISTATI  PIC X(5).                                               
           02  ABEDNRL    COMP  PIC  S9(4).                                     
           02  ABEDNRF    PICTURE X.                                            
           02  FILLER REDEFINES ABEDNRF.                                        
             03 ABEDNRA    PICTURE X.                                           
           02  ABEDNRI  PIC X(4).                                               
           02  AIEHVONL    COMP  PIC  S9(4).                                    
           02  AIEHVONF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHVONF.                                       
             03 AIEHVONA    PICTURE X.                                          
           02  AIEHVONI  PIC X(5).                                              
           02  AIEHBISL    COMP  PIC  S9(4).                                    
           02  AIEHBISF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHBISF.                                       
             03 AIEHBISA    PICTURE X.                                          
           02  AIEHBISI  PIC X(5).                                              
           02  AZRANZL    COMP  PIC  S9(4).                                     
           02  AZRANZF    PICTURE X.                                            
           02  FILLER REDEFINES AZRANZF.                                        
             03 AZRANZA    PICTURE X.                                           
           02  AZRANZI  PIC X(2).                                               
           02  ASTXT1L    COMP  PIC  S9(4).                                     
           02  ASTXT1F    PICTURE X.                                            
           02  FILLER REDEFINES ASTXT1F.                                        
             03 ASTXT1A    PICTURE X.                                           
           02  ASTXT1I  PIC X(15).                                              
           02  ASEHEIZL    COMP  PIC  S9(4).                                    
           02  ASEHEIZF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHEIZF.                                       
             03 ASEHEIZA    PICTURE X.                                          
           02  ASEHEIZI  PIC X(10).                                             
           02  ASEQFEIL    COMP  PIC  S9(4).                                    
           02  ASEQFEIF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFEIF.                                       
             03 ASEQFEIA    PICTURE X.                                          
           02  ASEQFEII  PIC X(5).                                              
           02  AITXT1L    COMP  PIC  S9(4).                                     
           02  AITXT1F    PICTURE X.                                            
           02  FILLER REDEFINES AITXT1F.                                        
             03 AITXT1A    PICTURE X.                                           
           02  AITXT1I  PIC X(8).                                               
           02  AIEHEIZL    COMP  PIC  S9(4).                                    
           02  AIEHEIZF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHEIZF.                                       
             03 AIEHEIZA    PICTURE X.                                          
           02  AIEHEIZI  PIC X(10).                                             
           02  AIEQFEIL    COMP  PIC  S9(4).                                    
           02  AIEQFEIF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFEIF.                                       
             03 AIEQFEIA    PICTURE X.                                          
           02  AIEQFEII  PIC X(5).                                              
           02  ASTXT2L    COMP  PIC  S9(4).                                     
           02  ASTXT2F    PICTURE X.                                            
           02  FILLER REDEFINES ASTXT2F.                                        
             03 ASTXT2A    PICTURE X.                                           
           02  ASTXT2I  PIC X(15).                                              
           02  ASEHGRUL    COMP  PIC  S9(4).                                    
           02  ASEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHGRUF.                                       
             03 ASEHGRUA    PICTURE X.                                          
           02  ASEHGRUI  PIC X(10).                                             
           02  ASEQFGRL    COMP  PIC  S9(4).                                    
           02  ASEQFGRF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFGRF.                                       
             03 ASEQFGRA    PICTURE X.                                          
           02  ASEQFGRI  PIC X(5).                                              
           02  AITXT2L    COMP  PIC  S9(4).                                     
           02  AITXT2F    PICTURE X.                                            
           02  FILLER REDEFINES AITXT2F.                                        
             03 AITXT2A    PICTURE X.                                           
           02  AITXT2I  PIC X(8).                                               
           02  AIEHGRUL    COMP  PIC  S9(4).                                    
           02  AIEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHGRUF.                                       
             03 AIEHGRUA    PICTURE X.                                          
           02  AIEHGRUI  PIC X(10).                                             
           02  ABEHGRUL    COMP  PIC  S9(4).                                    
           02  ABEHGRUF    PICTURE X.                                           
           02  FILLER REDEFINES ABEHGRUF.                                       
             03 ABEHGRUA    PICTURE X.                                          
           02  ABEHGRUI  PIC X(10).                                             
           02  AIEQFGRL    COMP  PIC  S9(4).                                    
           02  AIEQFGRF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFGRF.                                       
             03 AIEQFGRA    PICTURE X.                                          
           02  AIEQFGRI  PIC X(5).                                              
           02  ASTXT3L    COMP  PIC  S9(4).                                     
           02  ASTXT3F    PICTURE X.                                            
           02  FILLER REDEFINES ASTXT3F.                                        
             03 ASTXT3A    PICTURE X.                                           
           02  ASTXT3I  PIC X(15).                                              
           02  ASEHGESL    COMP  PIC  S9(4).                                    
           02  ASEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES ASEHGESF.                                       
             03 ASEHGESA    PICTURE X.                                          
           02  ASEHGESI  PIC X(10).                                             
           02  ASEQFGSL    COMP  PIC  S9(4).                                    
           02  ASEQFGSF    PICTURE X.                                           
           02  FILLER REDEFINES ASEQFGSF.                                       
             03 ASEQFGSA    PICTURE X.                                          
           02  ASEQFGSI  PIC X(5).                                              
           02  AITXT3L    COMP  PIC  S9(4).                                     
           02  AITXT3F    PICTURE X.                                            
           02  FILLER REDEFINES AITXT3F.                                        
             03 AITXT3A    PICTURE X.                                           
           02  AITXT3I  PIC X(8).                                               
           02  AIEHGESL    COMP  PIC  S9(4).                                    
           02  AIEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHGESF.                                       
             03 AIEHGESA    PICTURE X.                                          
           02  AIEHGESI  PIC X(10).                                             
           02  ABEHGESL    COMP  PIC  S9(4).                                    
           02  ABEHGESF    PICTURE X.                                           
           02  FILLER REDEFINES ABEHGESF.                                       
             03 ABEHGESA    PICTURE X.                                          
           02  ABEHGESI  PIC X(10).                                             
           02  AIEQFGSL    COMP  PIC  S9(4).                                    
           02  AIEQFGSF    PICTURE X.                                           
           02  FILLER REDEFINES AIEQFGSF.                                       
             03 AIEQFGSA    PICTURE X.                                          
           02  AIEQFGSI  PIC X(5).                                              
           02  ASTXT4L    COMP  PIC  S9(4).                                     
           02  ASTXT4F    PICTURE X.                                            
           02  FILLER REDEFINES ASTXT4F.                                        
             03 ASTXT4A    PICTURE X.                                           
           02  ASTXT4I  PIC X(15).                                              
           02  AMAXEIGL    COMP  PIC  S9(4).                                    
           02  AMAXEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AMAXEIGF.                                       
             03 AMAXEIGA    PICTURE X.                                          
           02  AMAXEIGI  PIC X(10).                                             
           02  AITXT4L    COMP  PIC  S9(4).                                     
           02  AITXT4F    PICTURE X.                                            
           02  FILLER REDEFINES AITXT4F.                                        
             03 AITXT4A    PICTURE X.                                           
           02  AITXT4I  PIC X(8).                                               
           02  AIEHEIGL    COMP  PIC  S9(4).                                    
           02  AIEHEIGF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHEIGF.                                       
             03 AIEHEIGA    PICTURE X.                                          
           02  AIEHEIGI  PIC X(10).                                             
           02  ATXTVERL    COMP  PIC  S9(4).                                    
           02  ATXTVERF    PICTURE X.                                           
           02  FILLER REDEFINES ATXTVERF.                                       
             03 ATXTVERA    PICTURE X.                                          
           02  ATXTVERI  PIC X(16).                                             
           02  AITXT5L    COMP  PIC  S9(4).                                     
           02  AITXT5F    PICTURE X.                                            
           02  FILLER REDEFINES AITXT5F.                                        
             03 AITXT5A    PICTURE X.                                           
           02  AITXT5I  PIC X(8).                                               
           02  AEIGABZL    COMP  PIC  S9(4).                                    
           02  AEIGABZF    PICTURE X.                                           
           02  FILLER REDEFINES AEIGABZF.                                       
             03 AEIGABZA    PICTURE X.                                          
           02  AEIGABZI  PIC X(10).                                             
           02  AIEHVERL    COMP  PIC  S9(4).                                    
           02  AIEHVERF    PICTURE X.                                           
           02  FILLER REDEFINES AIEHVERF.                                       
             03 AIEHVERA    PICTURE X.                                          
           02  AIEHVERI  PIC X(10).                                             
           02  ASTXT7L    COMP  PIC  S9(4).                                     
           02  ASTXT7F    PICTURE X.                                            
           02  FILLER REDEFINES ASTXT7F.                                        
             03 ASTXT7A    PICTURE X.                                           
           02  ASTXT7I  PIC X(15).                                              
           02  ASEHNPL    COMP  PIC  S9(4).                                     
           02  ASEHNPF    PICTURE X.                                            
           02  FILLER REDEFINES ASEHNPF.                                        
             03 ASEHNPA    PICTURE X.                                           
           02  ASEHNPI  PIC X(10).                                              
           02  AITXT7L    COMP  PIC  S9(4).                                     
           02  AITXT7F    PICTURE X.                                            
           02  FILLER REDEFINES AITXT7F.                                        
             03 AITXT7A    PICTURE X.                                           
           02  AITXT7I  PIC X(8).                                               
           02  AIEHNPL    COMP  PIC  S9(4).                                     
           02  AIEHNPF    PICTURE X.                                            
           02  FILLER REDEFINES AIEHNPF.                                        
             03 AIEHNPA    PICTURE X.                                           
           02  AIEHNPI  PIC X(10).                                              
           02  ABEHNPL    COMP  PIC  S9(4).                                     
           02  ABEHNPF    PICTURE X.                                            
           02  FILLER REDEFINES ABEHNPF.                                        
             03 ABEHNPA    PICTURE X.                                           
           02  ABEHNPI  PIC X(10).                                              
           02  ASEM1TXL    COMP  PIC  S9(4).                                    
           02  ASEM1TXF    PICTURE X.                                           
           02  FILLER REDEFINES ASEM1TXF.                                       
             03 ASEM1TXA    PICTURE X.                                          
           02  ASEM1TXI  PIC X(15).                                             
           02  ASEM1SL    COMP  PIC  S9(4).                                     
           02  ASEM1SF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM1SF.                                        
             03 ASEM1SA    PICTURE X.                                           
           02  ASEM1SI  PIC X(1).                                               
           02  ASEM1IL    COMP  PIC  S9(4).                                     
           02  ASEM1IF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM1IF.                                        
             03 ASEM1IA    PICTURE X.                                           
           02  ASEM1II  PIC X(1).                                               
           02  AGEW1TXL    COMP  PIC  S9(4).                                    
           02  AGEW1TXF    PICTURE X.                                           
           02  FILLER REDEFINES AGEW1TXF.                                       
             03 AGEW1TXA    PICTURE X.                                          
           02  AGEW1TXI  PIC X(15).                                             
           02  AGEW1SL    COMP  PIC  S9(4).                                     
           02  AGEW1SF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW1SF.                                        
             03 AGEW1SA    PICTURE X.                                           
           02  AGEW1SI  PIC X(1).                                               
           02  AGEW1IL    COMP  PIC  S9(4).                                     
           02  AGEW1IF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW1IF.                                        
             03 AGEW1IA    PICTURE X.                                           
           02  AGEW1II  PIC X(1).                                               
           02  ASEM2TXL    COMP  PIC  S9(4).                                    
           02  ASEM2TXF    PICTURE X.                                           
           02  FILLER REDEFINES ASEM2TXF.                                       
             03 ASEM2TXA    PICTURE X.                                          
           02  ASEM2TXI  PIC X(15).                                             
           02  ASEM2SL    COMP  PIC  S9(4).                                     
           02  ASEM2SF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM2SF.                                        
             03 ASEM2SA    PICTURE X.                                           
           02  ASEM2SI  PIC X(1).                                               
           02  ASEM2IL    COMP  PIC  S9(4).                                     
           02  ASEM2IF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM2IF.                                        
             03 ASEM2IA    PICTURE X.                                           
           02  ASEM2II  PIC X(1).                                               
           02  AGEW2TXL    COMP  PIC  S9(4).                                    
           02  AGEW2TXF    PICTURE X.                                           
           02  FILLER REDEFINES AGEW2TXF.                                       
             03 AGEW2TXA    PICTURE X.                                          
           02  AGEW2TXI  PIC X(15).                                             
           02  AGEW2SL    COMP  PIC  S9(4).                                     
           02  AGEW2SF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW2SF.                                        
             03 AGEW2SA    PICTURE X.                                           
           02  AGEW2SI  PIC X(1).                                               
           02  AGEW2IL    COMP  PIC  S9(4).                                     
           02  AGEW2IF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW2IF.                                        
             03 AGEW2IA    PICTURE X.                                           
           02  AGEW2II  PIC X(1).                                               
           02  ASEM3TXL    COMP  PIC  S9(4).                                    
           02  ASEM3TXF    PICTURE X.                                           
           02  FILLER REDEFINES ASEM3TXF.                                       
             03 ASEM3TXA    PICTURE X.                                          
           02  ASEM3TXI  PIC X(15).                                             
           02  ASEM3SL    COMP  PIC  S9(4).                                     
           02  ASEM3SF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM3SF.                                        
             03 ASEM3SA    PICTURE X.                                           
           02  ASEM3SI  PIC X(1).                                               
           02  ASEM3IL    COMP  PIC  S9(4).                                     
           02  ASEM3IF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM3IF.                                        
             03 ASEM3IA    PICTURE X.                                           
           02  ASEM3II  PIC X(1).                                               
           02  AGEW3TXL    COMP  PIC  S9(4).                                    
           02  AGEW3TXF    PICTURE X.                                           
           02  FILLER REDEFINES AGEW3TXF.                                       
             03 AGEW3TXA    PICTURE X.                                          
           02  AGEW3TXI  PIC X(15).                                             
           02  AGEW3SL    COMP  PIC  S9(4).                                     
           02  AGEW3SF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW3SF.                                        
             03 AGEW3SA    PICTURE X.                                           
           02  AGEW3SI  PIC X(1).                                               
           02  AGEW3IL    COMP  PIC  S9(4).                                     
           02  AGEW3IF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW3IF.                                        
             03 AGEW3IA    PICTURE X.                                           
           02  AGEW3II  PIC X(1).                                               
           02  ASEM4TXL    COMP  PIC  S9(4).                                    
           02  ASEM4TXF    PICTURE X.                                           
           02  FILLER REDEFINES ASEM4TXF.                                       
             03 ASEM4TXA    PICTURE X.                                          
           02  ASEM4TXI  PIC X(15).                                             
           02  ASEM4SL    COMP  PIC  S9(4).                                     
           02  ASEM4SF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM4SF.                                        
             03 ASEM4SA    PICTURE X.                                           
           02  ASEM4SI  PIC X(1).                                               
           02  ASEM4IL    COMP  PIC  S9(4).                                     
           02  ASEM4IF    PICTURE X.                                            
           02  FILLER REDEFINES ASEM4IF.                                        
             03 ASEM4IA    PICTURE X.                                           
           02  ASEM4II  PIC X(1).                                               
           02  AGEW4TXL    COMP  PIC  S9(4).                                    
           02  AGEW4TXF    PICTURE X.                                           
           02  FILLER REDEFINES AGEW4TXF.                                       
             03 AGEW4TXA    PICTURE X.                                          
           02  AGEW4TXI  PIC X(15).                                             
           02  AGEW4SL    COMP  PIC  S9(4).                                     
           02  AGEW4SF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW4SF.                                        
             03 AGEW4SA    PICTURE X.                                           
           02  AGEW4SI  PIC X(1).                                               
           02  AGEW4IL    COMP  PIC  S9(4).                                     
           02  AGEW4IF    PICTURE X.                                            
           02  FILLER REDEFINES AGEW4IF.                                        
             03 AGEW4IA    PICTURE X.                                           
           02  AGEW4II  PIC X(1).                                               
       01  BVB0066O REDEFINES BVB0066I.                                         
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESTPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRFTXTO  PIC X(14).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABEFAMO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AISTATO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ABEDNRO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHVONO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AIEHBISO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AZRANZO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASTXT1O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHEIZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFEIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AITXT1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHEIZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFEIO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTXT2O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFGRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AITXT2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABEHGRUO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFGRO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTXT3O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEQFGSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  AITXT3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ABEHGESO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEQFGSO  PIC X(5).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTXT4O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AMAXEIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AITXT4O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHEIGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ATXTVERO  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  AITXT5O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEIGABZO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  AIEHVERO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASTXT7O  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEHNPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AITXT7O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AIEHNPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABEHNPO  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASEM1TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEM1SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM1IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW1TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGEW1SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW1IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM2TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEM2SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM2IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW2TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGEW2SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW2IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM3TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEM3SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM3IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW3TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGEW3SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW3IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM4TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ASEM4SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ASEM4IO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW4TXO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  AGEW4SO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AGEW4IO  PIC X(1).                                               
