      *****************************************************************
CCC005*    EXEC SQL DECLARE VERTRAGSINFO TABLE
CCC004*    ( VIFVERTRAGSID                  CHAR(13) NOT NULL,
CCC004*      VIFHERKUNFT                    CHAR(3) NOT NULL,
CCC004*      VIFQUITTUNGSNR                 CHAR(15) NOT NULL,
CCC004*      VIFERSTELLDATUM                DATE,
CCC004*      VIFERSTELLZEIT                 INTEGER NOT NULL,
CCC004*      VIFANTRAGSNUMMER               CHAR(18) NOT NULL,
CCC004*      VIFVERMIT1MERKM                CHAR(20) NOT NULL,
CCC004*      VIFVERMITTLER1NR               CHAR(10) NOT NULL,
CCC004*      VIFVERMIT2MERKM                CHAR(20) NOT NULL,
CCC004*      VIFVERMITTLER2NR               CHAR(10) NOT NULL,
CCC004*      VIFTARIFPRODUKT                CHAR(50) NOT NULL,
CCC004*      VIFVERTSPAR_KTY                SMALLINT NOT NULL,
CCC004*      VIFVERTSPAR_KNR                DECIMAL(15, 0) NOT NULL,
CCC004*      VIFVERTRAGARTVTG               INTEGER NOT NULL,
CCC004*      VIFVERSICHRISIKO               CHAR(23) NOT NULL,
CCC004*      VIFAENDERUNGSGRD               CHAR(50) NOT NULL,
CCC004*      VIFAFBANTEILPROZ               DECIMAL(5, 3) NOT NULL,
CCC004*      VIFVERTRAGSINFO                CHAR(80) NOT NULL,
CCC004*      VIFJGBBEITRAG                  DECIMAL(12, 2) NOT NULL,
CCC004*      VIFFAELLIGKDATUM               DATE,
CCC004*      VIFJGNBEITRAG                  DECIMAL(10, 2) NOT NULL,
CCC004*      VIFMAHNSTUFE                   CHAR(25) NOT NULL,
CCC004*      VIFMAHNDATUM                   DATE,
CCC004*      VIFRUECKSTBETRAG               DECIMAL(9, 2) NOT NULL,
CCC004*      VIFLZRABTTPROZ                 SMALLINT NOT NULL,
CCC004*      VIFRATENZUSCHLAG               SMALLINT NOT NULL,
CCC004*      VIFZEICHNUNG                   CHAR(25) NOT NULL,
CCC004*      VIFFBBETRAGBRT                 DECIMAL(10, 2) NOT NULL,
CCC004*      VIFFBSUMME                     INTEGER NOT NULL,
CCC004*      VIFEINLBEITRBRT                DECIMAL(10, 2) NOT NULL,
CCC004*      VIFEINLBEITRNET                DECIMAL(10, 2) NOT NULL,
CCC004*      VIFSYNCDATUM                   DATE,
CCC004*      VIFDATUMAGTBEWEG               DATE,
CCC004*      VIFDATUMBEWEGUNG               CHAR(61) NOT NULL,
CCC004*      VIFKUNDENBONUS                 CHAR(26) NOT NULL,
CCC004*      VIFOSTRABATT                   SMALLINT NOT NULL,
CCC004*      VIFKURZTEXTBSA                 CHAR(6) NOT NULL,
CCC004*      VIFLANGTEXTBSA                 CHAR(50) NOT NULL,
CCC004*      VIFVERSGESELL                  CHAR(50) NOT NULL,
CCC004*      VIFVDNR                        INTEGER NOT NULL,
CCC004*      VIFVDNAME                      CHAR(20) NOT NULL,
CCC004*      VIFVORVERTRAGSNR               CHAR(17) NOT NULL,
CCC004*      VIFVERSSUMME                   DECIMAL(10, 0) NOT NULL,
CCC004*      LETZTEAENDERUNG                TIMESTAMP NOT NULL,
CCC004*      VIFAKTERGEBNIS                 CHAR(3),
CCC004*      VIFBESTMANAGKZ                 CHAR(1),
CCC004*      VIFPRKOMBBEZ_KTY               SMALLINT NOT NULL,
CCC004*      VIFPRKOMBBEZ_KNR               DECIMAL(15, 0),
CCC004*      VIFKUNDENIDSMH                 CHAR(10),
CCC004*      VIFFLEXNVSPNL                  DECIMAL(11, 2),
CCC004*      VIFFLEXNVSPKZ                  CHAR(1),
CCC004*      VIFFLEXNVGVNL                  DECIMAL(11, 2),
CCC004*      VIFFLEXNVGVKZ                  CHAR(1),
CCC004*      VIFVSPKZ                       CHAR(1) NOT NULL,
CCC004*      VIFBUENDELKZN_KTY              SMALLINT NOT NULL,
CCC004*      VIFBUENDELKZN_KNR              DECIMAL(15, 0)
CCC003*    ) END-EXEC.
      ******************************************************************
      * COBOL DECLARATION FOR TABLE VERTRAGSINFO                *
      ******************************************************************
       01  VERTRAGSINFO-GESAMT.
        05 NI-VERTRAGSINFO-TAB.
           10 NI-VERTRAGSINFO-ELE PIC S9(04) COMP OCCURS 56 TIMES.
        05 NI-VERTRAGSINFO REDEFINES NI-VERTRAGSINFO-TAB.
           10 NI-VIFVERTRAGSID      PIC S9(4) COMP.
           10 NI-VIFHERKUNFT        PIC S9(4) COMP.
           10 NI-VIFQUITTUNGSNR     PIC S9(4) COMP.
           10 NI-VIFERSTELLDATUM    PIC S9(4) COMP.
           10 NI-VIFERSTELLZEIT     PIC S9(4) COMP.
           10 NI-VIFANTRAGSNUMMER   PIC S9(4) COMP.
           10 NI-VIFVERMIT1MERKM    PIC S9(4) COMP.
           10 NI-VIFVERMITTLER1NR   PIC S9(4) COMP.
           10 NI-VIFVERMIT2MERKM    PIC S9(4) COMP.
           10 NI-VIFVERMITTLER2NR   PIC S9(4) COMP.
           10 NI-VIFTARIFPRODUKT    PIC S9(4) COMP.
           10 NI-VIFVERTSPAR-KTY    PIC S9(4) COMP.
           10 NI-VIFVERTSPAR-KNR    PIC S9(4) COMP.
           10 NI-VIFVERTRAGARTVTG   PIC S9(4) COMP.
           10 NI-VIFVERSICHRISIKO   PIC S9(4) COMP.
           10 NI-VIFAENDERUNGSGRD   PIC S9(4) COMP.
           10 NI-VIFAFBANTEILPROZ   PIC S9(4) COMP.
           10 NI-VIFVERTRAGSINFO    PIC S9(4) COMP.
           10 NI-VIFJGBBEITRAG      PIC S9(4) COMP.
           10 NI-VIFFAELLIGKDATUM   PIC S9(4) COMP.
           10 NI-VIFJGNBEITRAG      PIC S9(4) COMP.
           10 NI-VIFMAHNSTUFE       PIC S9(4) COMP.
           10 NI-VIFMAHNDATUM       PIC S9(4) COMP.
           10 NI-VIFRUECKSTBETRAG   PIC S9(4) COMP.
           10 NI-VIFLZRABTTPROZ     PIC S9(4) COMP.
           10 NI-VIFRATENZUSCHLAG   PIC S9(4) COMP.
           10 NI-VIFZEICHNUNG       PIC S9(4) COMP.
           10 NI-VIFFBBETRAGBRT     PIC S9(4) COMP.
           10 NI-VIFFBSUMME         PIC S9(4) COMP.
           10 NI-VIFEINLBEITRBRT    PIC S9(4) COMP.
           10 NI-VIFEINLBEITRNET    PIC S9(4) COMP.
           10 NI-VIFSYNCDATUM       PIC S9(4) COMP.
           10 NI-VIFDATUMAGTBEWEG   PIC S9(4) COMP.
           10 NI-VIFDATUMBEWEGUNG   PIC S9(4) COMP.
           10 NI-VIFKUNDENBONUS     PIC S9(4) COMP.
           10 NI-VIFOSTRABATT       PIC S9(4) COMP.
           10 NI-VIFKURZTEXTBSA     PIC S9(4) COMP.
           10 NI-VIFLANGTEXTBSA     PIC S9(4) COMP.
           10 NI-VIFVERSGESELL      PIC S9(4) COMP.
           10 NI-VIFVDNR            PIC S9(4) COMP.
           10 NI-VIFVDNAME          PIC S9(4) COMP.
           10 NI-VIFVORVERTRAGSNR   PIC S9(4) COMP.
           10 NI-VIFVERSSUMME       PIC S9(4) COMP.
           10 NI-LETZTEAENDERUNG    PIC S9(4) COMP.
           10 NI-VIFAKTERGEBNIS     PIC S9(4) COMP.
           10 NI-VIFBESTMANAGKZ     PIC S9(4) COMP.
           10 NI-VIFPRKOMBBEZ-KTY   PIC S9(4) COMP.
           10 NI-VIFPRKOMBBEZ-KNR   PIC S9(4) COMP.
           10 NI-VIFKUNDENIDSMH     PIC S9(4) COMP.
           10 NI-VIFFLEXNVSPNL      PIC S9(4) COMP.
           10 NI-VIFFLEXNVSPKZ      PIC S9(4) COMP.
           10 NI-VIFFLEXNVGVNL      PIC S9(4) COMP.
           10 NI-VIFFLEXNVGVKZ      PIC S9(4) COMP.
           10 NI-VIFVSPKZ           PIC S9(4) COMP.
           10 NI-VIFBUENDELKZN-KTY  PIC S9(4) COMP.
           10 NI-VIFBUENDELKZN-KNR  PIC S9(4) COMP.
        05 DCL-VERTRAGSINFO.
           10 VIFVERTRAGSID        PIC X(13).
           10 VIFHERKUNFT          PIC X(3).
           10 VIFQUITTUNGSNR       PIC X(15).
           10 VIFERSTELLDATUM      PIC X(10).
           10 VIFERSTELLZEIT       PIC S9(9) USAGE COMP-5.
           10 VIFANTRAGSNUMMER     PIC X(18).
           10 VIFVERMIT1MERKM      PIC X(20).
           10 VIFVERMITTLER1NR     PIC X(10).
           10 VIFVERMIT2MERKM      PIC X(20).
           10 VIFVERMITTLER2NR     PIC X(10).
           10 VIFTARIFPRODUKT      PIC X(50).
           10 VIFVERTSPAR-KTY      PIC S9(4) USAGE COMP-5.
           10 VIFVERTSPAR-KNR      PIC S9(15)V USAGE COMP-3.
           10 VIFVERTRAGARTVTG     PIC S9(9) USAGE COMP-5.
           10 VIFVERSICHRISIKO     PIC X(23).
           10 VIFAENDERUNGSGRD     PIC X(50).
           10 VIFAFBANTEILPROZ     PIC S9(2)V9(3) USAGE COMP-3.
           10 VIFVERTRAGSINFO      PIC X(80).
           10 VIFJGBBEITRAG        PIC S9(10)V9(2) USAGE COMP-3.
           10 VIFFAELLIGKDATUM     PIC X(10).
           10 VIFJGNBEITRAG        PIC S9(8)V9(2) USAGE COMP-3.
           10 VIFMAHNSTUFE         PIC X(25).
           10 VIFMAHNDATUM         PIC X(10).
           10 VIFRUECKSTBETRAG     PIC S9(7)V9(2) USAGE COMP-3.
           10 VIFLZRABTTPROZ       PIC S9(4) USAGE COMP-5.
           10 VIFRATENZUSCHLAG     PIC S9(4) USAGE COMP-5.
           10 VIFZEICHNUNG         PIC X(25).
           10 VIFFBBETRAGBRT       PIC S9(8)V9(2) USAGE COMP-3.
           10 VIFFBSUMME           PIC S9(9) USAGE COMP-5.
           10 VIFEINLBEITRBRT      PIC S9(8)V9(2) USAGE COMP-3.
           10 VIFEINLBEITRNET      PIC S9(8)V9(2) USAGE COMP-3.
           10 VIFSYNCDATUM         PIC X(10).
           10 VIFDATUMAGTBEWEG     PIC X(10).
           10 VIFDATUMBEWEGUNG     PIC X(61).
           10 VIFKUNDENBONUS       PIC X(26).
           10 VIFOSTRABATT         PIC S9(4) USAGE COMP-5.
           10 VIFKURZTEXTBSA       PIC X(6).
           10 VIFLANGTEXTBSA       PIC X(50).
           10 VIFVERSGESELL        PIC X(50).
           10 VIFVDNR              PIC S9(9) USAGE COMP-5.
           10 VIFVDNAME            PIC X(20).
           10 VIFVORVERTRAGSNR     PIC X(17).
           10 VIFVERSSUMME         PIC S9(10)V USAGE COMP-3.
           10 LETZTEAENDERUNG      PIC X(26).
           10 VIFAKTERGEBNIS       PIC X(3).
           10 VIFBESTMANAGKZ       PIC X(1).
           10 VIFPRKOMBBEZ-KTY     PIC S9(4) USAGE COMP-5.
           10 VIFPRKOMBBEZ-KNR     PIC S9(15)V USAGE COMP-3.
           10 VIFKUNDENIDSMH       PIC X(10).
           10 VIFFLEXNVSPNL        PIC S9(9)V9(2) USAGE COMP-3.
           10 VIFFLEXNVSPKZ        PIC X(1).
           10 VIFFLEXNVGVNL        PIC S9(9)V9(2) USAGE COMP-3.
           10 VIFFLEXNVGVKZ        PIC X(1).
           10 VIFVSPKZ             PIC X(1).
           10 VIFBUENDELKZN-KTY    PIC S9(4) USAGE COMP-5.
           10 VIFBUENDELKZN-KNR    PIC S9(15)V USAGE COMP-3.
      ************************** ENDE-DCLGEN *************************
