      *   Mainframe Express 3.1  6.013.0041
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-57)
      *   MapSet Name   BPA0066
      *   Date Created  11/10/2015
      *   Time Created  14:56:58

      *  Input Data For Map BPA0066
         01 BPA0066I.
            03 FILLER                         PIC X(12).
            03 EVBNRL                         PIC S9(4) COMP.
            03 EVBNRF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EVBNRI                         PIC X(7).
            03 EZIELSTL                       PIC S9(4) COMP.
            03 EZIELSTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EZIELSTI                       PIC X(2).
            03 EKOJAHRL                       PIC S9(4) COMP.
            03 EKOJAHRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKOJAHRI                       PIC X(4).
            03 ASEIFBL                        PIC S9(4) COMP.
            03 ASEIFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIFBI                        PIC X(6).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(3).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(3).
            03 EAENVTTL                       PIC S9(4) COMP.
            03 EAENVTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAENVTTI                       PIC X(2).
            03 EAENVMML                       PIC S9(4) COMP.
            03 EAENVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAENVMMI                       PIC X(2).
            03 EAENVJJL                       PIC S9(4) COMP.
            03 EAENVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAENVJJI                       PIC X(4).
            03 EAENBTTL                       PIC S9(4) COMP.
            03 EAENBTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAENBTTI                       PIC X(2).
            03 EAENBMML                       PIC S9(4) COMP.
            03 EAENBMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAENBMMI                       PIC X(2).
            03 EAENBJJL                       PIC S9(4) COMP.
            03 EAENBJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAENBJJI                       PIC X(4).
            03 EINFVBML                       PIC S9(4) COMP.
            03 EINFVBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EINFVBMI                       PIC X(2).
            03 EINFVBJL                       PIC S9(4) COMP.
            03 EINFVBJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EINFVBJI                       PIC X(4).
            03 EVERZSTL                       PIC S9(4) COMP.
            03 EVERZSTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVERZSTI                       PIC X(1).
            03 AVZSTBML                       PIC S9(4) COMP.
            03 AVZSTBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVZSTBMI                       PIC X(40).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(10).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(1).
            03 AFCSFB1L                       PIC S9(4) COMP.
            03 AFCSFB1F                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFB1I                       PIC X(31).
            03 AFCFBL                         PIC S9(4) COMP.
            03 AFCFBF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AFCFBI                         PIC X(2).
            03 DFHG001I                       OCCURS 10 TIMES.
               05 EFCZL                          PIC S9(4) COMP.
               05 EFCZF                          PIC X.
               05 FILLER                         PIC X(1).
               05 EFCZI                          PIC X(1).
               05 AVBNRL                         PIC S9(4) COMP.
               05 AVBNRF                         PIC X.
               05 FILLER                         PIC X(1).
               05 AVBNRI                         PIC X(9).
               05 AZIELSTL                       PIC S9(4) COMP.
               05 AZIELSTF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AZIELSTI                       PIC X(2).
               05 AKOJAHRL                       PIC S9(4) COMP.
               05 AKOJAHRF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AKOJAHRI                       PIC X(4).
               05 AAENDATL                       PIC S9(4) COMP.
               05 AAENDATF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AAENDATI                       PIC X(10).
               05 AVARBZSL                       PIC S9(4) COMP.
               05 AVARBZSF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AVARBZSI                       PIC X(17).
               05 ALTBVONL                       PIC S9(4) COMP.
               05 ALTBVONF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ALTBVONI                       PIC X(8).
               05 ALTBAML                        PIC S9(4) COMP.
               05 ALTBAMF                        PIC X.
               05 FILLER                         PIC X(1).
               05 ALTBAMI                        PIC X(10).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(79).

      *  Output Data For Map BPA0066
         01 BPA0066O REDEFINES BPA0066I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 EVBNRA                         PIC X.
            03 EVBNRH                         PIC X.
            03 EVBNRO                         PIC X(7).
            03 FILLER                         PIC X(2).
            03 EZIELSTA                       PIC X.
            03 EZIELSTH                       PIC X.
            03 EZIELSTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EKOJAHRA                       PIC X.
            03 EKOJAHRH                       PIC X.
            03 EKOJAHRO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 ASEIFBA                        PIC X.
            03 ASEIFBH                        PIC X.
            03 ASEIFBO                        PIC X(6).
            03 FILLER                         PIC X(2).
            03 ESEIAKTA                       PIC X.
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 ASEISTRA                       PIC X.
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEIGESA                       PIC X.
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 EAENVTTA                       PIC X.
            03 EAENVTTH                       PIC X.
            03 EAENVTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EAENVMMA                       PIC X.
            03 EAENVMMH                       PIC X.
            03 EAENVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EAENVJJA                       PIC X.
            03 EAENVJJH                       PIC X.
            03 EAENVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EAENBTTA                       PIC X.
            03 EAENBTTH                       PIC X.
            03 EAENBTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EAENBMMA                       PIC X.
            03 EAENBMMH                       PIC X.
            03 EAENBMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EAENBJJA                       PIC X.
            03 EAENBJJH                       PIC X.
            03 EAENBJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EINFVBMA                       PIC X.
            03 EINFVBMH                       PIC X.
            03 EINFVBMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EINFVBJA                       PIC X.
            03 EINFVBJH                       PIC X.
            03 EINFVBJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVERZSTA                       PIC X.
            03 EVERZSTH                       PIC X.
            03 EVERZSTO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 AVZSTBMA                       PIC X.
            03 AVZSTBMH                       PIC X.
            03 AVZSTBMO                       PIC X(40).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(1).
            03 FILLER                         PIC X(2).
            03 AFCSFB1A                       PIC X.
            03 AFCSFB1H                       PIC X.
            03 AFCSFB1O                       PIC X(31).
            03 FILLER                         PIC X(2).
            03 AFCFBA                         PIC X.
            03 AFCFBH                         PIC X.
            03 AFCFBO                         PIC X(2).
            03 DFHG001O OCCURS 10.
               05 FILLER                         PIC X(2).
               05 EFCZA                          PIC X.
               05 EFCZH                          PIC X.
               05 EFCZO                          PIC X(1).
               05 FILLER                         PIC X(2).
               05 AVBNRA                         PIC X.
               05 AVBNRH                         PIC X.
               05 AVBNRO                         PIC X(9).
               05 FILLER                         PIC X(2).
               05 AZIELSTA                       PIC X.
               05 AZIELSTH                       PIC X.
               05 AZIELSTO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 AKOJAHRA                       PIC X.
               05 AKOJAHRH                       PIC X.
               05 AKOJAHRO                       PIC X(4).
               05 FILLER                         PIC X(2).
               05 AAENDATA                       PIC X.
               05 AAENDATH                       PIC X.
               05 AAENDATO                       PIC X(10).
               05 FILLER                         PIC X(2).
               05 AVARBZSA                       PIC X.
               05 AVARBZSH                       PIC X.
               05 AVARBZSO                       PIC X(17).
               05 FILLER                         PIC X(2).
               05 ALTBVONA                       PIC X.
               05 ALTBVONH                       PIC X.
               05 ALTBVONO                       PIC X(8).
               05 FILLER                         PIC X(2).
               05 ALTBAMA                        PIC X.
               05 ALTBAMH                        PIC X.
               05 ALTBAMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 AFCANZA                        PIC X.
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(79).


