      *   MAINFRAME EXPRESS 3.1  6.013.0041
      *   MICRO FOCUS BMS SCREEN PAINTER (VER IDE_6-0-57)
      *   MAPSET NAME   BPA0061
      *   DATE CREATED  07/01/2016
      *   TIME CREATED  11:31:33

      *  INPUT DATA FOR MAP BPA0061
         01 BPA0061I.
            03 FILLER                         PIC X(12).
            03 AGESFBL                        PIC S9(4) COMP.
            03 AGESFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESFBI                        PIC X(4).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(8).
            03 EUNRL                          PIC S9(4) COMP.
            03 EUNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EUNRI                          PIC X(3).
            03 ESCHICHL                       PIC S9(4) COMP.
            03 ESCHICHF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESCHICHI                       PIC X(3).
            03 EWAEBKL                        PIC S9(4) COMP.
            03 EWAEBKF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EWAEBKI                        PIC X(3).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(30).
            03 AVERSL                         PIC S9(4) COMP.
            03 AVERSF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSI                         PIC X(3).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVGESBML                       PIC S9(4) COMP.
            03 AVGESBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESBMI                       PIC X(4).
            03 AERKZFBL                       PIC S9(4) COMP.
            03 AERKZFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AERKZFBI                       PIC X(8).
            03 AERSTKZL                       PIC S9(4) COMP.
            03 AERSTKZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AERSTKZI                       PIC X(1).
            03 ALUPDDAL                       PIC S9(4) COMP.
            03 ALUPDDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDDAI                       PIC X(10).
            03 ALUPDUSL                       PIC S9(4) COMP.
            03 ALUPDUSF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDUSI                       PIC X(8).
            03 EKNAMEL                        PIC S9(4) COMP.
            03 EKNAMEF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKNAMEI                        PIC X(25).
            03 EFAEVTTL                       PIC S9(4) COMP.
            03 EFAEVTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVTTI                       PIC X(2).
            03 EFAEVMML                       PIC S9(4) COMP.
            03 EFAEVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVMMI                       PIC X(2).
            03 EFAEVJJL                       PIC S9(4) COMP.
            03 EFAEVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFAEVJJI                       PIC X(4).
            03 EKVNAMEL                       PIC S9(4) COMP.
            03 EKVNAMEF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EKVNAMEI                       PIC X(20).
            03 AABRETTL                       PIC S9(4) COMP.
            03 AABRETTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRETTI                       PIC X(2).
            03 AABREMML                       PIC S9(4) COMP.
            03 AABREMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREMMI                       PIC X(2).
            03 AABREJJL                       PIC S9(4) COMP.
            03 AABREJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREJJI                       PIC X(4).
            03 EAVERML                        PIC S9(4) COMP.
            03 EAVERMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMI                        PIC X(7).
            03 EAVERMPL                       PIC S9(4) COMP.
            03 EAVERMPF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EAVERMPI                       PIC X(1).
            03 EZHLWL                         PIC S9(4) COMP.
            03 EZHLWF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EZHLWI                         PIC X(2).
            03 AZHLTXTL                       PIC S9(4) COMP.
            03 AZHLTXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLTXTI                       PIC X(10).
            03 EVBEGTTL                       PIC S9(4) COMP.
            03 EVBEGTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGTTI                       PIC X(2).
            03 EVBEGMML                       PIC S9(4) COMP.
            03 EVBEGMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGMMI                       PIC X(2).
            03 EVBEGJJL                       PIC S9(4) COMP.
            03 EVBEGJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVBEGJJI                       PIC X(4).
            03 EVENDTTL                       PIC S9(4) COMP.
            03 EVENDTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDTTI                       PIC X(2).
            03 EVENDMML                       PIC S9(4) COMP.
            03 EVENDMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDMMI                       PIC X(2).
            03 EVENDJJL                       PIC S9(4) COMP.
            03 EVENDJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVENDJJI                       PIC X(4).
            03 EHBEGTTL                       PIC S9(4) COMP.
            03 EHBEGTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHBEGTTI                       PIC X(2).
            03 EHBEGMML                       PIC S9(4) COMP.
            03 EHBEGMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHBEGMMI                       PIC X(2).
            03 EHBEGJJL                       PIC S9(4) COMP.
            03 EHBEGJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHBEGJJI                       PIC X(4).
            03 EHENDTTL                       PIC S9(4) COMP.
            03 EHENDTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHENDTTI                       PIC X(2).
            03 EHENDMML                       PIC S9(4) COMP.
            03 EHENDMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHENDMMI                       PIC X(2).
            03 EHENDJJL                       PIC S9(4) COMP.
            03 EHENDJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHENDJJI                       PIC X(4).
            03 EVPNAMEL                       PIC S9(4) COMP.
            03 EVPNAMEF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVPNAMEI                       PIC X(25).
            03 ELFZEITL                       PIC S9(4) COMP.
            03 ELFZEITF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ELFZEITI                       PIC X(4).
            03 EVVGKZL                        PIC S9(4) COMP.
            03 EVVGKZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EVVGKZI                        PIC X(1).
            03 EVPVNAML                       PIC S9(4) COMP.
            03 EVPVNAMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVPVNAMI                       PIC X(20).
            03 EPRSCHLL                       PIC S9(4) COMP.
            03 EPRSCHLF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPRSCHLI                       PIC X(5).
            03 ENSTOKZL                       PIC S9(4) COMP.
            03 ENSTOKZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ENSTOKZI                       PIC X(1).
            03 EINKATTL                       PIC S9(4) COMP.
            03 EINKATTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EINKATTI                       PIC X(2).
            03 EINKAMML                       PIC S9(4) COMP.
            03 EINKAMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EINKAMMI                       PIC X(2).
            03 EINKAJJL                       PIC S9(4) COMP.
            03 EINKAJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EINKAJJI                       PIC X(4).
            03 EVERGESL                       PIC S9(4) COMP.
            03 EVERGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EVERGESI                       PIC X(2).
            03 EPRODARL                       PIC S9(4) COMP.
            03 EPRODARF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODARI                       PIC X(1).
            03 EDYNKZ2L                       PIC S9(4) COMP.
            03 EDYNKZ2F                       PIC X.
            03 FILLER                         PIC X(1).
            03 EDYNKZ2I                       PIC X(1).
            03 ADYKZTXL                       PIC S9(4) COMP.
            03 ADYKZTXF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADYKZTXI                       PIC X(10).
            03 EUPOLTTL                       PIC S9(4) COMP.
            03 EUPOLTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUPOLTTI                       PIC X(2).
            03 EUPOLMML                       PIC S9(4) COMP.
            03 EUPOLMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUPOLMMI                       PIC X(2).
            03 EUPOLJJL                       PIC S9(4) COMP.
            03 EUPOLJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUPOLJJI                       PIC X(4).
            03 ETARKZL                        PIC S9(4) COMP.
            03 ETARKZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ETARKZI                        PIC X(2).
            03 ERABSTFL                       PIC S9(4) COMP.
            03 ERABSTFF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ERABSTFI                       PIC X(3).
            03 EPOLITTL                       PIC S9(4) COMP.
            03 EPOLITTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPOLITTI                       PIC X(2).
            03 EPOLIMML                       PIC S9(4) COMP.
            03 EPOLIMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPOLIMMI                       PIC X(2).
            03 EPOLIJJL                       PIC S9(4) COMP.
            03 EPOLIJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPOLIJJI                       PIC X(4).
            03 EPGVL                          PIC S9(4) COMP.
            03 EPGVF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPGVI                          PIC X(4).
            03 EBEWHKFL                       PIC S9(4) COMP.
            03 EBEWHKFF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EBEWHKFI                       PIC X(1).
            03 EBWSCHLL                       PIC S9(4) COMP.
            03 EBWSCHLF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EBWSCHLI                       PIC X(6).
            03 EPRODL                         PIC S9(4) COMP.
            03 EPRODF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EPRODI                         PIC X(3).
            03 EPGTARIL                       PIC S9(4) COMP.
            03 EPGTARIF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPGTARII                       PIC X(15).
            03 EPPFLSUL                       PIC S9(4) COMP.
            03 EPPFLSUF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EPPFLSUI                       PIC X(15).
            03 EPROVSL                        PIC S9(4) COMP.
            03 EPROVSF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVSI                        PIC X(9).
            03 EPROVBL                        PIC S9(4) COMP.
            03 EPROVBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EPROVBI                        PIC X(13).
            03 AFCZANZL                       PIC S9(4) COMP.
            03 AFCZANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZANZI                       PIC X(79).

      *  OUTPUT DATA FOR MAP BPA0061
         01 BPA0061O REDEFINES BPA0061I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 AGESFBA                        PIC X.
            03 AGESFBH                        PIC X.
            03 AGESFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 EGESA                          PIC X.
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EVNRA                          PIC X.
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(8).
            03 FILLER                         PIC X(2).
            03 EUNRA                          PIC X.
            03 EUNRH                          PIC X.
            03 EUNRO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 ESCHICHA                       PIC X.
            03 ESCHICHH                       PIC X.
            03 ESCHICHO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 EWAEBKA                        PIC X.
            03 EWAEBKH                        PIC X.
            03 EWAEBKO                        PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(30).
            03 FILLER                         PIC X(2).
            03 AVERSA                         PIC X.
            03 AVERSH                         PIC X.
            03 AVERSO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 AVSTATA                        PIC X.
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVGESBMA                       PIC X.
            03 AVGESBMH                       PIC X.
            03 AVGESBMO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AERKZFBA                       PIC X.
            03 AERKZFBH                       PIC X.
            03 AERKZFBO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 AERSTKZA                       PIC X.
            03 AERSTKZH                       PIC X.
            03 AERSTKZO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ALUPDDAA                       PIC X.
            03 ALUPDDAH                       PIC X.
            03 ALUPDDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 ALUPDUSA                       PIC X.
            03 ALUPDUSH                       PIC X.
            03 ALUPDUSO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 EKNAMEA                        PIC X.
            03 EKNAMEH                        PIC X.
            03 EKNAMEO                        PIC X(25).
            03 FILLER                         PIC X(2).
            03 EFAEVTTA                       PIC X.
            03 EFAEVTTH                       PIC X.
            03 EFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVMMA                       PIC X.
            03 EFAEVMMH                       PIC X.
            03 EFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EFAEVJJA                       PIC X.
            03 EFAEVJJH                       PIC X.
            03 EFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EKVNAMEA                       PIC X.
            03 EKVNAMEH                       PIC X.
            03 EKVNAMEO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 AABRETTA                       PIC X.
            03 AABRETTH                       PIC X.
            03 AABRETTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AABREMMA                       PIC X.
            03 AABREMMH                       PIC X.
            03 AABREMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 AABREJJA                       PIC X.
            03 AABREJJH                       PIC X.
            03 AABREJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EAVERMA                        PIC X.
            03 EAVERMH                        PIC X.
            03 EAVERMO                        PIC X(7).
            03 FILLER                         PIC X(2).
            03 EAVERMPA                       PIC X.
            03 EAVERMPH                       PIC X.
            03 EAVERMPO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 EZHLWA                         PIC X.
            03 EZHLWH                         PIC X.
            03 EZHLWO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 AZHLTXTA                       PIC X.
            03 AZHLTXTH                       PIC X.
            03 AZHLTXTO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 EVBEGTTA                       PIC X.
            03 EVBEGTTH                       PIC X.
            03 EVBEGTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVBEGMMA                       PIC X.
            03 EVBEGMMH                       PIC X.
            03 EVBEGMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVBEGJJA                       PIC X.
            03 EVBEGJJH                       PIC X.
            03 EVBEGJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVENDTTA                       PIC X.
            03 EVENDTTH                       PIC X.
            03 EVENDTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVENDMMA                       PIC X.
            03 EVENDMMH                       PIC X.
            03 EVENDMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EVENDJJA                       PIC X.
            03 EVENDJJH                       PIC X.
            03 EVENDJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EHBEGTTA                       PIC X.
            03 EHBEGTTH                       PIC X.
            03 EHBEGTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EHBEGMMA                       PIC X.
            03 EHBEGMMH                       PIC X.
            03 EHBEGMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EHBEGJJA                       PIC X.
            03 EHBEGJJH                       PIC X.
            03 EHBEGJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EHENDTTA                       PIC X.
            03 EHENDTTH                       PIC X.
            03 EHENDTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EHENDMMA                       PIC X.
            03 EHENDMMH                       PIC X.
            03 EHENDMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EHENDJJA                       PIC X.
            03 EHENDJJH                       PIC X.
            03 EHENDJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVPNAMEA                       PIC X.
            03 EVPNAMEH                       PIC X.
            03 EVPNAMEO                       PIC X(25).
            03 FILLER                         PIC X(2).
            03 ELFZEITA                       PIC X.
            03 ELFZEITH                       PIC X.
            03 ELFZEITO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVVGKZA                        PIC X.
            03 EVVGKZH                        PIC X.
            03 EVVGKZO                        PIC X(1).
            03 FILLER                         PIC X(2).
            03 EVPVNAMA                       PIC X.
            03 EVPVNAMH                       PIC X.
            03 EVPVNAMO                       PIC X(20).
            03 FILLER                         PIC X(2).
            03 EPRSCHLA                       PIC X.
            03 EPRSCHLH                       PIC X.
            03 EPRSCHLO                       PIC X(5).
            03 FILLER                         PIC X(2).
            03 ENSTOKZA                       PIC X.
            03 ENSTOKZH                       PIC X.
            03 ENSTOKZO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 EINKATTA                       PIC X.
            03 EINKATTH                       PIC X.
            03 EINKATTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EINKAMMA                       PIC X.
            03 EINKAMMH                       PIC X.
            03 EINKAMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EINKAJJA                       PIC X.
            03 EINKAJJH                       PIC X.
            03 EINKAJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVERGESA                       PIC X.
            03 EVERGESH                       PIC X.
            03 EVERGESO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EPRODARA                       PIC X.
            03 EPRODARH                       PIC X.
            03 EPRODARO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 EDYNKZ2A                       PIC X.
            03 EDYNKZ2H                       PIC X.
            03 EDYNKZ2O                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ADYKZTXA                       PIC X.
            03 ADYKZTXH                       PIC X.
            03 ADYKZTXO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 EUPOLTTA                       PIC X.
            03 EUPOLTTH                       PIC X.
            03 EUPOLTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUPOLMMA                       PIC X.
            03 EUPOLMMH                       PIC X.
            03 EUPOLMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUPOLJJA                       PIC X.
            03 EUPOLJJH                       PIC X.
            03 EUPOLJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 ETARKZA                        PIC X.
            03 ETARKZH                        PIC X.
            03 ETARKZO                        PIC X(2).
            03 FILLER                         PIC X(2).
            03 ERABSTFA                       PIC X.
            03 ERABSTFH                       PIC X.
            03 ERABSTFO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 EPOLITTA                       PIC X.
            03 EPOLITTH                       PIC X.
            03 EPOLITTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EPOLIMMA                       PIC X.
            03 EPOLIMMH                       PIC X.
            03 EPOLIMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EPOLIJJA                       PIC X.
            03 EPOLIJJH                       PIC X.
            03 EPOLIJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EPGVA                          PIC X.
            03 EPGVH                          PIC X.
            03 EPGVO                          PIC X(4).
            03 FILLER                         PIC X(2).
            03 EBEWHKFA                       PIC X.
            03 EBEWHKFH                       PIC X.
            03 EBEWHKFO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 EBWSCHLA                       PIC X.
            03 EBWSCHLH                       PIC X.
            03 EBWSCHLO                       PIC X(6).
            03 FILLER                         PIC X(2).
            03 EPRODA                         PIC X.
            03 EPRODH                         PIC X.
            03 EPRODO                         PIC X(3).
            03 FILLER                         PIC X(2).
            03 EPGTARIA                       PIC X.
            03 EPGTARIH                       PIC X.
            03 EPGTARIO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EPPFLSUA                       PIC X.
            03 EPPFLSUH                       PIC X.
            03 EPPFLSUO                       PIC X(15).
            03 FILLER                         PIC X(2).
            03 EPROVSA                        PIC X.
            03 EPROVSH                        PIC X.
            03 EPROVSO                        PIC X(9).
            03 FILLER                         PIC X(2).
            03 EPROVBA                        PIC X.
            03 EPROVBH                        PIC X.
            03 EPROVBO                        PIC X(13).
            03 FILLER                         PIC X(2).
            03 AFCZANZA                       PIC X.
            03 AFCZANZH                       PIC X.
            03 AFCZANZO                       PIC X(79).

