      *   Micro Focus Enterprise Developer for Eclipse  5.0.00256
      *   Micro Focus BMS Screen Painter (ver BMSIDE_5-0-01)
      *   MapSet Name   BPA0010
      *   Date Created  03/03/2020
      *   Time Created  11:41:50

      *  Input Data For Map BPA0010
         01 BPA0010I.
            03 FILLER                         PIC X(12).
            03 AGESL                          PIC S9(4) COMP.
            03 AGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 AVNRL                          PIC S9(4) COMP.
            03 AVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AVNRI                          PIC X(15).
            03 APINL                          PIC S9(4) COMP.
            03 APINF                          PIC X.
            03 FILLER                         PIC X(1).
            03 APINI                          PIC X(9).
            03 AVERSL                         PIC S9(4) COMP.
            03 AVERSF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSI                         PIC X(2).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVSTEXTL                       PIC S9(4) COMP.
            03 AVSTEXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTEXTI                       PIC X(40).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(57).
            03 AFAEVDAL                       PIC S9(4) COMP.
            03 AFAEVDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVDAI                       PIC X(10).
            03 AFABFBL                        PIC S9(4) COMP.
            03 AFABFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFABFBI                        PIC X(6).
            03 AFAEBDAL                       PIC S9(4) COMP.
            03 AFAEBDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBDAI                       PIC X(10).
            03 AVBNRL                         PIC S9(4) COMP.
            03 AVBNRF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVBNRI                         PIC X(7).
            03 AKUNDNLL                       PIC S9(4) COMP.
            03 AKUNDNLF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKUNDNLI                       PIC X(45).
            03 AVBEGDAL                       PIC S9(4) COMP.
            03 AVBEGDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVBEGDAI                       PIC X(10).
            03 AABREDAL                       PIC S9(4) COMP.
            03 AABREDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABREDAI                       PIC X(10).
            03 AVENDFBL                       PIC S9(4) COMP.
            03 AVENDFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVENDFBI                       PIC X(13).
            03 AVENDDAL                       PIC S9(4) COMP.
            03 AVENDDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVENDDAI                       PIC X(10).
            03 AEINDFBL                       PIC S9(4) COMP.
            03 AEINDFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEINDFBI                       PIC X(16).
            03 AEINLDAL                       PIC S9(4) COMP.
            03 AEINLDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEINLDAI                       PIC X(10).
            03 AZHLWFBL                       PIC S9(4) COMP.
            03 AZHLWFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLWFBI                       PIC X(10).
            03 AZAHLWL                        PIC S9(4) COMP.
            03 AZAHLWF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AZAHLWI                        PIC X(2).
            03 AZWTEXTL                       PIC S9(4) COMP.
            03 AZWTEXTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZWTEXTI                       PIC X(10).
            03 DFHG001I                       OCCURS 3 TIMES.
               05 APRODFBL                       PIC S9(4) COMP.
               05 APRODFBF                       PIC X.
               05 FILLER                         PIC X(1).
               05 APRODFBI                       PIC X(17).
               05 APRODSPL                       PIC S9(4) COMP.
               05 APRODSPF                       PIC X.
               05 FILLER                         PIC X(1).
               05 APRODSPI                       PIC X(18).
            03 DFHG002I                       OCCURS 3 TIMES.
               05 AVVNRFBL                       PIC S9(4) COMP.
               05 AVVNRFBF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AVVNRFBI                       PIC X(17).
               05 AVVNRL                         PIC S9(4) COMP.
               05 AVVNRF                         PIC X.
               05 FILLER                         PIC X(1).
               05 AVVNRI                         PIC X(18).
            03 ALUPUIDL                       PIC S9(4) COMP.
            03 ALUPUIDF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPUIDI                       PIC X(8).
            03 ALUPDDAL                       PIC S9(4) COMP.
            03 ALUPDDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDDAI                       PIC X(10).
            03 ALUPDTIL                       PIC S9(4) COMP.
            03 ALUPDTIF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ALUPDTII                       PIC X(10).

      *  Output Data For Map BPA0010
         01 BPA0010O REDEFINES BPA0010I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 AGESA                          PIC X.
            03 AGESH                          PIC X.
            03 AGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 AVNRA                          PIC X.
            03 AVNRH                          PIC X.
            03 AVNRO                          PIC X(15).
            03 FILLER                         PIC X(2).
            03 APINA                          PIC X.
            03 APINH                          PIC X.
            03 APINO                          PIC X(9).
            03 FILLER                         PIC X(2).
            03 AVERSA                         PIC X.
            03 AVERSH                         PIC X.
            03 AVERSO                         PIC X(2).
            03 FILLER                         PIC X(2).
            03 AVSTATA                        PIC X.
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVSTEXTA                       PIC X.
            03 AVSTEXTH                       PIC X.
            03 AVSTEXTO                       PIC X(40).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(57).
            03 FILLER                         PIC X(2).
            03 AFAEVDAA                       PIC X.
            03 AFAEVDAH                       PIC X.
            03 AFAEVDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AFABFBA                        PIC X.
            03 AFABFBH                        PIC X.
            03 AFABFBO                        PIC X(6).
            03 FILLER                         PIC X(2).
            03 AFAEBDAA                       PIC X.
            03 AFAEBDAH                       PIC X.
            03 AFAEBDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AVBNRA                         PIC X.
            03 AVBNRH                         PIC X.
            03 AVBNRO                         PIC X(7).
            03 FILLER                         PIC X(2).
            03 AKUNDNLA                       PIC X.
            03 AKUNDNLH                       PIC X.
            03 AKUNDNLO                       PIC X(45).
            03 FILLER                         PIC X(2).
            03 AVBEGDAA                       PIC X.
            03 AVBEGDAH                       PIC X.
            03 AVBEGDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AABREDAA                       PIC X.
            03 AABREDAH                       PIC X.
            03 AABREDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AVENDFBA                       PIC X.
            03 AVENDFBH                       PIC X.
            03 AVENDFBO                       PIC X(13).
            03 FILLER                         PIC X(2).
            03 AVENDDAA                       PIC X.
            03 AVENDDAH                       PIC X.
            03 AVENDDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AEINDFBA                       PIC X.
            03 AEINDFBH                       PIC X.
            03 AEINDFBO                       PIC X(16).
            03 FILLER                         PIC X(2).
            03 AEINLDAA                       PIC X.
            03 AEINLDAH                       PIC X.
            03 AEINLDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AZHLWFBA                       PIC X.
            03 AZHLWFBH                       PIC X.
            03 AZHLWFBO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AZAHLWA                        PIC X.
            03 AZAHLWH                        PIC X.
            03 AZAHLWO                        PIC X(2).
            03 FILLER                         PIC X(2).
            03 AZWTEXTA                       PIC X.
            03 AZWTEXTH                       PIC X.
            03 AZWTEXTO                       PIC X(10).
            03 DFHG001O OCCURS 3.
               05 FILLER                         PIC X(2).
               05 APRODFBA                       PIC X.
               05 APRODFBH                       PIC X.
               05 APRODFBO                       PIC X(17).
               05 FILLER                         PIC X(2).
               05 APRODSPA                       PIC X.
               05 APRODSPH                       PIC X.
               05 APRODSPO                       PIC X(18).
            03 DFHG002O OCCURS 3.
               05 FILLER                         PIC X(2).
               05 AVVNRFBA                       PIC X.
               05 AVVNRFBH                       PIC X.
               05 AVVNRFBO                       PIC X(17).
               05 FILLER                         PIC X(2).
               05 AVVNRA                         PIC X.
               05 AVVNRH                         PIC X.
               05 AVVNRO                         PIC X(18).
            03 FILLER                         PIC X(2).
            03 ALUPUIDA                       PIC X.
            03 ALUPUIDH                       PIC X.
            03 ALUPUIDO                       PIC X(8).
            03 FILLER                         PIC X(2).
            03 ALUPDDAA                       PIC X.
            03 ALUPDDAH                       PIC X.
            03 ALUPDDAO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 ALUPDTIA                       PIC X.
            03 ALUPDTIH                       PIC X.
            03 ALUPDTIO                       PIC X(10).


