      *   MICRO FOCUS ENTERPRISE DEVELOPER FOR ECLIPSE  5.0.00256
      *   MICRO FOCUS BMS SCREEN PAINTER (VER BMSIDE_5-0-01)
      *   MAPSET NAME   BPA0040
      *   DATE CREATED  01/25/2022
      *   TIME CREATED  08:12:16

      *  INPUT DATA FOR MAP BPA0040
         01 BPA0040I.
            03 FILLER                         PIC X(12).
            03 APRSUFBL                       PIC S9(4) COMP.
            03 APRSUFBF                       PIC X.
            03 FILLER REDEFINES APRSUFBF.
               05 APRSUFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRSUFBI                       PIC X(22).
            03 ARATBTGL                       PIC S9(4) COMP.
            03 ARATBTGF                       PIC X.
            03 FILLER REDEFINES ARATBTGF.
               05 ARATBTGA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARATBTGI                       PIC X(15).
            03 AURSPFBL                       PIC S9(4) COMP.
            03 AURSPFBF                       PIC X.
            03 FILLER REDEFINES AURSPFBF.
               05 AURSPFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AURSPFBI                       PIC X(19).
            03 AURPDATL                       PIC S9(4) COMP.
            03 AURPDATF                       PIC X.
            03 FILLER REDEFINES AURPDATF.
               05 AURPDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AURPDATI                       PIC X(10).
            03 ABERSUBL                       PIC S9(4) COMP.
            03 ABERSUBF                       PIC X.
            03 FILLER REDEFINES ABERSUBF.
               05 ABERSUBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABERSUBI                       PIC X(15).
            03 APOLDATL                       PIC S9(4) COMP.
            03 APOLDATF                       PIC X.
            03 FILLER REDEFINES APOLDATF.
               05 APOLDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APOLDATI                       PIC X(10).
            03 ARDBWFBL                       PIC S9(4) COMP.
            03 ARDBWFBF                       PIC X.
            03 FILLER REDEFINES ARDBWFBF.
               05 ARDBWFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARDBWFBI                       PIC X(22).
            03 ARBEWSUL                       PIC S9(4) COMP.
            03 ARBEWSUF                       PIC X.
            03 FILLER REDEFINES ARBEWSUF.
               05 ARBEWSUA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARBEWSUI                       PIC X(15).
            03 APPFLBEL                       PIC S9(4) COMP.
            03 APPFLBEF                       PIC X.
            03 FILLER REDEFINES APPFLBEF.
               05 APPFLBEA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFLBEI                       PIC X(10).
            03 ABZDAUEL                       PIC S9(4) COMP.
            03 ABZDAUEF                       PIC X.
            03 FILLER REDEFINES ABZDAUEF.
               05 ABZDAUEA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABZDAUEI                       PIC X(4).
            03 APPFLABL                       PIC S9(4) COMP.
            03 APPFLABF                       PIC X.
            03 FILLER REDEFINES APPFLABF.
               05 APPFLABA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFLABI                       PIC X(10).
            03 AGSDAUEL                       PIC S9(4) COMP.
            03 AGSDAUEF                       PIC X.
            03 FILLER REDEFINES AGSDAUEF.
               05 AGSDAUEA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGSDAUEI                       PIC X(4).
            03 AINKSSTL                       PIC S9(4) COMP.
            03 AINKSSTF                       PIC X.
            03 FILLER REDEFINES AINKSSTF.
               05 AINKSSTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AINKSSTI                       PIC X(10).
            03 AJAHRBTL                       PIC S9(4) COMP.
            03 AJAHRBTF                       PIC X.
            03 FILLER REDEFINES AJAHRBTF.
               05 AJAHRBTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AJAHRBTI                       PIC X(13).
            03 AINKAFBL                       PIC S9(4) COMP.
            03 AINKAFBF                       PIC X.
            03 FILLER REDEFINES AINKAFBF.
               05 AINKAFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AINKAFBI                       PIC X(19).
            03 AINKSL                         PIC S9(4) COMP.
            03 AINKSF                         PIC X.
            03 FILLER REDEFINES AINKSF.
               05 AINKSA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AINKSI                         PIC X(2).
            03 AINKSBML                       PIC S9(4) COMP.
            03 AINKSBMF                       PIC X.
            03 FILLER REDEFINES AINKSBMF.
               05 AINKSBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AINKSBMI                       PIC X(10).
            03 ABWBTFBL                       PIC S9(4) COMP.
            03 ABWBTFBF                       PIC X.
            03 FILLER REDEFINES ABWBTFBF.
               05 ABWBTFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABWBTFBI                       PIC X(22).
            03 ABWTBTL                        PIC S9(4) COMP.
            03 ABWTBTF                        PIC X.
            03 FILLER REDEFINES ABWTBTF.
               05 ABWTBTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ABWTBTI                        PIC X(15).
            03 ANSTOFBL                       PIC S9(4) COMP.
            03 ANSTOFBF                       PIC X.
            03 FILLER REDEFINES ANSTOFBF.
               05 ANSTOFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANSTOFBI                       PIC X(19).
            03 ANSTOKZL                       PIC S9(4) COMP.
            03 ANSTOKZF                       PIC X.
            03 FILLER REDEFINES ANSTOKZF.
               05 ANSTOKZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANSTOKZI                       PIC X(1).
            03 AVVGFBL                        PIC S9(4) COMP.
            03 AVVGFBF                        PIC X.
            03 FILLER REDEFINES AVVGFBF.
               05 AVVGFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVVGFBI                        PIC X(7).
            03 AVVGKZL                        PIC S9(4) COMP.
            03 AVVGKZF                        PIC X.
            03 FILLER REDEFINES AVVGKZF.
               05 AVVGKZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVVGKZI                        PIC X(1).
            03 ARDBTFBL                       PIC S9(4) COMP.
            03 ARDBTFBF                       PIC X.
            03 FILLER REDEFINES ARDBTFBF.
               05 ARDBTFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARDBTFBI                       PIC X(22).
            03 ARBWTBTL                       PIC S9(4) COMP.
            03 ARBWTBTF                       PIC X.
            03 FILLER REDEFINES ARBWTBTF.
               05 ARBWTBTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARBWTBTI                       PIC X(15).
            03 ADYNKZ2L                       PIC S9(4) COMP.
            03 ADYNKZ2F                       PIC X.
            03 FILLER REDEFINES ADYNKZ2F.
               05 ADYNKZ2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADYNKZ2I                       PIC X(1).
            03 ADYN2BML                       PIC S9(4) COMP.
            03 ADYN2BMF                       PIC X.
            03 FILLER REDEFINES ADYN2BMF.
               05 ADYN2BMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADYN2BMI                       PIC X(10).
            03 AVERSFBL                       PIC S9(4) COMP.
            03 AVERSFBF                       PIC X.
            03 FILLER REDEFINES AVERSFBF.
               05 AVERSFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSFBI                       PIC X(22).
            03 AVERSSUL                       PIC S9(4) COMP.
            03 AVERSSUF                       PIC X.
            03 FILLER REDEFINES AVERSSUF.
               05 AVERSSUA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSSUI                       PIC X(15).
            03 ADPKZFBL                       PIC S9(4) COMP.
            03 ADPKZFBF                       PIC X.
            03 FILLER REDEFINES ADPKZFBF.
               05 ADPKZFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADPKZFBI                       PIC X(19).
            03 ADEPOKZL                       PIC S9(4) COMP.
            03 ADEPOKZF                       PIC X.
            03 FILLER REDEFINES ADEPOKZF.
               05 ADEPOKZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADEPOKZI                       PIC X(1).
            03 ADEPOBML                       PIC S9(4) COMP.
            03 ADEPOBMF                       PIC X.
            03 FILLER REDEFINES ADEPOBMF.
               05 ADEPOBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ADEPOBMI                       PIC X(10).
            03 APRATBTL                       PIC S9(4) COMP.
            03 APRATBTF                       PIC X.
            03 FILLER REDEFINES APRATBTF.
               05 APRATBTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRATBTI                       PIC X(15).
            03 AEIKZFBL                       PIC S9(4) COMP.
            03 AEIKZFBF                       PIC X.
            03 FILLER REDEFINES AEIKZFBF.
               05 AEIKZFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEIKZFBI                       PIC X(19).
            03 AVFGARTL                       PIC S9(4) COMP.
            03 AVFGARTF                       PIC X.
            03 FILLER REDEFINES AVFGARTF.
               05 AVFGARTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVFGARTI                       PIC X(4).
            03 APFBTFBL                       PIC S9(4) COMP.
            03 APFBTFBF                       PIC X.
            03 FILLER REDEFINES APFBTFBF.
               05 APFBTFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APFBTFBI                       PIC X(22).
            03 APPFLBTL                       PIC S9(4) COMP.
            03 APPFLBTF                       PIC X.
            03 FILLER REDEFINES APPFLBTF.
               05 APPFLBTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFLBTI                       PIC X(15).
            03 ATARIFBL                       PIC S9(4) COMP.
            03 ATARIFBF                       PIC X.
            03 FILLER REDEFINES ATARIFBF.
               05 ATARIFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ATARIFBI                       PIC X(15).
            03 APRRATZL                       PIC S9(4) COMP.
            03 APRRATZF                       PIC X.
            03 FILLER REDEFINES APRRATZF.
               05 APRRATZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRRATZI                       PIC X(4).
            03 APRRATNL                       PIC S9(4) COMP.
            03 APRRATNF                       PIC X.
            03 FILLER REDEFINES APRRATNF.
               05 APRRATNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRRATNI                       PIC X(4).
            03 ASAMMFBL                       PIC S9(4) COMP.
            03 ASAMMFBF                       PIC X.
            03 FILLER REDEFINES ASAMMFBF.
               05 ASAMMFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASAMMFBI                       PIC X(19).
            03 ASAMMNRL                       PIC S9(4) COMP.
            03 ASAMMNRF                       PIC X.
            03 FILLER REDEFINES ASAMMNRF.
               05 ASAMMNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASAMMNRI                       PIC X(9).
            03 APFSAFBL                       PIC S9(4) COMP.
            03 APFSAFBF                       PIC X.
            03 FILLER REDEFINES APFSAFBF.
               05 APFSAFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APFSAFBI                       PIC X(22).
            03 APPFLSUL                       PIC S9(4) COMP.
            03 APPFLSUF                       PIC X.
            03 FILLER REDEFINES APPFLSUF.
               05 APPFLSUA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APPFLSUI                       PIC X(15).
            03 ARABSTL                        PIC S9(4) COMP.
            03 ARABSTF                        PIC X.
            03 FILLER REDEFINES ARABSTF.
               05 ARABSTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ARABSTI                        PIC X(5).
            03 AHISTUNL                       PIC S9(4) COMP.
            03 AHISTUNF                       PIC X.
            03 FILLER REDEFINES AHISTUNF.
               05 AHISTUNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHISTUNI                       PIC X(3).
            03 AHISTNRL                       PIC S9(4) COMP.
            03 AHISTNRF                       PIC X.
            03 FILLER REDEFINES AHISTNRF.
               05 AHISTNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHISTNRI                       PIC X(3).
            03 ANAMEL                         PIC S9(4) COMP.
            03 ANAMEF                         PIC X.
            03 FILLER REDEFINES ANAMEF.
               05 ANAMEA                         PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEI                         PIC X(25).
            03 ANAMEFBL                       PIC S9(4) COMP.
            03 ANAMEFBF                       PIC X.
            03 FILLER REDEFINES ANAMEFBF.
               05 ANAMEFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEFBI                       PIC X(5).
            03 AFBKENNL                       PIC S9(4) COMP.
            03 AFBKENNF                       PIC X.
            03 FILLER REDEFINES AFBKENNF.
               05 AFBKENNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBKENNI                       PIC X(8).
            03 AGLKENNL                       PIC S9(4) COMP.
            03 AGLKENNF                       PIC X.
            03 FILLER REDEFINES AGLKENNF.
               05 AGLKENNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGLKENNI                       PIC X(6).
            03 AORDNRL                        PIC S9(4) COMP.
            03 AORDNRF                        PIC X.
            03 FILLER REDEFINES AORDNRF.
               05 AORDNRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AORDNRI                        PIC X(2).
            03 AFAEVTTL                       PIC S9(4) COMP.
            03 AFAEVTTF                       PIC X.
            03 FILLER REDEFINES AFAEVTTF.
               05 AFAEVTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVTTI                       PIC X(2).
            03 AFAEVMML                       PIC S9(4) COMP.
            03 AFAEVMMF                       PIC X.
            03 FILLER REDEFINES AFAEVMMF.
               05 AFAEVMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVMMI                       PIC X(2).
            03 AFAEVJJL                       PIC S9(4) COMP.
            03 AFAEVJJF                       PIC X.
            03 FILLER REDEFINES AFAEVJJF.
               05 AFAEVJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVJJI                       PIC X(4).
            03 AFAEBTTL                       PIC S9(4) COMP.
            03 AFAEBTTF                       PIC X.
            03 FILLER REDEFINES AFAEBTTF.
               05 AFAEBTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBTTI                       PIC X(2).
            03 AFAEBMML                       PIC S9(4) COMP.
            03 AFAEBMMF                       PIC X.
            03 FILLER REDEFINES AFAEBMMF.
               05 AFAEBMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBMMI                       PIC X(2).
            03 AFAEBJJL                       PIC S9(4) COMP.
            03 AFAEBJJF                       PIC X.
            03 FILLER REDEFINES AFAEBJJF.
               05 AFAEBJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBJJI                       PIC X(4).
            03 AFOLGNRL                       PIC S9(4) COMP.
            03 AFOLGNRF                       PIC X.
            03 FILLER REDEFINES AFOLGNRF.
               05 AFOLGNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFOLGNRI                       PIC X(3).
            03 APRODSLL                       PIC S9(4) COMP.
            03 APRODSLF                       PIC X.
            03 FILLER REDEFINES APRODSLF.
               05 APRODSLA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRODSLI                       PIC X(3).
            03 AVNRL                          PIC S9(4) COMP.
            03 AVNRF                          PIC X.
            03 FILLER REDEFINES AVNRF.
               05 AVNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 AVNRI                          PIC X(15).
            03 AUNTERL                        PIC S9(4) COMP.
            03 AUNTERF                        PIC X.
            03 FILLER REDEFINES AUNTERF.
               05 AUNTERA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AUNTERI                        PIC X(3).
            03 ASCHICHL                       PIC S9(4) COMP.
            03 ASCHICHF                       PIC X.
            03 FILLER REDEFINES ASCHICHF.
               05 ASCHICHA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASCHICHI                       PIC X(3).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER REDEFINES AGESBMF.
               05 AGESBMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 AGESL                          PIC S9(4) COMP.
            03 AGESF                          PIC X.
            03 FILLER REDEFINES AGESF.
               05 AGESA                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGESI                          PIC X(2).
            03 ANBBSFBL                       PIC S9(4) COMP.
            03 ANBBSFBF                       PIC X.
            03 FILLER REDEFINES ANBBSFBF.
               05 ANBBSFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANBBSFBI                       PIC X(22).
            03 ANBBSUML                       PIC S9(4) COMP.
            03 ANBBSUMF                       PIC X.
            03 FILLER REDEFINES ANBBSUMF.
               05 ANBBSUMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANBBSUMI                       PIC X(15).
            03 AAUWSFBL                       PIC S9(4) COMP.
            03 AAUWSFBF                       PIC X.
            03 FILLER REDEFINES AAUWSFBF.
               05 AAUWSFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AAUWSFBI                       PIC X(19).
            03 AAUWSUML                       PIC S9(4) COMP.
            03 AAUWSUMF                       PIC X.
            03 FILLER REDEFINES AAUWSUMF.
               05 AAUWSUMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AAUWSUMI                       PIC X(15).

      *  OUTPUT DATA FOR MAP BPA0040
         01 BPA0040O REDEFINES BPA0040I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 APRSUFBH                       PIC X.
            03 APRSUFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 ARATBTGH                       PIC X.
            03 ARATBTGO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 AURSPFBH                       PIC X.
            03 AURSPFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 AURPDATH                       PIC X.
            03 AURPDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ABERSUBH                       PIC X.
            03 ABERSUBO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 APOLDATH                       PIC X.
            03 APOLDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ARDBWFBH                       PIC X.
            03 ARDBWFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 ARBEWSUH                       PIC X.
            03 ARBEWSUO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 APPFLBEH                       PIC X.
            03 APPFLBEO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ABZDAUEH                       PIC X.
            03 ABZDAUEO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 APPFLABH                       PIC X.
            03 APPFLABO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AGSDAUEH                       PIC X.
            03 AGSDAUEO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AINKSSTH                       PIC X.
            03 AINKSSTO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AJAHRBTH                       PIC X.
            03 AJAHRBTO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 AINKAFBH                       PIC X.
            03 AINKAFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 AINKSH                         PIC X.
            03 AINKSO                         PIC X(2).
            03 FILLER                         PIC X(3).
            03 AINKSBMH                       PIC X.
            03 AINKSBMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ABWBTFBH                       PIC X.
            03 ABWBTFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 ABWTBTH                        PIC X.
            03 ABWTBTO                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 ANSTOFBH                       PIC X.
            03 ANSTOFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 ANSTOKZH                       PIC X.
            03 ANSTOKZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 AVVGFBH                        PIC X.
            03 AVVGFBO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 AVVGKZH                        PIC X.
            03 AVVGKZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 ARDBTFBH                       PIC X.
            03 ARDBTFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 ARBWTBTH                       PIC X.
            03 ARBWTBTO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ADYNKZ2H                       PIC X.
            03 ADYNKZ2O                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADYN2BMH                       PIC X.
            03 ADYN2BMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVERSFBH                       PIC X.
            03 AVERSFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 AVERSSUH                       PIC X.
            03 AVERSSUO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ADPKZFBH                       PIC X.
            03 ADPKZFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 ADEPOKZH                       PIC X.
            03 ADEPOKZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 ADEPOBMH                       PIC X.
            03 ADEPOBMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 APRATBTH                       PIC X.
            03 APRATBTO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 AEIKZFBH                       PIC X.
            03 AEIKZFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 AVFGARTH                       PIC X.
            03 AVFGARTO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 APFBTFBH                       PIC X.
            03 APFBTFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 APPFLBTH                       PIC X.
            03 APPFLBTO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ATARIFBH                       PIC X.
            03 ATARIFBO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 APRRATZH                       PIC X.
            03 APRRATZO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 APRRATNH                       PIC X.
            03 APRRATNO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 ASAMMFBH                       PIC X.
            03 ASAMMFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 ASAMMNRH                       PIC X.
            03 ASAMMNRO                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 APFSAFBH                       PIC X.
            03 APFSAFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 APPFLSUH                       PIC X.
            03 APPFLSUO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 ARABSTH                        PIC X.
            03 ARABSTO                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 AHISTUNH                       PIC X.
            03 AHISTUNO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AHISTNRH                       PIC X.
            03 AHISTNRO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ANAMEH                         PIC X.
            03 ANAMEO                         PIC X(25).
            03 FILLER                         PIC X(3).
            03 ANAMEFBH                       PIC X.
            03 ANAMEFBO                       PIC X(5).
            03 FILLER                         PIC X(3).
            03 AFBKENNH                       PIC X.
            03 AFBKENNO                       PIC X(8).
            03 FILLER                         PIC X(3).
            03 AGLKENNH                       PIC X.
            03 AGLKENNO                       PIC X(6).
            03 FILLER                         PIC X(3).
            03 AORDNRH                        PIC X.
            03 AORDNRO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEVTTH                       PIC X.
            03 AFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEVMMH                       PIC X.
            03 AFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEVJJH                       PIC X.
            03 AFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AFAEBTTH                       PIC X.
            03 AFAEBTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEBMMH                       PIC X.
            03 AFAEBMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEBJJH                       PIC X.
            03 AFAEBJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AFOLGNRH                       PIC X.
            03 AFOLGNRO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APRODSLH                       PIC X.
            03 APRODSLO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AVNRH                          PIC X.
            03 AVNRO                          PIC X(15).
            03 FILLER                         PIC X(3).
            03 AUNTERH                        PIC X.
            03 AUNTERO                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASCHICHH                       PIC X.
            03 ASCHICHO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 AGESH                          PIC X.
            03 AGESO                          PIC X(2).
            03 FILLER                         PIC X(3).
            03 ANBBSFBH                       PIC X.
            03 ANBBSFBO                       PIC X(22).
            03 FILLER                         PIC X(3).
            03 ANBBSUMH                       PIC X.
            03 ANBBSUMO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 AAUWSFBH                       PIC X.
            03 AAUWSFBO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 AAUWSUMH                       PIC X.
            03 AAUWSUMO                       PIC X(15).

