      *   Mainframe Express 3.1  6.013.0041
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-57)
      *   MapSet Name   BPA0036
      *   Date Created  12/10/2013
      *   Time Created  07:26:05

      *  Input Data For Map BPA0036
         01 BPA0036I.
            03 FILLER                         PIC X(12).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(1).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(1).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(24).
            03 AVBNRFBL                       PIC S9(4) COMP.
            03 AVBNRFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVBNRFBI                       PIC X(30).
            03 ESVBNRL                        PIC S9(4) COMP.
            03 ESVBNRF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ESVBNRI                        PIC X(7).
            03 ESVBNRPL                       PIC S9(4) COMP.
            03 ESVBNRPF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESVBNRPI                       PIC X(1).
            03 ASTREFBL                       PIC S9(4) COMP.
            03 ASTREFBF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTREFBI                       PIC X(18).
            03 ASTREDAL                       PIC S9(4) COMP.
            03 ASTREDAF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTREDAI                       PIC X(1).
            03 ESTRETTL                       PIC S9(4) COMP.
            03 ESTRETTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESTRETTI                       PIC X(2).
            03 ESTREMML                       PIC S9(4) COMP.
            03 ESTREMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESTREMMI                       PIC X(2).
            03 ESTREJJL                       PIC S9(4) COMP.
            03 ESTREJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESTREJJI                       PIC X(4).
            03 AVSTATL                        PIC S9(4) COMP.
            03 AVSTATF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTATI                        PIC X(4).
            03 AVSTXTL                        PIC S9(4) COMP.
            03 AVSTXTF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTXTI                        PIC X(50).
            03 AFCZFBL                        PIC S9(4) COMP.
            03 AFCZFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZFBI                        PIC X(2).
            03 DFHG001I                       OCCURS 9 TIMES.
               05 EFCZL                          PIC S9(4) COMP.
               05 EFCZF                          PIC X.
               05 FILLER                         PIC X(1).
               05 EFCZI                          PIC X(1).
               05 AVBNRL                         PIC S9(4) COMP.
               05 AVBNRF                         PIC X.
               05 FILLER                         PIC X(1).
               05 AVBNRI                         PIC X(1).
               05 EVBNRL                         PIC S9(4) COMP.
               05 EVBNRF                         PIC X.
               05 FILLER                         PIC X(1).
               05 EVBNRI                         PIC X(7).
               05 EVBNRPL                        PIC S9(4) COMP.
               05 EVBNRPF                        PIC X.
               05 FILLER                         PIC X(1).
               05 EVBNRPI                        PIC X(1).
               05 AVBNKL                         PIC S9(4) COMP.
               05 AVBNKF                         PIC X.
               05 FILLER                         PIC X(1).
               05 AVBNKI                         PIC X(20).
               05 ASTRSTUL                       PIC S9(4) COMP.
               05 ASTRSTUF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ASTRSTUI                       PIC X(1).
               05 ESTRSTUL                       PIC S9(4) COMP.
               05 ESTRSTUF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ESTRSTUI                       PIC X(4).
               05 ADIPROVL                       PIC S9(4) COMP.
               05 ADIPROVF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ADIPROVI                       PIC X(1).
               05 EDIPROVL                       PIC S9(4) COMP.
               05 EDIPROVF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EDIPROVI                       PIC X(3).
               05 AEMPTYPL                       PIC S9(4) COMP.
               05 AEMPTYPF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AEMPTYPI                       PIC X(1).
               05 EEMPTYPL                       PIC S9(4) COMP.
               05 EEMPTYPF                       PIC X.
               05 FILLER                         PIC X(1).
               05 EEMPTYPI                       PIC X(2).
               05 AEMPTBKL                       PIC S9(4) COMP.
               05 AEMPTBKF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AEMPTBKI                       PIC X(10).
            03 AFCZANZL                       PIC S9(4) COMP.
            03 AFCZANZF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCZANZI                       PIC X(79).
            03 AGESL                          PIC S9(4) COMP.
            03 AGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(9).
            03 APINFBL                        PIC S9(4) COMP.
            03 APINFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 APINFBI                        PIC X(4).
            03 APINL                          PIC S9(4) COMP.
            03 APINF                          PIC X.
            03 FILLER                         PIC X(1).
            03 APINI                          PIC X(9).
            03 AVNRL                          PIC S9(4) COMP.
            03 AVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 AVNRI                          PIC X(16).

      *  Output Data For Map BPA0036
         01 BPA0036O REDEFINES BPA0036I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 ESEIAKTA                       PIC X.
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEISTRA                       PIC X.
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEIGESA                       PIC X.
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 AFCSFBA                        PIC X.
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(2).
            03 EFCSA                          PIC X.
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(2).
            03 AFCSANZA                       PIC X.
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(24).
            03 FILLER                         PIC X(2).
            03 AVBNRFBA                       PIC X.
            03 AVBNRFBH                       PIC X.
            03 AVBNRFBO                       PIC X(30).
            03 FILLER                         PIC X(2).
            03 ESVBNRA                        PIC X.
            03 ESVBNRH                        PIC X.
            03 ESVBNRO                        PIC X(7).
            03 FILLER                         PIC X(2).
            03 ESVBNRPA                       PIC X.
            03 ESVBNRPH                       PIC X.
            03 ESVBNRPO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASTREFBA                       PIC X.
            03 ASTREFBH                       PIC X.
            03 ASTREFBO                       PIC X(18).
            03 FILLER                         PIC X(2).
            03 ASTREDAA                       PIC X.
            03 ASTREDAH                       PIC X.
            03 ASTREDAO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ESTRETTA                       PIC X.
            03 ESTRETTH                       PIC X.
            03 ESTRETTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 ESTREMMA                       PIC X.
            03 ESTREMMH                       PIC X.
            03 ESTREMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 ESTREJJA                       PIC X.
            03 ESTREJJH                       PIC X.
            03 ESTREJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVSTATA                        PIC X.
            03 AVSTATH                        PIC X.
            03 AVSTATO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 AVSTXTA                        PIC X.
            03 AVSTXTH                        PIC X.
            03 AVSTXTO                        PIC X(50).
            03 FILLER                         PIC X(2).
            03 AFCZFBA                        PIC X.
            03 AFCZFBH                        PIC X.
            03 AFCZFBO                        PIC X(2).
            03 DFHG001O OCCURS 9.
               05 FILLER                         PIC X(2).
               05 EFCZA                          PIC X.
               05 EFCZH                          PIC X.
               05 EFCZO                          PIC X(1).
               05 FILLER                         PIC X(2).
               05 AVBNRA                         PIC X.
               05 AVBNRH                         PIC X.
               05 AVBNRO                         PIC X(1).
               05 FILLER                         PIC X(2).
               05 EVBNRA                         PIC X.
               05 EVBNRH                         PIC X.
               05 EVBNRO                         PIC X(7).
               05 FILLER                         PIC X(2).
               05 EVBNRPA                        PIC X.
               05 EVBNRPH                        PIC X.
               05 EVBNRPO                        PIC X(1).
               05 FILLER                         PIC X(2).
               05 AVBNKA                         PIC X.
               05 AVBNKH                         PIC X.
               05 AVBNKO                         PIC X(20).
               05 FILLER                         PIC X(2).
               05 ASTRSTUA                       PIC X.
               05 ASTRSTUH                       PIC X.
               05 ASTRSTUO                       PIC X(1).
               05 FILLER                         PIC X(2).
               05 ESTRSTUA                       PIC X.
               05 ESTRSTUH                       PIC X.
               05 ESTRSTUO                       PIC X(4).
               05 FILLER                         PIC X(2).
               05 ADIPROVA                       PIC X.
               05 ADIPROVH                       PIC X.
               05 ADIPROVO                       PIC X(1).
               05 FILLER                         PIC X(2).
               05 EDIPROVA                       PIC X.
               05 EDIPROVH                       PIC X.
               05 EDIPROVO                       PIC X(3).
               05 FILLER                         PIC X(2).
               05 AEMPTYPA                       PIC X.
               05 AEMPTYPH                       PIC X.
               05 AEMPTYPO                       PIC X(1).
               05 FILLER                         PIC X(2).
               05 EEMPTYPA                       PIC X.
               05 EEMPTYPH                       PIC X.
               05 EEMPTYPO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 AEMPTBKA                       PIC X.
               05 AEMPTBKH                       PIC X.
               05 AEMPTBKO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AFCZANZA                       PIC X.
            03 AFCZANZH                       PIC X.
            03 AFCZANZO                       PIC X(79).
            03 FILLER                         PIC X(2).
            03 AGESA                          PIC X.
            03 AGESH                          PIC X.
            03 AGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(9).
            03 FILLER                         PIC X(2).
            03 APINFBA                        PIC X.
            03 APINFBH                        PIC X.
            03 APINFBO                        PIC X(4).
            03 FILLER                         PIC X(2).
            03 APINA                          PIC X.
            03 APINH                          PIC X.
            03 APINO                          PIC X(9).
            03 FILLER                         PIC X(2).
            03 AVNRA                          PIC X.
            03 AVNRH                          PIC X.
            03 AVNRO                          PIC X(16).

