      *   Mainframe Express 3.1  6.018.0057
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-65)
      *   MapSet Name   BPA0027
      *   Date Created  05/15/2018
      *   Time Created  09:41:58

      *  Input Data For Map BPA0027
         01 BPA0027I.
            03 FILLER                         PIC X(12).
            03 AGESL                          PIC S9(4) COMP.
            03 AGESF                          PIC X.
            03 FILLER REDEFINES AGESF.
               05 AGESA                          PIC X.
            03 FILLER                         PIC X(1).
            03 AGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER REDEFINES AGESBMF.
               05 AGESBMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 AVNRL                          PIC S9(4) COMP.
            03 AVNRF                          PIC X.
            03 FILLER REDEFINES AVNRF.
               05 AVNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 AVNRI                          PIC X(15).
            03 AUNTERL                        PIC S9(4) COMP.
            03 AUNTERF                        PIC X.
            03 FILLER REDEFINES AUNTERF.
               05 AUNTERA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AUNTERI                        PIC X(3).
            03 ASCHICHL                       PIC S9(4) COMP.
            03 ASCHICHF                       PIC X.
            03 FILLER REDEFINES ASCHICHF.
               05 ASCHICHA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASCHICHI                       PIC X(3).
            03 APINFBL                        PIC S9(4) COMP.
            03 APINFBF                        PIC X.
            03 FILLER REDEFINES APINFBF.
               05 APINFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 APINFBI                        PIC X(4).
            03 APINL                          PIC S9(4) COMP.
            03 APINF                          PIC X.
            03 FILLER REDEFINES APINF.
               05 APINA                          PIC X.
            03 FILLER                         PIC X(1).
            03 APINI                          PIC X(9).
            03 APRODSLL                       PIC S9(4) COMP.
            03 APRODSLF                       PIC X.
            03 FILLER REDEFINES APRODSLF.
               05 APRODSLA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRODSLI                       PIC X(3).
            03 AORDNRL                        PIC S9(4) COMP.
            03 AORDNRF                        PIC X.
            03 FILLER REDEFINES AORDNRF.
               05 AORDNRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AORDNRI                        PIC X(2).
            03 AFAEVTTL                       PIC S9(4) COMP.
            03 AFAEVTTF                       PIC X.
            03 FILLER REDEFINES AFAEVTTF.
               05 AFAEVTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVTTI                       PIC X(2).
            03 AFAEVMML                       PIC S9(4) COMP.
            03 AFAEVMMF                       PIC X.
            03 FILLER REDEFINES AFAEVMMF.
               05 AFAEVMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVMMI                       PIC X(2).
            03 AFAEVJJL                       PIC S9(4) COMP.
            03 AFAEVJJF                       PIC X.
            03 FILLER REDEFINES AFAEVJJF.
               05 AFAEVJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEVJJI                       PIC X(4).
            03 AFAEBTTL                       PIC S9(4) COMP.
            03 AFAEBTTF                       PIC X.
            03 FILLER REDEFINES AFAEBTTF.
               05 AFAEBTTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBTTI                       PIC X(2).
            03 AFAEBMML                       PIC S9(4) COMP.
            03 AFAEBMMF                       PIC X.
            03 FILLER REDEFINES AFAEBMMF.
               05 AFAEBMMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBMMI                       PIC X(2).
            03 AFAEBJJL                       PIC S9(4) COMP.
            03 AFAEBJJF                       PIC X.
            03 FILLER REDEFINES AFAEBJJF.
               05 AFAEBJJA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFAEBJJI                       PIC X(4).
            03 AFOLGNRL                       PIC S9(4) COMP.
            03 AFOLGNRF                       PIC X.
            03 FILLER REDEFINES AFOLGNRF.
               05 AFOLGNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFOLGNRI                       PIC X(3).
            03 AFBKENNL                       PIC S9(4) COMP.
            03 AFBKENNF                       PIC X.
            03 FILLER REDEFINES AFBKENNF.
               05 AFBKENNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBKENNI                       PIC X(8).
            03 AGLKENNL                       PIC S9(4) COMP.
            03 AGLKENNF                       PIC X.
            03 FILLER REDEFINES AGLKENNF.
               05 AGLKENNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AGLKENNI                       PIC X(6).
            03 ANAMEFBL                       PIC S9(4) COMP.
            03 ANAMEFBF                       PIC X.
            03 FILLER REDEFINES ANAMEFBF.
               05 ANAMEFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEFBI                       PIC X(5).
            03 ANAMEL                         PIC S9(4) COMP.
            03 ANAMEF                         PIC X.
            03 FILLER REDEFINES ANAMEF.
               05 ANAMEA                         PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEI                         PIC X(25).
            03 AHISTNRL                       PIC S9(4) COMP.
            03 AHISTNRF                       PIC X.
            03 FILLER REDEFINES AHISTNRF.
               05 AHISTNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHISTNRI                       PIC X(3).
            03 AZAELFBL                       PIC S9(4) COMP.
            03 AZAELFBF                       PIC X.
            03 FILLER REDEFINES AZAELFBF.
               05 AZAELFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZAELFBI                       PIC X(13).
            03 AZAELNRL                       PIC S9(4) COMP.
            03 AZAELNRF                       PIC X.
            03 FILLER REDEFINES AZAELNRF.
               05 AZAELNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZAELNRI                       PIC X(20).
            03 AVERBFBL                       PIC S9(4) COMP.
            03 AVERBFBF                       PIC X.
            03 FILLER REDEFINES AVERBFBF.
               05 AVERBFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERBFBI                       PIC X(10).
            03 AVERBRL                        PIC S9(4) COMP.
            03 AVERBRF                        PIC X.
            03 FILLER REDEFINES AVERBRF.
               05 AVERBRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVERBRI                        PIC X(10).
            03 AVERPFBL                       PIC S9(4) COMP.
            03 AVERPFBF                       PIC X.
            03 FILLER REDEFINES AVERPFBF.
               05 AVERPFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERPFBI                       PIC X(24).
            03 AVERSPNL                       PIC S9(4) COMP.
            03 AVERSPNF                       PIC X.
            03 FILLER REDEFINES AVERSPNF.
               05 AVERSPNA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVERSPNI                       PIC X(2).
            03 AFLXFB1L                       PIC S9(4) COMP.
            03 AFLXFB1F                       PIC X.
            03 FILLER REDEFINES AFLXFB1F.
               05 AFLXFB1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLXFB1I                       PIC X(18).
            03 AFLEXRLL                       PIC S9(4) COMP.
            03 AFLEXRLF                       PIC X.
            03 FILLER REDEFINES AFLEXRLF.
               05 AFLEXRLA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLEXRLI                       PIC X(1).
            03 APRSUFBL                       PIC S9(4) COMP.
            03 APRSUFBF                       PIC X.
            03 FILLER REDEFINES APRSUFBF.
               05 APRSUFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRSUFBI                       PIC X(24).
            03 APRTASUL                       PIC S9(4) COMP.
            03 APRTASUF                       PIC X.
            03 FILLER REDEFINES APRTASUF.
               05 APRTASUA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRTASUI                       PIC X(13).
            03 AFLXFB2L                       PIC S9(4) COMP.
            03 AFLXFB2F                       PIC X.
            03 FILLER REDEFINES AFLXFB2F.
               05 AFLXFB2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLXFB2I                       PIC X(18).
            03 AVSPFKZL                       PIC S9(4) COMP.
            03 AVSPFKZF                       PIC X.
            03 FILLER REDEFINES AVSPFKZF.
               05 AVSPFKZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSPFKZI                       PIC X(1).
            03 APRRAFBL                       PIC S9(4) COMP.
            03 APRRAFBF                       PIC X.
            03 FILLER REDEFINES APRRAFBF.
               05 APRRAFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRRAFBI                       PIC X(24).
            03 APRRAT1L                       PIC S9(4) COMP.
            03 APRRAT1F                       PIC X.
            03 FILLER REDEFINES APRRAT1F.
               05 APRRAT1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRRAT1I                       PIC X(4).
            03 APRRFB2L                       PIC S9(4) COMP.
            03 APRRFB2F                       PIC X.
            03 FILLER REDEFINES APRRFB2F.
               05 APRRFB2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRRFB2I                       PIC X(1).
            03 APRRAT2L                       PIC S9(4) COMP.
            03 APRRAT2F                       PIC X.
            03 FILLER REDEFINES APRRAT2F.
               05 APRRAT2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRRAT2I                       PIC X(4).
            03 AFLXFB3L                       PIC S9(4) COMP.
            03 AFLXFB3F                       PIC X.
            03 FILLER REDEFINES AFLXFB3F.
               05 AFLXFB3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLXFB3I                       PIC X(18).
            03 APRKONRL                       PIC S9(4) COMP.
            03 APRKONRF                       PIC X.
            03 FILLER REDEFINES APRKONRF.
               05 APRKONRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRKONRI                       PIC X(5).
            03 APGKZFBL                       PIC S9(4) COMP.
            03 APGKZFBF                       PIC X.
            03 FILLER REDEFINES APGKZFBF.
               05 APGKZFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APGKZFBI                       PIC X(24).
            03 APGVKZL                        PIC S9(4) COMP.
            03 APGVKZF                        PIC X.
            03 FILLER REDEFINES APGVKZF.
               05 APGVKZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGVKZI                        PIC X(1).
            03 AFLXFB4L                       PIC S9(4) COMP.
            03 AFLXFB4F                       PIC X.
            03 FILLER REDEFINES AFLXFB4F.
               05 AFLXFB4A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLXFB4I                       PIC X(18).
            03 APRKOBZL                       PIC S9(4) COMP.
            03 APRKOBZF                       PIC X.
            03 FILLER REDEFINES APRKOBZF.
               05 APRKOBZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRKOBZI                       PIC X(3).
            03 ASTRUFBL                       PIC S9(4) COMP.
            03 ASTRUFBF                       PIC X.
            03 FILLER REDEFINES ASTRUFBF.
               05 ASTRUFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTRUFBI                       PIC X(24).
            03 ASTRUKTL                       PIC S9(4) COMP.
            03 ASTRUKTF                       PIC X.
            03 FILLER REDEFINES ASTRUKTF.
               05 ASTRUKTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTRUKTI                       PIC X(10).
            03 AFLXFB5L                       PIC S9(4) COMP.
            03 AFLXFB5F                       PIC X.
            03 FILLER REDEFINES AFLXFB5F.
               05 AFLXFB5A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLXFB5I                       PIC X(18).
            03 AFLEXBRL                       PIC S9(4) COMP.
            03 AFLEXBRF                       PIC X.
            03 FILLER REDEFINES AFLEXBRF.
               05 AFLEXBRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFLEXBRI                       PIC X(1).
            03 AHFTFB1L                       PIC S9(4) COMP.
            03 AHFTFB1F                       PIC X.
            03 FILLER REDEFINES AHFTFB1F.
               05 AHFTFB1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHFTFB1I                       PIC X(12).
            03 AHFTFB2L                       PIC S9(4) COMP.
            03 AHFTFB2F                       PIC X.
            03 FILLER REDEFINES AHFTFB2F.
               05 AHFTFB2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHFTFB2I                       PIC X(5).
            03 AHFTVONL                       PIC S9(4) COMP.
            03 AHFTVONF                       PIC X.
            03 FILLER REDEFINES AHFTVONF.
               05 AHFTVONA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHFTVONI                       PIC X(10).
            03 AHFTFB3L                       PIC S9(4) COMP.
            03 AHFTFB3F                       PIC X.
            03 FILLER REDEFINES AHFTFB3F.
               05 AHFTFB3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHFTFB3I                       PIC X(3).
            03 AHFTBISL                       PIC S9(4) COMP.
            03 AHFTBISF                       PIC X.
            03 FILLER REDEFINES AHFTBISF.
               05 AHFTBISA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AHFTBISI                       PIC X(10).
            03 ALFZFBL                        PIC S9(4) COMP.
            03 ALFZFBF                        PIC X.
            03 FILLER REDEFINES ALFZFBF.
               05 ALFZFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ALFZFBI                        PIC X(9).
            03 ATLSLFZL                       PIC S9(4) COMP.
            03 ATLSLFZF                       PIC X.
            03 FILLER REDEFINES ATLSLFZF.
               05 ATLSLFZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ATLSLFZI                       PIC X(2).
            03 AAUSSFBL                       PIC S9(4) COMP.
            03 AAUSSFBF                       PIC X.
            03 FILLER REDEFINES AAUSSFBF.
               05 AAUSSFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AAUSSFBI                       PIC X(24).
            03 AAUSSCHL                       PIC S9(4) COMP.
            03 AAUSSCHF                       PIC X.
            03 FILLER REDEFINES AAUSSCHF.
               05 AAUSSCHA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AAUSSCHI                       PIC X(18).
            03 AKZEAFBL                       PIC S9(4) COMP.
            03 AKZEAFBF                       PIC X.
            03 FILLER REDEFINES AKZEAFBF.
               05 AKZEAFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKZEAFBI                       PIC X(18).
            03 AKZEANTL                       PIC S9(4) COMP.
            03 AKZEANTF                       PIC X.
            03 FILLER REDEFINES AKZEANTF.
               05 AKZEANTA                       PIC X(1).
            03 FILLER                         PIC X(1).
            03 AKZEANTI                       PIC X(1).
            03 AKONDBML                       PIC S9(4) COMP.
            03 AKONDBMF                       PIC X.
            03 FILLER REDEFINES AKONDBMF.
               05 AKONDBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKONDBMI                       PIC X(40).
            03 APARTFBL                       PIC S9(4) COMP.
            03 APARTFBF                       PIC X.
            03 FILLER REDEFINES APARTFBF.
               05 APARTFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APARTFBI                       PIC X(15).
            03 APRPARTL                       PIC S9(4) COMP.
            03 APRPARTF                       PIC X.
            03 FILLER REDEFINES APRPARTF.
               05 APRPARTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APRPARTI                       PIC X(2).
            03 APARTXTL                       PIC S9(4) COMP.
            03 APARTXTF                       PIC X.
            03 FILLER REDEFINES APARTXTF.
               05 APARTXTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APARTXTI                       PIC X(20).
            03 ASTOGFBL                       PIC S9(4) COMP.
            03 ASTOGFBF                       PIC X.
            03 FILLER REDEFINES ASTOGFBF.
               05 ASTOGFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTOGFBI                       PIC X(12).
            03 ASTOGRDL                       PIC S9(4) COMP.
            03 ASTOGRDF                       PIC X.
            03 FILLER REDEFINES ASTOGRDF.
               05 ASTOGRDA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTOGRDI                       PIC X(2).
            03 ASTOTXTL                       PIC S9(4) COMP.
            03 ASTOTXTF                       PIC X.
            03 FILLER REDEFINES ASTOTXTF.
               05 ASTOTXTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASTOTXTI                       PIC X(20).
            03 ATARIFBL                       PIC S9(4) COMP.
            03 ATARIFBF                       PIC X.
            03 FILLER REDEFINES ATARIFBF.
               05 ATARIFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ATARIFBI                       PIC X(17).
            03 ATFBEZTL                       PIC S9(4) COMP.
            03 ATFBEZTF                       PIC X.
            03 FILLER REDEFINES ATFBEZTF.
               05 ATFBEZTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ATFBEZTI                       PIC X(50).
            03 ATNRFBL                        PIC S9(4) COMP.
            03 ATNRFBF                        PIC X.
            03 FILLER REDEFINES ATNRFBF.
               05 ATNRFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ATNRFBI                        PIC X(24).
            03 ATNRPNL                        PIC S9(4) COMP.
            03 ATNRPNF                        PIC X.
            03 FILLER REDEFINES ATNRPNF.
               05 ATNRPNA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ATNRPNI                        PIC X(20).
            03 AMIGRFBL                       PIC S9(4) COMP.
            03 AMIGRFBF                       PIC X.
            03 FILLER REDEFINES AMIGRFBF.
               05 AMIGRFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AMIGRFBI                       PIC X(14).
            03 AMIGKZL                        PIC S9(4) COMP.
            03 AMIGKZF                        PIC X.
            03 FILLER REDEFINES AMIGKZF.
               05 AMIGKZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AMIGKZI                        PIC X(1).
            03 AABRDATL                       PIC S9(4) COMP.
            03 AABRDATF                       PIC X.
            03 FILLER REDEFINES AABRDATF.
               05 AABRDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AABRDATI                       PIC X(10).
            03 AUPDDAL                        PIC S9(4) COMP.
            03 AUPDDAF                        PIC X.
            03 FILLER REDEFINES AUPDDAF.
               05 AUPDDAA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AUPDDAI                        PIC X(10).
            03 AEINDFBL                       PIC S9(4) COMP.
            03 AEINDFBF                       PIC X.
            03 FILLER REDEFINES AEINDFBF.
               05 AEINDFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEINDFBI                       PIC X(24).
            03 AEINDATL                       PIC S9(4) COMP.
            03 AEINDATF                       PIC X.
            03 FILLER REDEFINES AEINDATF.
               05 AEINDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AEINDATI                       PIC X(10).
            03 AUPDUIDL                       PIC S9(4) COMP.
            03 AUPDUIDF                       PIC X.
            03 FILLER REDEFINES AUPDUIDF.
               05 AUPDUIDA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AUPDUIDI                       PIC X(8).

      *  Output Data For Map BPA0027
         01 BPA0027O REDEFINES BPA0027I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 AGESH                          PIC X.
            03 AGESO                          PIC X(2).
            03 FILLER                         PIC X(3).
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVNRH                          PIC X.
            03 AVNRO                          PIC X(15).
            03 FILLER                         PIC X(3).
            03 AUNTERH                        PIC X.
            03 AUNTERO                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASCHICHH                       PIC X.
            03 ASCHICHO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APINFBH                        PIC X.
            03 APINFBO                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 APINH                          PIC X.
            03 APINO                          PIC X(9).
            03 FILLER                         PIC X(3).
            03 APRODSLH                       PIC X.
            03 APRODSLO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AORDNRH                        PIC X.
            03 AORDNRO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEVTTH                       PIC X.
            03 AFAEVTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEVMMH                       PIC X.
            03 AFAEVMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEVJJH                       PIC X.
            03 AFAEVJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AFAEBTTH                       PIC X.
            03 AFAEBTTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEBMMH                       PIC X.
            03 AFAEBMMO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFAEBJJH                       PIC X.
            03 AFAEBJJO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AFOLGNRH                       PIC X.
            03 AFOLGNRO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFBKENNH                       PIC X.
            03 AFBKENNO                       PIC X(8).
            03 FILLER                         PIC X(3).
            03 AGLKENNH                       PIC X.
            03 AGLKENNO                       PIC X(6).
            03 FILLER                         PIC X(3).
            03 ANAMEFBH                       PIC X.
            03 ANAMEFBO                       PIC X(5).
            03 FILLER                         PIC X(3).
            03 ANAMEH                         PIC X.
            03 ANAMEO                         PIC X(25).
            03 FILLER                         PIC X(3).
            03 AHISTNRH                       PIC X.
            03 AHISTNRO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AZAELFBH                       PIC X.
            03 AZAELFBO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 AZAELNRH                       PIC X.
            03 AZAELNRO                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 AVERBFBH                       PIC X.
            03 AVERBFBO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVERBRH                        PIC X.
            03 AVERBRO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVERPFBH                       PIC X.
            03 AVERPFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 AVERSPNH                       PIC X.
            03 AVERSPNO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFLXFB1H                       PIC X.
            03 AFLXFB1O                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 AFLEXRLH                       PIC X.
            03 AFLEXRLO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 APRSUFBH                       PIC X.
            03 APRSUFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 APRTASUH                       PIC X.
            03 APRTASUO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 AFLXFB2H                       PIC X.
            03 AFLXFB2O                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 AVSPFKZH                       PIC X.
            03 AVSPFKZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 APRRAFBH                       PIC X.
            03 APRRAFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 APRRAT1H                       PIC X.
            03 APRRAT1O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 APRRFB2H                       PIC X.
            03 APRRFB2O                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 APRRAT2H                       PIC X.
            03 APRRAT2O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AFLXFB3H                       PIC X.
            03 AFLXFB3O                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 APRKONRH                       PIC X.
            03 APRKONRO                       PIC X(5).
            03 FILLER                         PIC X(3).
            03 APGKZFBH                       PIC X.
            03 APGKZFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 APGVKZH                        PIC X.
            03 APGVKZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 AFLXFB4H                       PIC X.
            03 AFLXFB4O                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 APRKOBZH                       PIC X.
            03 APRKOBZO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASTRUFBH                       PIC X.
            03 ASTRUFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 ASTRUKTH                       PIC X.
            03 ASTRUKTO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AFLXFB5H                       PIC X.
            03 AFLXFB5O                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 AFLEXBRH                       PIC X.
            03 AFLEXBRO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 AHFTFB1H                       PIC X.
            03 AHFTFB1O                       PIC X(12).
            03 FILLER                         PIC X(3).
            03 AHFTFB2H                       PIC X.
            03 AHFTFB2O                       PIC X(5).
            03 FILLER                         PIC X(3).
            03 AHFTVONH                       PIC X.
            03 AHFTVONO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AHFTFB3H                       PIC X.
            03 AHFTFB3O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AHFTBISH                       PIC X.
            03 AHFTBISO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ALFZFBH                        PIC X.
            03 ALFZFBO                        PIC X(9).
            03 FILLER                         PIC X(3).
            03 ATLSLFZH                       PIC X.
            03 ATLSLFZO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AAUSSFBH                       PIC X.
            03 AAUSSFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 AAUSSCHH                       PIC X.
            03 AAUSSCHO                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 AKZEAFBH                       PIC X.
            03 AKZEAFBO                       PIC X(18).
            03 FILLER                         PIC X(3).
            03 AKZEANTH                       PIC X.
            03 AKZEANTO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 AKONDBMH                       PIC X.
            03 AKONDBMO                       PIC X(40).
            03 FILLER                         PIC X(3).
            03 APARTFBH                       PIC X.
            03 APARTFBO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 APRPARTH                       PIC X.
            03 APRPARTO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 APARTXTH                       PIC X.
            03 APARTXTO                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 ASTOGFBH                       PIC X.
            03 ASTOGFBO                       PIC X(12).
            03 FILLER                         PIC X(3).
            03 ASTOGRDH                       PIC X.
            03 ASTOGRDO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 ASTOTXTH                       PIC X.
            03 ASTOTXTO                       PIC X(20).
            03 FILLER                         PIC X(3).
            03 ATARIFBH                       PIC X.
            03 ATARIFBO                       PIC X(17).
            03 FILLER                         PIC X(3).
            03 ATFBEZTH                       PIC X.
            03 ATFBEZTO                       PIC X(50).
            03 FILLER                         PIC X(3).
            03 ATNRFBH                        PIC X.
            03 ATNRFBO                        PIC X(24).
            03 FILLER                         PIC X(3).
            03 ATNRPNH                        PIC X.
            03 ATNRPNO                        PIC X(20).
            03 FILLER                         PIC X(3).
            03 AMIGRFBH                       PIC X.
            03 AMIGRFBO                       PIC X(14).
            03 FILLER                         PIC X(3).
            03 AMIGKZH                        PIC X.
            03 AMIGKZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 AABRDATH                       PIC X.
            03 AABRDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AUPDDAH                        PIC X.
            03 AUPDDAO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 AEINDFBH                       PIC X.
            03 AEINDFBO                       PIC X(24).
            03 FILLER                         PIC X(3).
            03 AEINDATH                       PIC X.
            03 AEINDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AUPDUIDH                       PIC X.
            03 AUPDUIDO                       PIC X(8).


