      *   Mainframe Express 3.1  6.013.0041
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-57)
      *   MapSet Name   BPA0018
      *   Date Created  10/31/2016
      *   Time Created  10:10:48

      *  Input Data For Map BPA0018
         01 BPA0018I.
            03 FILLER                         PIC X(12).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER REDEFINES EGESF.
               05 EGESA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER REDEFINES AGESBMF.
               05 AGESBMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER REDEFINES EVNRF.
               05 EVNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 EHISTNRL                       PIC S9(4) COMP.
            03 EHISTNRF                       PIC X.
            03 FILLER REDEFINES EHISTNRF.
               05 EHISTNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EHISTNRI                       PIC X(2).
            03 AFCSFBL                        PIC S9(4) COMP.
            03 AFCSFBF                        PIC X.
            03 FILLER REDEFINES AFCSFBF.
               05 AFCSFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSFBI                        PIC X(5).
            03 EFCSL                          PIC S9(4) COMP.
            03 EFCSF                          PIC X.
            03 FILLER REDEFINES EFCSF.
               05 EFCSA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EFCSI                          PIC X(3).
            03 AFCSANZL                       PIC S9(4) COMP.
            03 AFCSANZF                       PIC X.
            03 FILLER REDEFINES AFCSANZF.
               05 AFCSANZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFCSANZI                       PIC X(19).
            03 EPINL                          PIC S9(4) COMP.
            03 EPINF                          PIC X.
            03 FILLER REDEFINES EPINF.
               05 EPINA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EPINI                          PIC X(9).
            03 APINPRZL                       PIC S9(4) COMP.
            03 APINPRZF                       PIC X.
            03 FILLER REDEFINES APINPRZF.
               05 APINPRZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 APINPRZI                       PIC X(2).
            03 AVGESL                         PIC S9(4) COMP.
            03 AVGESF                         PIC X.
            03 FILLER REDEFINES AVGESF.
               05 AVGESA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESI                         PIC X(4).
            03 ANAMEFBL                       PIC S9(4) COMP.
            03 ANAMEFBF                       PIC X.
            03 FILLER REDEFINES ANAMEFBF.
               05 ANAMEFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEFBI                       PIC X(13).
            03 AKDNNL                         PIC S9(4) COMP.
            03 AKDNNF                         PIC X.
            03 FILLER REDEFINES AKDNNF.
               05 AKDNNA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AKDNNI                         PIC X(25).
            03 AVNAMFBL                       PIC S9(4) COMP.
            03 AVNAMFBF                       PIC X.
            03 FILLER REDEFINES AVNAMFBF.
               05 AVNAMFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVNAMFBI                       PIC X(9).
            03 AKDVNL                         PIC S9(4) COMP.
            03 AKDVNF                         PIC X.
            03 FILLER REDEFINES AKDVNF.
               05 AKDVNA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AKDVNI                         PIC X(20).
            03 AVBGDATL                       PIC S9(4) COMP.
            03 AVBGDATF                       PIC X.
            03 FILLER REDEFINES AVBGDATF.
               05 AVBGDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVBGDATI                       PIC X(10).
            03 AVGESFBL                       PIC S9(4) COMP.
            03 AVGESFBF                       PIC X.
            03 FILLER REDEFINES AVGESFBF.
               05 AVGESFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESFBI                       PIC X(10).
            03 AVMGESL                        PIC S9(4) COMP.
            03 AVMGESF                        PIC X.
            03 FILLER REDEFINES AVMGESF.
               05 AVMGESA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVMGESI                        PIC X(2).
            03 AVGESBML                       PIC S9(4) COMP.
            03 AVGESBMF                       PIC X.
            03 FILLER REDEFINES AVGESBMF.
               05 AVGESBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESBMI                       PIC X(10).
            03 AVABDFBL                       PIC S9(4) COMP.
            03 AVABDFBF                       PIC X.
            03 FILLER REDEFINES AVABDFBF.
               05 AVABDFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVABDFBI                       PIC X(17).
            03 AVABDATL                       PIC S9(4) COMP.
            03 AVABDATF                       PIC X.
            03 FILLER REDEFINES AVABDATF.
               05 AVABDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVABDATI                       PIC X(10).
            03 AFEIVFBL                       PIC S9(4) COMP.
            03 AFEIVFBF                       PIC X.
            03 FILLER REDEFINES AFEIVFBF.
               05 AFEIVFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFEIVFBI                       PIC X(13).
            03 AFEIVBKL                       PIC S9(4) COMP.
            03 AFEIVBKF                       PIC X.
            03 FILLER REDEFINES AFEIVBKF.
               05 AFEIVBKA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFEIVBKI                       PIC X(1).
            03 AFEIVBML                       PIC S9(4) COMP.
            03 AFEIVBMF                       PIC X.
            03 FILLER REDEFINES AFEIVBMF.
               05 AFEIVBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFEIVBMI                       PIC X(10).
            03 AZHLWFBL                       PIC S9(4) COMP.
            03 AZHLWFBF                       PIC X.
            03 FILLER REDEFINES AZHLWFBF.
               05 AZHLWFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLWFBI                       PIC X(12).
            03 AZHLWL                         PIC S9(4) COMP.
            03 AZHLWF                         PIC X.
            03 FILLER REDEFINES AZHLWF.
               05 AZHLWA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLWI                         PIC X(2).
            03 AZHLWBML                       PIC S9(4) COMP.
            03 AZHLWBMF                       PIC X.
            03 FILLER REDEFINES AZHLWBMF.
               05 AZHLWBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZHLWBMI                       PIC X(10).
            03 AUMWNFBL                       PIC S9(4) COMP.
            03 AUMWNFBF                       PIC X.
            03 FILLER REDEFINES AUMWNFBF.
               05 AUMWNFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AUMWNFBI                       PIC X(9).
            03 AUMWNRL                        PIC S9(4) COMP.
            03 AUMWNRF                        PIC X.
            03 FILLER REDEFINES AUMWNRF.
               05 AUMWNRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AUMWNRI                        PIC X(15).
            03 AAVERML                        PIC S9(4) COMP.
            03 AAVERMF                        PIC X.
            03 FILLER REDEFINES AAVERMF.
               05 AAVERMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AAVERMI                        PIC X(7).
            03 AAVEPRZL                       PIC S9(4) COMP.
            03 AAVEPRZF                       PIC X.
            03 FILLER REDEFINES AAVEPRZF.
               05 AAVEPRZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AAVEPRZI                       PIC X(1).
            03 ASAMNFBL                       PIC S9(4) COMP.
            03 ASAMNFBF                       PIC X.
            03 FILLER REDEFINES ASAMNFBF.
               05 ASAMNFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASAMNFBI                       PIC X(14).
            03 ASAMNRL                        PIC S9(4) COMP.
            03 ASAMNRF                        PIC X.
            03 FILLER REDEFINES ASAMNRF.
               05 ASAMNRA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASAMNRI                        PIC X(9).
            03 AKDBFBL                        PIC S9(4) COMP.
            03 AKDBFBF                        PIC X.
            03 FILLER REDEFINES AKDBFBF.
               05 AKDBFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AKDBFBI                        PIC X(17).
            03 AKDBETRL                       PIC S9(4) COMP.
            03 AKDBETRF                       PIC X.
            03 FILLER REDEFINES AKDBETRF.
               05 AKDBETRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKDBETRI                       PIC X(7).
            03 AKDBPRZL                       PIC S9(4) COMP.
            03 AKDBPRZF                       PIC X.
            03 FILLER REDEFINES AKDBPRZF.
               05 AKDBPRZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKDBPRZI                       PIC X(1).
            03 ARABSFBL                       PIC S9(4) COMP.
            03 ARABSFBF                       PIC X.
            03 FILLER REDEFINES ARABSFBF.
               05 ARABSFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ARABSFBI                       PIC X(10).
            03 ARABSTL                        PIC S9(4) COMP.
            03 ARABSTF                        PIC X.
            03 FILLER REDEFINES ARABSTF.
               05 ARABSTA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ARABSTI                        PIC X(3).
            03 AVMFBL                         PIC S9(4) COMP.
            03 AVMFBF                         PIC X.
            03 FILLER REDEFINES AVMFBF.
               05 AVMFBA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVMFBI                         PIC X(15).
            03 AVML                           PIC S9(4) COMP.
            03 AVMF                           PIC X.
            03 FILLER REDEFINES AVMF.
               05 AVMA                           PIC X.
            03 FILLER                         PIC X(1).
            03 AVMI                           PIC X(7).
            03 AVMPRZL                        PIC S9(4) COMP.
            03 AVMPRZF                        PIC X.
            03 FILLER REDEFINES AVMPRZF.
               05 AVMPRZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AVMPRZI                        PIC X(1).
            03 AEINHL                         PIC S9(4) COMP.
            03 AEINHF                         PIC X.
            03 FILLER REDEFINES AEINHF.
               05 AEINHA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AEINHI                         PIC X(11).
            03 AUPDFBL                        PIC S9(4) COMP.
            03 AUPDFBF                        PIC X.
            03 FILLER REDEFINES AUPDFBF.
               05 AUPDFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AUPDFBI                        PIC X(22).
            03 AUPDDATL                       PIC S9(4) COMP.
            03 AUPDDATF                       PIC X.
            03 FILLER REDEFINES AUPDDATF.
               05 AUPDDATA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AUPDDATI                       PIC X(10).
            03 AVARTBML                       PIC S9(4) COMP.
            03 AVARTBMF                       PIC X.
            03 FILLER REDEFINES AVARTBMF.
               05 AVARTBMA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVARTBMI                       PIC X(10).
            03 AVARTTXL                       PIC S9(4) COMP.
            03 AVARTTXF                       PIC X.
            03 FILLER REDEFINES AVARTTXF.
               05 AVARTTXA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVARTTXI                       PIC X(15).
            03 AUPDIFBL                       PIC S9(4) COMP.
            03 AUPDIFBF                       PIC X.
            03 FILLER REDEFINES AUPDIFBF.
               05 AUPDIFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AUPDIFBI                       PIC X(4).
            03 AUPDUIDL                       PIC S9(4) COMP.
            03 AUPDUIDF                       PIC X.
            03 FILLER REDEFINES AUPDUIDF.
               05 AUPDUIDA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AUPDUIDI                       PIC X(8).
            03 AVSTANDL                       PIC S9(4) COMP.
            03 AVSTANDF                       PIC X.
            03 FILLER REDEFINES AVSTANDF.
               05 AVSTANDA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTANDI                       PIC X(4).
            03 AVSTDBLL                       PIC S9(4) COMP.
            03 AVSTDBLF                       PIC X.
            03 FILLER REDEFINES AVSTDBLF.
               05 AVSTDBLA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTDBLI                       PIC X(40).
            03 AZLERFBL                       PIC S9(4) COMP.
            03 AZLERFBF                       PIC X.
            03 FILLER REDEFINES AZLERFBF.
               05 AZLERFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZLERFBI                       PIC X(17).
            03 AZAHLERL                       PIC S9(4) COMP.
            03 AZAHLERF                       PIC X.
            03 FILLER REDEFINES AZAHLERF.
               05 AZAHLERA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZAHLERI                       PIC X(25).
            03 AVPFBL                         PIC S9(4) COMP.
            03 AVPFBF                         PIC X.
            03 FILLER REDEFINES AVPFBF.
               05 AVPFBA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AVPFBI                         PIC X(21).
            03 AVPL                           PIC S9(4) COMP.
            03 AVPF                           PIC X.
            03 FILLER REDEFINES AVPF.
               05 AVPA                           PIC X.
            03 FILLER                         PIC X(1).
            03 AVPI                           PIC X(25).
            03 AADRVFBL                       PIC S9(4) COMP.
            03 AADRVFBF                       PIC X.
            03 FILLER REDEFINES AADRVFBF.
               05 AADRVFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AADRVFBI                       PIC X(11).
            03 AADRVNL                        PIC S9(4) COMP.
            03 AADRVNF                        PIC X.
            03 FILLER REDEFINES AADRVNF.
               05 AADRVNA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AADRVNI                        PIC X(57).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER REDEFINES AFCANZF.
               05 AFCANZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(79).

      *  Output Data For Map BPA0018
         01 BPA0018O REDEFINES BPA0018I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(3).
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(3).
            03 EHISTNRH                       PIC X.
            03 EHISTNRO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFCSFBH                        PIC X.
            03 AFCSFBO                        PIC X(5).
            03 FILLER                         PIC X(3).
            03 EFCSH                          PIC X.
            03 EFCSO                          PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFCSANZH                       PIC X.
            03 AFCSANZO                       PIC X(19).
            03 FILLER                         PIC X(3).
            03 EPINH                          PIC X.
            03 EPINO                          PIC X(9).
            03 FILLER                         PIC X(3).
            03 APINPRZH                       PIC X.
            03 APINPRZO                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 AVGESH                         PIC X.
            03 AVGESO                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 ANAMEFBH                       PIC X.
            03 ANAMEFBO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 AKDNNH                         PIC X.
            03 AKDNNO                         PIC X(25).
            03 FILLER                         PIC X(3).
            03 AVNAMFBH                       PIC X.
            03 AVNAMFBO                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 AKDVNH                         PIC X.
            03 AKDVNO                         PIC X(20).
            03 FILLER                         PIC X(3).
            03 AVBGDATH                       PIC X.
            03 AVBGDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVGESFBH                       PIC X.
            03 AVGESFBO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVMGESH                        PIC X.
            03 AVMGESO                        PIC X(2).
            03 FILLER                         PIC X(3).
            03 AVGESBMH                       PIC X.
            03 AVGESBMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVABDFBH                       PIC X.
            03 AVABDFBO                       PIC X(17).
            03 FILLER                         PIC X(3).
            03 AVABDATH                       PIC X.
            03 AVABDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AFEIVFBH                       PIC X.
            03 AFEIVFBO                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 AFEIVBKH                       PIC X.
            03 AFEIVBKO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 AFEIVBMH                       PIC X.
            03 AFEIVBMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AZHLWFBH                       PIC X.
            03 AZHLWFBO                       PIC X(12).
            03 FILLER                         PIC X(3).
            03 AZHLWH                         PIC X.
            03 AZHLWO                         PIC X(2).
            03 FILLER                         PIC X(3).
            03 AZHLWBMH                       PIC X.
            03 AZHLWBMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AUMWNFBH                       PIC X.
            03 AUMWNFBO                       PIC X(9).
            03 FILLER                         PIC X(3).
            03 AUMWNRH                        PIC X.
            03 AUMWNRO                        PIC X(15).
            03 FILLER                         PIC X(3).
            03 AAVERMH                        PIC X.
            03 AAVERMO                        PIC X(7).
            03 FILLER                         PIC X(3).
            03 AAVEPRZH                       PIC X.
            03 AAVEPRZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 ASAMNFBH                       PIC X.
            03 ASAMNFBO                       PIC X(14).
            03 FILLER                         PIC X(3).
            03 ASAMNRH                        PIC X.
            03 ASAMNRO                        PIC X(9).
            03 FILLER                         PIC X(3).
            03 AKDBFBH                        PIC X.
            03 AKDBFBO                        PIC X(17).
            03 FILLER                         PIC X(3).
            03 AKDBETRH                       PIC X.
            03 AKDBETRO                       PIC X(7).
            03 FILLER                         PIC X(3).
            03 AKDBPRZH                       PIC X.
            03 AKDBPRZO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 ARABSFBH                       PIC X.
            03 ARABSFBO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 ARABSTH                        PIC X.
            03 ARABSTO                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 AVMFBH                         PIC X.
            03 AVMFBO                         PIC X(15).
            03 FILLER                         PIC X(3).
            03 AVMH                           PIC X.
            03 AVMO                           PIC X(7).
            03 FILLER                         PIC X(3).
            03 AVMPRZH                        PIC X.
            03 AVMPRZO                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 AEINHH                         PIC X.
            03 AEINHO                         PIC X(11).
            03 FILLER                         PIC X(3).
            03 AUPDFBH                        PIC X.
            03 AUPDFBO                        PIC X(22).
            03 FILLER                         PIC X(3).
            03 AUPDDATH                       PIC X.
            03 AUPDDATO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVARTBMH                       PIC X.
            03 AVARTBMO                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 AVARTTXH                       PIC X.
            03 AVARTTXO                       PIC X(15).
            03 FILLER                         PIC X(3).
            03 AUPDIFBH                       PIC X.
            03 AUPDIFBO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUPDUIDH                       PIC X.
            03 AUPDUIDO                       PIC X(8).
            03 FILLER                         PIC X(3).
            03 AVSTANDH                       PIC X.
            03 AVSTANDO                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTDBLH                       PIC X.
            03 AVSTDBLO                       PIC X(40).
            03 FILLER                         PIC X(3).
            03 AZLERFBH                       PIC X.
            03 AZLERFBO                       PIC X(17).
            03 FILLER                         PIC X(3).
            03 AZAHLERH                       PIC X.
            03 AZAHLERO                       PIC X(25).
            03 FILLER                         PIC X(3).
            03 AVPFBH                         PIC X.
            03 AVPFBO                         PIC X(21).
            03 FILLER                         PIC X(3).
            03 AVPH                           PIC X.
            03 AVPO                           PIC X(25).
            03 FILLER                         PIC X(3).
            03 AADRVFBH                       PIC X.
            03 AADRVFBO                       PIC X(11).
            03 FILLER                         PIC X(3).
            03 AADRVNH                        PIC X.
            03 AADRVNO                        PIC X(57).
            03 FILLER                         PIC X(3).
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(79).


