      *   Mainframe Express 3.1  6.018.0057
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-65)
      *   MapSet Name   BPA0046
      *   Date Created  04/05/2018
      *   Time Created  15:39:29

      *  Input Data For Map BPA0046
         01 BPA0046I.
            03 FILLER                         PIC X(12).
            03 EUMBVTTL                       PIC S9(4) COMP.
            03 EUMBVTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMBVTTI                       PIC X(2).
            03 EUMBVMML                       PIC S9(4) COMP.
            03 EUMBVMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMBVMMI                       PIC X(2).
            03 EUMBVJJL                       PIC S9(4) COMP.
            03 EUMBVJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMBVJJI                       PIC X(4).
            03 EUMBBTTL                       PIC S9(4) COMP.
            03 EUMBBTTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMBBTTI                       PIC X(2).
            03 EUMBBMML                       PIC S9(4) COMP.
            03 EUMBBMMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMBBMMI                       PIC X(2).
            03 EUMBBJJL                       PIC S9(4) COMP.
            03 EUMBBJJF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EUMBBJJI                       PIC X(4).
            03 ASEIFBL                        PIC S9(4) COMP.
            03 ASEIFBF                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIFBI                        PIC X(6).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(3).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(3).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVGESL                         PIC S9(4) COMP.
            03 EVGESF                         PIC X.
            03 FILLER                         PIC X(1).
            03 EVGESI                         PIC X(1).
            03 AVGESBML                       PIC S9(4) COMP.
            03 AVGESBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVGESBMI                       PIC X(4).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 EBGRUNDL                       PIC S9(4) COMP.
            03 EBGRUNDF                       PIC X.
            03 FILLER                         PIC X(1).
            03 EBGRUNDI                       PIC X(2).
            03 ABGRUBML                       PIC S9(4) COMP.
            03 ABGRUBMF                       PIC X.
            03 FILLER                         PIC X(1).
            03 ABGRUBMI                       PIC X(10).
            03 AKENNGL                        PIC S9(4) COMP.
            03 AKENNGF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AKENNGI                        PIC X(17).
            03 EKENNGL                        PIC S9(4) COMP.
            03 EKENNGF                        PIC X.
            03 FILLER                         PIC X(1).
            03 EKENNGI                        PIC X(8).
            03 AFCFBL                         PIC S9(4) COMP.
            03 AFCFBF                         PIC X.
            03 FILLER                         PIC X(1).
            03 AFCFBI                         PIC X(2).
            03 DFHG001I                       OCCURS 10 TIMES.
               05 EFCZL                          PIC S9(4) COMP.
               05 EFCZF                          PIC X.
               05 FILLER                         PIC X(1).
               05 EFCZI                          PIC X(1).
               05 AZINFOL                        PIC S9(4) COMP.
               05 AZINFOF                        PIC X.
               05 FILLER                         PIC X(1).
               05 AZINFOI                        PIC X(2).
               05 AGESL                          PIC S9(4) COMP.
               05 AGESF                          PIC X.
               05 FILLER                         PIC X(1).
               05 AGESI                          PIC X(2).
               05 AVNRL                          PIC S9(4) COMP.
               05 AVNRF                          PIC X.
               05 FILLER                         PIC X(1).
               05 AVNRI                          PIC X(15).
               05 AUMBDATL                       PIC S9(4) COMP.
               05 AUMBDATF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AUMBDATI                       PIC X(10).
               05 ABGRUNDL                       PIC S9(4) COMP.
               05 ABGRUNDF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ABGRUNDI                       PIC X(2).
               05 APRODL                         PIC S9(4) COMP.
               05 APRODF                         PIC X.
               05 FILLER                         PIC X(1).
               05 APRODI                         PIC X(6).
               05 AFAEVONL                       PIC S9(4) COMP.
               05 AFAEVONF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AFAEVONI                       PIC X(10).
               05 AHISTNRL                       PIC S9(4) COMP.
               05 AHISTNRF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AHISTNRI                       PIC X(3).
               05 AGPVBTGL                       PIC S9(4) COMP.
               05 AGPVBTGF                       PIC X.
               05 FILLER                         PIC X(1).
               05 AGPVBTGI                       PIC X(11).
               05 ADGVL                          PIC S9(4) COMP.
               05 ADGVF                          PIC X.
               05 FILLER                         PIC X(1).
               05 ADGVI                          PIC X(2).
               05 ADIFFKZL                       PIC S9(4) COMP.
               05 ADIFFKZF                       PIC X.
               05 FILLER                         PIC X(1).
               05 ADIFFKZI                       PIC X(1).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(79).

      *  Output Data For Map BPA0046
         01 BPA0046O REDEFINES BPA0046I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(2).
            03 EUMBVTTA                       PIC X.
            03 EUMBVTTH                       PIC X.
            03 EUMBVTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUMBVMMA                       PIC X.
            03 EUMBVMMH                       PIC X.
            03 EUMBVMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUMBVJJA                       PIC X.
            03 EUMBVJJH                       PIC X.
            03 EUMBVJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EUMBBTTA                       PIC X.
            03 EUMBBTTH                       PIC X.
            03 EUMBBTTO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUMBBMMA                       PIC X.
            03 EUMBBMMH                       PIC X.
            03 EUMBBMMO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 EUMBBJJA                       PIC X.
            03 EUMBBJJH                       PIC X.
            03 EUMBBJJO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 ASEIFBA                        PIC X.
            03 ASEIFBH                        PIC X.
            03 ASEIFBO                        PIC X(6).
            03 FILLER                         PIC X(2).
            03 ESEIAKTA                       PIC X.
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 ASEISTRA                       PIC X.
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 ASEIGESA                       PIC X.
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(3).
            03 FILLER                         PIC X(2).
            03 EGESA                          PIC X.
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(2).
            03 AGESBMA                        PIC X.
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(2).
            03 EVGESA                         PIC X.
            03 EVGESH                         PIC X.
            03 EVGESO                         PIC X(1).
            03 FILLER                         PIC X(2).
            03 AVGESBMA                       PIC X.
            03 AVGESBMH                       PIC X.
            03 AVGESBMO                       PIC X(4).
            03 FILLER                         PIC X(2).
            03 EVNRA                          PIC X.
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(2).
            03 EBGRUNDA                       PIC X.
            03 EBGRUNDH                       PIC X.
            03 EBGRUNDO                       PIC X(2).
            03 FILLER                         PIC X(2).
            03 ABGRUBMA                       PIC X.
            03 ABGRUBMH                       PIC X.
            03 ABGRUBMO                       PIC X(10).
            03 FILLER                         PIC X(2).
            03 AKENNGA                        PIC X.
            03 AKENNGH                        PIC X.
            03 AKENNGO                        PIC X(17).
            03 FILLER                         PIC X(2).
            03 EKENNGA                        PIC X.
            03 EKENNGH                        PIC X.
            03 EKENNGO                        PIC X(8).
            03 FILLER                         PIC X(2).
            03 AFCFBA                         PIC X.
            03 AFCFBH                         PIC X.
            03 AFCFBO                         PIC X(2).
            03 DFHG001O OCCURS 10.
               05 FILLER                         PIC X(2).
               05 EFCZA                          PIC X.
               05 EFCZH                          PIC X.
               05 EFCZO                          PIC X(1).
               05 FILLER                         PIC X(2).
               05 AZINFOA                        PIC X.
               05 AZINFOH                        PIC X.
               05 AZINFOO                        PIC X(2).
               05 FILLER                         PIC X(2).
               05 AGESA                          PIC X.
               05 AGESH                          PIC X.
               05 AGESO                          PIC X(2).
               05 FILLER                         PIC X(2).
               05 AVNRA                          PIC X.
               05 AVNRH                          PIC X.
               05 AVNRO                          PIC X(15).
               05 FILLER                         PIC X(2).
               05 AUMBDATA                       PIC X.
               05 AUMBDATH                       PIC X.
               05 AUMBDATO                       PIC X(10).
               05 FILLER                         PIC X(2).
               05 ABGRUNDA                       PIC X.
               05 ABGRUNDH                       PIC X.
               05 ABGRUNDO                       PIC X(2).
               05 FILLER                         PIC X(2).
               05 APRODA                         PIC X.
               05 APRODH                         PIC X.
               05 APRODO                         PIC X(6).
               05 FILLER                         PIC X(2).
               05 AFAEVONA                       PIC X.
               05 AFAEVONH                       PIC X.
               05 AFAEVONO                       PIC X(10).
               05 FILLER                         PIC X(2).
               05 AHISTNRA                       PIC X.
               05 AHISTNRH                       PIC X.
               05 AHISTNRO                       PIC X(3).
               05 FILLER                         PIC X(2).
               05 AGPVBTGA                       PIC X.
               05 AGPVBTGH                       PIC X.
               05 AGPVBTGO                       PIC X(11).
               05 FILLER                         PIC X(2).
               05 ADGVA                          PIC X.
               05 ADGVH                          PIC X.
               05 ADGVO                          PIC X(2).
               05 FILLER                         PIC X(2).
               05 ADIFFKZA                       PIC X.
               05 ADIFFKZH                       PIC X.
               05 ADIFFKZO                       PIC X(1).
            03 FILLER                         PIC X(2).
            03 AFCANZA                        PIC X.
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(79).


