      *   Mainframe Express 3.1  6.018.0057
      *   Micro Focus BMS Screen Painter (ver IDE_6-0-65)
      *   MapSet Name   BPA0023
      *   Date Created  11/27/2018
      *   Time Created  07:13:32

      *  Input Data For Map BPA0023
         01 BPA0023I.
            03 FILLER                         PIC X(12).
            03 EGESL                          PIC S9(4) COMP.
            03 EGESF                          PIC X.
            03 FILLER REDEFINES EGESF.
               05 EGESA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EGESI                          PIC X(2).
            03 AGESBML                        PIC S9(4) COMP.
            03 AGESBMF                        PIC X.
            03 FILLER REDEFINES AGESBMF.
               05 AGESBMA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AGESBMI                        PIC X(10).
            03 EVNRL                          PIC S9(4) COMP.
            03 EVNRF                          PIC X.
            03 FILLER REDEFINES EVNRF.
               05 EVNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EVNRI                          PIC X(15).
            03 EUNRL                          PIC S9(4) COMP.
            03 EUNRF                          PIC X.
            03 FILLER REDEFINES EUNRF.
               05 EUNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 EUNRI                          PIC X(3).
            03 ESCHICHL                       PIC S9(4) COMP.
            03 ESCHICHF                       PIC X.
            03 FILLER REDEFINES ESCHICHF.
               05 ESCHICHA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESCHICHI                       PIC X(3).
            03 ASEIFBL                        PIC S9(4) COMP.
            03 ASEIFBF                        PIC X.
            03 FILLER REDEFINES ASEIFBF.
               05 ASEIFBA                        PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIFBI                        PIC X(6).
            03 ESEIAKTL                       PIC S9(4) COMP.
            03 ESEIAKTF                       PIC X.
            03 FILLER REDEFINES ESEIAKTF.
               05 ESEIAKTA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ESEIAKTI                       PIC X(3).
            03 ASEISTRL                       PIC S9(4) COMP.
            03 ASEISTRF                       PIC X.
            03 FILLER REDEFINES ASEISTRF.
               05 ASEISTRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEISTRI                       PIC X(1).
            03 ASEIGESL                       PIC S9(4) COMP.
            03 ASEIGESF                       PIC X.
            03 FILLER REDEFINES ASEIGESF.
               05 ASEIGESA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASEIGESI                       PIC X(3).
            03 ANAMEFBL                       PIC S9(4) COMP.
            03 ANAMEFBF                       PIC X.
            03 FILLER REDEFINES ANAMEFBF.
               05 ANAMEFBA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEFBI                       PIC X(5).
            03 ANAMEL                         PIC S9(4) COMP.
            03 ANAMEF                         PIC X.
            03 FILLER REDEFINES ANAMEF.
               05 ANAMEA                         PIC X.
            03 FILLER                         PIC X(1).
            03 ANAMEI                         PIC X(25).
            03 AKENBEZL                       PIC S9(4) COMP.
            03 AKENBEZF                       PIC X.
            03 FILLER REDEFINES AKENBEZF.
               05 AKENBEZA                       PIC X.
            03 FILLER                         PIC X(1).
            03 AKENBEZI                       PIC X(8).
            03 EGELKENL                       PIC S9(4) COMP.
            03 EGELKENF                       PIC X.
            03 FILLER REDEFINES EGELKENF.
               05 EGELKENA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EGELKENI                       PIC X(6).
            03 AFCFBL                         PIC S9(4) COMP.
            03 AFCFBF                         PIC X.
            03 FILLER REDEFINES AFCFBF.
               05 AFCFBA                         PIC X.
            03 FILLER                         PIC X(1).
            03 AFCFBI                         PIC X(2).
            03 AFABFB1L                       PIC S9(4) COMP.
            03 AFABFB1F                       PIC X.
            03 FILLER REDEFINES AFABFB1F.
               05 AFABFB1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFABFB1I                       PIC X(6).
            03 AFBUNT1L                       PIC S9(4) COMP.
            03 AFBUNT1F                       PIC X.
            03 FILLER REDEFINES AFBUNT1F.
               05 AFBUNT1A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBUNT1I                       PIC X(7).
            03 AFABFB2L                       PIC S9(4) COMP.
            03 AFABFB2F                       PIC X.
            03 FILLER REDEFINES AFABFB2F.
               05 AFABFB2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFABFB2I                       PIC X(6).
            03 AFBUNT2L                       PIC S9(4) COMP.
            03 AFBUNT2F                       PIC X.
            03 FILLER REDEFINES AFBUNT2F.
               05 AFBUNT2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AFBUNT2I                       PIC X(7).
            03 EFCZ2L                         PIC S9(4) COMP.
            03 EFCZ2F                         PIC X.
            03 FILLER REDEFINES EFCZ2F.
               05 EFCZ2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ2I                         PIC X(1).
            03 AZINFO2L                       PIC S9(4) COMP.
            03 AZINFO2F                       PIC X.
            03 FILLER REDEFINES AZINFO2F.
               05 AZINFO2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO2I                       PIC X(2).
            03 F000007L                       PIC S9(4) COMP.
            03 F000007F                       PIC X.
            03 FILLER REDEFINES F000007F.
               05 F000007A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000007I                       PIC X(10).
            03 F000006L                       PIC S9(4) COMP.
            03 F000006F                       PIC X.
            03 FILLER REDEFINES F000006F.
               05 F000006A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000006I                       PIC X(2).
            03 F000005L                       PIC S9(4) COMP.
            03 F000005F                       PIC X.
            03 FILLER REDEFINES F000005F.
               05 F000005A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000005I                       PIC X(2).
            03 F000004L                       PIC S9(4) COMP.
            03 F000004F                       PIC X.
            03 FILLER REDEFINES F000004F.
               05 F000004A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000004I                       PIC X(4).
            03 AUNRL                          PIC S9(4) COMP.
            03 AUNRF                          PIC X.
            03 FILLER REDEFINES AUNRF.
               05 AUNRA                          PIC X.
            03 FILLER                         PIC X(1).
            03 AUNRI                          PIC X(3).
            03 ASCHICHL                       PIC S9(4) COMP.
            03 ASCHICHF                       PIC X.
            03 FILLER REDEFINES ASCHICHF.
               05 ASCHICHA                       PIC X.
            03 FILLER                         PIC X(1).
            03 ASCHICHI                       PIC X(3).
            03 EFOLGNRL                       PIC S9(4) COMP.
            03 EFOLGNRF                       PIC X.
            03 FILLER REDEFINES EFOLGNRF.
               05 EFOLGNRA                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFOLGNRI                       PIC X(3).
            03 APGV2L                         PIC S9(4) COMP.
            03 APGV2F                         PIC X.
            03 FILLER REDEFINES APGV2F.
               05 APGV2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV2I                         PIC X(4).
            03 F000002L                       PIC S9(4) COMP.
            03 F000002F                       PIC X.
            03 FILLER REDEFINES F000002F.
               05 F000002A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000002I                       PIC X(13).
            03 F000001L                       PIC S9(4) COMP.
            03 F000001F                       PIC X.
            03 FILLER REDEFINES F000001F.
               05 F000001A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000001I                       PIC X(4).
            03 AVSTAT2L                       PIC S9(4) COMP.
            03 AVSTAT2F                       PIC X.
            03 FILLER REDEFINES AVSTAT2F.
               05 AVSTAT2A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT2I                       PIC X(4).
            03 F000000L                       PIC S9(4) COMP.
            03 F000000F                       PIC X.
            03 FILLER REDEFINES F000000F.
               05 F000000A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000000I                       PIC X(3).
            03 EFCZ3L                         PIC S9(4) COMP.
            03 EFCZ3F                         PIC X.
            03 FILLER REDEFINES EFCZ3F.
               05 EFCZ3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ3I                         PIC X(1).
            03 AZINFO3L                       PIC S9(4) COMP.
            03 AZINFO3F                       PIC X.
            03 FILLER REDEFINES AZINFO3F.
               05 AZINFO3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO3I                       PIC X(2).
            03 F000015L                       PIC S9(4) COMP.
            03 F000015F                       PIC X.
            03 FILLER REDEFINES F000015F.
               05 F000015A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000015I                       PIC X(10).
            03 F000014L                       PIC S9(4) COMP.
            03 F000014F                       PIC X.
            03 FILLER REDEFINES F000014F.
               05 F000014A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000014I                       PIC X(2).
            03 F000013L                       PIC S9(4) COMP.
            03 F000013F                       PIC X.
            03 FILLER REDEFINES F000013F.
               05 F000013A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000013I                       PIC X(2).
            03 F000012L                       PIC S9(4) COMP.
            03 F000012F                       PIC X.
            03 FILLER REDEFINES F000012F.
               05 F000012A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000012I                       PIC X(4).
            03 AUNR2L                         PIC S9(4) COMP.
            03 AUNR2F                         PIC X.
            03 FILLER REDEFINES AUNR2F.
               05 AUNR2A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR2I                         PIC X(3).
            03 F000011L                       PIC S9(4) COMP.
            03 F000011F                       PIC X.
            03 FILLER REDEFINES F000011F.
               05 F000011A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000011I                       PIC X(3).
            03 F000010L                       PIC S9(4) COMP.
            03 F000010F                       PIC X.
            03 FILLER REDEFINES F000010F.
               05 F000010A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000010I                       PIC X(3).
            03 APGV3L                         PIC S9(4) COMP.
            03 APGV3F                         PIC X.
            03 FILLER REDEFINES APGV3F.
               05 APGV3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV3I                         PIC X(4).
            03 F000009L                       PIC S9(4) COMP.
            03 F000009F                       PIC X.
            03 FILLER REDEFINES F000009F.
               05 F000009A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000009I                       PIC X(13).
            03 F000008L                       PIC S9(4) COMP.
            03 F000008F                       PIC X.
            03 FILLER REDEFINES F000008F.
               05 F000008A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000008I                       PIC X(4).
            03 AVSTAT3L                       PIC S9(4) COMP.
            03 AVSTAT3F                       PIC X.
            03 FILLER REDEFINES AVSTAT3F.
               05 AVSTAT3A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT3I                       PIC X(4).
            03 F000003L                       PIC S9(4) COMP.
            03 F000003F                       PIC X.
            03 FILLER REDEFINES F000003F.
               05 F000003A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000003I                       PIC X(3).
            03 EFCZ4L                         PIC S9(4) COMP.
            03 EFCZ4F                         PIC X.
            03 FILLER REDEFINES EFCZ4F.
               05 EFCZ4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ4I                         PIC X(1).
            03 AZINFO4L                       PIC S9(4) COMP.
            03 AZINFO4F                       PIC X.
            03 FILLER REDEFINES AZINFO4F.
               05 AZINFO4A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO4I                       PIC X(2).
            03 F000024L                       PIC S9(4) COMP.
            03 F000024F                       PIC X.
            03 FILLER REDEFINES F000024F.
               05 F000024A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000024I                       PIC X(10).
            03 F000023L                       PIC S9(4) COMP.
            03 F000023F                       PIC X.
            03 FILLER REDEFINES F000023F.
               05 F000023A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000023I                       PIC X(2).
            03 F000022L                       PIC S9(4) COMP.
            03 F000022F                       PIC X.
            03 FILLER REDEFINES F000022F.
               05 F000022A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000022I                       PIC X(2).
            03 F000021L                       PIC S9(4) COMP.
            03 F000021F                       PIC X.
            03 FILLER REDEFINES F000021F.
               05 F000021A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000021I                       PIC X(4).
            03 AUNR3L                         PIC S9(4) COMP.
            03 AUNR3F                         PIC X.
            03 FILLER REDEFINES AUNR3F.
               05 AUNR3A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR3I                         PIC X(3).
            03 F000020L                       PIC S9(4) COMP.
            03 F000020F                       PIC X.
            03 FILLER REDEFINES F000020F.
               05 F000020A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000020I                       PIC X(3).
            03 F000019L                       PIC S9(4) COMP.
            03 F000019F                       PIC X.
            03 FILLER REDEFINES F000019F.
               05 F000019A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000019I                       PIC X(3).
            03 APGV4L                         PIC S9(4) COMP.
            03 APGV4F                         PIC X.
            03 FILLER REDEFINES APGV4F.
               05 APGV4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV4I                         PIC X(4).
            03 F000018L                       PIC S9(4) COMP.
            03 F000018F                       PIC X.
            03 FILLER REDEFINES F000018F.
               05 F000018A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000018I                       PIC X(13).
            03 F000017L                       PIC S9(4) COMP.
            03 F000017F                       PIC X.
            03 FILLER REDEFINES F000017F.
               05 F000017A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000017I                       PIC X(4).
            03 AVSTAT4L                       PIC S9(4) COMP.
            03 AVSTAT4F                       PIC X.
            03 FILLER REDEFINES AVSTAT4F.
               05 AVSTAT4A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT4I                       PIC X(4).
            03 F000016L                       PIC S9(4) COMP.
            03 F000016F                       PIC X.
            03 FILLER REDEFINES F000016F.
               05 F000016A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000016I                       PIC X(3).
            03 EFCZ5L                         PIC S9(4) COMP.
            03 EFCZ5F                         PIC X.
            03 FILLER REDEFINES EFCZ5F.
               05 EFCZ5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ5I                         PIC X(1).
            03 AZINFO5L                       PIC S9(4) COMP.
            03 AZINFO5F                       PIC X.
            03 FILLER REDEFINES AZINFO5F.
               05 AZINFO5A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO5I                       PIC X(2).
            03 F000033L                       PIC S9(4) COMP.
            03 F000033F                       PIC X.
            03 FILLER REDEFINES F000033F.
               05 F000033A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000033I                       PIC X(10).
            03 F000032L                       PIC S9(4) COMP.
            03 F000032F                       PIC X.
            03 FILLER REDEFINES F000032F.
               05 F000032A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000032I                       PIC X(2).
            03 F000031L                       PIC S9(4) COMP.
            03 F000031F                       PIC X.
            03 FILLER REDEFINES F000031F.
               05 F000031A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000031I                       PIC X(2).
            03 F000030L                       PIC S9(4) COMP.
            03 F000030F                       PIC X.
            03 FILLER REDEFINES F000030F.
               05 F000030A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000030I                       PIC X(4).
            03 AUNR4L                         PIC S9(4) COMP.
            03 AUNR4F                         PIC X.
            03 FILLER REDEFINES AUNR4F.
               05 AUNR4A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR4I                         PIC X(3).
            03 F000029L                       PIC S9(4) COMP.
            03 F000029F                       PIC X.
            03 FILLER REDEFINES F000029F.
               05 F000029A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000029I                       PIC X(3).
            03 F000028L                       PIC S9(4) COMP.
            03 F000028F                       PIC X.
            03 FILLER REDEFINES F000028F.
               05 F000028A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000028I                       PIC X(3).
            03 APGV5L                         PIC S9(4) COMP.
            03 APGV5F                         PIC X.
            03 FILLER REDEFINES APGV5F.
               05 APGV5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV5I                         PIC X(4).
            03 F000027L                       PIC S9(4) COMP.
            03 F000027F                       PIC X.
            03 FILLER REDEFINES F000027F.
               05 F000027A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000027I                       PIC X(13).
            03 F000026L                       PIC S9(4) COMP.
            03 F000026F                       PIC X.
            03 FILLER REDEFINES F000026F.
               05 F000026A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000026I                       PIC X(4).
            03 AVSTAT5L                       PIC S9(4) COMP.
            03 AVSTAT5F                       PIC X.
            03 FILLER REDEFINES AVSTAT5F.
               05 AVSTAT5A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT5I                       PIC X(4).
            03 F000025L                       PIC S9(4) COMP.
            03 F000025F                       PIC X.
            03 FILLER REDEFINES F000025F.
               05 F000025A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000025I                       PIC X(3).
            03 EFCZ6L                         PIC S9(4) COMP.
            03 EFCZ6F                         PIC X.
            03 FILLER REDEFINES EFCZ6F.
               05 EFCZ6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ6I                         PIC X(1).
            03 AZINFO6L                       PIC S9(4) COMP.
            03 AZINFO6F                       PIC X.
            03 FILLER REDEFINES AZINFO6F.
               05 AZINFO6A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO6I                       PIC X(2).
            03 F000042L                       PIC S9(4) COMP.
            03 F000042F                       PIC X.
            03 FILLER REDEFINES F000042F.
               05 F000042A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000042I                       PIC X(10).
            03 F000041L                       PIC S9(4) COMP.
            03 F000041F                       PIC X.
            03 FILLER REDEFINES F000041F.
               05 F000041A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000041I                       PIC X(2).
            03 F000040L                       PIC S9(4) COMP.
            03 F000040F                       PIC X.
            03 FILLER REDEFINES F000040F.
               05 F000040A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000040I                       PIC X(2).
            03 F000039L                       PIC S9(4) COMP.
            03 F000039F                       PIC X.
            03 FILLER REDEFINES F000039F.
               05 F000039A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000039I                       PIC X(4).
            03 AUNR5L                         PIC S9(4) COMP.
            03 AUNR5F                         PIC X.
            03 FILLER REDEFINES AUNR5F.
               05 AUNR5A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR5I                         PIC X(3).
            03 F000038L                       PIC S9(4) COMP.
            03 F000038F                       PIC X.
            03 FILLER REDEFINES F000038F.
               05 F000038A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000038I                       PIC X(3).
            03 F000037L                       PIC S9(4) COMP.
            03 F000037F                       PIC X.
            03 FILLER REDEFINES F000037F.
               05 F000037A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000037I                       PIC X(3).
            03 APGV6L                         PIC S9(4) COMP.
            03 APGV6F                         PIC X.
            03 FILLER REDEFINES APGV6F.
               05 APGV6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV6I                         PIC X(4).
            03 F000036L                       PIC S9(4) COMP.
            03 F000036F                       PIC X.
            03 FILLER REDEFINES F000036F.
               05 F000036A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000036I                       PIC X(13).
            03 F000035L                       PIC S9(4) COMP.
            03 F000035F                       PIC X.
            03 FILLER REDEFINES F000035F.
               05 F000035A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000035I                       PIC X(4).
            03 AVSTAT6L                       PIC S9(4) COMP.
            03 AVSTAT6F                       PIC X.
            03 FILLER REDEFINES AVSTAT6F.
               05 AVSTAT6A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT6I                       PIC X(4).
            03 F000034L                       PIC S9(4) COMP.
            03 F000034F                       PIC X.
            03 FILLER REDEFINES F000034F.
               05 F000034A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000034I                       PIC X(3).
            03 EFCZ7L                         PIC S9(4) COMP.
            03 EFCZ7F                         PIC X.
            03 FILLER REDEFINES EFCZ7F.
               05 EFCZ7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ7I                         PIC X(1).
            03 AZINFO7L                       PIC S9(4) COMP.
            03 AZINFO7F                       PIC X.
            03 FILLER REDEFINES AZINFO7F.
               05 AZINFO7A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO7I                       PIC X(2).
            03 F000051L                       PIC S9(4) COMP.
            03 F000051F                       PIC X.
            03 FILLER REDEFINES F000051F.
               05 F000051A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000051I                       PIC X(10).
            03 F000050L                       PIC S9(4) COMP.
            03 F000050F                       PIC X.
            03 FILLER REDEFINES F000050F.
               05 F000050A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000050I                       PIC X(2).
            03 F000049L                       PIC S9(4) COMP.
            03 F000049F                       PIC X.
            03 FILLER REDEFINES F000049F.
               05 F000049A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000049I                       PIC X(2).
            03 F000048L                       PIC S9(4) COMP.
            03 F000048F                       PIC X.
            03 FILLER REDEFINES F000048F.
               05 F000048A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000048I                       PIC X(4).
            03 AUNR6L                         PIC S9(4) COMP.
            03 AUNR6F                         PIC X.
            03 FILLER REDEFINES AUNR6F.
               05 AUNR6A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR6I                         PIC X(3).
            03 F000047L                       PIC S9(4) COMP.
            03 F000047F                       PIC X.
            03 FILLER REDEFINES F000047F.
               05 F000047A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000047I                       PIC X(3).
            03 F000046L                       PIC S9(4) COMP.
            03 F000046F                       PIC X.
            03 FILLER REDEFINES F000046F.
               05 F000046A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000046I                       PIC X(3).
            03 APGV7L                         PIC S9(4) COMP.
            03 APGV7F                         PIC X.
            03 FILLER REDEFINES APGV7F.
               05 APGV7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV7I                         PIC X(4).
            03 F000045L                       PIC S9(4) COMP.
            03 F000045F                       PIC X.
            03 FILLER REDEFINES F000045F.
               05 F000045A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000045I                       PIC X(13).
            03 F000044L                       PIC S9(4) COMP.
            03 F000044F                       PIC X.
            03 FILLER REDEFINES F000044F.
               05 F000044A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000044I                       PIC X(4).
            03 AVSTAT7L                       PIC S9(4) COMP.
            03 AVSTAT7F                       PIC X.
            03 FILLER REDEFINES AVSTAT7F.
               05 AVSTAT7A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT7I                       PIC X(4).
            03 F000043L                       PIC S9(4) COMP.
            03 F000043F                       PIC X.
            03 FILLER REDEFINES F000043F.
               05 F000043A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000043I                       PIC X(3).
            03 EFCZ8L                         PIC S9(4) COMP.
            03 EFCZ8F                         PIC X.
            03 FILLER REDEFINES EFCZ8F.
               05 EFCZ8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ8I                         PIC X(1).
            03 AZINFO8L                       PIC S9(4) COMP.
            03 AZINFO8F                       PIC X.
            03 FILLER REDEFINES AZINFO8F.
               05 AZINFO8A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO8I                       PIC X(2).
            03 F000060L                       PIC S9(4) COMP.
            03 F000060F                       PIC X.
            03 FILLER REDEFINES F000060F.
               05 F000060A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000060I                       PIC X(10).
            03 F000059L                       PIC S9(4) COMP.
            03 F000059F                       PIC X.
            03 FILLER REDEFINES F000059F.
               05 F000059A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000059I                       PIC X(2).
            03 F000058L                       PIC S9(4) COMP.
            03 F000058F                       PIC X.
            03 FILLER REDEFINES F000058F.
               05 F000058A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000058I                       PIC X(2).
            03 F000057L                       PIC S9(4) COMP.
            03 F000057F                       PIC X.
            03 FILLER REDEFINES F000057F.
               05 F000057A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000057I                       PIC X(4).
            03 AUNR7L                         PIC S9(4) COMP.
            03 AUNR7F                         PIC X.
            03 FILLER REDEFINES AUNR7F.
               05 AUNR7A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR7I                         PIC X(3).
            03 F000056L                       PIC S9(4) COMP.
            03 F000056F                       PIC X.
            03 FILLER REDEFINES F000056F.
               05 F000056A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000056I                       PIC X(3).
            03 F000055L                       PIC S9(4) COMP.
            03 F000055F                       PIC X.
            03 FILLER REDEFINES F000055F.
               05 F000055A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000055I                       PIC X(3).
            03 APGV8L                         PIC S9(4) COMP.
            03 APGV8F                         PIC X.
            03 FILLER REDEFINES APGV8F.
               05 APGV8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV8I                         PIC X(4).
            03 F000054L                       PIC S9(4) COMP.
            03 F000054F                       PIC X.
            03 FILLER REDEFINES F000054F.
               05 F000054A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000054I                       PIC X(13).
            03 F000053L                       PIC S9(4) COMP.
            03 F000053F                       PIC X.
            03 FILLER REDEFINES F000053F.
               05 F000053A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000053I                       PIC X(4).
            03 AVSTAT8L                       PIC S9(4) COMP.
            03 AVSTAT8F                       PIC X.
            03 FILLER REDEFINES AVSTAT8F.
               05 AVSTAT8A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT8I                       PIC X(4).
            03 F000052L                       PIC S9(4) COMP.
            03 F000052F                       PIC X.
            03 FILLER REDEFINES F000052F.
               05 F000052A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000052I                       PIC X(3).
            03 EFCZ9L                         PIC S9(4) COMP.
            03 EFCZ9F                         PIC X.
            03 FILLER REDEFINES EFCZ9F.
               05 EFCZ9A                         PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ9I                         PIC X(1).
            03 AZINFO9L                       PIC S9(4) COMP.
            03 AZINFO9F                       PIC X.
            03 FILLER REDEFINES AZINFO9F.
               05 AZINFO9A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AZINFO9I                       PIC X(2).
            03 F000069L                       PIC S9(4) COMP.
            03 F000069F                       PIC X.
            03 FILLER REDEFINES F000069F.
               05 F000069A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000069I                       PIC X(10).
            03 F000068L                       PIC S9(4) COMP.
            03 F000068F                       PIC X.
            03 FILLER REDEFINES F000068F.
               05 F000068A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000068I                       PIC X(2).
            03 F000067L                       PIC S9(4) COMP.
            03 F000067F                       PIC X.
            03 FILLER REDEFINES F000067F.
               05 F000067A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000067I                       PIC X(2).
            03 F000066L                       PIC S9(4) COMP.
            03 F000066F                       PIC X.
            03 FILLER REDEFINES F000066F.
               05 F000066A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000066I                       PIC X(4).
            03 AUNR8L                         PIC S9(4) COMP.
            03 AUNR8F                         PIC X.
            03 FILLER REDEFINES AUNR8F.
               05 AUNR8A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR8I                         PIC X(3).
            03 F000065L                       PIC S9(4) COMP.
            03 F000065F                       PIC X.
            03 FILLER REDEFINES F000065F.
               05 F000065A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000065I                       PIC X(3).
            03 F000064L                       PIC S9(4) COMP.
            03 F000064F                       PIC X.
            03 FILLER REDEFINES F000064F.
               05 F000064A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000064I                       PIC X(3).
            03 APGV9L                         PIC S9(4) COMP.
            03 APGV9F                         PIC X.
            03 FILLER REDEFINES APGV9F.
               05 APGV9A                         PIC X.
            03 FILLER                         PIC X(1).
            03 APGV9I                         PIC X(4).
            03 F000063L                       PIC S9(4) COMP.
            03 F000063F                       PIC X.
            03 FILLER REDEFINES F000063F.
               05 F000063A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000063I                       PIC X(13).
            03 F000062L                       PIC S9(4) COMP.
            03 F000062F                       PIC X.
            03 FILLER REDEFINES F000062F.
               05 F000062A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000062I                       PIC X(4).
            03 AVSTAT9L                       PIC S9(4) COMP.
            03 AVSTAT9F                       PIC X.
            03 FILLER REDEFINES AVSTAT9F.
               05 AVSTAT9A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AVSTAT9I                       PIC X(4).
            03 F000061L                       PIC S9(4) COMP.
            03 F000061F                       PIC X.
            03 FILLER REDEFINES F000061F.
               05 F000061A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000061I                       PIC X(3).
            03 EFCZ92L                        PIC S9(4) COMP.
            03 EFCZ92F                        PIC X.
            03 FILLER REDEFINES EFCZ92F.
               05 EFCZ92A                        PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ92I                        PIC X(1).
            03 F000080L                       PIC S9(4) COMP.
            03 F000080F                       PIC X.
            03 FILLER REDEFINES F000080F.
               05 F000080A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000080I                       PIC X(2).
            03 F000079L                       PIC S9(4) COMP.
            03 F000079F                       PIC X.
            03 FILLER REDEFINES F000079F.
               05 F000079A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000079I                       PIC X(10).
            03 F000078L                       PIC S9(4) COMP.
            03 F000078F                       PIC X.
            03 FILLER REDEFINES F000078F.
               05 F000078A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000078I                       PIC X(2).
            03 F000077L                       PIC S9(4) COMP.
            03 F000077F                       PIC X.
            03 FILLER REDEFINES F000077F.
               05 F000077A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000077I                       PIC X(2).
            03 F000076L                       PIC S9(4) COMP.
            03 F000076F                       PIC X.
            03 FILLER REDEFINES F000076F.
               05 F000076A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000076I                       PIC X(4).
            03 AUNR9L                         PIC S9(4) COMP.
            03 AUNR9F                         PIC X.
            03 FILLER REDEFINES AUNR9F.
               05 AUNR9A                         PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR9I                         PIC X(3).
            03 F000075L                       PIC S9(4) COMP.
            03 F000075F                       PIC X.
            03 FILLER REDEFINES F000075F.
               05 F000075A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000075I                       PIC X(3).
            03 F000074L                       PIC S9(4) COMP.
            03 F000074F                       PIC X.
            03 FILLER REDEFINES F000074F.
               05 F000074A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000074I                       PIC X(3).
            03 APGV92L                        PIC S9(4) COMP.
            03 APGV92F                        PIC X.
            03 FILLER REDEFINES APGV92F.
               05 APGV92A                        PIC X.
            03 FILLER                         PIC X(1).
            03 APGV92I                        PIC X(4).
            03 F000073L                       PIC S9(4) COMP.
            03 F000073F                       PIC X.
            03 FILLER REDEFINES F000073F.
               05 F000073A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000073I                       PIC X(13).
            03 F000072L                       PIC S9(4) COMP.
            03 F000072F                       PIC X.
            03 FILLER REDEFINES F000072F.
               05 F000072A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000072I                       PIC X(4).
            03 F000071L                       PIC S9(4) COMP.
            03 F000071F                       PIC X.
            03 FILLER REDEFINES F000071F.
               05 F000071A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000071I                       PIC X(4).
            03 F000070L                       PIC S9(4) COMP.
            03 F000070F                       PIC X.
            03 FILLER REDEFINES F000070F.
               05 F000070A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000070I                       PIC X(3).
            03 EFCZ922L                       PIC S9(4) COMP.
            03 EFCZ922F                       PIC X.
            03 FILLER REDEFINES EFCZ922F.
               05 EFCZ922A                       PIC X.
            03 FILLER                         PIC X(1).
            03 EFCZ922I                       PIC X(1).
            03 F000091L                       PIC S9(4) COMP.
            03 F000091F                       PIC X.
            03 FILLER REDEFINES F000091F.
               05 F000091A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000091I                       PIC X(2).
            03 F000090L                       PIC S9(4) COMP.
            03 F000090F                       PIC X.
            03 FILLER REDEFINES F000090F.
               05 F000090A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000090I                       PIC X(10).
            03 F000089L                       PIC S9(4) COMP.
            03 F000089F                       PIC X.
            03 FILLER REDEFINES F000089F.
               05 F000089A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000089I                       PIC X(2).
            03 F000088L                       PIC S9(4) COMP.
            03 F000088F                       PIC X.
            03 FILLER REDEFINES F000088F.
               05 F000088A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000088I                       PIC X(2).
            03 F000087L                       PIC S9(4) COMP.
            03 F000087F                       PIC X.
            03 FILLER REDEFINES F000087F.
               05 F000087A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000087I                       PIC X(4).
            03 AUNR92L                        PIC S9(4) COMP.
            03 AUNR92F                        PIC X.
            03 FILLER REDEFINES AUNR92F.
               05 AUNR92A                        PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR92I                        PIC X(3).
            03 F000086L                       PIC S9(4) COMP.
            03 F000086F                       PIC X.
            03 FILLER REDEFINES F000086F.
               05 F000086A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000086I                       PIC X(3).
            03 F000085L                       PIC S9(4) COMP.
            03 F000085F                       PIC X.
            03 FILLER REDEFINES F000085F.
               05 F000085A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000085I                       PIC X(3).
            03 APGV922L                       PIC S9(4) COMP.
            03 APGV922F                       PIC X.
            03 FILLER REDEFINES APGV922F.
               05 APGV922A                       PIC X.
            03 FILLER                         PIC X(1).
            03 APGV922I                       PIC X(4).
            03 F000084L                       PIC S9(4) COMP.
            03 F000084F                       PIC X.
            03 FILLER REDEFINES F000084F.
               05 F000084A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000084I                       PIC X(13).
            03 F000083L                       PIC S9(4) COMP.
            03 F000083F                       PIC X.
            03 FILLER REDEFINES F000083F.
               05 F000083A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000083I                       PIC X(4).
            03 F000082L                       PIC S9(4) COMP.
            03 F000082F                       PIC X.
            03 FILLER REDEFINES F000082F.
               05 F000082A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000082I                       PIC X(4).
            03 F000081L                       PIC S9(4) COMP.
            03 F000081F                       PIC X.
            03 FILLER REDEFINES F000081F.
               05 F000081A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000081I                       PIC X(3).
            03 F000104L                       PIC S9(4) COMP.
            03 F000104F                       PIC X.
            03 FILLER REDEFINES F000104F.
               05 F000104A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000104I                       PIC X(1).
            03 F000103L                       PIC S9(4) COMP.
            03 F000103F                       PIC X.
            03 FILLER REDEFINES F000103F.
               05 F000103A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000103I                       PIC X(2).
            03 F000102L                       PIC S9(4) COMP.
            03 F000102F                       PIC X.
            03 FILLER REDEFINES F000102F.
               05 F000102A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000102I                       PIC X(10).
            03 F000101L                       PIC S9(4) COMP.
            03 F000101F                       PIC X.
            03 FILLER REDEFINES F000101F.
               05 F000101A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000101I                       PIC X(2).
            03 F000100L                       PIC S9(4) COMP.
            03 F000100F                       PIC X.
            03 FILLER REDEFINES F000100F.
               05 F000100A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000100I                       PIC X(2).
            03 F000099L                       PIC S9(4) COMP.
            03 F000099F                       PIC X.
            03 FILLER REDEFINES F000099F.
               05 F000099A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000099I                       PIC X(4).
            03 AUNR922L                       PIC S9(4) COMP.
            03 AUNR922F                       PIC X.
            03 FILLER REDEFINES AUNR922F.
               05 AUNR922A                       PIC X.
            03 FILLER                         PIC X(1).
            03 AUNR922I                       PIC X(3).
            03 F000098L                       PIC S9(4) COMP.
            03 F000098F                       PIC X.
            03 FILLER REDEFINES F000098F.
               05 F000098A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000098I                       PIC X(3).
            03 F000097L                       PIC S9(4) COMP.
            03 F000097F                       PIC X.
            03 FILLER REDEFINES F000097F.
               05 F000097A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000097I                       PIC X(3).
            03 F000096L                       PIC S9(4) COMP.
            03 F000096F                       PIC X.
            03 FILLER REDEFINES F000096F.
               05 F000096A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000096I                       PIC X(4).
            03 F000095L                       PIC S9(4) COMP.
            03 F000095F                       PIC X.
            03 FILLER REDEFINES F000095F.
               05 F000095A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000095I                       PIC X(13).
            03 F000094L                       PIC S9(4) COMP.
            03 F000094F                       PIC X.
            03 FILLER REDEFINES F000094F.
               05 F000094A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000094I                       PIC X(4).
            03 F000093L                       PIC S9(4) COMP.
            03 F000093F                       PIC X.
            03 FILLER REDEFINES F000093F.
               05 F000093A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000093I                       PIC X(4).
            03 F000092L                       PIC S9(4) COMP.
            03 F000092F                       PIC X.
            03 FILLER REDEFINES F000092F.
               05 F000092A                       PIC X.
            03 FILLER                         PIC X(1).
            03 F000092I                       PIC X(3).
            03 AFCANZL                        PIC S9(4) COMP.
            03 AFCANZF                        PIC X.
            03 FILLER REDEFINES AFCANZF.
               05 AFCANZA                        PIC X.
            03 FILLER                         PIC X(1).
            03 AFCANZI                        PIC X(79).

      *  Output Data For Map BPA0023
         01 BPA0023O REDEFINES BPA0023I.
            03 FILLER                         PIC X(12).
            03 FILLER                         PIC X(3).
            03 EGESH                          PIC X.
            03 EGESO                          PIC X(2).
            03 FILLER                         PIC X(3).
            03 AGESBMH                        PIC X.
            03 AGESBMO                        PIC X(10).
            03 FILLER                         PIC X(3).
            03 EVNRH                          PIC X.
            03 EVNRO                          PIC X(15).
            03 FILLER                         PIC X(3).
            03 EUNRH                          PIC X.
            03 EUNRO                          PIC X(3).
            03 FILLER                         PIC X(3).
            03 ESCHICHH                       PIC X.
            03 ESCHICHO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASEIFBH                        PIC X.
            03 ASEIFBO                        PIC X(6).
            03 FILLER                         PIC X(3).
            03 ESEIAKTH                       PIC X.
            03 ESEIAKTO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASEISTRH                       PIC X.
            03 ASEISTRO                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 ASEIGESH                       PIC X.
            03 ASEIGESO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 ANAMEFBH                       PIC X.
            03 ANAMEFBO                       PIC X(5).
            03 FILLER                         PIC X(3).
            03 ANAMEH                         PIC X.
            03 ANAMEO                         PIC X(25).
            03 FILLER                         PIC X(3).
            03 AKENBEZH                       PIC X.
            03 AKENBEZO                       PIC X(8).
            03 FILLER                         PIC X(3).
            03 EGELKENH                       PIC X.
            03 EGELKENO                       PIC X(6).
            03 FILLER                         PIC X(3).
            03 AFCFBH                         PIC X.
            03 AFCFBO                         PIC X(2).
            03 FILLER                         PIC X(3).
            03 AFABFB1H                       PIC X.
            03 AFABFB1O                       PIC X(6).
            03 FILLER                         PIC X(3).
            03 AFBUNT1H                       PIC X.
            03 AFBUNT1O                       PIC X(7).
            03 FILLER                         PIC X(3).
            03 AFABFB2H                       PIC X.
            03 AFABFB2O                       PIC X(6).
            03 FILLER                         PIC X(3).
            03 AFBUNT2H                       PIC X.
            03 AFBUNT2O                       PIC X(7).
            03 FILLER                         PIC X(3).
            03 EFCZ2H                         PIC X.
            03 EFCZ2O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO2H                       PIC X.
            03 AZINFO2O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000007H                       PIC X.
            03 F000007O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000006H                       PIC X.
            03 F000006O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000005H                       PIC X.
            03 F000005O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000004H                       PIC X.
            03 F000004O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNRH                          PIC X.
            03 AUNRO                          PIC X(3).
            03 FILLER                         PIC X(3).
            03 ASCHICHH                       PIC X.
            03 ASCHICHO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFOLGNRH                       PIC X.
            03 EFOLGNRO                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV2H                         PIC X.
            03 APGV2O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000002H                       PIC X.
            03 F000002O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000001H                       PIC X.
            03 F000001O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT2H                       PIC X.
            03 AVSTAT2O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000000H                       PIC X.
            03 F000000O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ3H                         PIC X.
            03 EFCZ3O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO3H                       PIC X.
            03 AZINFO3O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000015H                       PIC X.
            03 F000015O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000014H                       PIC X.
            03 F000014O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000013H                       PIC X.
            03 F000013O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000012H                       PIC X.
            03 F000012O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR2H                         PIC X.
            03 AUNR2O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000011H                       PIC X.
            03 F000011O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000010H                       PIC X.
            03 F000010O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV3H                         PIC X.
            03 APGV3O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000009H                       PIC X.
            03 F000009O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000008H                       PIC X.
            03 F000008O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT3H                       PIC X.
            03 AVSTAT3O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000003H                       PIC X.
            03 F000003O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ4H                         PIC X.
            03 EFCZ4O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO4H                       PIC X.
            03 AZINFO4O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000024H                       PIC X.
            03 F000024O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000023H                       PIC X.
            03 F000023O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000022H                       PIC X.
            03 F000022O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000021H                       PIC X.
            03 F000021O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR3H                         PIC X.
            03 AUNR3O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000020H                       PIC X.
            03 F000020O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000019H                       PIC X.
            03 F000019O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV4H                         PIC X.
            03 APGV4O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000018H                       PIC X.
            03 F000018O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000017H                       PIC X.
            03 F000017O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT4H                       PIC X.
            03 AVSTAT4O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000016H                       PIC X.
            03 F000016O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ5H                         PIC X.
            03 EFCZ5O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO5H                       PIC X.
            03 AZINFO5O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000033H                       PIC X.
            03 F000033O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000032H                       PIC X.
            03 F000032O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000031H                       PIC X.
            03 F000031O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000030H                       PIC X.
            03 F000030O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR4H                         PIC X.
            03 AUNR4O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000029H                       PIC X.
            03 F000029O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000028H                       PIC X.
            03 F000028O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV5H                         PIC X.
            03 APGV5O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000027H                       PIC X.
            03 F000027O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000026H                       PIC X.
            03 F000026O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT5H                       PIC X.
            03 AVSTAT5O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000025H                       PIC X.
            03 F000025O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ6H                         PIC X.
            03 EFCZ6O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO6H                       PIC X.
            03 AZINFO6O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000042H                       PIC X.
            03 F000042O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000041H                       PIC X.
            03 F000041O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000040H                       PIC X.
            03 F000040O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000039H                       PIC X.
            03 F000039O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR5H                         PIC X.
            03 AUNR5O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000038H                       PIC X.
            03 F000038O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000037H                       PIC X.
            03 F000037O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV6H                         PIC X.
            03 APGV6O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000036H                       PIC X.
            03 F000036O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000035H                       PIC X.
            03 F000035O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT6H                       PIC X.
            03 AVSTAT6O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000034H                       PIC X.
            03 F000034O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ7H                         PIC X.
            03 EFCZ7O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO7H                       PIC X.
            03 AZINFO7O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000051H                       PIC X.
            03 F000051O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000050H                       PIC X.
            03 F000050O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000049H                       PIC X.
            03 F000049O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000048H                       PIC X.
            03 F000048O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR6H                         PIC X.
            03 AUNR6O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000047H                       PIC X.
            03 F000047O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000046H                       PIC X.
            03 F000046O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV7H                         PIC X.
            03 APGV7O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000045H                       PIC X.
            03 F000045O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000044H                       PIC X.
            03 F000044O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT7H                       PIC X.
            03 AVSTAT7O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000043H                       PIC X.
            03 F000043O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ8H                         PIC X.
            03 EFCZ8O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO8H                       PIC X.
            03 AZINFO8O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000060H                       PIC X.
            03 F000060O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000059H                       PIC X.
            03 F000059O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000058H                       PIC X.
            03 F000058O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000057H                       PIC X.
            03 F000057O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR7H                         PIC X.
            03 AUNR7O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000056H                       PIC X.
            03 F000056O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000055H                       PIC X.
            03 F000055O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV8H                         PIC X.
            03 APGV8O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000054H                       PIC X.
            03 F000054O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000053H                       PIC X.
            03 F000053O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT8H                       PIC X.
            03 AVSTAT8O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000052H                       PIC X.
            03 F000052O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ9H                         PIC X.
            03 EFCZ9O                         PIC X(1).
            03 FILLER                         PIC X(3).
            03 AZINFO9H                       PIC X.
            03 AZINFO9O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000069H                       PIC X.
            03 F000069O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000068H                       PIC X.
            03 F000068O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000067H                       PIC X.
            03 F000067O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000066H                       PIC X.
            03 F000066O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR8H                         PIC X.
            03 AUNR8O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000065H                       PIC X.
            03 F000065O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000064H                       PIC X.
            03 F000064O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV9H                         PIC X.
            03 APGV9O                         PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000063H                       PIC X.
            03 F000063O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000062H                       PIC X.
            03 F000062O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AVSTAT9H                       PIC X.
            03 AVSTAT9O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000061H                       PIC X.
            03 F000061O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ92H                        PIC X.
            03 EFCZ92O                        PIC X(1).
            03 FILLER                         PIC X(3).
            03 F000080H                       PIC X.
            03 F000080O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000079H                       PIC X.
            03 F000079O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000078H                       PIC X.
            03 F000078O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000077H                       PIC X.
            03 F000077O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000076H                       PIC X.
            03 F000076O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR9H                         PIC X.
            03 AUNR9O                         PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000075H                       PIC X.
            03 F000075O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000074H                       PIC X.
            03 F000074O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV92H                        PIC X.
            03 APGV92O                        PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000073H                       PIC X.
            03 F000073O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000072H                       PIC X.
            03 F000072O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000071H                       PIC X.
            03 F000071O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000070H                       PIC X.
            03 F000070O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 EFCZ922H                       PIC X.
            03 EFCZ922O                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 F000091H                       PIC X.
            03 F000091O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000090H                       PIC X.
            03 F000090O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000089H                       PIC X.
            03 F000089O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000088H                       PIC X.
            03 F000088O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000087H                       PIC X.
            03 F000087O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR92H                        PIC X.
            03 AUNR92O                        PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000086H                       PIC X.
            03 F000086O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000085H                       PIC X.
            03 F000085O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 APGV922H                       PIC X.
            03 APGV922O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000084H                       PIC X.
            03 F000084O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000083H                       PIC X.
            03 F000083O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000082H                       PIC X.
            03 F000082O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000081H                       PIC X.
            03 F000081O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000104H                       PIC X.
            03 F000104O                       PIC X(1).
            03 FILLER                         PIC X(3).
            03 F000103H                       PIC X.
            03 F000103O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000102H                       PIC X.
            03 F000102O                       PIC X(10).
            03 FILLER                         PIC X(3).
            03 F000101H                       PIC X.
            03 F000101O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000100H                       PIC X.
            03 F000100O                       PIC X(2).
            03 FILLER                         PIC X(3).
            03 F000099H                       PIC X.
            03 F000099O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 AUNR922H                       PIC X.
            03 AUNR922O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000098H                       PIC X.
            03 F000098O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000097H                       PIC X.
            03 F000097O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 F000096H                       PIC X.
            03 F000096O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000095H                       PIC X.
            03 F000095O                       PIC X(13).
            03 FILLER                         PIC X(3).
            03 F000094H                       PIC X.
            03 F000094O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000093H                       PIC X.
            03 F000093O                       PIC X(4).
            03 FILLER                         PIC X(3).
            03 F000092H                       PIC X.
            03 F000092O                       PIC X(3).
            03 FILLER                         PIC X(3).
            03 AFCANZH                        PIC X.
            03 AFCANZO                        PIC X(79).


