      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  26.06.2019
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2019 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3708.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI3708.CPv  $
      *
      *   Rev 2.1   Jul 05 2019 08:18:56   t13ac20
      *AKI01690: Datenbereitstellung für Potentialabfrage FlexN-Boo
      *ster für den VB: Source
      *
      *   Rev 2.0   Jun 26 2019 12:06:22   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *
      *    FLEXN-BOOSTER POTENTIAL BOOSTER-BEWERTUNG
      *
      *    SATZLÄNGE VARIABEL (16 BYTES)
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    VERSION
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AKI01690!26.06.19!2.1 ! NEU                       ! T13AC20
      *         !        !    !                           !
      *         !        !    !                           !
      *         !        !    !                           !
      *
      * ENDE-LOGBUCH
      *****************************************************************
      *
           05 DRKI3708.
              10 KIPERSONENID                    PIC  X(013).
              10 KV-BOOST-KZN                    PIC  X(001).
              10 LV-BOOST-KZN                    PIC  X(001).
              10 BOOSTER-BEWERTUNG               PIC  X(001).

