      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2020 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0420.CPY  $
      *    $Revision:   2.24  $
      *
      *    $Log:   L:/mf/CPY/DRKI0420.CPv  $
      *
      *   Rev 2.24   Feb 04 2020 12:52:42   t13ac20
      *AKI01757: VDL-Leben: HOST Verarbeitung und Speicherung der D
      *aten für die neuen Pflegetarife (pflegeSmart und pflegePro) 
      *b2
      *
      *   Rev 2.23   Feb 04 2020 07:32:36   t13ac20
      *AKI01757: VDL-Leben: HOST Verarbeitung und Speicherung der D
      *aten für die neuen Pflegetarife (pflegeSmart und pflegePro)
      *b2
      *
      *   Rev 2.22   Aug 14 2018 09:30:14   t13ac17
      *AKI01605: G20 EVWS - neue Produkte zum RT 09/2018 Standard-OZP
      *
      *   Rev 2.21   Apr 04 2017 14:22:00   t13ac20
      *AKI01503: OZPs bereinigen
      *
      *   Rev 2.20   Mar 15 2017 14:30:08   t13ex27
      *AKI01492: AML-Änderungen zum RT 03/2017OZPs
      *
      *   Rev 2.19   Jan 17 2017 10:57:42   t13ex27
      *AKI01488: AM-Leben Konsortialverträge
      *
      *   Rev 2.18   Jun 24 2016 09:03:34   t13ex48
      *AKI01434: AML-Neue Produkte zum RT 06/16: Rechenwerte
      *
      *   Rev 2.17   Mar 18 2015 17:19:20   t13ex48
      *AKI01349: AMLeben: VEP-Bestandsmasken: OZP LRW
      *
      *   Rev 2.16   Jun 26 2014 14:03:12   t13ex48
      *AKI01296: VERMÖGENS- & EINKOMMENSPLAN - VEP: Cobol RW
      *
      *   Rev 2.15   Mar 28 2014 01:17:48   t13ex48
      *AKI01153: Neues Verfahren: Aktualisierung AML-Rechenwerte
      *
      *   Rev 2.14   Aug 31 2011 12:40:04   t13ex48
      *AKI01065: AMLeben - Einführung Impulsprodukt - VASP: Source RW
      *
      *   Rev 2.13   Jan 04 2011 13:45:00   t13ex27
      *AKI00961: Anzeige "Frühester Rentenbeginn" in KI-Vertragsdat
      *en-OZP
      *
      *   Rev 2.12   Dec 10 2010 10:23:46   t13ex48
      *AKI00969: AML-DTA: neue Felder zum RT 06/2010: RW
      *
      *   Rev 2.11   Sep 07 2009 15:36:00   t13ex27
      *AKI00860: Anzeige " Abtretung" bei LV-Verträgen-OZPs und Map
      *ping
      *
      *   Rev 2.10   Aug 13 2009 11:53:52   t13ex27
      *AKI00860: Anzeige " Abtretung" bei LV-Verträgen-OZPs und Map
      *ping
      *
      *   Rev 2.9   02 Feb 2009 10:17:48   t13ex27
      *AKI00768: CR 22257 - Bearbeitungskennzeichen Rechenwerte-DB-
      *Änderung
      *
      *   Rev 2.8   09 Jun 2008 15:57:52   t13ex27
      *AKI00711: Neue DTA-Felder AMLeben OZPs
      *
      *   Rev 2.7   04 Oct 2006 15:04:40   t13ex39
      *AKI00615: Einführung Pflegerentenversicherung
      *
      *   Rev 2.6   27 Sep 2006 10:34:36   t13ex39
      *AKI00619: neuer Unfall Plus Tarif "50+"
      *
      *   Rev 1.0   28 Jul 1998 09:52:30   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRKI0420                                      *
      *    --------------------------------------------------------   *
      *    SCHNITTSTELLE FÜR DIE FUNKTION DRKI0420                    *
      *    --------------------------------------------------------   *
      ****************************************************************
      *   ERZEUGT MIT OZPGEN         04.02.2020 / 11:40:45 / T13AC20
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *
      *    DIESES COPY ENTHÄLT DIE EIN- UND AUSGABEPARAMETER
      *    FÜR DIE FUNKTION DRKI0420
      *    AUSSER: DEM FUNKTIONSNAMEN,
      *            DEM ERR-ERROR-BEREICH UND
      *            DEM STANDARD-STATUS-BEREICH
      *            (JEWEILS SEPARATE COPYS)
      *
      *    >>>  INSERT  <<<
      *
      ****************************************************************
      *
       01  PI-DRKI0420.
           05  PI-DRKI0420-KEY.
 
ANF   *        %M_PI_KEY%
             10 PI-DRKI0420-LRWVERSTARLFDNR   PIC S9(4) COMP.
             10 PI-DRKI0420-LRWVERTRAGSID   PIC  X(0013).
END   *
 
           05  PI-DRKI0420-NI.
 
ANF   *        %M_PI_DATEN_NI%
             15 PI-DRKI0420-NI-LRWABLEISTSIM    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBLSTSMBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWABLEISTVOR    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBLSTVRBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBLSTVRWKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWABZUG         PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWABZUGBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWAKTVTRWERT    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWKTVTRWRTBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSZHLBTBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSZHLBTRG       PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBGBRFPHS       PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBTRFRSM        PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWBETRFSUMBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWBONUSRENTE    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBNSRNTBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBSPBGRNTZHLG   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWBTFRISTWERT   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBTFRSTWRTSK    PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWBTFRMINDWERT  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWBTFRMNDWRTSK   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWBTFRSUMSK     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWBTFRSUMSKBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWDATUMSTAND    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWDTMSTNDSM      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWEINKOMTOPF    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWNKMTPFBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWERMABL        PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWERMABLBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWFMBTFRTT      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWFMBTFRTTINFO  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWFMBTFRTTSK    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWFMBTFRTTSKBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWFORENDITE     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWFORENDITEBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWFRMGLBGRNT     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARABLRNTPRL  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRBRNTPRLBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARLSTABL     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARLSTABLBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARPFRENTANW  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRPFRNTNWBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRPFRNTBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARPFRENTE1   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARPFRENTE2   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARPFRENTE3   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARPFRENTE4   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARPFRENTE5   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVGBLKPBF     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVGBLKPKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVGBLSTBL     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGARVGABLSTKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVRGKPBBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVRGKPBF      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVRGLSTBBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGRVRGLSTBL     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGBURENTANW    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGBRNTNWBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGBURENTE      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGBURENTEBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGBUZVRENTE    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGBZVRNTBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESEURENTE    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGSRNTBKZ       PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGSZBNRBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESEUZBONRNT  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESEUZVRENTE  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGSZVRNTBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESPFRENTANW  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGSPFRNTNWBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGSPFRNTBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESPFRENTE1   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESPFRENTE2   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESPFRENTE3   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESPFRENTE4   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGESPFRENTE5   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGKIRENTE      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGKIRENTEBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGPFRENTE      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWGPFRNTNBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGPFRENTEANW   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGPFRENTEBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGUZVSUMME     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWGUZVSUMMEBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKAPABFGAR     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKAPABFGARBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWKPBFNKDBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKAPABFINKDYN  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKAPABFVOR     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKAPABFVORBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKONVGH        PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWKONVGHBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWLSTPROZPFL1   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWLSTPROZPFL2   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWLSTPROZPFL3   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWLSTPROZPFL4   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWLSTPROZPFL5   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWMGLDRLBTR      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWMOEGLDBBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWPFSTAFFELKZN  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWBUZV       PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWBUZVBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWERTGES     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWERTGESBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWEUZV       PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWEUZVBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWHV         PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWHVBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWPZV        PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWPZVBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWSK         PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWSKBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWTZV        PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWRKWTZVBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSCHRHRSBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSCHRHRSRV      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSMBTBWRKBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWSUMBETBWRRK   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWSUMDK         PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWSUMDKBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWSUMRKWNATAZ   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSMRKWNTZBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSMTLRNTN       PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWSMTLRNTBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWUEBETTOD      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWUEBETTODBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRMGTPBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVERMOEGTOPF   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRSZDRLBTR     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVORAUSZDBBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRKPBFNBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRKPBFTNTZ     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRLSTBLNBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRLSTBLNTZ     PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRVRGKPBBKZ    PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRVRGKPBF      PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRVRGLSTBBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVRVRGLSTBL     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVSRSK         PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVSRSKBKZ      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVSRSKUEB      PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVSRSKUEBBKZ   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVSRTOD        PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVSRTODBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVVGKAPABFSIM  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVVGLSTABLSIM  PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWVVGLSTASIBKZ  PIC S9(4) COMP.
             15 PI-DRKI0420-N-LRWVVKPBFSBKZ     PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWZAHLBEITRAG   PIC S9(4) COMP.
             15 PI-DRKI0420-NI-LRWZAHLBEITRBKZ  PIC S9(4) COMP.
END   *
 
           05  PI-DRKI0420-DATEN.
 
ANF   *        %M_PI_DATEN%
             10 PI-DRKI0420-LRWABLEISTSIM   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWABLEISTSIMBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWABLEISTVOR   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWABLEISTVORBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWABLEISTVORWKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWABZUG   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWABZUGBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWAKTVTRWERT   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWAKTVTRWERTBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWAUSZAHLBETBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWAUSZAHLBETRAG   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBEGABRUFPHASE   PIC  X(010).
             10 PI-DRKI0420-LRWBEITRFREIESUM   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBETRFSUMBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWBONUSRENTE   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBONUSRENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWBSPBEGRNTZHLG   PIC  X(010).
             10 PI-DRKI0420-LRWBTFRISTWERT   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBTFRISTWERTSK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBTFRMINDWERT   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBTFRMINDWRTSK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBTFRSUMSK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWBTFRSUMSKBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWDATUMSTAND   PIC  X(010).
             10 PI-DRKI0420-LRWDATUMSTANDSIM   PIC  X(010).
             10 PI-DRKI0420-LRWEINKOMTOPF   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWEINKOMTOPFBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWERMABL   PIC  X(010).
             10 PI-DRKI0420-LRWERMABLBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWFMBTFRTT   PIC  X(010).
             10 PI-DRKI0420-LRWFMBTFRTTINFO   PIC  X(0001).
             10 PI-DRKI0420-LRWFMBTFRTTSK   PIC  X(010).
             10 PI-DRKI0420-LRWFMBTFRTTSKBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWFORENDITE   PIC S9(3)V9(2) COMP-3.
             10 PI-DRKI0420-LRWFORENDITEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWFRMGLBEGRENTE   PIC  X(010).
             10 PI-DRKI0420-LRWGARABLRNTPRL   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARABRNTPRLBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARLSTABL   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARLSTABLBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARPFRENTANW   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARPFRENTANWBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARPFRENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARPFRENTE1   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARPFRENTE2   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARPFRENTE3   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARPFRENTE4   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARPFRENTE5   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARVGABLKAPABF   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARVGABLKAPKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARVGABLSTABL   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARVGABLSTKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARVORGKAPABBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARVORGKAPABF   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGARVORGLSTABBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGARVORGLSTABL   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGBURENTANW   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGBURENTANWBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGBURENTE   PIC S9(7)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGBURENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGBUZVRENTE   PIC S9(7)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGBUZVRENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGESEURENTE   PIC S9(7)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESEURENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGESEUZBONRBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGESEUZBONRNT   PIC S9(7)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESEUZVRENTE   PIC S9(7)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESEUZVRNTBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGESPFRENTANW   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESPFRENTANWBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGESPFRENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGESPFRENTE1   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESPFRENTE2   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESPFRENTE3   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESPFRENTE4   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGESPFRENTE5   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGKIRENTE   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGKIRENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGPFRENTE   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGPFRENTEANBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGPFRENTEANW   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGPFRENTEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWGUZVSUMME   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWGUZVSUMMEBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWKAPABFGAR   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWKAPABFGARBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWKAPABFINKDBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWKAPABFINKDYN   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWKAPABFVOR   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWKAPABFVORBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWKONSORTIALKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWKONVGH   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWKONVGHBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWLSTPROZPFL1   PIC S9(3)V COMP-3.
             10 PI-DRKI0420-LRWLSTPROZPFL2   PIC S9(3)V COMP-3.
             10 PI-DRKI0420-LRWLSTPROZPFL3   PIC S9(3)V COMP-3.
             10 PI-DRKI0420-LRWLSTPROZPFL4   PIC S9(3)V COMP-3.
             10 PI-DRKI0420-LRWLSTPROZPFL5   PIC S9(3)V COMP-3.
             10 PI-DRKI0420-LRWMOEGLDARLBETR   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWMOEGLDBBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWPFSTAFFELKZN   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWBUZV   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWBUZVBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWERTGES   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWERTGESBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWEUZV   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWEUZVBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWHV   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWHVBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWPZV   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWPZVBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWSK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWSKBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWRKWTZV   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWRKWTZVBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWSICHERHRESBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWSICHERHRESERV   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWSUMBETBWRKBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWSUMBETBWRRK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWSUMDK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWSUMDKBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWSUMRKWNATAZ   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWSUMRKWNATAZBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWSUMTEILRENTEN   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWSUMTEILRNTBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWUEBETTOD   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWUEBETTODBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVERMOEGTOPBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVERMOEGTOPF   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVORAUSZDARLBETR   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVORAUSZDBBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVORKAPABFNABKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVORKAPABFTNATAZ   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVORLSTABLNABKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVORLSTABLNATAZ   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVORVORGKAPABBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVORVORGKAPABF   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVORVORGLSTABBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVORVORGLSTABL   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVSRSK   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVSRSKBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVSRSKUEB   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVSRSKUEBBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVSRTOD   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVSRTODBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVVGKAPABFSIM   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVVGLSTABLSIM   PIC S9(11)V9(2) COMP-3.
             10 PI-DRKI0420-LRWVVGLSTASIBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWVVKAPABFSIBKZ   PIC  X(0001).
             10 PI-DRKI0420-LRWZAHLBEITRAG   PIC S9(9)V9(2) COMP-3.
             10 PI-DRKI0420-LRWZAHLBEITRBKZ   PIC  X(0001).
END   *
 
      *  INITIALISIERUNG NULL-INDIKATOR
       01  PI-DRKI0420-NI1.
           05 PI-DRKI0420-INIT-TAB1 PIC S9(04) COMP VALUE -1
                                      OCCURS 150.
       01  PI-DRKI0420-NI7.
           05 PI-DRKI0420-INIT-TAB7 PIC S9(04) COMP VALUE -7
                                      OCCURS 150.
 
      *
       01  PO-DRKI0420.
           05  PO-DRKI0420-RC                     PIC  X(003).
               88 PO-DRKI0420-RC-OK                  VALUE 'OK '.
               88 PO-DRKI0420-RC-DUPLICATE-VALUE VALUE 'DVA'.
      *
      ******* ENDE COPY-MEMBER **************************************

