      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0506.CPY  $
      *    $Revision:   2.31  $
      *
      *    $Log:   L:/mf/CPY/DRKI0506.CPv  $
      *
      *   Rev 2.31   May 27 2020 14:44:30   t13ex78
      *AKI01771: Bugfixing Vorzeichen BONUS
      *
      *   Rev 2.30   May 27 2020 14:16:56   t13ex78
      *AKI01771: Bugfixing
      *
      *   Rev 2.29   Apr 15 2020 08:19:06   t13ex78
      *AKI01771: Programme und Copies
      *
      *   Rev 2.28   Dec 16 2014 16:37:22   t13ex20
      *AKI01330: Badenia - Überarbeitung der Produktschlüssel
      *
      *   Rev 2.27   Nov 15 2012 15:31:32   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.26   Nov 15 2012 14:42:40   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.25   Nov 15 2012 14:31:22   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.24   Nov 15 2012 14:23:28   t13ex14
      *AKI01157: Badenia: Behandlung übersparter Verträge Programme
      *
      *   Rev 2.23   Aug 02 2010 12:32:44   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.22   Aug 02 2010 12:17:50   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.21   Aug 02 2010 12:09:14   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.20   Aug 02 2010 11:30:30   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.19   Aug 02 2010 10:59:02   T13ae49
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.18   Jul 14 2010 18:02:34   t13ex52
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.17   Jul 14 2010 17:22:30   t13ex52
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.16   Jul 13 2010 19:38:08   t13ex52
      *AKI00967: Felderweiterg. elektr. Vtrg.Datenänderung Ermittlu
      *ng, Aufbereitung, Aktualisierung
      *
      *   Rev 2.15   Feb 10 2010 10:51:46   t13ex14
      *AKI00911: Vorzeichenänderung f. Ermittl., Aufber., Aktual. B
      *ausparen
      *
      *   Rev 2.14   Feb 09 2010 12:22:44   t13ex14
      *AKI00911: Vorzeichenänderung f. Ermittl., Aufber., Aktual. B
      *ausparen
      *
      *   Rev 2.13   Oct 26 2009 07:36:40   t13ex14
      *AKI00846: Erw. der Bestands-DTAs Badenia: Programme u. Auftr
      *äge
      *
      *   Rev 2.12   Aug 29 2008 11:11:26   t13ex14
      *AKI00737: Badenia-Zwischen-und Vorfinanzierungen; Vertragsda
      *ten
      *
      *   Rev 2.11   May 07 2008 09:10:42   t13ex14
      *AKI00700: Neue Bestandsfelder im Vertrags-DTA Badenia
      *
      *   Rev 2.10   11 Aug 2007 12:40:32   t13ae31
      *AKI00623: Erweiterung des Bestands-DTA von der Badenia
      *
      *   Rev 2.9   Nov 17 2005 15:44:40   t13ex48
      *AKI00524: Erweiterter DTA-Badenia Bausparkasse.
      *
      *   Rev 2.8   Apr 05 2005 17:43:40   t13ex27
      *AKI00475: Anpassungen für Badenia
      *
      *   Rev 2.7   Jul 06 2004 13:49:38   t13ex49
      *AKI00419: Bestandsdatenerweiterung bei der Badenia Bausparka
      *sse AG
      *
      *   Rev 2.6   Apr 02 2003 13:27:42   t13ae31
      *AKI00333 neue Felder ZINSPLUS BWZVJ ZINSLFDJAHR
      *
      *   Rev 2.5   Jan 24 2003 07:50:26   t13ae31
      *FKI00695 Beitrag Minus zulassen
      *
      *   Rev 2.4   Jan 25 2002 08:52:24   t13ex49
      *AKI00258 - Dezimalstellen
      *
      *   Rev 2.3   20 Dec 2000 13:59:16   T13EX49
      *AKI00153 - Änderung Bewertungszahl
      *
      *   Rev 2.2   Jun 30 1999 09:44:40   T13EX51
      *AKI00030 Einfügen WKZ
      *
      *   Rev 2.1   Apr 08 1999 15:07:10   T13EX51
      *AKI00021
      *
      *   Rev 2.0   Mar 01 1999 15:06:28   T13EX51
      *Neue Revision AKI000001
      *
      *   Rev 1.0   07 Aug 1998 14:43:40   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ******************************************************************
      *              #####################                             *
      *     ########    D R K I 0 5 0 6    ########                    *
      *              #####################                             *
      *                                                                *
      *  COPY-MEMBER FUER BADENIA Vertragsdaten Komplettbestand        *
      *                                                                *
      *                                                                *
291101*    Satzlänge   179 Bytes                                       *
100303*    Satzlänge   209 Bytes                                       *
250504*    Satzlänge   259 Bytes                                       *
200207*    Satzlänge   500 Bytes                                       *
110809*    Satzlänge   999 Bytes                                       *
      *                                                                *
      *                                                                *
      *----------------------------------------------------------------*
      *    LOGBUCH                                                     *
      *DATUM   !      ÄNDERUNG                         !NAME     !VERS.*
      *AUFTRAG !                                       !         !     *
      *--------!---------------------------------------!---------!-----*
      *03.08.98!NEUERSTELLUNG                          !Dobslaff ! 01  *
      *KI-NEU  !                                       !         !     *
      *        !                                       !         !     *
      *AKI00030!Einfügen Währungskennzeichen           !Dobslaff ! 02  *
      *        !                                       !         !     *
081100*        !                                       !         !     *
081100*08.11.99! BEWERTUNGSZAHL um eine Vorkomma-      !P. Pohl  !     *
081100*AKI00153! stelle erweitert                      !         !     *
291101*29.11.01! Einführung Dezimalstellen für:        !P. Pohl  !     *
291101*AKI00258! D-VSUMME (Vertragssumme) sowie        !         !     *
291101*        ! D-FEHL-MIN-ANSPAR (Fehlbetrag)        !         !     *
      *        !                                       !         !     *
240103*FKI00695! Vorzeichen Beitrag                    !P. Hübner!     *
      *        !                                       !         !     *
100303*AKI0333 ! Neue Felder ZINSPLUS/BWZVORJAHR       !         !     *
100303*        !ZINSLFDJAHR                            !P. Hübner!     *
      *        !                                       !         !     *
250504*AKI0419 ! Neues Feld SCHL-WOHN-PROG + Filler    !P. Pohl  !     *
      *AKI00475! neue Felder BASERHOEHEZBPROZ          !I.Frenzel!     *
      *        ! und EHELEUTEKZ                        !         !     *
      *--------!---------------------------------------!---------!     *
211005*AKI00524! neue Felder VERMITTELTKZ              !H.Sebbach!     *
      *21.10.05! und         BLANKODARLKZ              !         !     *
      *        !                                       !         !     *
200207*AKI00623! neue Felder für Finanz.produkte       !P. Hübner!     *
      *        !                                       !         !     *
100308*AKI00700! neue Felder ZP-FAKTOR, ZP-BETRAG,     !W.Misgeld!     *
100308*        ! ZP-GENERATION                         !         !     *
      *        !                                       !         !     *
120808*AKI00737! neues Feld K-LFDNR für  ZWK/BVD       !W.Misgeld!     *
      *        !                                       !         !     *
110809*AKI00846! DTA-Erweiterung                       !W.Misgeld!     *
      *        !                                       !         !     *
250110*AKI00911! Änd.6 Feld. mit Vorzeichen            !W.Misgeld!     *
      *        !                                       !         !     *
180610*AKI00967! DTA-Erweiterung um 7 Datenfelder      !H.Schlenther!  *
      *   UE002! gesamt 36 Byte.                       !         !     *
      *        !                                       !         !     *
280912*AKI01157! DTA-Erw. f. übersparte Verträge       !W.Misgeld!     *
      *        !                                       !         !     *
121114*AKI01330! Ueberarbeitung Produktschluessel      ! UZI     !     *
      *AKI01771! Umbenennung diverser Felder           ! T13EX78 !     *
      *        ! Teils neue Schlüssel (SCHL-WOHN-PROG) !         !     *
      *        ! 5 komplett neue Felder                !         !     *
      *AKI01771! Vorzeichen bei K-BONUS                ! T13EX78 !     *
      *----------------------------------------------------------------*
      *DBO-9564!                NEUES FELD             ! T13EX39 !     *
      *        !                PE-AUSZAHLUNGSART      !         !     *
      *        !                                       !         !     *
      *        !                                       !         !     *
      ******************************************************************
       01  DRKI0506.
      *
           05 K-AEND-KZ               PIC  9(002).
      *
      *  00 --> Neuanlage
      *  01 --> Änderung
      *  99 --> Stornierung
      *
           05 K-VERTRAG-KEY.
              10 K-VNR                PIC  9(015).
120808        10 K-LFDNR              PIC  9(001).
120808*       1 = Bausparvertrag
120808*       2 = ZWK (Zwischenkredit)/BVD (Bauvorausdarlehen)
           05 K-PRODSCHL              PIC  9(002).
           05 K-LAUFZEIT              PIC  X(002).
           05 K-VBEGINN               PIC  9(008).
           05 K-VENDE                 PIC  9(008).
291101*    05 K-VSUMME                PIC  9(007).
291101     05 K-VSUMME                PIC  9(008)V99.
240103**** 05 K-BEITRAG               PIC  9(005)V99.
240103     05 K-BEITRAG               PIC  S9(005)V99.
           05 K-KTO-STAND             PIC  X(001).
081100*    05 K-BEWERT-ZAHL           PIC  9(002)V99999.
081100     05 K-BEWERT-ZAHL           PIC  9(003)V99999.
           05 K-T-VAR-T3              PIC  X(001).
           05 K-ZINSSATZ-ALLG         PIC  9(003)V99.
           05 K-DARL-ZINS-TARIF       PIC  9(003)V99.
           05 K-DISAGIO-PROZ          PIC  9(003)V99.
291101*    05 K-FEHL-MIN-ANSPAR       PIC  9(007).
291101     05 K-FEHL-MIN-ANSPAR       PIC  9(008)V99.
           05 K-ENDE-STEUER-LAUFZEIT  PIC  9(008).
           05 K-DAT-WOBAU-PRAEMIE     PIC  9(008).
           05 K-DAT-ZUTEIL-AUSSICHT   PIC  9(008).
           05 K-DAT-MIN-ANSPAR        PIC  9(008).
           05 K-PART-INFO             PIC  X(020).
           05 K-VBNR                  PIC  9(009).
           05 K-MIN-ANSPAR-PROZ       PIC  9(003)V99.
           05 K-ZAHLW                 PIC  9(002).
      *
      *  01 --> jährlich
      *  02 --> halbjährlich
      *  04 --> vierteljährlich
      *  06 --> monatlich
      *  07 --> Einmalzahlung Laufzeit mind. 12 Mon.
      *  08 --> Einmalzahlung/Einmalprämie
      *  09 --> 2-monatlich
      *  99 --> Zahlweise fehlt
      *
           05 K-SPARBETRAG            PIC  9(009)V99.
      *
100308*    Zinsplusbetrag-Stand des Vorjahres:
100303     05 K-BONUS                 PIC  S9(009)V99.
      *
100303     05 K-BWZ-VORJAHR           PIC  9(003)V9(5).
      *
100303     05 K-ZINS-LFD-JAHR         PIC  S9(009)V99.
      *
           05 K-VERTRAG-WKZ           PIC  X(003).
      *
           05 K-LETZTE-AEND           PIC  X(008).


250504     05 K-SCHL-WOHN-PROG        PIC  9(002).
250504*    05 FILLER                  PIC  X(048).
250205     05 K-BASERHOEHEZBPROZ      PIC  9(003)V9(002).
250205     05 K-EHELEUTEKZ            PIC  X(001).
211005     05 K-BLANKODARLKZ          PIC  X(001).
211005     05 K-VERMITTELTKZ          PIC  X(001).
200207     05 K-DATUM-SPERRFRIST      PIC  9(008).
200207     05 K-ZINSVORTRAG           PIC  S9(9)V99.
200207     05 K-DATUM-AG-EINGANG      PIC  9(008).
200207     05 K-FIN-PRODUKT-SCHL      PIC  99.
200207     05 K-DATUM-ZINSFEST-AB     PIC  9(008).
200207     05 K-DATUM-ZINSFEST-BIS    PIC  9(008).
200207     05 K-DARL-ZINS-NOMINAL     PIC  9(3)V999.
200207     05 K-DARL-ZINS-EFFEKTIV    PIC  9(3)V999.
200207     05 K-ANNU-RATE             PIC  9(9)V99.
200207     05 K-LAUFZEIT-FIN          PIC  9(003).
200207     05 K-SONDERTILG-JAHR       PIC  9(9)V99.
200207     05 K-DARLEHEN-HOEHE        PIC  9(9)V99.
200207     05 K-DARLEHEN-SALDO        PIC  S9(9)V99.
200207     05 K-DATUM-AF-BEGINN       PIC  9(008).
100308     05 K-BONUS-FAKTOR          PIC S9(002)V99.
100308*    Zinsplusbetrag-Stand des aktuellen Jahres:
100308     05 K-BONUS-VORJAHR         PIC S9(009)V99.
100308     05 K-ZP-GENERATION         PIC  9(002).
110809     05 K-EINZBETRAGMON         PIC  9(007)V99.
>>         05 K-EINZGDATUMMON         PIC  9(008).
           05 K-EINZBETRAGJHR         PIC  9(007)V99.
           05 K-EINZGDATUMJHR         PIC  9(008).
           05 K-EINZUGDYNAM           PIC  9(003)V99.
           05 K-MINBEWERTZAHL         PIC  9(003)V999.
           05 K-INKASSOART            PIC  X(001).
      *  05 --> Lastschrift


           05 K-STEUERLFZDAT          PIC  9(008).
250110*    05 K-VLSUMJAHR             PIC  9(007)V99.
250110     05 K-VLSUMJAHR             PIC S9(007)V99.
           05 K-WOPKZ                 PIC  X(001).
           05 K-WOPAVORJHR            PIC  9(004).
           05 K-WOPAVORVORJHR         PIC  9(004).
           05 K-DAUERZULAGEKZ         PIC  X(001).
           05 K-JAHRESZULAGE.
              10 K-JAHRESZULAGE-TAB   OCCURS 5.
                 15 K-JAHRZULAGE      PIC  9(004).
250110*          15 K-JHRZULAGGUT     PIC  9(007)V99.
250110           15 K-JHRZULAGGUT     PIC S9(007)V99.
                 15 K-DATZULAGGUT     PIC  9(008).
250110*    05 K-SUMFOEREINZHL         PIC  9(007)V99.
250110     05 K-SUMFOEREINZHL         PIC S9(007)V99.
250110*    05 K-SALDWHNFOEKTO         PIC  9(007)V99.
250110     05 K-SALDWHNFOEKTO         PIC S9(007)V99.
250110*    05 K-SUMAVWLEINZHL         PIC  9(007)V99.
250110     05 K-SUMAVWLEINZHL         PIC S9(007)V99.
250110*    05 K-SUMFOERVORJHR         PIC  9(007)V99.
250110     05 K-SUMFOERVORJHR         PIC S9(007)V99.
           05 K-VARIANWECHSKZ         PIC  X(001).
           05 K-FINANZIERNGKZ         PIC  X(001).
           05 K-ZUTEILANWDAT          PIC  9(008).
           05 K-DARLEHNAKTEKZ         PIC  X(001).
           05 K-ENDEBINDFRIST         PIC  X(010).
           05 K-LETZTEDATAKTU         PIC  9(008).
           05 K-ZIELTILGUNG           PIC  9(003)V99.
           05 K-MEHRZUTEILUNG         PIC  9(007)V99.
           05 K-ABTRETUNGBLZ          PIC  9(008).
           05 K-TARIFUMSTBTRG         PIC  9(005)V99.
    <<     05 K-ANFTILGUNG            PIC  9(003)V99.
180610***  Datum letzte Zuteilung i.d.F. JJJJMMTT
    >>     05 K-LETZTEZUTEIL          PIC  9(008).
      *
      ***  Zuteilungsanwartschaft; Datum, wann der Vertrag voraussicht-
      ***  lich zugeteilt wird. zeitraum max. 10 Wochen.
      ***  i.d.F JJJJMMTT.
           05 K-ZUTEILANWART          PIC  9(008).
      *
      ***  WOP-Anspruch Wohnungsbau-Prämie
           05 K-WOPANSPRUCH           PIC  S9(007)V99.
      *
      ***  Sparzulage frei ab. Datum i.d.F. JJJJMMTT.
           05 K-SPARZULFREIAB         PIC  9(008).
      *
      ***  Vermoegenswirksame Leistung(VL). Wurde auf diesen Vertrag
      ***  VL einbezahlt ? 'J' Ja, 'N' Nein, Blank.
           05 K-VWLKZ                 PIC  X.
      *
      ***  ImmoFit-KZ. Für MOREBA-Steuerung notwendig.
      ***  'A' aktiver oder 'I'naktiver ImmoFit-Vertrag.
           05 K-IMMOFITKZ             PIC  X.
      *
      ***  Werbeverbot-Kennzeichen. hat der kunbde das Werbeverbot aus-
      ***  gesprochen ? 'J' Ja oder 'N' Nein oder Blank.
      ***  (Derzeit ist jedoch keine Anzeige in KI erwuenscht.)
           05 K-WERBVERBOTKZ          PIC  X.
    <<*
180610**
280912     05 K-DATGHBZINSBEGR        PIC  9(008).
>>    *    Guthabenszinsbegrenzung-Ab: Datum ab dem die Badenia nur
      *    noch maximal die Bausparsumme zur Zinsermittlung heranzieht.
      *    Format JJJJMMTT


           05 K-MAXZINSKAPITAL        PIC  S9(009)V99.
      *    Maximal verzinstes Guthaben


           05 K-MIETKAUTIONKZ         PIC  X.
      *    Mietkaution liegt vor: Ausprägung 'J'a, 'N'ein oder ' '


           05 K-PASSWVEREINB          PIC  X.
      *    Geheimwortvereinb. liegt vor: Ausprägung 'J'a, 'N'ein od. ' '


           05 K-DATLETZTERKAZ         PIC  9(008).
      *    Letzter Kontoauszug am; Format JJJJMMTT


           05 K-NRLETZTERKAZ          PIC  X(007).
      *    Nummer des aktuellen Kontoauszug; Format XXXX/XX


           05 K-DATNVBESCHEIN         PIC  9(008).
      *    Nichtveranlagungsbescheinigung-Bis: Datum, bis zu dem die
      *    Zinserträge des Kunde von der Abgeltungssteuer befreit sind.
      *    Format JJJJMMTT


    <<     05 K-VLPERSONALTKZ         PIC  X.
280912*    VL-Personalisiert: Ausprägungen 'J'a, 'N'ein oder ' '


           05 K-ONLINE-KI-PRODUKT     PIC  X(050).
           05 K-ONLINE-KI-ART         PIC  X(050).
           05 K-FRONTEND-TECHNISCH    PIC  X(008).
<<         05 K-ABB-VERSION           PIC  X(007).
           05 K-BONUSART              PIC  9(002).
           05 K-BONUSBEGINNDAT        PIC  9(008).
           05 K-TUB-AKTION            PIC  X(001).
           05 K-SONDERZAHLUNG         PIC  9(003)V9(002).
           05 K-SONDERTILGUNG         PIC  9(003)V9(002).

           05 K-PEAUSZAHLART          PIC  X.
      *    PEAUSZAHLART. LIEGT VOR: AUSPRÄGUNG 'J'A, 'N'EIN OD.' '   


061114     05 FILLER                  PIC  X(178).
280912*    05 FILLER                  PIC  X(293).
180610*    05 FILLER                  PIC  X(338).
110809*    05 FILLER                  PIC  X(374).
250205*    05 FILLER                  PIC  X(042).
211005*    05 FILLER                  PIC  X(040).
100308*    05 FILLER                  PIC  X(169).
120808*    05 FILLER                  PIC  X(152).
120808*    05 FILLER                  PIC  X(151).


      *******************************************************




