      *****************************************************************
      *    COPY-MEMBER: DRKI1949                                      *
      *                                                               *
      *    RESTARTINFORMATION ZU PROGRAMM PMKI1420                    *
      *                                                               *
      *****************************************************************
      *****************************************************************
      * LOGBUCH:                                                      *
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME     *
      * --------------------------------------------------------------*
      * DBO-8439   !30.04.21! NEU                          ! T13AC20  *
      *            !        !                              !          *
      *            !        !                              !          *
      *                                                               *
      * ENDE-LOGBUCH                                                  *
      *****************************************************************
      *
       01  DRKI1949-RESTARTINFO.
           05 DRKI1949-KEY.
              10 DRKI1949-VERTRAGSID             PIC  X(013).
           05 DRKI1949-ZAEHLER PACKED-DECIMAL.
              10 DRKI1949-EZ-LPZEIN              PIC S9(009).
              10 DRKI1949-AZ-LPZFEHL             PIC S9(009).
              10 DRKI1949-VZ-LPZ-INS             PIC S9(009).
              10 DRKI1949-VZ-LPZ-DEL             PIC S9(009).
      *****************************************************************
      *---------------------- ENDE DRKI1949 --------------------------* 
      *****************************************************************
