      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  28.04.2004
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2004 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1671.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI1671.CPv  $
      *
      *   Rev 2.1   Mar 09 2005 06:21:12   t13ex49
      *AKI00268: Post.Prüfung vor Kundenaktualisierung - DB
      *
      *   Rev 2.0   Apr 28 2004 09:28:38   t13ex49
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      * AENDERUNGEN:                                                  *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME      *
      * --------------------------------------------------------------*
      * AKI00268!26.04.04!    ! Neu                       ! P. Pohl   *
      *         !        !    !                           !           *
      *         !        !    !                           !           *
      *         !        !    !                           !           *
      *         !        !    !                           !           *
      *****************************************************************
      *
      * Protokollierung der gelöschten AdressAenderungen (R-Adressen)
      *
      * Satzlänge 105 Byte
      *
       01 DRKI1671.
           05  DRKI1671-ADAPERSONENID             PIC X(13).
           05  DRKI1671-ADAVERTRAGSID             PIC X(13).
           05  DRKI1671-ADAADRESSEALTID           PIC X(13).
           05  DRKI1671-ADAADRESSENEUID           PIC X(13).
           05  DRKI1671-ADAVBID                   PIC X(13).
           05  DRKI1671-ADAVBROLLE                PIC X(01).
           05  DRKI1671-ADAAENDGRUNDID            PIC S9(4) COMP.
           05  DRKI1671-ADADTAERLEDIGT            PIC X(01).
           05  DRKI1671-ADGEAENDERTAM             PIC X(10).
           05  DRKI1671-LETZTEAENDERUNG           PIC X(26).




      *----------- Ende DRKI1671 ---------------------------
      *

