      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI1505.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI1505.CPv  $
      *
      *   Rev 2.1   Jan 18 2007 11:22:56   t13ex14
      *FKI01032: Central Fehlerbereinigungen 
      *
      *   Rev 2.0   Feb 27 1999 12:52:48   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   09 Feb 1999 14:36:34   T13EX47
      *SELECT fuer das OZP ZWKI0357
      *
      *   Rev 1.0   29 Sep 1997 11:44:10   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ****************************************************************
      *    COPY-MEMBER: DRKI1502  FUNKTION lese-OZP                  *
      *    -------------------------------------------------------   *
      *    ERSTELLT: WHO                                             *
      *    DATUM:    10.02.2003                                      *
      ****************************************************************
      *    VERSION   01                                              *
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00694!21.01.03! 01 ! NEU                       ! HORNUNG  *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      ***************************************************************
      *                 PARAMETER-INPUT                             *
      ***************************************************************
       01  PI-DRKI1505.
           10 PI-DRKI1505-KRTVERTRAGSID               PIC X(13).
           10 PI-DRKI1505-KRTPERSONENNUMMER           PIC S9(4) COMP.



      ***************************************************************
      *                 PARAMETER-OUTPUT                            *
      ***************************************************************
       01  PO-DRKI1505.
           10  PO-DRKI1505-RC                  PIC  X(03).
               88  PO-DRKI1505-RC-OK           VALUE 'OK '.
               88  PO-DRKI1505-RC-NFD          VALUE 'NFD'.
           10 PO-DRKI1505-KRTVERSTARLFDNR      PIC S9(4) COMP.

      *
      ******** ENDE COPY-MEMBER (DRKI1502) *******************

