      *****************************************************************
      *    COPY-MEMBER: DRKI2482
      *
      *    G21/VIRIDIUM ÄNDERUNG VERTRAG/GENVERTRAGDETAIL
      *
      *    ÄNDERUNGSBESTAND FÜR AUFBEREITUNG VERTRAG/GENVERTRAGDETAIL
      *    ZUM PG G21/PROXALTO ÜBER DIE LIEFERUNG DER VIRIDIUM.
      *
      *    SATZLÄNGE VARIABEL
      *
      *****************************************************************
      *****************************************************************
      * LOGBUCH:
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME
      * --------------------------------------------------------------
      * DBO-10293  !22.08.22! NEU                          ! T13AC20
      * -----------!--------!------------------------------!----------
      *            !        !                              !
      *            !        !                              !
      *
      * ENDE-LOGBUCH
      *****************************************************************
          05 VERARB-KZN                        PIC  X(001).
          05 GES                               PIC  X(002).
          05 VNR                               PIC  X(015).
          05 MANDANT                           PIC  9(007).
          05 DATVERTRAEND                      PIC  X(010).
          05 VBNR                              PIC  9(007).
          05 VBNR-KZN                          PIC  X(001).
          05 SPARTE                            PIC  X(003).
          05 SPARTE-KZN                        PIC  X(001).
          05 VERTRZUSTAND                      PIC  9(002).
          05 VERTRZUSTAND-KZN                  PIC  X(001).
          05 VERTRBEGINN                       PIC  X(010).
          05 VERTRBEGINN-KZN                   PIC  X(001).
          05 VERTRABLAUF                       PIC  X(010).
          05 VERTRABLAUF-KZN                   PIC  X(001).
          05 ZAHLBEITRAG                       PIC  9(008)V99.
          05 ZAHLBEITRAG-KZN                   PIC  X(001).
          05 NJBEITRAG                         PIC  9(008)V99.
          05 NJBEITRAG-KZN                     PIC  X(001).
          05 ZAHLWEISE                         PIC S9(002).
          05 ZAHLWEISE-KZN                     PIC  X(001).
          05 PRODUKT                           PIC  X(050).
          05 PRODUKT-KZN                       PIC  X(001).
          05 TARIF                             PIC  X(050).
          05 TARIF-KZN                         PIC  X(001).
          05 RENTENBEZUG                       PIC  X(001).
          05 RENTENBEZUG-KZN                   PIC  X(001).
          05 RENTEVORAUS                       PIC  9(006).
          05 RENTEVORAUS-KZN                   PIC  X(001).
          05 RENTEGARANT                       PIC  9(006).
          05 RENTEGARANT-KZN                   PIC  X(001).
          05 RNTZAHLW                          PIC S9(002).
          05 RNTZAHLW-KZN                      PIC  X(001).
          05 LEISTUNG-KZN                      PIC  X(001).
          05 LEISTUNG-KZN-KZN                  PIC  X(001).
          05 BERECH-DAT                        PIC  X(010).
          05 BERECH-DAT-KZN                    PIC  X(001).
          05 ERLFALL-SUM                       PIC  9(008)V99.
          05 ERLFALL-SUM-KZN                   PIC  X(001).
          05 TODFALL-SUM                       PIC  9(008)V99.
          05 TODFALL-SUM-KZN                   PIC  X(001).
          05 RNTFAKTOR                         PIC  9(005)V99.
          05 RNTFAKTOR-KZN                     PIC  X(001).
          05 KAPABFIND                         PIC  9(008)V99.
          05 KAPABFIND-KZN                     PIC  X(001).
          05 FONDSGUTH                         PIC  9(008)V99.
          05 FONDSGUTH-KZN                     PIC  X(001).
      *****************************************************************
      *---------------------- ENDE DRKI2482 --------------------------*
      *****************************************************************