      *****************************************************************
      *    COPY-MEMBER: DRKI2484
      *
      *    G21/VIRIDIUM ÄNDERUNG KUNDE
      *
      *    ÄNDERUNGSBESTAND FÜR AUFBEREITUNG KUNDE
      *    ZUM PG G21/PROXALTO ÜBER DIE LIEFERUNG DER VIRIDIUM.
      *
      *    SATZLÄNGE VARIABEL
      *
      *****************************************************************
      *****************************************************************
      * LOGBUCH:
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME
      * --------------------------------------------------------------
      * DBO-10293  !05.09.22! NEU                          ! T13AC20
      * -----------!--------!------------------------------!----------
      *            !        !                              !
      *            !        !                              !
      *
      * ENDE-LOGBUCH
      *****************************************************************
          05 VERARB-KZN                        PIC  X(001).
          05 GES                               PIC  X(002).
          05 VNR                               PIC  X(015).
      *
          05 NACHNAME-ALT                      PIC  X(080).
          05 VORNAME-ALT                       PIC  X(030).
          05 GEBDAT-ALT                        PIC  X(010).
      *
          05 NACHNAME                          PIC  X(080).
          05 NACHNAME-KZN                      PIC  X(001).
          05 VORNAME                           PIC  X(030).
          05 VORNAME-KZN                       PIC  X(001).
          05 GEBDAT                            PIC  X(010).
          05 GEBDAT-KZN                        PIC  X(001).
          05 ANREDE                            PIC S9(002).
          05 ANREDE-KZN                        PIC  X(001).
          05 GESCHLECHT                        PIC  X(001).
          05 GESCHLECHT-KZN                    PIC  X(001).
          05 STR                               PIC  X(045).
          05 STR-KZN                           PIC  X(001).
          05 PLZ                               PIC  X(015).
          05 PLZ-KZN                           PIC  X(001).
          05 ORT                               PIC  X(030).
          05 ORT-KZN                           PIC  X(001).
          05 LKZN                              PIC  X(003).
          05 LKZN-KZN                          PIC  X(001).
      *****************************************************************
      *---------------------- ENDE DRKI2484 --------------------------*
      *****************************************************************