      * P13SP99   Stand: 06/12/98    18:03:12
      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0640.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/DRKI0640.CPv  $
      *
      *   Rev 2.2   Mar 27 2017 09:01:22   t13ae31
      *FKI01544: III alten Code entfernen
      *
      *   Rev 2.1   Apr 22 1999 17:02:48   T13EX48
      *AKI00028
      *RDTA
      *
      *   Rev 2.0   Apr 22 1999 16:49:30   T13EX48
      *
      *
      *   Rev 1.0   25 Aug 1998 09:26:02   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ****************************************************************
      *    COPY-MEMBER: DRKI0640  DATEIAUFBAU RUECKDTA               *
      *    -------------------------------------------------------   *
      *    ERSTELLT: BRENNECKE                                       *
      *    DATUM:    18.08.1998                                      *
      ****************************************************************
      *    VERSION   01                                              *
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00001!13.08.98! 01 ! NEUERSTELLUNG             !BRENNECKE *
      * -------------------------------------------------------------*
      * FKI01544!22.03.17! 02 ! Beschreibung zeile 28     !HHU       *
      *         !        !    ! aktualisiert              !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *                                                              *
      *                                                              *
      ****************************************************************
      *
       01  DRKI0640-SATZ.
           10 DRKI0640-aenderungskz           pic 9(002).
           10 DRKI0640-vertragsnr             pic 9(015).
           10 DRKI0640-direktionsnr           pic 9(003).
           10 DRKI0640-kundenbetreuernr       pic 9(007).

