      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  24.03.2014
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2014 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI2853.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI2853.CPv  $
      *
      *   Rev 2.1   Mar 24 2014 14:04:44   t13ex73
      *AKI01273: Abgleich von Kundenunterschieden zwischen OKI und 
      *HOST
      *
      *   Rev 2.0   Mar 24 2014 13:22:10   t13ex73
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    COPY-MEMBER: DRKI2853                                      *
      *    --------------------------------------------------------   *
      *    SCHNITTSTELLE FÜR DAS UPRO UPKI0246                        *
      *    MIT DEN DATEN, DIE EINMAL PRO UPRO ÜBERGEBEN WERDEN        *
      *    --------------------------------------------------------   *
      *    ERSTELLT: ZGUR-VUJIC                                       *
      *    DATUM:    24.03.2014                                       *
      *****************************************************************
      *    VERSION  1
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI01273!24.03.14! 01 ! NEUERSTELLUNG             ! DDY      *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      ****************************************************************
      *    DIESES COPY ENTHÄLT DIE EIN- UND AUSGABEPARAMETER         *
      *    FÜR DIE FUNKTION DRKI2853                                 *
      *                                                              *
      ****************************************************************
      *
       01  UPKI0246-AREA.
          05 PI-UPKI0246-NAME-INPUT         PIC  X(030).
          05 PO-UPKI0246-NAME-OUTPUT        PIC  X(030).
      *
      ***** Ende-Copy-Member *****************************************
