      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0333.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\DRKI0333.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 12:57:24   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   18 Aug 1998 10:46:56   T13EX39
      *ki000001 - Neuerstellung
      *
      *   Rev 1.0   14 Jul 1998 17:00:10   P13SP13
      *Initial revision.
      *
      *---------------------------------------------------------------*
       01  PI-DRKI0333.
           05 PI-DRKI0333-BINARY                PIC X(13).

       01  PO-DRKI0333.
           05 PO-DRKI0333-STRING                PIC X(26).
