      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  14.11.2017
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2017 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI3192.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRKI3192.CPv  $
      *
      *   Rev 2.1   Feb 19 2018 09:21:44   t13ac17
      *AKI01534: G20 - Projekt LENA: Vertragsteil
      *
      *   Rev 2.0   Nov 14 2017 08:41:18   t13ac17
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *
      *    ÄNDERUNGSDATEN AUS ERMITTLUNG VERTRAGSTEIL FÜR VERTRAG
      *    AMLEBEN - G20 (PSLIFE)
      *
      *
      *---------------------------------------------------------------*
      *    LOGBUCH
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AKI01534!14.11.17!2.1 ! Neuerstellung             ! Walbert
      *         !        !    !                           !
      *         !        !    !                           !
      *****************************************************************
      *
           05 VERARB-KZN                         PIC  X(001).
           05 GES                                PIC  X(002).
           05 VNR                                PIC  X(015).
           05 BEGINN                             PIC  X(010).
           05 BEGINN-KZN                         PIC  X(001).
           05 ABLAUF                             PIC  X(010).
           05 ABLAUF-KZN                         PIC  X(001).

