      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI0238.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:\MF\CPY\DRKI0238.CPv  $
      *
      *   Rev 2.1   Aug 12 1999 23:40:46   T13EX12
      *AKI00042 Restart für PMKI0322
      *
      *   Rev 2.0   Feb 27 1999 12:54:00   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.0   15 Jun 1998 08:51:26   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      ****************************************************************
      *    VERSION   01
      *    Copy Strecke für Restart des PMKI0322 Programmes
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AKI00001!10.08.99! 01 ! NEUERSTELLUNG             !v.d.Goltz *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
       01  DRKI0238-RESTART.
           05 DRKI0238-COPY-NAME         PIC X(008)   VALUE 'DRKI0238'.
           05 DRKI0238-RESTART-KUNDEN-ID PIC X(013).


