      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  08.10.2013
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2013 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRKI2788.CPY  $
      *    $Revision:   2.34  $
      *
      *    $Log:   L:/mf/CPY/DRKI2788.CPv  $
      *
      *   Rev 2.34   Nov 24 2020 09:17:46   u130685
      *AKI01805: Aufnahme Flag 'eSafe' Tabelle Struktur
      *
      *   Rev 2.33   Apr 17 2020 13:42:32   t13ex39
      *AKI01767: Deutsche Bank - PK Smart - Erweiterung der Datenli
      *eferung um Laufzeit und Restkreditversicherungen
      *
      *   Rev 2.32   Jan 28 2020 15:14:44   t13ex39
      *AKI01754: Investment D: Neues Datenfeld und Fixselektion - U
      *ltimosparen
      *
      *   Rev 2.31   Jun 19 2019 14:00:38   t13ex39
      *AKI01687: Deutsche Bank: Anzeige gebührenbefreites Konto im
      *Bestandsvertrag inkl. Erweiterung der Selektionen
      *
      *   Rev 2.30   Jun 07 2019 08:42:24   t13ex78
      *AKI01669: MDTA, Ermittlung und Aufbereitung
      *
      *   Rev 2.29   Jun 05 2019 12:07:44   t13ex78
      *AKI01669: MDTA, Ermittlung und Aufbereitung
      *
      *   Rev 2.28   Jun 05 2019 10:44:10   t13ex78
      *AKI01669: MDTA, Ermittlung und Aufbereitung
      *
      *   Rev 2.27   Mar 18 2019 17:38:48   t13ae52
      *AKI01658: G48 - Kontokorrent Sourcen/COPYs
      *
      *   Rev 2.26   Nov 29 2018 09:42:18   t13ae52
      *AKI01645: G48  -  Sourcen/COPYs
      *
      *   Rev 2.25   Jan 25 2018 07:22:00   t13ex39
      *AKI01556: DeuBa zusätzliche  PINs BANKPRODUKT
      *
      *   Rev 2.24   Aug 22 2017 09:20:28   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.23   Aug 18 2017 12:00:30   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.22   Aug 18 2017 11:41:42   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.21   Aug 18 2017 11:20:22   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.20   Aug 18 2017 10:53:26   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.19   Aug 17 2017 09:53:44   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.18   Aug 17 2017 07:43:08   t13ex78
      *AKI01506: Fehlerkorrekturen an PMKI0618 und PMKI1197
      *
      *   Rev 2.17   Jun 26 2017 10:34:32   t13ex39
      *AKI01506: Deuba KK aus GHP und DBP nach BANKPRODUKT überführ
      *en
      *
      *   Rev 2.16   Jul 20 2016 11:35:08   t13ex15
      *AKI01449: Deutsche Bank Konto: Datum des Saldos BKP OZP und
      *PMKI1197
      *
      *   Rev 2.15   Nov 16 2015 10:30:30   t13ex39
      *AKI01385: Korrektur der Darstellung des Eigenvermitteltkennz
      *eichens    WHO
      *
      *   Rev 2.14   Oct 22 2015 14:33:26   t13ex39
      *AKI01361: Moritz Programme
      *
      *   Rev 2.13   Sep 01 2015 10:57:54   t13ex29
      *AKI01361: DeuBa Sparverträge von DBP in BKP-Programme
      *
      *   Rev 2.12   Jul 01 2015 12:36:18   t13ex73
      *AKI01375: Neues Fehlerverfahren in Deuba - PMKI1197
      *
      *   Rev 2.11   Mar 17 2015 14:37:06   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank - Co
      *pies
      *
      *   Rev 2.10   Mar 11 2015 12:26:38   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.9   Mar 09 2015 11:15:32   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.8   Mar 02 2015 10:51:28   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.7   Feb 25 2015 11:41:52   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.6   Jan 13 2015 13:05:30   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.5   Jul 24 2014 15:16:30   t13ex77
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.4   Nov 27 2013 11:53:12   T13Ex77
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.3   Nov 27 2013 10:04:16   T13Ex77
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.2   Nov 26 2013 08:13:58   T13Ex77
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.1   Nov 12 2013 08:21:36   t13ex77
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.0   Oct 08 2013 10:41:42   T13Ex77
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *                                                               *
      *    COPY-MEMBER FUER DAS AUFBEREITUNGSPROGRAMM BAUFI-DATEN     *
      *                                                               *
      *    SATZLAENGE   600                                           *
      *---------------------------------------------------------------*
      *****************************************************************
      *    VERSION
      *****************************************************************
      *  AENDERUNGEN:                                                 *
      *  AUFTRAG !  DATUM   ! VER ! AENDERUNG              ! NAME     *
      * ------------------------------------------------------------- *
      * AKI01251 ! 11.10.13 !  01 ! Neuerstellung          ! Borgmann *
      * ------------------------------------------------------------- *
300615* AKI01375 ! 30.06.15 !  02 ! KTO-DATAIL X50 -> S915 ! DDY      *
      *          !          !     ! FILLER ANPASSEN 83->125!          *
      * ------------------------------------------------------------- *
210415* AKI01361 !30.08.15  !     ! Entfernen Änderungs-   ! MTE      *
      *          !          !     ! Kennzeichen für EV-KZ +!          *
      *          !          !     ! Abschlussvermittler    !          *
      * ------------------------------------------------------------- *
      * AKI01385 !24.09.15  !     ! Neues Attribut Prov-   ! WHO      *
      *          !          !     ! relevant               !          *
      * ------------------------------------------------------------- *
190716* AKI01449 !19.07.2016!     ! 3 neue Attribute       ! SWZ      *
      *          !          !     ! DATUMSALDO             !          *
      *          !          !     ! ABRECHKONTO            !          *
      *          !          !     ! ANTEILRATE             !          *
      * ------------------------------------------------------------- *
010417* AKI01506 !01.04.17! Deuba KK aus GHP und DBP nach  ! WHO      *
      *          !        ! BANKPRODUKT                    !          *
      *          !        ! AEND-PROV-REL-KZ  aufgenomemn  !          *
      *----------------------------------------------------------------*
101217*AKI01556  !10.12.17! PIN verarbeiten                ! WHO       *
      *          !        !                                 !          *
      *----------!--------!-------------------------------- !----------*
      * AKI01645 !14.11.18! VERARBEITUNG NEUES DATUMSFELD   !SCHUMACHER*
      *          !        ! DATUM-VOLLAUSZ                  !          *
      *          !        ! ANPASSUNG FILLER                !          *
      *----------!--------!---------------------------------!----------*
      * AKI01658 !24.01.19!*AUFNAHME ZUSÄTZLICHE FELDER     !SCHUMACHER*
      *          !        !  - KFW DARLEHEN ERSTRATE        !          *
      *          !        !  - KFW DARLEHEN FOLGERATE       !          *
      *          !        !  - KFW DARLEHEN KREDITBETRAG    !          *
      *          !        !  - KFW DARLEHEN SOLLZINSSATZ    !          *
      *          !        !  - KFW DARLEHEN ENDE            !          *
      *          !        !    ZINSFESTSCHREIBUNG           !          *
      *----------!--------!---------------------------------!----------*
      * AKI01669 !14.05.19! Aufnahme Sicherheitspaket und   ! tfl
      *          !        ! Restlaufzeit                    !          *
      *          !        !                                 !          *
      *          !        !*ERWEITERUNG SATZLÄNGE AUF 600   !          *
      * --------------------------------------------------------------
      * AKI01687!16.06.19!    ! NEUES ATTRIBUT            ! T13EX39
      *         !        !    ! "KOSTENSCHLÜSSE ZKP"      !
      *---------!--------!--------------------------------!----------*
      * AKI01754!04.01.20! NEUES ATTRIBUT "ULTIMOSPAREN"  ! T13EX39
      *---------!--------!--------------------------------!----------*
      * AKI01767!04.03.20! NEUE  ATTRIBUTE                ! T13EX39
      *         !        ! GESAMTLAUFZEIT                 !
      *         !        ! VERSICHERUNGSUMFANG1           !
      *         !        ! VERSICHERUNGSUMFANG2           !
      *---------!--------!--------------------------------!----------*
      *AKI01805 !14.10.20! NEUES ATTRIBUT ESAFE           ! ATAR     *
      *         !        !                                !          *
      *         !        !                                !
      *         !        !                                !
      *  ENDE-LOGBUCH                                                  *
      ******************************************************************
 
           05  'XX'-GES                        PIC  9(02) VALUE ZERO.
           05  'XX'-VNR                        PIC  9(15) VALUE ZERO.
      *     Produkt-ID
           05  'XX'-PRODUKT-ID                 PIC S9(04) VALUE ZERO.
      *     lfd. Nr. BANKPRODUKT
           05  'XX'-LFDNR                      PIC S9(04) VALUE ZERO.
 
      * Allgemeine Felder
 
      *        Kontoart
           05  'XX'-KONTO-ART                  PIC  X(03) VALUE SPACE.
      *        J WENN WKZ GEAENDERT
           05  'XX'-AEND-KONTO-ART-KZ          PIC  X(01) VALUE SPACE.
 
      *        Kennzeichen Telefonbanking
           05  'XX'-TELEFONBANKING             PIC  X(01) VALUE SPACE.
      *        J wenn sich Telefonbanking geaendert hat
           05  'XX'-AEND-TELEFONBANK-KZ        PIC  X(01) VALUE SPACE.
 
      *        Kennzeichen Onlinebanking
           05  'XX'-ONLINEBANKING              PIC  X(01) VALUE SPACE.
      *        J wenn sich Onlinebanking geaendert hat
           05  'XX'-AEND-ONLINEBANK-KZ         PIC  X(01) VALUE SPACE.
 
      *        Kreditart
           05  'XX'-KREDITART                  PIC  X(06) VALUE SPACE.
      *        J wenn sich Kreditart geaendert hat
           05  'XX'-AEND-KREDITART-KZ          PIC  X(01) VALUE SPACE.
 
      *        Darlehensart
           05  'XX'-DARLEHENSART               PIC  X(01) VALUE SPACE.
      *        J wenn sich Darlehensart geaendert hat
           05  'XX'-AEND-DARLEHENSART-KZ       PIC  X(01) VALUE SPACE.
 
      *        Bilanzschlüssel
           05  'XX'-BILANZ-SCHL                PIC S9(04) VALUE ZERO.
      *        J wenn sich Bilanzschlüssel geaendert hat
           05  'XX'-AEND-BILANZ-SCHL-KZ        PIC  X(01) VALUE SPACE.
 
      *        Konditionsschluessel
           05  'XX'-KOND-SCHL                  PIC  X(02) VALUE SPACE.
      *        J wenn sich der Konditionsschluessel geaendert hat
           05  'XX'-AEND-KOND-SCHL-KZ          PIC  X(01) VALUE SPACE.
 
      *        Zahlungsweise
           05  'XX'-ZAHLUNGSWEISE              PIC S9(02) VALUE ZERO.
      *        J wenn sich Zahlungsweise geaendert hat
           05  'XX'-AEND-ZAHLUNGSWEISE-KZ      PIC  X(01) VALUE SPACE.
 
      *        Kontodetail
300615*    05  'XX'-KTO-DETAIL                 PIC  X(50) VALUE SPACE.
300615     05  'XX'-KTO-DETAIL               PIC S9(15)V COMP-3 VALUE 0.
      *        J wenn sich Kontodetail geaendert hat
           05  'XX'-AEND-KTO-DETAIL-KZ         PIC  X(01) VALUE SPACE.
 
      *        Bankleitzahl des Kundens
           05  'XX'-BLZ-KUNDE                  PIC  X(08) VALUE SPACE.
      *        J wenn sich die Bankleitzahl geaendert hat
           05  'XX'-AEND-BLZ-KUNDE-KZ          PIC  X(01) VALUE SPACE.
 
      *        BIC
           05  'XX'-BIC                        PIC  X(11) VALUE SPACE.
      *        J wenn sich die BIC geaendert hat
           05  'XX'-AEND-BIC-KZ                PIC  X(01) VALUE SPACE.
 
      *        IBAN
           05  'XX'-IBAN                       PIC  X(34) VALUE SPACE.
      *        J wenn sich die IBAN geaendert hat
           05  'XX'-AEND-IBAN-KZ               PIC  X(01) VALUE SPACE.
 
      *        Abschlussvermittler
           05  'XX'-ABSCHL-VBNR                PIC  9(07) VALUE ZERO.
      *        J wenn sich der Abschlussvermittler geaendert hat
210415     05  FILLER                          PIC  X(01) VALUE SPACE.
210415*    05  'XX'-AEND-ABSCHL-VBNR-KZ        PIC  X(01) VALUE SPACE.
 
      *        Kennzeichen eigenvermittelt
           05  'XX'-EIGENVERMITTELT            PIC  X(01) VALUE SPACE.
      *        J wenn sich Eigenvermittelt geaendert hat
210415     05  FILLER                          PIC  X(01) VALUE SPACE.
210415*    05  'XX'-AEND-EIGENVERM-KZ          PIC  X(01) VALUE SPACE.
 
      *        Währungsschlüssel
           05  'XX'-WAEHRUNGS-SCHL             PIC S9(04) VALUE ZERO.
      *        J wenn sich Währungsschlüssel geaendert hat
           05  'XX'-AEND-WAEHRUNGS-SCHL-KZ     PIC  X(01) VALUE SPACE.
 
      *        Datum Produkteroeffnung
           05  'XX'-DATUM-PRODBEGINN           PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Produkteroeffnung geaendert hat
           05  'XX'-AEND-DAT-PRODBEG-KZ        PIC  X(01) VALUE SPACE.
 
      *        Datum Produktschliessung
           05  'XX'-DATUM-PRODABLAUF           PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Produkteroeffnung geaendert hat
           05  'XX'-AEND-DAT-PRODABL-KZ        PIC  X(01) VALUE SPACE.
 
      *        Datum Kreditzusage
           05  'XX'-DATUM-KREDITZUSAGE         PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Kreditzusage geaendert hat
           05  'XX'-AEND-DAT-KREDZUS-KZ        PIC  X(01) VALUE SPACE.
 
      *        Datum Kreditauszahlung
           05  'XX'-DATUM-KREDITAUSZAHLUNG     PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Kreditauszahlung geaendert hat
           05  'XX'-AEND-DAT-KREDAUS-KZ        PIC  X(01) VALUE SPACE.
 
      *        Datum Ende Zinsfestschreibung
           05  'XX'-DATUM-ENDEZINSFS           PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Ende Zinsfestschreibung geaendert hat
           05  'XX'-AEND-DAT-ENDEZFS-KZ        PIC  X(01) VALUE SPACE.
 
      *        Vertragsende
           05  'XX'-VERTRAGS-ENDE              PIC  X(10) VALUE SPACE.
      *        J wenn sich Vertragsende geaendert hat
           05  'XX'-AEND-VERTRAGS-ENDE-KZ      PIC  X(01) VALUE SPACE.
 
      *        Datum der Faelligkeit
           05  'XX'-DATUM-FAELLIGKEIT          PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum der Faelligkeit geaendert hat
           05  'XX'-AEND-DAT-KREDFAEL-KZ       PIC  X(01) VALUE SPACE.
 
      *        Datum Ende der Freijahre
           05  'XX'-DATUM-ENDEZRFREI           PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Ende der Freijahre geaendert hat
           05  'XX'-AEND-DAT-ZRFREI-KZ         PIC  X(01) VALUE SPACE.
 
      *        Ende des Beguenstigungszeitraum
           05  'XX'-ENDE-BEGUENSTIGUNG         PIC  X(10) VALUE SPACE.
      *        J wenn sich Ende des Beguenstigungszeitraum geaendert hat
           05  'XX'-AEND-ENDE-BEGUENS-KZ       PIC  X(01) VALUE SPACE.
 
      *        Urspruenglicher Darlehensbetrag
           05  'XX'-DARL-BTRG-BEGINN           PIC  S9(12)V99 VALUE 0.
      *        J wenn sich Urspr. Darlehensbetrag geaendert hat
           05  'XX'-AEND-DARL-BTRG-BEG-KZ      PIC  X(01) VALUE SPACE.
 
      *        Aktueller Darlehensbetrag
           05  'XX'-DARL-BTRG-AKTUELL          PIC  S9(12)V99 VALUE 0.
      *        J wenn sich Urspr. Darlehensbetrag geaendert hat
           05  'XX'-AEND-DARL-BTRG-AKT-KZ      PIC  X(01) VALUE SPACE.
 
      *        Aktueller Saldo
           05  'XX'-SALDO                      PIC  S9(12)V99 VALUE 0.
      *        J wenn sich Aktueller Saldo geaendert hat
           05  'XX'-AEND-SALDO-KZ              PIC  X(01) VALUE SPACE.
 
      *        Externes Limit
           05  'XX'-LIMIT-EXTERN               PIC  S9(12)V99 VALUE 0.
      *        J wenn sich Externes Limit geaendert hat
           05  'XX'-AEND-LIMIT-EXTERN-KZ       PIC  X(01) VALUE SPACE.
 
      *        Zinssatz Soll
           05  'XX'-SOLLZINS                   PIC  S9(02)V9999 VALUE 0.
      *        J wenn sich Zinssatz Soll geaendert hat
           05  'XX'-AEND-SOLLZINS-KZ           PIC  X(01) VALUE SPACE.
 
      *        Zinssatz Haben
           05  'XX'-HABENZINS                  PIC  S9(02)V9999 VALUE 0.
      *        J wenn sich Zinssatz Haben geaendert hat
           05  'XX'-AEND-HABENZINS-KZ          PIC  X(01) VALUE SPACE.
 
      *        Zinssatz Ueberziehung
           05  'XX'-UEBERZZINS                 PIC  S9(02)V9999 VALUE 0.
      *        J wenn sich Zinssatz Ueberziehung geaendert hat
           05  'XX'-AEND-UEBERZZINS-KZ         PIC  X(01) VALUE SPACE.
 
      *        Hoehe der Rate
           05  'XX'-RATENHOEHE                 PIC S9(012)V99 VALUE 0.
      *        J wenn sich Hoehe der Rate geaendert hat
           05  'XX'-AEND-RATENHOEHE-KZ         PIC  X(01) VALUE SPACE.
 
      *        Rate (Annuitaet) in EUR
           05  'XX'-ANNUITAET                  PIC S9(012)V99 VALUE 0.
      *        J wenn sich Rate (Annuitaet) in EUR geaendert hat
           05  'XX'-AEND-ANNUITAET-KZ          PIC  X(01) VALUE SPACE.
 
      *        Tilgungsart
           05  'XX'-TILGUNGSART                PIC  X(01) VALUE SPACE.
      *        J wenn sich Tilgungsart geaendert hat
           05  'XX'-AEND-TILGUNGSART-KZ        PIC  X(01) VALUE SPACE.
 
      *        Tilgung in Prozent
           05  'XX'-TILGUNGSPROZENT            PIC  S9(02)V9999 VALUE 0.
      *        J wenn sich Tilgung in Prozent geaendert hat
           05  'XX'-AEND-TILG-PROZ-KZ          PIC  X(01) VALUE SPACE.
 
      *        Zinsanteil pro Rate
           05  'XX'-ANTEIL-ZINS                PIC S9(012)V99 VALUE 0.
      *        J wenn sich Zinsanteil pro Rate geaendert hat
           05  'XX'-AEND-ANT-ZINS-KZ           PIC  X(01) VALUE SPACE.
 
      *        Anfaengliche Tilgung in Prozent
           05  'XX'-TILG-ANF-PROZENT           PIC S9(02)V9999 VALUE 0.
      *        J wenn sich Anf. Tilgung in Prozent geaendert hat
           05  'XX'-AEND-TILG-ANF-PROZ-KZ      PIC  X(01) VALUE SPACE.
 
      *        Aktualisierungskennzeichen
           05  'XX'-AKTUAL-KZ                  PIC  X(01) VALUE SPACE.
      *        I = INSERT
      *        U = UPDATE
      *        D = DELETE
240915     05  'XX'-PROV-REL                   PIC  X(01).
 
      *        Datum Saldo (DeuBa)
190716     05  'XX'-DATUM-SALDO                PIC  X(10) VALUE SPACE.
      *        J wenn sich Datum Saldo geändert hat
190716     05  'XX'-AEND-DATUM-SALDO-KZ        PIC  X(01) VALUE SPACE.
 
      *        Abrechnungskonto (Santander Info zu Vertragsnummer)
190716     05  'XX'-ABR-KONTO                  PIC  X(10) VALUE SPACE.
      *        J wenn sich Abrechnungskonto geaendert hat
190716     05  'XX'-AEND-ABR-KONTO-KZ          PIC  X(01) VALUE SPACE.
 
      *        Anteil Rate (Baufi)
190716     05  'XX'-ANTEIL-RATE                PIC S9(12)V99 VALUE 0.
      *        J wenn sich Anteil Rate geaendert hat
190716     05  'XX'-AEND-ANTEIL-RATE-KZ        PIC  X(01) VALUE SPACE.
 
010417     05  'XX'-AEND-PROV-REL-KZ           PIC  X(01).
 
101217     05  'XX'-PIN                        PIC  9(09).
101217     05  'XX'-AEND-PIN-KZ                PIC  X(01).

      *        DATUM DER VOLLAUSZAHLUNG
           05  'XX'-DATUM-VOLLAUSZ             PIC  X(010) VALUE SPACE.
      *        J WENN SICH DATUM VOLLAUSZAHLUNG GEÄNDERT HAT
           05  'XX'-AEND-DATUM-VOLLAUSZ-KZ     PIC  X(001) VALUE SPACE.
 
 
           05  'XX'-KFW-DARL-ERSTRATE          PIC S9(012)V99
                                                   VALUE 0.
      *        KFW DARLEHEN ERSTRATE
           05  'XX'-AEND-KFW-ERSTRATE-KZ       PIC X(001)
                                                   VALUE SPACE.
      *        J = ÄNDERUNG KFW-DARL-ERSTRATE
 
           05  'XX'-KFW-DARL-FOLGERATE         PIC S9(012)V99
                                                   VALUE 0.
      *        KFW DARLEHEN FOLGERATE
           05  'XX'-AEND-KFW-FOLGERATE-KZ      PIC X(001)
                                                   VALUE SPACE.
      *        J = ÄNDERUNG KFW-DARL-FOLGERATE
 
           05  'XX'-KFW-DARL-KREDITBETRAG      PIC S9(012)V99
                                                   VALUE 0.
      *        KFW DARLEHEN KREDITBETRAG
           05  'XX'-AEND-KFW-KREDITBTRG-KZ
                                               PIC X(001)
                                                   VALUE SPACE.
      *        J = ÄNDERUNG KFW-DARL-KREDITBETRAG
 
           05  'XX'-KFW-DARL-SOLLZINS          PIC S9(002)V9999
                                                   VALUE ZERO.
      *        KFW DARLEHEN SOLLZINSSATZ
           05  'XX'-AEND-KFW-SOLLZINS-KZ       PIC X(001)
                                                   VALUE SPACE.
      *        J = ÄNDERUNG KFW-DARL-SOLLZINS
 
           05  'XX'-KFW-DARL-ENDE-ZFST         PIC X(010)
                                                   VALUE SPACE.
      *        KFW DARLEHEN DATUM ENDE ZINSFESTSCHREIBUNG JJJJMMTT
           05  'XX'-AEND-KFW-ENDE-ZFST-KZ      PIC X(001)
                                                   VALUE SPACE.
      *        J = ÄNDERUNG KFW-DARL-ENDE-ZFST
 
           05  'XX'-KFW-DARL-TILGUNG           PIC S9(002)V9999
                                                   VALUE 0.
      *        KFW DARLEHEN TILGUNG IN PROZENT
           05  'XX'-AEND-KFW-TILGUNG-KZ        PIC X(001)
                                                   VALUE SPACE.
      *        J = ÄNDERUNG KFW-DARL-TILGUNG
 
           05  'XX'-SICHERHEITSPAKET           PIC X(001) VALUE SPACE.
           05  'XX'-AEND-SICHERHEIT-KZ         PIC X(001) VALUE SPACE.
 
           05  'XX'-RESTLAUFZEIT               PIC 9(003) VALUE 0.
           05  'XX'-AEND-REST-KZ               PIC X(001) VALUE SPACE.
 
           05  'XX'-KOSTEN-SCHL                PIC  X(001).
      *        KOSTENSCHLÜSSEL ZINSKONTO PLUS
           05  'XX'-AEND-KOSTEN-SCHL           PIC  X(001).
      *        J = ÄNDERUNG BNK-KOSTEN-SCHL
 
           05  'XX'-ULTIMOSTAR-KZ              PIC  X(001).
      *       UILTIMOSPAREN J/' '
           05  'XX'-AEND-ULTIMOSTAR-KZ         PIC  X(001).
      *        J = ÄNDERUNG UILTIMOSPAREN J/' '
 
           05  'XX'-GES-LAUFZEIT              PIC 9(003).
      *        GESAMTLAUFZEIT IN MONATEN (AKTUELL)

           05  'XX'-AEND-GES-LAUFZEIT-KZ      PIC X(001).
 
      *        VERSICHERUNGSUMFANG 1. KREDITNEHMER
           05  'XX'-VERSUMFANG1               PIC 9(001).

           05  'XX'-AEND-VERSUMFANG1-KZ       PIC X(001).

      *        VERSICHERUNGSUMFANG 2. KREDITNEHMER
           05  'XX'-VERSUMFANG2               PIC 9(001).

           05  'XX'-AEND-VERSUMFANG2-KZ       PIC X(001).

      *         KENNZEICHEN ESAFE
           05  'XX'-ESAFE                     PIC  X(01) VALUE SPACE.
      *        J WENN SICH ESAFE GEAENDERT HAT
           05  'XX'-AEND-ESAFE-KZ             PIC  X(01) VALUE SPACE.

           05  FILLER                         PIC  X(075) VALUE SPACE.

 
 
 
 
 
 
 
 











