      *---------------------------------------------------------------*
      *
      *    ÄNDERUNGSDATEN AUS ERMITTLUNG VERTRAG FÜR LBNPSVERTRAG
      *    GEDLEBEN - G20 (PSLIFE)
      *
      *---------------------------------------------------------------*
      *    LOGBUCH
      *****************************************************************
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AKI01534!20.10.17!2.1 ! NEUERSTELLUNG             ! SWO
      * AKI01627!05.09.18!2.2 ! ERWEITERUNG UM TIMESTAMP  ! DETMAR
      *         !        !2.4 !                           !
      * AKI01742!16.01.20!2.5 ! NEUE FELDER FÜR BU/RFN    ! LORSON
      ***************************************************************** 
      * AENDERUNGEN:                                                    
      * AUFTRAG ! DATUM  ! AENDERUNG                       ! NAME       
      * --------------------------------------------------------------- 
      * AKI01819!08.12.20! MIA: FELDER ENTFALLEN,          ! T13AC20
      *         !        !      NEUE FELDER HINZU          !
      *         !        ! [PVCS 2.6]                      !
      * DBO8172 !16.03.21! MIA: FELDER ENTFALLEN           ! T13AC20    
      ***************************************************************** 
      * AENDERUNGEN:                                                    
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME      
      * ---------------------------------------------------------------
      * DBO-10280  !08.08.22! FELD STANDVERTR GELÖSCHT     ! T13AC20   
      * -----------!--------!------------------------------!----------- 
      *            !        !                              !          
      *            !        !                              !          
      * ENDE-LOGBUCH
      *****************************************************************
      *
           05 VERARB-KZN                         PIC  X(001).
           05 GES                                PIC  X(002).
           05 VNR                                PIC  X(015).
           05 DATVERTRAEND                       PIC  X(010).
           05 VZUST-D                            PIC S9(003).
           05 VZUST-D-KZN                        PIC  X(001).
           05 RNTBEZUG-KZN                       PIC  X(001).
           05 RNTBEZUG-KZN-KZN                   PIC  X(001).
           05 BAV-KZN                            PIC  X(001).
           05 BAV-KZN-KZN                        PIC  X(001).
           05 PRODKLASSE                         PIC  9(005).
           05 PRODKLASSE-KZN                     PIC  X(001).
           05 WERBEBEZEICH                       PIC S9(005).
           05 WERBEBEZEICH-KZN                   PIC  X(001).
           05 GSMTTAR-BEZ                        PIC  X(025).
           05 GSMTTAR-BEZ-KZN                    PIC  X(001).