      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA2517.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA2517.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 11:33:08   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Datensatz: Infosatz zu Filetransfer
      *
      *     SOURCE-NAME      :  DRMA2517
      *     DMR-NAME         :  DR-OV2517
      *
      *     AUTOR            :  WOLFF, STEFAN
      *     GENERIERUNG      :  26.02.09/10:25
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA2517.
              07 SST-NAME               PIC X(8).
              07 TIMESTAMP-BEGINN       PIC X(26).
              07 TIMESTAMP-ENDE         PIC X(26).
              07 ANZAHL                 PIC X(9).
              07 JOBNAME                PIC X(8).
      *
      **************************************************************
