      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1695.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1695.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 10:22:44   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     DRUCKAUSGABESATZ
      *
      *     SOURCE-NAME      :  DRMA1695
      *     DMR-NAME         :  DR-OV1695
      *
      *     AUTOR            :  NIEßEN, SVEN
      *     GENERIERUNG      :  29.08.00/10:09
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
000010     05 DRUCKAUSGABE.
000020        07 DRUCKAUSGABE.
000030           09 DRUCK-DATEIKZN      PICTURE X.
000040           09 DRUCK-STEUERKZN     PICTURE X.
000050           09 DRUCKAUSGABEDATEN   PICTURE X(132).
      *
      **************************************************************
