      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA4536.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA4536.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 17:31:14   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA4524
      *     RDz
      *     SOURCE-NAME      :  DRMA4536
      *     DMR-NAME         :  DG-OV4536
      *
      *     AUTOR            :  CONSOIR,ANNA E.
      *     GENERIERUNG      :  29.06.2012/11:42:19
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DG-OV4536.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 VBNR                   PIC S9(9)      BINARY.
              07 STICHTAG               PIC X(10).
      *
      **************************************************************
