      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  31.03.2015
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2015 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5086.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/DRMA5086.CPv  $
      *
      *   Rev 2.2   Jun 23 2015 10:54:16   t13ac20
      *AMA00148: USt: KOMA0505-VB-Abrechnung Druck - Programme/Copies
      *
      *   Rev 2.1   Mar 31 2015 16:20:06   t13ac20
      *AMA00148: USt: KOMA0505-VB-Abrechnung Druck - Programme
      *
      *   Rev 2.0   Mar 31 2015 10:11:44   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     EINGABE: UPMA5030   FUNKTION V1
      *
      *     SOURCE-NAME      :  DRMA5086
      *
      *     GENERIERUNG      :  23.06.2015/09:47:00
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00148!31.03.15!2.1  ! NEUERSTELLUNG             ! WOLFF
      * AMA00148!23.06.15!2.2  ! VERSION, VG EINGEFÜGT     ! WOLFF
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5086.
              07 DGAT0100.
                 09 FUNKTION            pic X(8).
              07 VERSION                pic X.
              07 VG                     pic 9(4).
              07 PG                     pic 99.
              07 PRODSCHL               pic 999.
      *
      **************************************************************

