      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  02.07.2013
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2013 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5016.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/DRMA5016.CPv  $
      *
      *   Rev 2.2   Oct 17 2013 11:27:32   t13ex75
      *AMA00019: Anpassung Daisy - Auswertungen / Listen
      *
      *   Rev 2.1   Oct 14 2013 07:22:40   t13ex75
      *AMA00019: Anpassung Daisy - Auswertungen / Listen
      *
      *   Rev 2.0   Jul 02 2013 13:42:54   t13ex75
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *
      * Kurzbeschreibung:
      * ================
      *     DATENSATZ: REFERENZBESTAND VERTRÄGE ( SPNP )
      *
      *     SOURCE-NAME      :  DRMA5016
      *
      *     GENERIERUNG      :  22.07.2013/11:57:09
      *     DURCH            :  PMMA5004/01.00.00
      *
      *
      *****************************************************************
      *   INTERNES LOGBUCH                                            *
      *****************************************************************
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME     *
      * --------------------------------------------------------------*
      * AMA00019!22.07.13! 2.1 ! Neuerstellung             !J. Niehus *
      * --------------------------------------------------------------*
      *                                                               *
      * ENDE-LOGBUCH
      *****************************************************************
      *
      *
           05 DRMA5016.
              07 DGMA0110.
                 09 PG                  pic 99.
                 09 VERTRAGS-ID         pic X(15).
      *
      **************************************************************

