      **************************************************************  
      *                                                               
      *     normierter Arbeitssatz Stornoauswertung                   
      *                                                               
      *     SOURCE-NAME      :  DRMA0003                              
      *                                                               
      *     GENERIERUNG      :  18.10.2021/11:29:55                   
      *     DURCH            :  PMMA5004/01.00.01                     
      *                                                               
      * LOGBUCH                                                       
      * AENDERUNGEN:                                                  
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME     
      * --------------------------------------------------------------
      * MA-908  !07.04.21!1    ! NEUERSTELLUNG             ! D.WILHELM
      *         !        !     !                           !          
      *                                                               
      * ENDELOGBUCH                                                   
      **************************************************************  
      *                                                               
      *                                                               
           05 DRMA0003.                                               
              07 VERTRAGSNR-EXTERN      pic X(15).                    
              07 GESKZ                  pic 99.                       
              07 PRODSCHL               pic 999.                      
              07 PRODART-VG             pic 99.                       
              07 HZRBEG-JAHR            pic 9(4).                     
              07 HZRBEG-MONAT           pic 99.                       
              07 BEWSCHL-ART            pic X(6).                     
              07 BUCHDAT                pic X(10).                    
              07 ANZAHL                 pic 9(6).                     
              07 ERWERB-FOLGE-KZN       pic X.                        
      *                                                               
      **************************************************************  