      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA3364.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA3364.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 11:50:54   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA3337 - SELECT-3
      *
      *     SOURCE-NAME      :  DRMA3364
      *     DMR-NAME         :  DG-OV3364
      *
      *     AUTOR            :  WOLFF, STEFAN
      *     GENERIERUNG      :  05.05.08/17:09
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA3364.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 VBNR                   PIC S9(9)      BINARY.
      *
      **************************************************************
