      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  11.05.2016
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2016 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5155.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5155.CPv  $
      *
      *   Rev 2.1   Jul 07 2016 16:05:36   t13ac18
      *AMA00292: Umstellung OVGESELLSCHAFT00 - Sourcen
      *
      *   Rev 2.0   May 11 2016 17:36:26   t13ac18
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Arbeitssatz Referenztab. Prod. Gesamt
      *
      *     SOURCE-NAME      :  DRMA5155
      *
      *     GENERIERUNG      :  11.05.2016/17:53:32
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00292!11.05.16!2.1  ! Neuerstellung             ! D.WILHELM
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5155.
              07 VERSION                pic X.
              07 VG                     pic S9(4)      binary.
              07 PG                     pic S9(4)      binary.
              07 PG-KURZ                pic X(10).
              07 PG-LANG                pic X(40).
              07 LAND-KZN               pic X(4).
              07 BEW-ART-KZN            pic X(10).
              07 KTO                    pic X(10).
              07 PG-UST-RELEVANT        pic X.
      *
      **************************************************************

