      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA3399.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA3399.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 11:52:08   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA1253 - SELECT-5
      *
      *     SOURCE-NAME      :  DRMA3399
      *     DMR-NAME         :  DG-OV3399
      *
      *     AUTOR            :  WALBERT, GABY
      *     GENERIERUNG      :  16.10.07/12:38
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA3399.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 VG                     PIC S9(4)      BINARY.
              07 FACH-KENNUNG           PIC X(10).
      *
      **************************************************************
