      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1952.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1952.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 10:38:02   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     ERG-DE-LFDNR 0 - 19 einzeln
      *
      *     SOURCE-NAME      :  DRMA1952
      *     DMR-NAME         :  DG-OV1952
      *
      *     AUTOR            :  WOLFF, STEFAN
      *     GENERIERUNG      :  17.04.01/13:51
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
000010     05 DRMA1952.
000020        07 ERG-DE-0-LFDNR         PICTURE S9(4)  BINARY.
000030        07 ERG-DE-1-LFDNR         PICTURE S9(4)  BINARY.
000040        07 ERG-DE-2-LFDNR         PICTURE S9(4)  BINARY.
000050        07 ERG-DE-3-LFDNR         PICTURE S9(4)  BINARY.
000060        07 ERG-DE-4-LFDNR         PICTURE S9(4)  BINARY.
000070        07 ERG-DE-5-LFDNR         PICTURE S9(4)  BINARY.
000080        07 ERG-DE-6-LFDNR         PICTURE S9(4)  BINARY.
000090        07 ERG-DE-7-LFDNR         PICTURE S9(4)  BINARY.
000100        07 ERG-DE-8-LFDNR         PICTURE S9(4)  BINARY.
000110        07 ERG-DE-9-LFDNR         PICTURE S9(4)  BINARY.
000120        07 ERG-DE-10-LFDNR        PICTURE S9(4)  BINARY.
000130        07 ERG-DE-11-LFDNR        PICTURE S9(4)  BINARY.
000140        07 ERG-DE-12-LFDNR        PICTURE S9(4)  BINARY.
000150        07 ERG-DE-13-LFDNR        PICTURE S9(4)  BINARY.
000160        07 ERG-DE-14-LFDNR        PICTURE S9(4)  BINARY.
000170        07 ERG-DE-15-LFDNR        PICTURE S9(4)  BINARY.
000180        07 ERG-DE-16-LFDNR        PICTURE S9(4)  BINARY.
000190        07 ERG-DE-17-LFDNR        PICTURE S9(4)  BINARY.
000200        07 ERG-DE-18-LFDNR        PICTURE S9(4)  BINARY.
000210        07 ERG-DE-19-LFDNR        PICTURE S9(4)  BINARY.
      *
      **************************************************************
