      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1923.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1923.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 10:36:04   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     ED
      *
      *     SOURCE-NAME      :  DRMA1923
      *     DMR-NAME         :  DR-OV1923
      *
      *     AUTOR            :  NIEßEN, SVEN
      *     GENERIERUNG      :  08.11.00/14:48
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
000010     05 DRMA1923.
000020        07 ED-ST-NR               PICTURE S9(9)  BINARY.
000030        07 EDD-LAST-UPDATE        PICTURE X(26).
000040        07 MA-ST-NR               PICTURE S9(9)  BINARY.
000050        07 ED-BEZEICHNUNG         PICTURE X(40).
      *
      **************************************************************
