      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA3228.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA3228.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 11:43:40   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Eingabe-Bereich UPMA1253 - SELECT-4
      *
      *     SOURCE-NAME      :  DRMA3228
      *     DMR-NAME         :  DG-OV3228
      *
      *     AUTOR            :  WILHELM, DETLEF
      *     GENERIERUNG      :  08.12.06/16:54
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
           05 DRMA3228.
              07 FUNKTION               PIC X(8).
              07 VERSION                PIC X.
              07 VG                     PIC S9(4)      BINARY.
              07 FACH-KENNUNG           PIC X(10).
      *
      **************************************************************
