      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  06.11.2017
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2017 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5165.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5165.CPv  $
      *
      *   Rev 2.1   Nov 24 2017 09:55:00   t13ac18
      *AMA00360: 3. Statistik-Kategorie Folge Neu - Copies 2 DWH
      *
      *   Rev 2.0   Nov 06 2017 15:20:48   t13ac18
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Provisionseinheiten Folge-Neu
      *
      *     SOURCE-NAME      :  DRMA5165
      *
      *     GENERIERUNG      :  06.11.2017/15:28:32
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00360!06.11.17!2.1  ! Neuerstellung             ! D.WILHELM
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5165.
              07 DGMA5014.
                 09 EH-FG-NEU-ZU-EG     pic S9(9)V9    packed-decimal.
                 09 EH-FG-NEU-ZU-GR     pic S9(9)V9    packed-decimal.
                 09 EH-FG-NEU-AB-EG     pic S9(9)V9    packed-decimal.
                 09 EH-FG-NEU-AB-GR     pic S9(9)V9    packed-decimal.
      *
      **************************************************************

