      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  29.07.2015
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2015 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5116.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5116.CPv  $
      *
      *   Rev 2.1   Aug 11 2015 16:38:24   t13ac20
      *AMA00183: USt: KOMA0506-Druck - Programme/Copies
      *
      *   Rev 2.0   Jul 29 2015 11:49:18   t13ac20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     DATENSATZ: DRUCKAUSGABE MIT DATEN 168 BYTES
      *
      *     SOURCE-NAME      :  DRMA5116
      *
      *     GENERIERUNG      :  06.08.2015/07:33:15
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00183!29.07.15!2.1  ! NEUERSTELLUNG             ! WOLFF
      *         !        !     !                           !
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRUCKAUSGABE.
              07 DRUCK-DATEIKZN         pic X.
              07 DRUCK-STEUERKZN        pic X.
              07 DRUCKAUSGABEDATEN      pic X(168).
      *
      **************************************************************

