      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum     :  26.04.2013
      *            Kategorie :  Cobol-Programm
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2012 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA1605.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA1605.CPv  $
      *
      *   Rev 2.1   Jul 01 2013 10:14:26   p13sp20
      *AMA00011: Kalypso: Teilprojekt 4
      *
      *   Rev 2.0   Apr 26 2013 12:00:00   p13sp20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     VERSION und VG
      *
      *     SOURCE-NAME      :  DRMA1605
      *     DMR-NAME         :  DR-OV1605
      *
      *     AUTOR            :  WILHELM, OLIVER
      *     GENERIERUNG      :  27.07.00/12:40
      *     LETZTE AENDERUNG :
      *
      **************************************************************
      *
      *
000010     05 DRMA1605.
000020        07 VERSION                PICTURE X.
000030        07 VG                     PICTURE 9(4).
000040        07 FILLER                 OCCURS 75 TIMES
000050                                  PICTURE X.
      *
      **************************************************************
