      *---------------------------------------------------------------* 
      *    Standard fuer alle Objekte unter PVCS VM                     
      *            Datum      :  05.05.2014                             
      *            Kategorie  :  Copystrecke                            
      *---------------------------------------------------------------* 
      *                                                                 
      *---------------------------------------------------------------* 
      *    Copyright (c) 2014 ATLAS Dienstleistungen f. V. GmbH         
      *---------------------------------------------------------------* 
      *    $Workfile:   DRMA2852.CPY  $                                         

      *    $Revision:   2.1  $                                          
      *                                                                 
      *    $Log:   L:/mf/CPY/DRMA2852.CPv  $                                
      *
      *   Rev 2.1   May 06 2014 16:54:18   t13ac20
      *AMA00058: Advocard: Sourcen
      *                                                                 
      *   Rev 2.0   May 05 2014 09:57:26   t13ac20                      
      *Archiverstellung                                                 
      *                                                                 
      *---------------------------------------------------------------* 
      **************************************************************    
      *                                                                 
      *     DATENSATZ: POSTVERTEILUNGSSCHL. ADVOCARD - EINGABE          
      *                                                                 
      *     SOURCE-NAME      :  DRMA2852                                
      *                                                                 
      *     GENERIERUNG      :  05.05.2014/09:56:39                     
      *     DURCH            :  PMMA5004/01.00.01                       
      *                                                                 
      * LOGBUCH                                                         
      * AENDERUNGEN:                                                    
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME       
      * --------+--------+-----+---------------------------+----------  
      * AMA00058!05.05.14!2.1  ! NUR ÜBERNAHME AUS AACHEN  ! WOLFF      
      *         !        !     !                           !            
      *         !        !     !                           !            
      *                                                                 
      * ENDELOGBUCH                                                     
      **************************************************************    
      *                                                                 
      *                                                                 
           05 DRMA2852.                                                 
              07 SATZ-KZ                pic X.                          
              07 VBNR                   pic 9(6).                       
      *                                                                 
      **************************************************************    
