      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  06.11.2017
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2017 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRMA5163.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/DRMA5163.CPv  $
      *
      *   Rev 2.1   Nov 24 2017 09:54:42   t13ac18
      *AMA00360: 3. Statistik-Kategorie Folge Neu - Copies 2 DWH
      *
      *   Rev 2.0   Nov 06 2017 15:13:44   t13ac18
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      **************************************************************
      *
      *     Provisionsverdienst Folge-Neu
      *
      *     SOURCE-NAME      :  DRMA5163
      *
      *     GENERIERUNG      :  06.11.2017/15:25:03
      *     DURCH            :  PMMA5004/01.00.01
      *
      * LOGBUCH
      * AENDERUNGEN:
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                 ! NAME
      * --------------------------------------------------------------
      * AMA00360!06.11.17!2.1  ! NEUERSTELLUNG             ! D.WILHELM
      *         !        !     !                           !
      *
      * ENDELOGBUCH
      **************************************************************
      *
      *
           05 DRMA5163.
              07 PV-FG-NEU-NT-EG        pic S9(9)V99   packed-decimal.
              07 PV-FG-NEU-NT-GR        pic S9(9)V99   packed-decimal.
      *
      **************************************************************

