      *****************************************************************
      *    COPY-MEMBER: DRPA1954                                     
      *                                                              
      *  PEG-Datensatz Ges. 55 Sonstige Gesellschaften AT Haftpfl.      
      *                                                              
      *****************************************************************
      *****************************************************************
      * LOGBUCH:                                                      *
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME     *
      * --------------------------------------------------------------*
      * DAISY-3552 !08.06.21! Neu                          ! Kranz    *
      *            !        !                              !          *
      *            !        !                              !          *
      *                                                               *
      * ENDE-LOGBUCH                                                  *
      *****************************************************************
             30 SOGATHPL-DATENSATZ.         
                35 PGEB-GES                 PIC  9(002).             
                35 VNR                      PIC  9(015).             
                35 VERTRAG-BEGINN           PIC  X(010).             
                35 FAELLIG-VON              PIC  X(010).             
                35 AVERM                    PIC  9(007).             
                35 KUNDE-NNAME              PIC  X(025).             
                35 KUNDE-VNAME              PIC  X(020).             
                35 ABR-DAT-PG               PIC  X(010).             
                35 PIN                      PIC  9(007).             
                35 ZAHLWEISE                PIC  X(002).             
                35 VERTRAG-WAEHRUNG         PIC  X(003).             
                35 HAFTZ-BEGINN             PIC  X(010).             
                35 HAFTZ-ENDE               PIC  X(010).             
                35 PGV-PG                   PIC  X(004).             
                35 PG-TARIF                 PIC  X(012).             
                35 PG-BEITRAG-VZ            PIC  X.           
                35 PG-BEITRAG               PIC  9(010)V9(02).
                35 PPFL-BEITRAG-VZ          PIC  X.           
                35 PPFL-BEITRAG             PIC  9(010)V9(02).
                35 PROV-SATZ                PIC  9(005)V9(02).
                35 PROV-BETRAG-VZ           PIC  X.           
                35 PROV-BETRAG              PIC  9(010)V9(02).

      *****************************************************************
      *---------------------- ENDE DRPA1954 --------------------------* 
      *****************************************************************
