      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   drpa0570.cpy  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\drpa0570.cpv  $
      *
      *   Rev 2.0   May 27 1999 14:06:46   T01JM2S
      *APA00042
      *
      *   Rev 1.0   22 Oct 1997 15:28:52   P13PVCS
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA0570                                      *
      *    --------------------------------------------------------   *
      *    PMDS-DATEN                                                 *
      *    --------------------------------------------------------   *
      *    ERSTELLT: WOLFF                                            *
      *    DATUM:    22.10.1997                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AFPA0012!22.10.97! 01 ! NEU                       ! WOLFF    *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DIE DATEN FÜR PMDS.                   *
      *                                                              *
      ****************************************************************
      *
             30 PMDS-DATEN.
                35 PMBE-ID                          PIC S9(015)
                                                        PACKED-DECIMAL.
                35 PMBE-VERSION                     PIC S9(004) BINARY.
                35 PMDS-PMBE-ID                     PIC S9(015)
                                                        PACKED-DECIMAL.
                35 PMDS-PMBE-VERSION                PIC S9(004) BINARY.
      *
      ******* ENDE COPY-MEMBER **************************************
