      *****************************************************************
      *    COPY-MEMBER: DRPA1976                                      *
      *                                                               *
      *    PEG-DATENSATZ GEIGER-EDELMETALLE-UST/ GES.80               * 
      *                                                               *
      *****************************************************************
      *****************************************************************
      * LOGBUCH:                                                      *
      * AUFTRAG    ! DATUM  ! AENDERUNG                    ! NAME     *
      * --------------------------------------------------------------*
      * DSY04791   !04.08.22!NEU                           ! WANG     *
      *            !        !                              !          *
      *            !        !                              !          *
      *                                                               *
      * ENDE-LOGBUCH                                                  *
      *****************************************************************
      *
             30 GEIGER-UST-DATENSATZ.
                35 PGEB-GES               PIC  9(002).
                35 VNR                    PIC  9(015).
                35 VERTRAG-BEGINN         PIC  X(010).
                35 FAELLIG-VON            PIC  X(010).
                35 AVERM                  PIC  9(007).
                35 KUNDE-NNAME            PIC  X(035).
                35 KUNDE-VNAME            PIC  X(035).
                35 ABR-DAT-PG             PIC  X(010).
                35 VERTRAG-WAEHRUNG       PIC  X(003).
                35 ZAHLWEISE              PIC  9(002).
                35 PGV-PG                 PIC  X(004).
                35 PG-PROD-BEZ            PIC  X(015).
                35 PPFL-SUMME-VORZ        PIC  X(001).
                35 PPFL-SUMME             PIC S9(009)V99.
                35 PROV-SATZ              PIC  9(003)V999.
                35 PROV-BETRAG-VORZ       PIC  X(001).
                35 PROV-BETRAG            PIC S9(009)V99.
                35 UMSATZ-STEUER-VORZ     PIC  X(001).
                35 UMSATZ-STEUER-BETRAG   PIC S9(009)V99.
                35 UMSATZ-STEUER-SATZ     PIC  9(003)V999.
                35 GESAMT-BETRAG-VORZ     PIC  X(001).
                35 GESAMT-BETRAG          PIC S9(009)V99.
                35 KUNDEN-NR              PIC  X(008).
                35 FILLER                 PIC  X(033).
      *****************************************************************
      *---------------------- ENDE DRPA1976 --------------------------* 
      *****************************************************************
