      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1021                                      *
      *    --------------------------------------------------------   *
      *    FUNKTIONSAUFRUF <<ZULÄSSIGKEIT D. UMBUCHUNG PRÜFEN>>       *
      *    --------------------------------------------------------   *
      *    ERSTELLT: FOLTZ                                            *
      *    DATUM:    17.07.1998                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  ! AENDERUNG                      ! NAME     *
      * -------------------------------------------------------------*
      * APA00012!17.07.98! NEU                            ! FOLTZ    *
      * APA00012!10.03.98!-ERWEITERUNGEN IN TAB 3         ! STORCH   *
      *         !        !-LÖSCHEN VON TABELLE 1 + 2      !          *
      *         !        ! WG. NEUER PRÜFALGORITHMEN      !          *
      * APA00012!30.03.99!-ÄNDERUNGEN NACH KONZEPT-       ! STORCH   *
      *         !        ! KORREKTUREN VON UWA            !          *
      * FPA00275!24.07.01! ERWEITERUNGEN IN TABELLE       ! STORCH   *
      * APA00330!17.02.05! ERWEITUNG DGV 236 / 436        ! JÄGER    *
      * APA00485!31.05.06! ERWEITUNG DGV 105 / 301        ! WANG     *
      * APA00495!08.11.06! ERWEITERUNG DGV 238 / 326      ! JÄGER    *
      * APA00452!03.01.07! KORREKTUR INDEX F. TABELLE     ! JÄGER    *
      *         !        ! (ÜBERGABE MIT 3-STL. PROD)     !          *
      * APA00638!10.07.07! ERWEITERUNG DGV 313/113        ! SCHEIDEL *
      * APA00940!07.09.09! ERWEITERUNG DGV 119/319        ! BUCH     *
      * APA01184!11.03.11! ERWEITERUNG DGV 439            ! JÄGER    *
      * APA01259!18.11.11! DGV 260, 270, 66 ERGÄNZT       ! BUCH     *
      * FPA01325!28.08.13! KORREKTUR OCCURS-ANGABE        ! STORCH   *
      * APA01526!27.08.13! ERWEITERUNGEN FÜR KALYPSO      ! STORCH   *
      *         !        ! SEHR ALTE ZEILEN GELÖSCHT      !          *
      * APA01526!20.01.14! NEUE DGV'S AML                 ! BÖTTCHER *
      * APA01895!05.11.14! UMB. 313  -> 107 ABGESCHAL     ! SCHEIDEL *
      *         !        !  UMGEKEHRT WEITER MOEGLICH     !          *
      * APA02020!04.05.15! NEUER DGV 432                  ! BUCH     *
      * APA02038!07.05.15! NEUER DGV 145                  ! BUCH     *
      * APA02221!02.03.16! UMB. 168 AUF 326 MÖGLICH       ! STORCH   *
      * APA02265!06.06.16! UMSTELLUNG 4-STELLIG           ! BUCH     *
      * APA02499!22.08.17! NEUER DGV 1071                 ! WANG     *
      * APA02436!30.08.17! NEUER DGV 1971                 ! KÖPRÜCÜ  *
      * APA02508!08.09.17! NEUE AML-DGV's                 ! KÖPRÜCÜ  *
      * APA02492!01.11.17! Folge-Neu                      ! KRANZ    *
      * APA02944!03.09.20! NEUE DGV-UMBUCHUNGEN HINZU     ! KÖPRÜCÜ  *
      * FPA01791!04.11.20! DGV-UMBUCHUNG 1150-3010        ! STORCH   *
      * DSY-3271!08.04.21! DGV-UMBUCHUNG 5040-7010        ! WANG     *
      * DSY-5007!08.11.22! DGV-UMBUCHUNG 1032-3010        ! STORCH   *
      *         !        !                                !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DIE EIN- UND AUSGABEPARAMETER         *
      *    FÜR DIE FUNKTION DRPA1021                                 *
      *    AUSSER: DEM FUNKTIONSNAMEN,                               *
      *            DEM ERR-ERROR-BEREICH UND                         *
      *            DEM STANDARD-STATUS-BEREICH                       *
      *            (JEWEILS SEPARATE COPYS)                          *
      ****************************************************************
      *
      *
      *  Tabelle zum Prüfen von Prodarten und Daisy-Gevo
      *  genaue struktur s. redefinition
      *
      *
       01  DRPA1021-TABELLE-KONST.
      ***
      *** Verwendung der Prodart und des DGV im Rahmen der Umbuchung.
      ***
      *** Die nachfolgenden Tabellen beschreiben die zulässigen
      *** Umbuchungsketten anhand der Prodarten und DGV für Buchung,
      *** Gegenbuchung und (Um-)Buchung. Dabei sind 3 grundsätzliche
      *** Fälle zu unterscheiden:
      ***
      *** - Umbuchung ohne Änderungen der Prodart
      *** - Umbuchung von AP auf FP und umgekehrt
      *** - Umbuchung von WIK und Stornoneutral
      ***
      *** Die Tabellen werden für die folgenden Fachfunktionen benötigt.
      *** 'FKPAW058 Gegen-Daisy-Gevo/Prodart ermitteln'
      *** 'FKPAW064 Daisy-Gevo/Prodart für Neutralisierung prüfen'
      *** 'FKPAW065 Daisy-Gevo/Prodart für Umbuchung prüfen'
      ***
      ***
      ***         NEUTRALISERUNG MÖGLICH = X-------------------------+
      ***         UMB.-DAISY-GEVO-------------------------------+    !
      ***         GEGEN-DAISY-GEVO-------------------------+    !    !
      ***         DAISY-GEVO--------------------------+    !    !    !
      ***         UMB.-PRODART----------------------+ !    !    !    !
      ***         GEGEN-PRODART-------------------+ ! !    !    !    !
      ***         PRODART-----------------------+ ! ! !    !    !    !
      ***  UMBUCHUNGEN                          ! ! ! !    !    !    !
      *                                         ! ! ! !    !    !    !
      *KOMPLETT AUF 5ER DGVS UND 2ER PRODART UMGESTELLT
           05  FILLER  PIC X(028)  VALUE '01 04 03 01000 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01010 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01020 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01030 04880 03010  '.
081122     05  FILLER  PIC X(028)  VALUE '01 04 03 01032 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01040 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01050 04880 03010  '.
030920     05  FILLER  PIC X(028)  VALUE '01 04 03 01061 04880 03010  '.
030920     05  FILLER  PIC X(028)  VALUE '01 04 03 01066 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01070 04880 03130  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01071 04880 03130  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01130 04880 03130  '.
041120     05  FILLER  PIC X(028)  VALUE '01 04 03 01150 04880 03010  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01190 04880 03190  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01260 04880 03260  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01680 04880 03260  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01980 04880 03980  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01450 04880 03970  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01990 04880 03990  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02010 03880 04020  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02020 03880 04020  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02030 03880 04020  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02030 03880 04320  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02040 03880 04030  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02050 03880 04030  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02120 03880 04130  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02130 03880 04130  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02140 03880 04130  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02150 03880 04130  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02220 03880 04230  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02230 03880 04230  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02240 03880 04230  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02250 03880 04230  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02320 03880 04330  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02330 03880 04330  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02340 03880 04330  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02350 03880 04330  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02360 03880 04360  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02380 03880 04380  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02380 03880 04390  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02600 03880 04600  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02700 03880 04700  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02980 03880 04980  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02990 03880 04990  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03010 02880 01010  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03010 02880 01050  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03110 02880 01110  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03130 02880 01130  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03190 02880 01190  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03260 02880 01260  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03990 02880 01990  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04010 01880 02010  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04020 01880 02010  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04030 01880 02040  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04040 01880 02030  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04110 01880 02140  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04130 01880 02140  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04140 01880 02130  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04230 01880 02240  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04240 01880 02240  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04330 01880 02340  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04340 01880 02340  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04360 01880 02360  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04380 01880 02380  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04390 01880 02380  '.
           05  FILLER  PIC X(028)  VALUE '04 03 02 04600 01880 02600  '.
           05  FILLER  PIC X(028)  VALUE '04 03 02 04700 01880 02700  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04980 01880 02980  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04990 01880 02990  '.
           05  FILLER  PIC X(028)  VALUE '05 08 07 05010 08880 07010  '.
           05  FILLER  PIC X(028)  VALUE '05 08 07 05020 08880 07010  '.
           05  FILLER  PIC X(028)  VALUE '05 08 07 05030 08880 07010  '.
080421     05  FILLER  PIC X(028)  VALUE '05 08 07 05040 08880 07010  '.
           05  FILLER  PIC X(028)  VALUE '05 08 07 05990 08880 07990  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06010 07880 08020  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06020 07880 08020  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06030 07880 08020  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06040 07880 08030  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06050 07880 08030  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06120 07880 08130  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06130 07880 08130  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06140 07880 08130  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06150 07880 08130  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06220 07880 08230  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06230 07880 08230  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06240 07880 08230  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06250 07880 08230  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06320 07880 08330  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06330 07880 08330  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06340 07880 08330  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06350 07880 08330  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06600 07880 08600  '.
           05  FILLER  PIC X(028)  VALUE '06 07 08 06990 07880 08990  '.
           05  FILLER  PIC X(028)  VALUE '07 06 05 07010 06880 05010  '.
           05  FILLER  PIC X(028)  VALUE '07 06 05 07110 06880 05010  '.
           05  FILLER  PIC X(028)  VALUE '07 06 05 07990 06880 05990  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08010 05880 06010  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08020 05880 06020  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08030 05880 06040  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08040 05880 06040  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08110 05880 06140  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08130 05880 06140  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08140 05880 06140  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08230 05880 06240  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08240 05880 06240  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08330 05880 06340  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08340 05880 06340  '.
           05  FILLER  PIC X(028)  VALUE '08 07 06 08600 07880 06600  '.
           05  FILLER  PIC X(028)  VALUE '08 05 06 08990 05880 06990  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01860 04880 03860  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01870 04880 03870  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01910 04880 03910  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01910 04880 03950  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01920 04880 03920  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01920 04880 03420  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01930 04880 03930  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01930 04880 03480  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01940 04880 03940  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01940 04880 03440  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01946 04880 03946  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01956 04880 03946  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01950 04880 03950  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01570 04880 03570  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01580 04880 03580  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01590 04880 03590  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01960 04880 03960  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01970 04880 03970  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01971 04880 03970  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01560 04880 03580  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01780 04880 03780  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01410 04880 03950  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01440 04880 03440  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01460 04880 03960  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01470 04880 03970  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01430 04880 03480  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01500 04880 03910  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01540 04880 03940  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01530 04880 03930  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01490 04880 03590  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01610 04880 03610  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01640 04880 03640  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01660 04880 02660  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01670 04880 03670  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01630 04880 03630  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01790 04880 03790  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01710 04880 03710  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01740 04880 03740  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01730 04880 03730  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02860 03880 04860  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02870 03880 04870  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02910 03880 04910  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02920 03880 04920  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02930 03880 04930  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02946 03880 04946  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02950 03880 04950  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02570 03880 04570  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02580 03880 04850  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02590 03880 04590  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02940 03880 04940  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02960 03880 04960  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02970 03880 04970  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02780 03880 04780  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02440 03880 04440  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02610 03880 04610  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02640 03880 04640  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02660 03880 04660  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02670 03880 04670  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02630 03880 04630  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02790 03880 04790  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02710 03880 04710  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02740 03880 04740  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02730 03880 04730  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02420 03880 04420  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02480 03880 04480  '.
081122     05  FILLER  PIC X(028)  VALUE '03 04 01 03010 04880 01032  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03860 02880 01860  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03870 02880 01870  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03910 02880 01500  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03920 02880 01500  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03930 02880 01530  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03950 02880 01410  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03570 02880 01570  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03580 02880 01580  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03590 02880 01590  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03940 02880 01540  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03946 02880 01946  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03946 02880 01956  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03960 02880 01960  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03970 02880 01970  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03970 02880 01971  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03780 02880 01780  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03440 02880 01440  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03610 02880 01610  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03640 02880 01640  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03660 02880 01660  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03670 02880 01670  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03630 02880 01630  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03790 02880 01790  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03710 02880 01710  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03740 02880 01740  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03730 02880 01730  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03420 02880 01410  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03480 02880 01430  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04860 01880 02860  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04870 01880 02870  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04910 01880 02910  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04920 01880 02920  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04930 01880 02930  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04950 01880 02950  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04570 01880 02570  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04580 01880 02580  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04590 01880 02590  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04940 01880 02940  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04946 01880 02946  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04960 01880 02960  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04970 01880 02970  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04780 01880 02780  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04440 01880 02440  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04610 01880 02610  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04640 01880 02640  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04660 01880 02660  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04670 01880 02670  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04630 01880 02630  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04790 01880 02790  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04710 01880 02710  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04740 01880 02740  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04730 01880 02730  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04420 01880 02420  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04480 01880 02480  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01810 04880 03810  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01820 04880 03820  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01830 04880 03830  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01840 04880 03840  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01760 04880 03760  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01900 04880 03900  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01890 04880 03890  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01770 04880 03770  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01280 04880 03280  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01290 04880 03290  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01300 04880 03300  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01270 04880 03270  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02810 03880 04810  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02820 03880 04820  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02830 03880 04830  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02840 03880 04840  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02760 03880 04760  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02890 03880 04890  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02900 03880 04900  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02770 03880 04770  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02280 03880 04280  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02290 03880 04290  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02300 03880 04300  '.
           05  FILLER  PIC X(028)  VALUE '02 03 04 02270 03880 04270  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03810 02880 01810  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03820 02880 01820  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03830 02880 01830  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03840 02880 01840  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03760 02880 01760  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03900 02880 01900  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03890 02880 01890  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03770 02880 01770  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03280 02880 01280  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03290 02880 01290  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03300 02880 01300  '.
           05  FILLER  PIC X(028)  VALUE '03 02 01 03270 02880 01270  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04810 01880 02810  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04820 01880 02820  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04830 01880 02830  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04840 01880 02840  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04760 01880 02760  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04900 01880 02900  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04890 01880 02890  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04770 01880 02770  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04280 01880 02280  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04290 01880 02290  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04300 01880 02300  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04270 01880 02270  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04320 01880 02030  '.
      *
      *    GEVO LEBENV 175
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01410  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01430  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01440  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01460  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01470  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01490  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01500  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01530  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01540  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01560  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01570  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01580  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01590  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01610  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01630  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01640  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01660  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01670  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01710  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01730  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01740  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01780  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01790  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01910  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01920  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01930  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01940  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01950  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01960  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01970  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01750 04880 01971  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03420  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03440  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03480  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03570  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03580  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03590  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03610  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03630  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03640  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03660  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03670  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03710  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03730  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03740  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03780  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03790  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03910  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03920  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03930  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03940  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03950  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03960  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01750 04880 03970  '.
      *    GEVO LEBENV 475
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02420  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02440  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02480  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02570  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02580  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02590  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02610  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02630  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02640  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02660  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02670  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02710  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02730  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02740  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02780  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02790  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02910  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02920  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02930  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02940  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02950  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02960  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04750 01880 02970  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04420  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04440  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04480  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04570  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04580  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04590  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04610  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04630  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04640  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04660  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04670  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04710  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04730  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04740  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04780  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04790  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04910  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04920  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04930  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04940  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04950  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04960  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04750 01880 04970  '.
      *    GEVO NEUTRDGV 165
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01270  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01280  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01290  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01300  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01760  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01770  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01810  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01820  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01830  '.
           05  FILLER  PIC X(028)  VALUE '01 04 01 01650 04880 01840  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03270  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03280  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03290  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03300  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03760  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03770  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03810  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03820  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03830  '.
           05  FILLER  PIC X(028)  VALUE '01 04 03 01650 04880 03840  '.
      *    GEVO NEUTRDGV 465
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02270  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02280  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02290  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02300  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02760  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02770  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02810  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02820  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02830  '.
           05  FILLER  PIC X(028)  VALUE '04 01 02 04650 01880 02840  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04270  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04280  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04290  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04300  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04760  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04770  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04810  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04820  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04830  '.
           05  FILLER  PIC X(028)  VALUE '04 01 04 04650 01880 04840  '.
      *
       01  DRPA1021-TABELLE         REDEFINES   DRPA1021-TABELLE-KONST.
           05  DRPA1021-TAB         OCCURS      400
                                    INDEXED BY  DRPA1021-IX.
      ***      Prodart
               10 DRPA1021-PRODART  PIC 9(002).
               10 FILLER            PIC X(001).
 
      ***      Gegen-Prodart
               10 DRPA1021-GPRODART PIC 9(002).
               10 FILLER            PIC X(001).
 
      ***      Umbuchungs-Prodart
               10 DRPA1021-UPRODART PIC 9(002).
               10 FILLER            PIC X(001).
 
      ***      DGV
               10 DRPA1021-DGV      PIC 9(005).
               10 FILLER            PIC X(001).
 
      ***      Gegen-DGV
               10 DRPA1021-GDGV     PIC 9(005).
               10 FILLER            PIC X(001).
 
      ***      Umbuchungs-DGV
               10 DRPA1021-UDGV     PIC 9(005).
               10 FILLER            PIC X(001).
 
      ***      Neutralisieren möglich
               10  DRPA1021-NEUTR   PIC X(001).
                   88 DRPA1021-NEUTR-MOEGL      VALUE 'X'.
      *