      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   drpa1226.cpy  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:\MF\CPY\drpa1226.cpv  $
      *
      *   Rev 2.1   May 06 1999 08:50:42   T01JM2S
      *APA00012 - NEUE FUNKTION DRPA1225
      *
      *   Rev 2.0   Mar 30 1999 08:44:06   P13SP99
      *Neuerstellung
      *
      *   Rev 2.0   Mar 05 1999 09:20:26   P13SP20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1226                                      *
      *    --------------------------------------------------------   *
      *    MINIMAL-DATEN                                              *
      *    --------------------------------------------------------   *
      *    ERSTELLT: WOLFF                                            *
      *    DATUM:    05.05.1999                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AFPA0012!05.05.99! 01 ! NEU                       ! WOLFF    *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DIE MINIMAL-DATEN FÜR DIE             *
      *    ERSTELLUNG DER KONTROLLWERTE DES KONTROLLSYSTEMS          *
      *                                                              *
      ****************************************************************
      *
             30 MIN-DATEN-KONTR.
                35 PDTA-ID                          PIC S9(015)
                                                        PACKED-DECIMAL.
                35 PGEB-GES                         PIC S9(004) BINARY.
                35 KNR-WAEHRUNG                     PIC S9(004) BINARY.
                35 GSMT-PROV                        PIC S9(009)V9(2)
                                                        PACKED-DECIMAL.
      *
      ******* ENDE COPY-MEMBER **************************************
