      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA0364.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/DRPA0364.CPv  $
      *
      *   Rev 2.2   Sep 29 2017 14:22:32   t13ex44
      *FPA01598: Korrektur K102
      *
      *   Rev 2.1   May 28 1999 18:30:56   T13EX26
      *Prod-Übergabe 28.0598 hpa
      *
      *   Rev 2.0   May 26 1999 16:57:14   T13EX26
      *MFE-Umstellung
      *
      *   Rev 1.0   09 Jul 1997 16:03:54   P13PVCS
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *---------------------------------------------------------------*
      ****************************************************************
      *    COPY-MEMBER: DRPA0364  FUNKTION                           *
      *                           "Prüfen VB-Nr auf TÄTIG"           *
      *                                                              *
      ****************************************************************
      *    VERSION   02
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER  ! AENDERUNG                ! NAME     *
      * -------------------------------------------------------------*
      * ??????? !??.??.??! 01  ! NEUERSTELLUNG            ! ???????  *
      * DSY04437!27.04.22!     ! RC-AUR NICHT MEHR ZULÄSSI! KÖPRÜCÜ  *
      *         !        !     !                          !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *---------------------------------------------------------------*
      ***************************************************************
      *                 PARAMETER-INPUT                             *
      ***************************************************************
       01  PI-DRPA0364.
           05  PI-DRPA0364-VBNR               PIC 9(9) BINARY.
           05  PI-DRPA0364-PROV-TERM          PIC X(10).
 
      ***************************************************************
      *                 PARAMETER-OUTPUT                            *
      ***************************************************************
       01  PO-DRPA0364.
           05  PO-DRPA0364-RC                 PIC  X(03).
               88  PO-DRPA0364-RC-OK                   VALUE 'OK '.
               88  PO-DRPA0364-RC-VM                   VALUE 'VM '.
               88  PO-DRPA0364-RC-NOTMA                VALUE 'NMA'.
               88  PO-DRPA0364-RC-NOT-FOUND            VALUE 'NFD'.
               88  PO-DRPA0364-RC-AUS                  VALUE 'AUS'.
               88  PO-DRPA0364-RC-ZUK                  VALUE 'ZUK'.
           05 PO-DRPA0364-VBNR                PIC  9(09) BINARY.
      *
      ******** ENDE COPY-MEMBER (DRPA0364) *******************

