      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  18.07.2016
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2016 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA1850.CPY  $
      *    $Revision:   2.3  $
      *
      *    $Log:   L:/mf/CPY/DRPA1850.CPv  $
      *
      *   Rev 2.3   Sep 01 2016 14:53:02   t13ae37
      *FPA01258: Korrektur SST-MA
      *
      *   Rev 2.2   Aug 19 2016 11:23:00   t13ae37
      *FPA01258: Korrektur SST-MA
      *
      *   Rev 2.1   Jul 29 2016 14:40:20   T13AE37
      *FPA01258: Korrektur SST-MA
      *
      *   Rev 2.0   Jul 18 2016 09:05:46   t13ae37
      *Archiverstellung
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA1850                                      *
      *    --------------------------------------------------------   *
      *    RESTARTINFORMATIONEN ZU PMPA0057 (COPY-10)                 *
      *       FÜR T-PROT10                                            *
      *       Umsatzsteuer DVAG                                       *
      *    --------------------------------------------------------   *
      *    ERSTELLT: BUCH                                             *
      *    DATUM:    18.06.2016                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * FPA01258!18.06.16!2.01! NEU                       ! BUCH     *
      *         !        !    !                           !          *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT DIE DATEN MIT DEN RESTARTINFORMA-     *
      *    TIONEN ZU PMPA0057 (SST-MA).                              *
      *                                                              *
      ****************************************************************
      *
       01  DRPA1850-RESTART.
           05 DRPA1850-ID.
              10 FILLER                             PIC  X(008)
                                                      VALUE 'DRPA1850'.
      *
           05 DRPA1850-DATEN.
              10 DRPA1850-PROT-10                   PIC  X(3100).
      *
           05 FILLER                                PIC  X(692).
      *
 
 

