      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DRPA0847.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\DRPA0847.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 14:29:42   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.1   11 Nov 1998 15:37:08   T01JM2S
      *PEG-PRODUKTIONSüBERGABE
      *
      *   Rev 1.0   14 Jan 1998 12:46:16   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****************************************************************
      *    COPY-MEMBER: DRPA0847                                      *
      *    --------------------------------------------------------   *
      *    KOFV-TEIL OHNE ABSCHLUSSDATUM                              *
      *    --------------------------------------------------------   *
      *    ERSTELLT: WOLFF                                            *
      *    DATUM:    16.02.1998                                       *
      *****************************************************************
      *    VERSION
      ****************************************************************
      * AENDERUNGEN:                                                 *
      * AUFTRAG ! DATUM  !VER ! AENDERUNG                 ! NAME     *
      * -------------------------------------------------------------*
      * AFPA0012!16.02.98! 01 ! NEU                       ! WOLFF    *
      *         !        !    !                           !          *
      *                                                              *
      * ENDE-LOGBUCH                                                 *
      ****************************************************************
      *                                                              *
      *    DIESES COPY ENTHÄLT EINEN TEIL DER DATEN FÜR KOFV OHNE    *
      *    ABSCHLUSSDATUM UND ZUKÜNFTIGES MITARBEITERABRECHNUNGSDATUM*
      *                                                              *
      ****************************************************************
      *
             35 KOFV-TEIL.
                40 PDTA-ID                          PIC S9(015)
                                                        PACKED-DECIMAL.
                40 PGEB-GES                         PIC S9(004) BINARY.
                40 KNR-FKT-BEREICH-AB               PIC S9(004) BINARY.
                40 KNR-FKT-BEREICH-ZU               PIC S9(004) BINARY.
                40 KNR-WAEHRUNG                     PIC S9(004) BINARY.
                40 KOFV-GSMT-PROV                   PIC S9(013)V99
                                                        PACKED-DECIMAL.
                40 KOFV-ANZ-BEW-AB                  PIC S9(009) BINARY.
                40 KOFV-ANZ-BEW-ZU                  PIC S9(009) BINARY.
      *
      ******* ENDE COPY-MEMBER **************************************
