      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   DWKI0007.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/MF/CPY/DWKI0007.CPv  $
      *
      *   Rev 2.1   22 Oct 2001 14:41:28   t13ex27
      *Umstellung von OS2 auf W2000
      *
      *   Rev 2.0   05 Jun 2001 17:32:16   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
       01  HEX-UMWANDLUNG.
           05  HEX-I                        PIC S9(4) COMP.
           05  HEX-Y                        PIC S9(4) COMP.
           05  BYTE-FELD-2                  PIC X(2).
           05  BYTE-FELD-26                 PIC X(26).
           05  ID-IN-FELD                   PIC X(13).
