       01  UA909I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRZ25L    COMP  PIC  S9(4).                                     
           02  PNRZ25F    PICTURE X.                                            
           02  FILLER REDEFINES PNRZ25F.                                        
             03 PNRZ25A    PICTURE X.                                           
           02  PNRZ25I  PIC X(7).                                               
           02  DATZ25L    COMP  PIC  S9(4).                                     
           02  DATZ25F    PICTURE X.                                            
           02  FILLER REDEFINES DATZ25F.                                        
             03 DATZ25A    PICTURE X.                                           
           02  DATZ25I  PIC X(8).                                               
           02  UHRZ25L    COMP  PIC  S9(4).                                     
           02  UHRZ25F    PICTURE X.                                            
           02  FILLER REDEFINES UHRZ25F.                                        
             03 UHRZ25A    PICTURE X.                                           
           02  UHRZ25I  PIC X(5).                                               
           02  GESZ25L    COMP  PIC  S9(4).                                     
           02  GESZ25F    PICTURE X.                                            
           02  FILLER REDEFINES GESZ25F.                                        
             03 GESZ25A    PICTURE X.                                           
           02  GESZ25I  PIC X(28).                                              
           02  VBNRZ25L    COMP  PIC  S9(4).                                    
           02  VBNRZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRZ25F.                                       
             03 VBNRZ25A    PICTURE X.                                          
           02  VBNRZ25I  PIC X(7).                                              
           02  VBPZZ25L    COMP  PIC  S9(4).                                    
           02  VBPZZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VBPZZ25F.                                       
             03 VBPZZ25A    PICTURE X.                                          
           02  VBPZZ25I  PIC X(1).                                              
           02  VMNRZ25L    COMP  PIC  S9(4).                                    
           02  VMNRZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VMNRZ25F.                                       
             03 VMNRZ25A    PICTURE X.                                          
           02  VMNRZ25I  PIC X(7).                                              
           02  VMPZZ25L    COMP  PIC  S9(4).                                    
           02  VMPZZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VMPZZ25F.                                       
             03 VMPZZ25A    PICTURE X.                                          
           02  VMPZZ25I  PIC X(1).                                              
           02  VNRZ25L    COMP  PIC  S9(4).                                     
           02  VNRZ25F    PICTURE X.                                            
           02  FILLER REDEFINES VNRZ25F.                                        
             03 VNRZ25A    PICTURE X.                                           
           02  VNRZ25I  PIC X(12).                                              
           02  TIVNZ25L    COMP  PIC  S9(4).                                    
           02  TIVNZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TIVNZ25F.                                       
             03 TIVNZ25A    PICTURE X.                                          
           02  TIVNZ25I  PIC X(10).                                             
           02  IVNRZ25L    COMP  PIC  S9(4).                                    
           02  IVNRZ25F    PICTURE X.                                           
           02  FILLER REDEFINES IVNRZ25F.                                       
             03 IVNRZ25A    PICTURE X.                                          
           02  IVNRZ25I  PIC X(7).                                              
           02  IVPZZ25L    COMP  PIC  S9(4).                                    
           02  IVPZZ25F    PICTURE X.                                           
           02  FILLER REDEFINES IVPZZ25F.                                       
             03 IVPZZ25A    PICTURE X.                                          
           02  IVPZZ25I  PIC X(2).                                              
           02  TVNAZ25L    COMP  PIC  S9(4).                                    
           02  TVNAZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TVNAZ25F.                                       
             03 TVNAZ25A    PICTURE X.                                          
           02  TVNAZ25I  PIC X(19).                                             
           02  VBNAZ25L    COMP  PIC  S9(4).                                    
           02  VBNAZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VBNAZ25F.                                       
             03 VBNAZ25A    PICTURE X.                                          
           02  VBNAZ25I  PIC X(7).                                              
           02  VNRAZ25L    COMP  PIC  S9(4).                                    
           02  VNRAZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VNRAZ25F.                                       
             03 VNRAZ25A    PICTURE X.                                          
           02  VNRAZ25I  PIC X(15).                                             
           02  ANREZ25L    COMP  PIC  S9(4).                                    
           02  ANREZ25F    PICTURE X.                                           
           02  FILLER REDEFINES ANREZ25F.                                       
             03 ANREZ25A    PICTURE X.                                          
           02  ANREZ25I  PIC X(9).                                              
           02  ZUNAZ25L    COMP  PIC  S9(4).                                    
           02  ZUNAZ25F    PICTURE X.                                           
           02  FILLER REDEFINES ZUNAZ25F.                                       
             03 ZUNAZ25A    PICTURE X.                                          
           02  ZUNAZ25I  PIC X(26).                                             
           02  VONAZ25L    COMP  PIC  S9(4).                                    
           02  VONAZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VONAZ25F.                                       
             03 VONAZ25A    PICTURE X.                                          
           02  VONAZ25I  PIC X(26).                                             
           02  PLZZ25L    COMP  PIC  S9(4).                                     
           02  PLZZ25F    PICTURE X.                                            
           02  FILLER REDEFINES PLZZ25F.                                        
             03 PLZZ25A    PICTURE X.                                           
           02  PLZZ25I  PIC X(5).                                               
           02  ORTZ25L    COMP  PIC  S9(4).                                     
           02  ORTZ25F    PICTURE X.                                            
           02  FILLER REDEFINES ORTZ25F.                                        
             03 ORTZ25A    PICTURE X.                                           
           02  ORTZ25I  PIC X(21).                                              
           02  AUSLZ25L    COMP  PIC  S9(4).                                    
           02  AUSLZ25F    PICTURE X.                                           
           02  FILLER REDEFINES AUSLZ25F.                                       
             03 AUSLZ25A    PICTURE X.                                          
           02  AUSLZ25I  PIC X(3).                                              
           02  TTARZ25L    COMP  PIC  S9(4).                                    
           02  TTARZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TTARZ25F.                                       
             03 TTARZ25A    PICTURE X.                                          
           02  TTARZ25I  PIC X(16).                                             
           02  TARIZ25L    COMP  PIC  S9(4).                                    
           02  TARIZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TARIZ25F.                                       
             03 TARIZ25A    PICTURE X.                                          
           02  TARIZ25I  PIC X(10).                                             
           02  GEBDZ25L    COMP  PIC  S9(4).                                    
           02  GEBDZ25F    PICTURE X.                                           
           02  FILLER REDEFINES GEBDZ25F.                                       
             03 GEBDZ25A    PICTURE X.                                          
           02  GEBDZ25I  PIC X(8).                                              
           02  SUMMZ25L    COMP  PIC  S9(4).                                    
           02  SUMMZ25F    PICTURE X.                                           
           02  FILLER REDEFINES SUMMZ25F.                                       
             03 SUMMZ25A    PICTURE X.                                          
           02  SUMMZ25I  PIC X(9).                                              
           02  TBEGZ25L    COMP  PIC  S9(4).                                    
           02  TBEGZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TBEGZ25F.                                       
             03 TBEGZ25A    PICTURE X.                                          
           02  TBEGZ25I  PIC X(16).                                             
           02  BEGIZ25L    COMP  PIC  S9(4).                                    
           02  BEGIZ25F    PICTURE X.                                           
           02  FILLER REDEFINES BEGIZ25F.                                       
             03 BEGIZ25A    PICTURE X.                                          
           02  BEGIZ25I  PIC X(8).                                              
           02  DAUEZ25L    COMP  PIC  S9(4).                                    
           02  DAUEZ25F    PICTURE X.                                           
           02  FILLER REDEFINES DAUEZ25F.                                       
             03 DAUEZ25A    PICTURE X.                                          
           02  DAUEZ25I  PIC X(2).                                              
           02  TBUZZ25L    COMP  PIC  S9(4).                                    
           02  TBUZZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TBUZZ25F.                                       
             03 TBUZZ25A    PICTURE X.                                          
           02  TBUZZ25I  PIC X(16).                                             
           02  DYNAZ25L    COMP  PIC  S9(4).                                    
           02  DYNAZ25F    PICTURE X.                                           
           02  FILLER REDEFINES DYNAZ25F.                                       
             03 DYNAZ25A    PICTURE X.                                          
           02  DYNAZ25I  PIC X(1).                                              
           02  BUZZ25L    COMP  PIC  S9(4).                                     
           02  BUZZ25F    PICTURE X.                                            
           02  FILLER REDEFINES BUZZ25F.                                        
             03 BUZZ25A    PICTURE X.                                           
           02  BUZZ25I  PIC X(2).                                               
           02  UZVZ25L    COMP  PIC  S9(4).                                     
           02  UZVZ25F    PICTURE X.                                            
           02  FILLER REDEFINES UZVZ25F.                                        
             03 UZVZ25A    PICTURE X.                                           
           02  UZVZ25I  PIC X(1).                                               
           02  TBEIZ25L    COMP  PIC  S9(4).                                    
           02  TBEIZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TBEIZ25F.                                       
             03 TBEIZ25A    PICTURE X.                                          
           02  TBEIZ25I  PIC X(16).                                             
           02  BEITZ25L    COMP  PIC  S9(4).                                    
           02  BEITZ25F    PICTURE X.                                           
           02  FILLER REDEFINES BEITZ25F.                                       
             03 BEITZ25A    PICTURE X.                                          
           02  BEITZ25I  PIC X(9).                                              
           02  ZAWZ25L    COMP  PIC  S9(4).                                     
           02  ZAWZ25F    PICTURE X.                                            
           02  FILLER REDEFINES ZAWZ25F.                                        
             03 ZAWZ25A    PICTURE X.                                           
           02  ZAWZ25I  PIC X(1).                                               
           02  PROZ25L    COMP  PIC  S9(4).                                     
           02  PROZ25F    PICTURE X.                                            
           02  FILLER REDEFINES PROZ25F.                                        
             03 PROZ25A    PICTURE X.                                           
           02  PROZ25I  PIC X(8).                                               
           02  AEZ25L    COMP  PIC  S9(4).                                      
           02  AEZ25F    PICTURE X.                                             
           02  FILLER REDEFINES AEZ25F.                                         
             03 AEZ25A    PICTURE X.                                            
           02  AEZ25I  PIC X(8).                                                
           02  AARTZ25L    COMP  PIC  S9(4).                                    
           02  AARTZ25F    PICTURE X.                                           
           02  FILLER REDEFINES AARTZ25F.                                       
             03 AARTZ25A    PICTURE X.                                          
           02  AARTZ25I  PIC X(1).                                              
           02  ADATZ25L    COMP  PIC  S9(4).                                    
           02  ADATZ25F    PICTURE X.                                           
           02  FILLER REDEFINES ADATZ25F.                                       
             03 ADATZ25A    PICTURE X.                                          
           02  ADATZ25I  PIC X(8).                                              
           02  EDATZ25L    COMP  PIC  S9(4).                                    
           02  EDATZ25F    PICTURE X.                                           
           02  FILLER REDEFINES EDATZ25F.                                       
             03 EDATZ25A    PICTURE X.                                          
           02  EDATZ25I  PIC X(8).                                              
           02  STAZ125L    COMP  PIC  S9(4).                                    
           02  STAZ125F    PICTURE X.                                           
           02  FILLER REDEFINES STAZ125F.                                       
             03 STAZ125A    PICTURE X.                                          
           02  STAZ125I  PIC X(2).                                              
           02  SDAZ125L    COMP  PIC  S9(4).                                    
           02  SDAZ125F    PICTURE X.                                           
           02  FILLER REDEFINES SDAZ125F.                                       
             03 SDAZ125A    PICTURE X.                                          
           02  SDAZ125I  PIC X(8).                                              
           02  STAZ225L    COMP  PIC  S9(4).                                    
           02  STAZ225F    PICTURE X.                                           
           02  FILLER REDEFINES STAZ225F.                                       
             03 STAZ225A    PICTURE X.                                          
           02  STAZ225I  PIC X(2).                                              
           02  SDAZ225L    COMP  PIC  S9(4).                                    
           02  SDAZ225F    PICTURE X.                                           
           02  FILLER REDEFINES SDAZ225F.                                       
             03 SDAZ225A    PICTURE X.                                          
           02  SDAZ225I  PIC X(8).                                              
           02  STAZ325L    COMP  PIC  S9(4).                                    
           02  STAZ325F    PICTURE X.                                           
           02  FILLER REDEFINES STAZ325F.                                       
             03 STAZ325A    PICTURE X.                                          
           02  STAZ325I  PIC X(2).                                              
           02  SDAZ325L    COMP  PIC  S9(4).                                    
           02  SDAZ325F    PICTURE X.                                           
           02  FILLER REDEFINES SDAZ325F.                                       
             03 SDAZ325A    PICTURE X.                                          
           02  SDAZ325I  PIC X(8).                                              
           02  VBNEZ25L    COMP  PIC  S9(4).                                    
           02  VBNEZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VBNEZ25F.                                       
             03 VBNEZ25A    PICTURE X.                                          
           02  VBNEZ25I  PIC X(7).                                              
           02  GESEZ25L    COMP  PIC  S9(4).                                    
           02  GESEZ25F    PICTURE X.                                           
           02  FILLER REDEFINES GESEZ25F.                                       
             03 GESEZ25A    PICTURE X.                                          
           02  GESEZ25I  PIC X(2).                                              
           02  VNREZ25L    COMP  PIC  S9(4).                                    
           02  VNREZ25F    PICTURE X.                                           
           02  FILLER REDEFINES VNREZ25F.                                       
             03 VNREZ25A    PICTURE X.                                          
           02  VNREZ25I  PIC 9(15).                                             
           02  NAMEZ25L    COMP  PIC  S9(4).                                    
           02  NAMEZ25F    PICTURE X.                                           
           02  FILLER REDEFINES NAMEZ25F.                                       
             03 NAMEZ25A    PICTURE X.                                          
           02  NAMEZ25I  PIC X(8).                                              
           02  TRAEZ25L    COMP  PIC  S9(4).                                    
           02  TRAEZ25F    PICTURE X.                                           
           02  FILLER REDEFINES TRAEZ25F.                                       
             03 TRAEZ25A    PICTURE X.                                          
           02  TRAEZ25I  PIC X(4).                                              
           02  FEHLZ25L    COMP  PIC  S9(4).                                    
           02  FEHLZ25F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLZ25F.                                       
             03 FEHLZ25A    PICTURE X.                                          
           02  FEHLZ25I  PIC X(79).                                             
       01  UA909O REDEFINES UA909I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRZ25O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATZ25O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHRZ25O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  GESZ25O  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRZ25O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPZZ25O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNRZ25O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMPZZ25O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRZ25O  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  TIVNZ25O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  IVNRZ25O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  IVPZZ25O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNAZ25O  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBNAZ25O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRAZ25O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANREZ25O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUNAZ25O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  VONAZ25O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  PLZZ25O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORTZ25O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSLZ25O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TTARZ25O  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  TARIZ25O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  GEBDZ25O PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  SUMMZ25O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBEGZ25O  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  BEGIZ25O PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  DAUEZ25O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBUZZ25O  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  DYNAZ25O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  BUZZ25O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  UZVZ25O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBEIZ25O  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  BEITZ25O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZAWZ25O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROZ25O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  AEZ25O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AARTZ25O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATZ25O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDATZ25O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAZ125O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  SDAZ125O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAZ225O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  SDAZ225O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAZ325O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  SDAZ325O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNEZ25O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  GESEZ25O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNREZ25O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  NAMEZ25O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TRAEZ25O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLZ25O  PIC X(79).                                             
