       01  UA910I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRZ15L    COMP  PIC  S9(4).                                     
           02  PNRZ15F    PICTURE X.                                            
           02  FILLER REDEFINES PNRZ15F.                                        
             03 PNRZ15A    PICTURE X.                                           
           02  PNRZ15I  PIC X(7).                                               
           02  DATZ15L    COMP  PIC  S9(4).                                     
           02  DATZ15F    PICTURE X.                                            
           02  FILLER REDEFINES DATZ15F.                                        
             03 DATZ15A    PICTURE X.                                           
           02  DATZ15I  PIC X(8).                                               
           02  UHRZ15L    COMP  PIC  S9(4).                                     
           02  UHRZ15F    PICTURE X.                                            
           02  FILLER REDEFINES UHRZ15F.                                        
             03 UHRZ15A    PICTURE X.                                           
           02  UHRZ15I  PIC X(5).                                               
           02  GESZ15L    COMP  PIC  S9(4).                                     
           02  GESZ15F    PICTURE X.                                            
           02  FILLER REDEFINES GESZ15F.                                        
             03 GESZ15A    PICTURE X.                                           
           02  GESZ15I  PIC X(28).                                              
           02  VBNRZ15L    COMP  PIC  S9(4).                                    
           02  VBNRZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRZ15F.                                       
             03 VBNRZ15A    PICTURE X.                                          
           02  VBNRZ15I  PIC X(7).                                              
           02  VBPZZ15L    COMP  PIC  S9(4).                                    
           02  VBPZZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VBPZZ15F.                                       
             03 VBPZZ15A    PICTURE X.                                          
           02  VBPZZ15I  PIC X(1).                                              
           02  VMNRZ15L    COMP  PIC  S9(4).                                    
           02  VMNRZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VMNRZ15F.                                       
             03 VMNRZ15A    PICTURE X.                                          
           02  VMNRZ15I  PIC X(7).                                              
           02  VMPZZ15L    COMP  PIC  S9(4).                                    
           02  VMPZZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VMPZZ15F.                                       
             03 VMPZZ15A    PICTURE X.                                          
           02  VMPZZ15I  PIC X(1).                                              
           02  VNRZ15L    COMP  PIC  S9(4).                                     
           02  VNRZ15F    PICTURE X.                                            
           02  FILLER REDEFINES VNRZ15F.                                        
             03 VNRZ15A    PICTURE X.                                           
           02  VNRZ15I  PIC X(12).                                              
           02  TIVNZ15L    COMP  PIC  S9(4).                                    
           02  TIVNZ15F    PICTURE X.                                           
           02  FILLER REDEFINES TIVNZ15F.                                       
             03 TIVNZ15A    PICTURE X.                                          
           02  TIVNZ15I  PIC X(10).                                             
           02  IVNRZ15L    COMP  PIC  S9(4).                                    
           02  IVNRZ15F    PICTURE X.                                           
           02  FILLER REDEFINES IVNRZ15F.                                       
             03 IVNRZ15A    PICTURE X.                                          
           02  IVNRZ15I  PIC X(7).                                              
           02  IVPZZ15L    COMP  PIC  S9(4).                                    
           02  IVPZZ15F    PICTURE X.                                           
           02  FILLER REDEFINES IVPZZ15F.                                       
             03 IVPZZ15A    PICTURE X.                                          
           02  IVPZZ15I  PIC X(2).                                              
           02  TVNAZ15L    COMP  PIC  S9(4).                                    
           02  TVNAZ15F    PICTURE X.                                           
           02  FILLER REDEFINES TVNAZ15F.                                       
             03 TVNAZ15A    PICTURE X.                                          
           02  TVNAZ15I  PIC X(19).                                             
           02  VBNAZ15L    COMP  PIC  S9(4).                                    
           02  VBNAZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VBNAZ15F.                                       
             03 VBNAZ15A    PICTURE X.                                          
           02  VBNAZ15I  PIC X(7).                                              
           02  VNRAZ15L    COMP  PIC  S9(4).                                    
           02  VNRAZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VNRAZ15F.                                       
             03 VNRAZ15A    PICTURE X.                                          
           02  VNRAZ15I  PIC X(15).                                             
           02  ANREZ15L    COMP  PIC  S9(4).                                    
           02  ANREZ15F    PICTURE X.                                           
           02  FILLER REDEFINES ANREZ15F.                                       
             03 ANREZ15A    PICTURE X.                                          
           02  ANREZ15I  PIC X(9).                                              
           02  ZUNAZ15L    COMP  PIC  S9(4).                                    
           02  ZUNAZ15F    PICTURE X.                                           
           02  FILLER REDEFINES ZUNAZ15F.                                       
             03 ZUNAZ15A    PICTURE X.                                          
           02  ZUNAZ15I  PIC X(26).                                             
           02  VONAZ15L    COMP  PIC  S9(4).                                    
           02  VONAZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VONAZ15F.                                       
             03 VONAZ15A    PICTURE X.                                          
           02  VONAZ15I  PIC X(26).                                             
           02  PLZZ15L    COMP  PIC  S9(4).                                     
           02  PLZZ15F    PICTURE X.                                            
           02  FILLER REDEFINES PLZZ15F.                                        
             03 PLZZ15A    PICTURE X.                                           
           02  PLZZ15I  PIC X(5).                                               
           02  ORTZ15L    COMP  PIC  S9(4).                                     
           02  ORTZ15F    PICTURE X.                                            
           02  FILLER REDEFINES ORTZ15F.                                        
             03 ORTZ15A    PICTURE X.                                           
           02  ORTZ15I  PIC X(21).                                              
           02  AUSLZ15L    COMP  PIC  S9(4).                                    
           02  AUSLZ15F    PICTURE X.                                           
           02  FILLER REDEFINES AUSLZ15F.                                       
             03 AUSLZ15A    PICTURE X.                                          
           02  AUSLZ15I  PIC X(3).                                              
           02  TBEGZ15L    COMP  PIC  S9(4).                                    
           02  TBEGZ15F    PICTURE X.                                           
           02  FILLER REDEFINES TBEGZ15F.                                       
             03 TBEGZ15A    PICTURE X.                                          
           02  TBEGZ15I  PIC X(16).                                             
           02  BEGIZ15L    COMP  PIC  S9(4).                                    
           02  BEGIZ15F    PICTURE X.                                           
           02  FILLER REDEFINES BEGIZ15F.                                       
             03 BEGIZ15A    PICTURE X.                                          
           02  BEGIZ15I  PIC X(8).                                              
           02  ABLAZ15L    COMP  PIC  S9(4).                                    
           02  ABLAZ15F    PICTURE X.                                           
           02  FILLER REDEFINES ABLAZ15F.                                       
             03 ABLAZ15A    PICTURE X.                                          
           02  ABLAZ15I  PIC X(8).                                              
           02  ZAWZ15L    COMP  PIC  S9(4).                                     
           02  ZAWZ15F    PICTURE X.                                            
           02  FILLER REDEFINES ZAWZ15F.                                        
             03 ZAWZ15A    PICTURE X.                                           
           02  ZAWZ15I  PIC X(1).                                               
           02  TPRZ115L    COMP  PIC  S9(4).                                    
           02  TPRZ115F    PICTURE X.                                           
           02  FILLER REDEFINES TPRZ115F.                                       
             03 TPRZ115A    PICTURE X.                                          
           02  TPRZ115I  PIC X(15).                                             
           02  PROZ115L    COMP  PIC  S9(4).                                    
           02  PROZ115F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ115F.                                       
             03 PROZ115A    PICTURE X.                                          
           02  PROZ115I  PIC X(2).                                              
           02  BEIZ115L    COMP  PIC  S9(4).                                    
           02  BEIZ115F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ115F.                                       
             03 BEIZ115A    PICTURE X.                                          
           02  BEIZ115I  PIC X(9).                                              
           02  PROZ215L    COMP  PIC  S9(4).                                    
           02  PROZ215F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ215F.                                       
             03 PROZ215A    PICTURE X.                                          
           02  PROZ215I  PIC X(2).                                              
           02  BEIZ215L    COMP  PIC  S9(4).                                    
           02  BEIZ215F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ215F.                                       
             03 BEIZ215A    PICTURE X.                                          
           02  BEIZ215I  PIC X(9).                                              
           02  TPRZ215L    COMP  PIC  S9(4).                                    
           02  TPRZ215F    PICTURE X.                                           
           02  FILLER REDEFINES TPRZ215F.                                       
             03 TPRZ215A    PICTURE X.                                          
           02  TPRZ215I  PIC X(15).                                             
           02  PROZ315L    COMP  PIC  S9(4).                                    
           02  PROZ315F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ315F.                                       
             03 PROZ315A    PICTURE X.                                          
           02  PROZ315I  PIC X(2).                                              
           02  BEIZ315L    COMP  PIC  S9(4).                                    
           02  BEIZ315F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ315F.                                       
             03 BEIZ315A    PICTURE X.                                          
           02  BEIZ315I  PIC X(9).                                              
           02  PROZ415L    COMP  PIC  S9(4).                                    
           02  PROZ415F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ415F.                                       
             03 PROZ415A    PICTURE X.                                          
           02  PROZ415I  PIC X(2).                                              
           02  BEIZ415L    COMP  PIC  S9(4).                                    
           02  BEIZ415F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ415F.                                       
             03 BEIZ415A    PICTURE X.                                          
           02  BEIZ415I  PIC X(9).                                              
           02  TPRZ315L    COMP  PIC  S9(4).                                    
           02  TPRZ315F    PICTURE X.                                           
           02  FILLER REDEFINES TPRZ315F.                                       
             03 TPRZ315A    PICTURE X.                                          
           02  TPRZ315I  PIC X(15).                                             
           02  PROZ515L    COMP  PIC  S9(4).                                    
           02  PROZ515F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ515F.                                       
             03 PROZ515A    PICTURE X.                                          
           02  PROZ515I  PIC X(2).                                              
           02  BEIZ515L    COMP  PIC  S9(4).                                    
           02  BEIZ515F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ515F.                                       
             03 BEIZ515A    PICTURE X.                                          
           02  BEIZ515I  PIC X(9).                                              
           02  PROZ615L    COMP  PIC  S9(4).                                    
           02  PROZ615F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ615F.                                       
             03 PROZ615A    PICTURE X.                                          
           02  PROZ615I  PIC X(2).                                              
           02  BEIZ615L    COMP  PIC  S9(4).                                    
           02  BEIZ615F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ615F.                                       
             03 BEIZ615A    PICTURE X.                                          
           02  BEIZ615I  PIC X(9).                                              
           02  TPRZ415L    COMP  PIC  S9(4).                                    
           02  TPRZ415F    PICTURE X.                                           
           02  FILLER REDEFINES TPRZ415F.                                       
             03 TPRZ415A    PICTURE X.                                          
           02  TPRZ415I  PIC X(15).                                             
           02  PROZ715L    COMP  PIC  S9(4).                                    
           02  PROZ715F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ715F.                                       
             03 PROZ715A    PICTURE X.                                          
           02  PROZ715I  PIC X(2).                                              
           02  BEIZ715L    COMP  PIC  S9(4).                                    
           02  BEIZ715F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ715F.                                       
             03 BEIZ715A    PICTURE X.                                          
           02  BEIZ715I  PIC X(9).                                              
           02  PROZ815L    COMP  PIC  S9(4).                                    
           02  PROZ815F    PICTURE X.                                           
           02  FILLER REDEFINES PROZ815F.                                       
             03 PROZ815A    PICTURE X.                                          
           02  PROZ815I  PIC X(2).                                              
           02  BEIZ815L    COMP  PIC  S9(4).                                    
           02  BEIZ815F    PICTURE X.                                           
           02  FILLER REDEFINES BEIZ815F.                                       
             03 BEIZ815A    PICTURE X.                                          
           02  BEIZ815I  PIC X(9).                                              
           02  AEZ15L    COMP  PIC  S9(4).                                      
           02  AEZ15F    PICTURE X.                                             
           02  FILLER REDEFINES AEZ15F.                                         
             03 AEZ15A    PICTURE X.                                            
           02  AEZ15I  PIC X(8).                                                
           02  AARTZ15L    COMP  PIC  S9(4).                                    
           02  AARTZ15F    PICTURE X.                                           
           02  FILLER REDEFINES AARTZ15F.                                       
             03 AARTZ15A    PICTURE X.                                          
           02  AARTZ15I  PIC X(1).                                              
           02  ADATZ15L    COMP  PIC  S9(4).                                    
           02  ADATZ15F    PICTURE X.                                           
           02  FILLER REDEFINES ADATZ15F.                                       
             03 ADATZ15A    PICTURE X.                                          
           02  ADATZ15I  PIC X(8).                                              
           02  EDATZ15L    COMP  PIC  S9(4).                                    
           02  EDATZ15F    PICTURE X.                                           
           02  FILLER REDEFINES EDATZ15F.                                       
             03 EDATZ15A    PICTURE X.                                          
           02  EDATZ15I  PIC X(8).                                              
           02  STAZ115L    COMP  PIC  S9(4).                                    
           02  STAZ115F    PICTURE X.                                           
           02  FILLER REDEFINES STAZ115F.                                       
             03 STAZ115A    PICTURE X.                                          
           02  STAZ115I  PIC X(2).                                              
           02  SDAZ115L    COMP  PIC  S9(4).                                    
           02  SDAZ115F    PICTURE X.                                           
           02  FILLER REDEFINES SDAZ115F.                                       
             03 SDAZ115A    PICTURE X.                                          
           02  SDAZ115I  PIC X(8).                                              
           02  STAZ215L    COMP  PIC  S9(4).                                    
           02  STAZ215F    PICTURE X.                                           
           02  FILLER REDEFINES STAZ215F.                                       
             03 STAZ215A    PICTURE X.                                          
           02  STAZ215I  PIC X(2).                                              
           02  SDAZ215L    COMP  PIC  S9(4).                                    
           02  SDAZ215F    PICTURE X.                                           
           02  FILLER REDEFINES SDAZ215F.                                       
             03 SDAZ215A    PICTURE X.                                          
           02  SDAZ215I  PIC X(8).                                              
           02  STAZ315L    COMP  PIC  S9(4).                                    
           02  STAZ315F    PICTURE X.                                           
           02  FILLER REDEFINES STAZ315F.                                       
             03 STAZ315A    PICTURE X.                                          
           02  STAZ315I  PIC X(2).                                              
           02  SDAZ315L    COMP  PIC  S9(4).                                    
           02  SDAZ315F    PICTURE X.                                           
           02  FILLER REDEFINES SDAZ315F.                                       
             03 SDAZ315A    PICTURE X.                                          
           02  SDAZ315I  PIC X(8).                                              
           02  VBNEZ15L    COMP  PIC  S9(4).                                    
           02  VBNEZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VBNEZ15F.                                       
             03 VBNEZ15A    PICTURE X.                                          
           02  VBNEZ15I  PIC X(7).                                              
           02  GESEZ15L    COMP  PIC  S9(4).                                    
           02  GESEZ15F    PICTURE X.                                           
           02  FILLER REDEFINES GESEZ15F.                                       
             03 GESEZ15A    PICTURE X.                                          
           02  GESEZ15I  PIC X(2).                                              
           02  VNREZ15L    COMP  PIC  S9(4).                                    
           02  VNREZ15F    PICTURE X.                                           
           02  FILLER REDEFINES VNREZ15F.                                       
             03 VNREZ15A    PICTURE X.                                          
           02  VNREZ15I  PIC 9(15).                                             
           02  NAMEZ15L    COMP  PIC  S9(4).                                    
           02  NAMEZ15F    PICTURE X.                                           
           02  FILLER REDEFINES NAMEZ15F.                                       
             03 NAMEZ15A    PICTURE X.                                          
           02  NAMEZ15I  PIC X(8).                                              
           02  TRAEZ15L    COMP  PIC  S9(4).                                    
           02  TRAEZ15F    PICTURE X.                                           
           02  FILLER REDEFINES TRAEZ15F.                                       
             03 TRAEZ15A    PICTURE X.                                          
           02  TRAEZ15I  PIC X(4).                                              
           02  FEHLZ15L    COMP  PIC  S9(4).                                    
           02  FEHLZ15F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLZ15F.                                       
             03 FEHLZ15A    PICTURE X.                                          
           02  FEHLZ15I  PIC X(79).                                             
       01  UA910O REDEFINES UA910I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRZ15O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATZ15O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHRZ15O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  GESZ15O  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRZ15O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPZZ15O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNRZ15O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMPZZ15O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRZ15O  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  TIVNZ15O  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  IVNRZ15O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  IVPZZ15O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVNAZ15O  PIC X(19).                                             
           02  FILLER PICTURE X(3).                                             
           02  VBNAZ15O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNRAZ15O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  ANREZ15O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZUNAZ15O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  VONAZ15O  PIC X(26).                                             
           02  FILLER PICTURE X(3).                                             
           02  PLZZ15O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORTZ15O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSLZ15O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBEGZ15O  PIC X(16).                                             
           02  FILLER PICTURE X(3).                                             
           02  BEGIZ15O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ABLAZ15O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZAWZ15O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPRZ115O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  PROZ115O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ115O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROZ215O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ215O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPRZ215O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  PROZ315O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ315O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROZ415O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ415O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPRZ315O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  PROZ515O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ515O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROZ615O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ615O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPRZ415O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  PROZ715O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ715O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROZ815O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIZ815O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  AEZ15O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  AARTZ15O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATZ15O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  EDATZ15O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAZ115O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  SDAZ115O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAZ215O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  SDAZ215O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAZ315O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  SDAZ315O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNEZ15O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  GESEZ15O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNREZ15O  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  NAMEZ15O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TRAEZ15O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLZ15O  PIC X(79).                                             
