       01  UA926I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS85L    COMP  PIC  S9(4).                                     
           02  PERS85F    PICTURE X.                                            
           02  FILLER REDEFINES PERS85F.                                        
             03 PERS85A    PICTURE X.                                           
           02  PERS85I  PIC X(7).                                               
           02  DATUM85L    COMP  PIC  S9(4).                                    
           02  DATUM85F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM85F.                                       
             03 DATUM85A    PICTURE X.                                          
           02  DATUM85I  PIC X(8).                                              
           02  UHR85L    COMP  PIC  S9(4).                                      
           02  UHR85F    PICTURE X.                                             
           02  FILLER REDEFINES UHR85F.                                         
             03 UHR85A    PICTURE X.                                            
           02  UHR85I  PIC X(5).                                                
           02  GES85L    COMP  PIC  S9(4).                                      
           02  GES85F    PICTURE X.                                             
           02  FILLER REDEFINES GES85F.                                         
             03 GES85A    PICTURE X.                                            
           02  GES85I  PIC X(15).                                               
           02  VBNRA85L    COMP  PIC  S9(4).                                    
           02  VBNRA85F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRA85F.                                       
             03 VBNRA85A    PICTURE X.                                          
           02  VBNRA85I  PIC X(7).                                              
           02  PRZVB85L    COMP  PIC  S9(4).                                    
           02  PRZVB85F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVB85F.                                       
             03 PRZVB85A    PICTURE X.                                          
           02  PRZVB85I  PIC X(1).                                              
           02  DIR85L    COMP  PIC  S9(4).                                      
           02  DIR85F    PICTURE X.                                             
           02  FILLER REDEFINES DIR85F.                                         
             03 DIR85A    PICTURE X.                                            
           02  DIR85I  PIC X(3).                                                
           02  VBNA85L    COMP  PIC  S9(4).                                     
           02  VBNA85F    PICTURE X.                                            
           02  FILLER REDEFINES VBNA85F.                                        
             03 VBNA85A    PICTURE X.                                           
           02  VBNA85I  PIC X(20).                                              
           02  VBVM85L    COMP  PIC  S9(4).                                     
           02  VBVM85F    PICTURE X.                                            
           02  FILLER REDEFINES VBVM85F.                                        
             03 VBVM85A    PICTURE X.                                           
           02  VBVM85I  PIC X(7).                                               
           02  PRZVM85L    COMP  PIC  S9(4).                                    
           02  PRZVM85F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVM85F.                                       
             03 PRZVM85A    PICTURE X.                                          
           02  PRZVM85I  PIC X(1).                                              
           02  VMNA85L    COMP  PIC  S9(4).                                     
           02  VMNA85F    PICTURE X.                                            
           02  FILLER REDEFINES VMNA85F.                                        
             03 VMNA85A    PICTURE X.                                           
           02  VMNA85I  PIC X(20).                                              
           02  TVT85L    COMP  PIC  S9(4).                                      
           02  TVT85F    PICTURE X.                                             
           02  FILLER REDEFINES TVT85F.                                         
             03 TVT85A    PICTURE X.                                            
           02  TVT85I  PIC X(10).                                               
           02  VNR185L    COMP  PIC  S9(4).                                     
           02  VNR185F    PICTURE X.                                            
           02  FILLER REDEFINES VNR185F.                                        
             03 VNR185A    PICTURE X.                                           
           02  VNR185I  PIC X(3).                                               
           02  VNR285L    COMP  PIC  S9(4).                                     
           02  VNR285F    PICTURE X.                                            
           02  FILLER REDEFINES VNR285F.                                        
             03 VNR285A    PICTURE X.                                           
           02  VNR285I  PIC X(7).                                               
           02  PRZ85L    COMP  PIC  S9(4).                                      
           02  PRZ85F    PICTURE X.                                             
           02  FILLER REDEFINES PRZ85F.                                         
             03 PRZ85A    PICTURE X.                                            
           02  PRZ85I  PIC X(2).                                                
           02  TAN85L    COMP  PIC  S9(4).                                      
           02  TAN85F    PICTURE X.                                             
           02  FILLER REDEFINES TAN85F.                                         
             03 TAN85A    PICTURE X.                                            
           02  TAN85I  PIC X(6).                                                
           02  ANRE85L    COMP  PIC  S9(4).                                     
           02  ANRE85F    PICTURE X.                                            
           02  FILLER REDEFINES ANRE85F.                                        
             03 ANRE85A    PICTURE X.                                           
           02  ANRE85I  PIC X(9).                                               
           02  TZU85L    COMP  PIC  S9(4).                                      
           02  TZU85F    PICTURE X.                                             
           02  FILLER REDEFINES TZU85F.                                         
             03 TZU85A    PICTURE X.                                            
           02  TZU85I  PIC X(6).                                                
           02  ZNAME85L    COMP  PIC  S9(4).                                    
           02  ZNAME85F    PICTURE X.                                           
           02  FILLER REDEFINES ZNAME85F.                                       
             03 ZNAME85A    PICTURE X.                                          
           02  ZNAME85I  PIC X(28).                                             
           02  TVOR85L    COMP  PIC  S9(4).                                     
           02  TVOR85F    PICTURE X.                                            
           02  FILLER REDEFINES TVOR85F.                                        
             03 TVOR85A    PICTURE X.                                           
           02  TVOR85I  PIC X(7).                                               
           02  VNAME85L    COMP  PIC  S9(4).                                    
           02  VNAME85F    PICTURE X.                                           
           02  FILLER REDEFINES VNAME85F.                                       
             03 VNAME85A    PICTURE X.                                          
           02  VNAME85I  PIC X(28).                                             
           02  TPLZA85L    COMP  PIC  S9(4).                                    
           02  TPLZA85F    PICTURE X.                                           
           02  FILLER REDEFINES TPLZA85F.                                       
             03 TPLZA85A    PICTURE X.                                          
           02  TPLZA85I  PIC X(3).                                              
           02  TORTA85L    COMP  PIC  S9(4).                                    
           02  TORTA85F    PICTURE X.                                           
           02  FILLER REDEFINES TORTA85F.                                       
             03 TORTA85A    PICTURE X.                                          
           02  TORTA85I  PIC X(7).                                              
           02  TAUSL85L    COMP  PIC  S9(4).                                    
           02  TAUSL85F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSL85F.                                       
             03 TAUSL85A    PICTURE X.                                          
           02  TAUSL85I  PIC X(4).                                              
           02  PLZA85L    COMP  PIC  S9(4).                                     
           02  PLZA85F    PICTURE X.                                            
           02  FILLER REDEFINES PLZA85F.                                        
             03 PLZA85A    PICTURE X.                                           
           02  PLZA85I  PIC X(5).                                               
           02  ORTA85L    COMP  PIC  S9(4).                                     
           02  ORTA85F    PICTURE X.                                            
           02  FILLER REDEFINES ORTA85F.                                        
             03 ORTA85A    PICTURE X.                                           
           02  ORTA85I  PIC X(21).                                              
           02  AUSL85L    COMP  PIC  S9(4).                                     
           02  AUSL85F    PICTURE X.                                            
           02  FILLER REDEFINES AUSL85F.                                        
             03 AUSL85A    PICTURE X.                                           
           02  AUSL85I  PIC X(3).                                               
           02  TZW85L    COMP  PIC  S9(4).                                      
           02  TZW85F    PICTURE X.                                             
           02  FILLER REDEFINES TZW85F.                                         
             03 TZW85A    PICTURE X.                                            
           02  TZW85I  PIC X(9).                                                
           02  ZW85L    COMP  PIC  S9(4).                                       
           02  ZW85F    PICTURE X.                                              
           02  FILLER REDEFINES ZW85F.                                          
             03 ZW85A    PICTURE X.                                             
           02  ZW85I  PIC X(1).                                                 
           02  TPROD85L    COMP  PIC  S9(4).                                    
           02  TPROD85F    PICTURE X.                                           
           02  FILLER REDEFINES TPROD85F.                                       
             03 TPROD85A    PICTURE X.                                          
           02  TPROD85I  PIC X(7).                                              
           02  PRODU85L    COMP  PIC  S9(4).                                    
           02  PRODU85F    PICTURE X.                                           
           02  FILLER REDEFINES PRODU85F.                                       
             03 PRODU85A    PICTURE X.                                          
           02  PRODU85I  PIC X(2).                                              
           02  TBEIT85L    COMP  PIC  S9(4).                                    
           02  TBEIT85F    PICTURE X.                                           
           02  FILLER REDEFINES TBEIT85F.                                       
             03 TBEIT85A    PICTURE X.                                          
           02  TBEIT85I  PIC X(12).                                             
           02  BEIT85L    COMP  PIC  S9(4).                                     
           02  BEIT85F    PICTURE X.                                            
           02  FILLER REDEFINES BEIT85F.                                        
             03 BEIT85A    PICTURE X.                                           
           02  BEIT85I  PIC X(7).                                               
           02  TSUMM85L    COMP  PIC  S9(4).                                    
           02  TSUMM85F    PICTURE X.                                           
           02  FILLER REDEFINES TSUMM85F.                                       
             03 TSUMM85A    PICTURE X.                                          
           02  TSUMM85I  PIC X(12).                                             
           02  SUMM85L    COMP  PIC  S9(4).                                     
           02  SUMM85F    PICTURE X.                                            
           02  FILLER REDEFINES SUMM85F.                                        
             03 SUMM85A    PICTURE X.                                           
           02  SUMM85I  PIC X(7).                                               
           02  TART85L    COMP  PIC  S9(4).                                     
           02  TART85F    PICTURE X.                                            
           02  FILLER REDEFINES TART85F.                                        
             03 TART85A    PICTURE X.                                           
           02  TART85I  PIC X(10).                                              
           02  ANART85L    COMP  PIC  S9(4).                                    
           02  ANART85F    PICTURE X.                                           
           02  FILLER REDEFINES ANART85F.                                       
             03 ANART85A    PICTURE X.                                          
           02  ANART85I  PIC X(1).                                              
           02  TAND85L    COMP  PIC  S9(4).                                     
           02  TAND85F    PICTURE X.                                            
           02  FILLER REDEFINES TAND85F.                                        
             03 TAND85A    PICTURE X.                                           
           02  TAND85I  PIC X(17).                                              
           02  ANDAT85L    COMP  PIC  S9(4).                                    
           02  ANDAT85F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT85F.                                       
             03 ANDAT85A    PICTURE X.                                          
           02  ANDAT85I  PIC X(6).                                              
           02  TERD85L    COMP  PIC  S9(4).                                     
           02  TERD85F    PICTURE X.                                            
           02  FILLER REDEFINES TERD85F.                                        
             03 TERD85A    PICTURE X.                                           
           02  TERD85I  PIC X(17).                                              
           02  ERFD85L    COMP  PIC  S9(4).                                     
           02  ERFD85F    PICTURE X.                                            
           02  FILLER REDEFINES ERFD85F.                                        
             03 ERFD85A    PICTURE X.                                           
           02  ERFD85I  PIC X(6).                                               
           02  TSTT85L    COMP  PIC  S9(4).                                     
           02  TSTT85F    PICTURE X.                                            
           02  FILLER REDEFINES TSTT85F.                                        
             03 TSTT85A    PICTURE X.                                           
           02  TSTT85I  PIC X(17).                                              
           02  STTD85L    COMP  PIC  S9(4).                                     
           02  STTD85F    PICTURE X.                                            
           02  FILLER REDEFINES STTD85F.                                        
             03 STTD85A    PICTURE X.                                           
           02  STTD85I  PIC X(6).                                               
           02  TSTAT85L    COMP  PIC  S9(4).                                    
           02  TSTAT85F    PICTURE X.                                           
           02  FILLER REDEFINES TSTAT85F.                                       
             03 TSTAT85A    PICTURE X.                                          
           02  TSTAT85I  PIC X(17).                                             
           02  STAT85L    COMP  PIC  S9(4).                                     
           02  STAT85F    PICTURE X.                                            
           02  FILLER REDEFINES STAT85F.                                        
             03 STAT85A    PICTURE X.                                           
           02  STAT85I  PIC X(2).                                               
           02  TEING85L    COMP  PIC  S9(4).                                    
           02  TEING85F    PICTURE X.                                           
           02  FILLER REDEFINES TEING85F.                                       
             03 TEING85A    PICTURE X.                                          
           02  TEING85I  PIC X(46).                                             
           02  EING85L    COMP  PIC  S9(4).                                     
           02  EING85F    PICTURE X.                                            
           02  FILLER REDEFINES EING85F.                                        
             03 EING85A    PICTURE X.                                           
           02  EING85I  PIC X(1).                                               
           02  FEHL85L    COMP  PIC  S9(4).                                     
           02  FEHL85F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL85F.                                        
             03 FEHL85A    PICTURE X.                                           
           02  FEHL85I  PIC X(78).                                              
       01  UA926O REDEFINES UA926I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS85O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATUM85O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR85O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  GES85O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA85O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVB85O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIR85O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNA85O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBVM85O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVM85O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNA85O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVT85O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR185O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR285O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZ85O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAN85O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRE85O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZU85O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZNAME85O  PIC X(28).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVOR85O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNAME85O  PIC X(28).                                             
           02  FILLER PICTURE X(3).                                             
           02  TPLZA85O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TORTA85O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAUSL85O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZA85O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORTA85O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSL85O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZW85O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZW85O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TPROD85O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODU85O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBEIT85O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  BEIT85O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSUMM85O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  SUMM85O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  TART85O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART85O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAND85O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANDAT85O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TERD85O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERFD85O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTT85O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  STTD85O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTAT85O  PIC X(17).                                             
           02  FILLER PICTURE X(3).                                             
           02  STAT85O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEING85O  PIC X(46).                                             
           02  FILLER PICTURE X(3).                                             
           02  EING85O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL85O  PIC X(78).                                              
