       01  UA932I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERSNR0L    COMP  PIC  S9(4).                                    
           02  PERSNR0F    PICTURE X.                                           
           02  FILLER REDEFINES PERSNR0F.                                       
             03 PERSNR0A    PICTURE X.                                          
           02  PERSNR0I  PIC X(7).                                              
           02  DAT0L    COMP  PIC  S9(4).                                       
           02  DAT0F    PICTURE X.                                              
           02  FILLER REDEFINES DAT0F.                                          
             03 DAT0A    PICTURE X.                                             
           02  DAT0I  PIC X(8).                                                 
           02  UHR0L    COMP  PIC  S9(4).                                       
           02  UHR0F    PICTURE X.                                              
           02  FILLER REDEFINES UHR0F.                                          
             03 UHR0A    PICTURE X.                                             
           02  UHR0I  PIC X(5).                                                 
           02  TGES0L    COMP  PIC  S9(4).                                      
           02  TGES0F    PICTURE X.                                             
           02  FILLER REDEFINES TGES0F.                                         
             03 TGES0A    PICTURE X.                                            
           02  TGES0I  PIC X(27).                                               
           02  VBNR0L    COMP  PIC  S9(4).                                      
           02  VBNR0F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR0F.                                         
             03 VBNR0A    PICTURE X.                                            
           02  VBNR0I  PIC X(7).                                                
           02  VPRZ0L    COMP  PIC  S9(4).                                      
           02  VPRZ0F    PICTURE X.                                             
           02  FILLER REDEFINES VPRZ0F.                                         
             03 VPRZ0A    PICTURE X.                                            
           02  VPRZ0I  PIC X(1).                                                
           02  VM0L    COMP  PIC  S9(4).                                        
           02  VM0F    PICTURE X.                                               
           02  FILLER REDEFINES VM0F.                                           
             03 VM0A    PICTURE X.                                              
           02  VM0I  PIC X(7).                                                  
           02  VMPRZ0L    COMP  PIC  S9(4).                                     
           02  VMPRZ0F    PICTURE X.                                            
           02  FILLER REDEFINES VMPRZ0F.                                        
             03 VMPRZ0A    PICTURE X.                                           
           02  VMPRZ0I  PIC X(1).                                               
           02  TVNR0L    COMP  PIC  S9(4).                                      
           02  TVNR0F    PICTURE X.                                             
           02  FILLER REDEFINES TVNR0F.                                         
             03 TVNR0A    PICTURE X.                                            
           02  TVNR0I  PIC X(10).                                               
           02  VNRE0L    COMP  PIC  S9(4).                                      
           02  VNRE0F    PICTURE X.                                             
           02  FILLER REDEFINES VNRE0F.                                         
             03 VNRE0A    PICTURE X.                                            
           02  VNRE0I  PIC X(10).                                               
           02  TEXT0L    COMP  PIC  S9(4).                                      
           02  TEXT0F    PICTURE X.                                             
           02  FILLER REDEFINES TEXT0F.                                         
             03 TEXT0A    PICTURE X.                                            
           02  TEXT0I  PIC X(8).                                                
           02  VNR0L    COMP  PIC  S9(4).                                       
           02  VNR0F    PICTURE X.                                              
           02  FILLER REDEFINES VNR0F.                                          
             03 VNR0A    PICTURE X.                                             
           02  VNR0I  PIC X(7).                                                 
           02  TVNRN0L    COMP  PIC  S9(4).                                     
           02  TVNRN0F    PICTURE X.                                            
           02  FILLER REDEFINES TVNRN0F.                                        
             03 TVNRN0A    PICTURE X.                                           
           02  TVNRN0I  PIC X(17).                                              
           02  VBNRN0L    COMP  PIC  S9(4).                                     
           02  VBNRN0F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRN0F.                                        
             03 VBNRN0A    PICTURE X.                                           
           02  VBNRN0I  PIC X(7).                                               
           02  VNRN0L    COMP  PIC  S9(4).                                      
           02  VNRN0F    PICTURE X.                                             
           02  FILLER REDEFINES VNRN0F.                                         
             03 VNRN0A    PICTURE X.                                            
           02  VNRN0I  PIC X(15).                                               
           02  TANR0L    COMP  PIC  S9(4).                                      
           02  TANR0F    PICTURE X.                                             
           02  FILLER REDEFINES TANR0F.                                         
             03 TANR0A    PICTURE X.                                            
           02  TANR0I  PIC X(6).                                                
           02  ANRE0L    COMP  PIC  S9(4).                                      
           02  ANRE0F    PICTURE X.                                             
           02  FILLER REDEFINES ANRE0F.                                         
             03 ANRE0A    PICTURE X.                                            
           02  ANRE0I  PIC X(9).                                                
           02  ANR0L    COMP  PIC  S9(4).                                       
           02  ANR0F    PICTURE X.                                              
           02  FILLER REDEFINES ANR0F.                                          
             03 ANR0A    PICTURE X.                                             
           02  ANR0I  PIC X(9).                                                 
           02  TZUN0L    COMP  PIC  S9(4).                                      
           02  TZUN0F    PICTURE X.                                             
           02  FILLER REDEFINES TZUN0F.                                         
             03 TZUN0A    PICTURE X.                                            
           02  TZUN0I  PIC X(6).                                                
           02  ZUNE0L    COMP  PIC  S9(4).                                      
           02  ZUNE0F    PICTURE X.                                             
           02  FILLER REDEFINES ZUNE0F.                                         
             03 ZUNE0A    PICTURE X.                                            
           02  ZUNE0I  PIC X(26).                                               
           02  ZUN0L    COMP  PIC  S9(4).                                       
           02  ZUN0F    PICTURE X.                                              
           02  FILLER REDEFINES ZUN0F.                                          
             03 ZUN0A    PICTURE X.                                             
           02  ZUN0I  PIC X(26).                                                
           02  TVNA0L    COMP  PIC  S9(4).                                      
           02  TVNA0F    PICTURE X.                                             
           02  FILLER REDEFINES TVNA0F.                                         
             03 TVNA0A    PICTURE X.                                            
           02  TVNA0I  PIC X(7).                                                
           02  NAE0L    COMP  PIC  S9(4).                                       
           02  NAE0F    PICTURE X.                                              
           02  FILLER REDEFINES NAE0F.                                          
             03 NAE0A    PICTURE X.                                             
           02  NAE0I  PIC X(26).                                                
           02  VNA0L    COMP  PIC  S9(4).                                       
           02  VNA0F    PICTURE X.                                              
           02  FILLER REDEFINES VNA0F.                                          
             03 VNA0A    PICTURE X.                                             
           02  VNA0I  PIC X(26).                                                
           02  TPLZ0L    COMP  PIC  S9(4).                                      
           02  TPLZ0F    PICTURE X.                                             
           02  FILLER REDEFINES TPLZ0F.                                         
             03 TPLZ0A    PICTURE X.                                            
           02  TPLZ0I  PIC X(3).                                                
           02  PLZE0L    COMP  PIC  S9(4).                                      
           02  PLZE0F    PICTURE X.                                             
           02  FILLER REDEFINES PLZE0F.                                         
             03 PLZE0A    PICTURE X.                                            
           02  PLZE0I  PIC X(5).                                                
           02  PLZ0L    COMP  PIC  S9(4).                                       
           02  PLZ0F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ0F.                                          
             03 PLZ0A    PICTURE X.                                             
           02  PLZ0I  PIC X(5).                                                 
           02  TORT0L    COMP  PIC  S9(4).                                      
           02  TORT0F    PICTURE X.                                             
           02  FILLER REDEFINES TORT0F.                                         
             03 TORT0A    PICTURE X.                                            
           02  TORT0I  PIC X(3).                                                
           02  TAUSL0L    COMP  PIC  S9(4).                                     
           02  TAUSL0F    PICTURE X.                                            
           02  FILLER REDEFINES TAUSL0F.                                        
             03 TAUSL0A    PICTURE X.                                           
           02  TAUSL0I  PIC X(4).                                               
           02  ORTE0L    COMP  PIC  S9(4).                                      
           02  ORTE0F    PICTURE X.                                             
           02  FILLER REDEFINES ORTE0F.                                         
             03 ORTE0A    PICTURE X.                                            
           02  ORTE0I  PIC X(21).                                               
           02  AUSLE0L    COMP  PIC  S9(4).                                     
           02  AUSLE0F    PICTURE X.                                            
           02  FILLER REDEFINES AUSLE0F.                                        
             03 AUSLE0A    PICTURE X.                                           
           02  AUSLE0I  PIC X(3).                                               
           02  ORT0L    COMP  PIC  S9(4).                                       
           02  ORT0F    PICTURE X.                                              
           02  FILLER REDEFINES ORT0F.                                          
             03 ORT0A    PICTURE X.                                             
           02  ORT0I  PIC X(21).                                                
           02  AUSL0L    COMP  PIC  S9(4).                                      
           02  AUSL0F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL0F.                                         
             03 AUSL0A    PICTURE X.                                            
           02  AUSL0I  PIC X(3).                                                
           02  TPROD0L    COMP  PIC  S9(4).                                     
           02  TPROD0F    PICTURE X.                                            
           02  FILLER REDEFINES TPROD0F.                                        
             03 TPROD0A    PICTURE X.                                           
           02  TPROD0I  PIC X(14).                                              
           02  PRODE0L    COMP  PIC  S9(4).                                     
           02  PRODE0F    PICTURE X.                                            
           02  FILLER REDEFINES PRODE0F.                                        
             03 PRODE0A    PICTURE X.                                           
           02  PRODE0I  PIC X(2).                                               
           02  PROD0L    COMP  PIC  S9(4).                                      
           02  PROD0F    PICTURE X.                                             
           02  FILLER REDEFINES PROD0F.                                         
             03 PROD0A    PICTURE X.                                            
           02  PROD0I  PIC X(2).                                                
           02  TZW0L    COMP  PIC  S9(4).                                       
           02  TZW0F    PICTURE X.                                              
           02  FILLER REDEFINES TZW0F.                                          
             03 TZW0A    PICTURE X.                                             
           02  TZW0I  PIC X(9).                                                 
           02  ZWE0L    COMP  PIC  S9(4).                                       
           02  ZWE0F    PICTURE X.                                              
           02  FILLER REDEFINES ZWE0F.                                          
             03 ZWE0A    PICTURE X.                                             
           02  ZWE0I  PIC X(1).                                                 
           02  ZW0L    COMP  PIC  S9(4).                                        
           02  ZW0F    PICTURE X.                                               
           02  FILLER REDEFINES ZW0F.                                           
             03 ZW0A    PICTURE X.                                              
           02  ZW0I  PIC X(1).                                                  
           02  TEX0L    COMP  PIC  S9(4).                                       
           02  TEX0F    PICTURE X.                                              
           02  FILLER REDEFINES TEX0F.                                          
             03 TEX0A    PICTURE X.                                             
           02  TEX0I  PIC X(12).                                                
           02  BEITE0L    COMP  PIC  S9(4).                                     
           02  BEITE0F    PICTURE X.                                            
           02  FILLER REDEFINES BEITE0F.                                        
             03 BEITE0A    PICTURE X.                                           
           02  BEITE0I  PIC X(10).                                              
           02  BEIT0L    COMP  PIC  S9(4).                                      
           02  BEIT0F    PICTURE X.                                             
           02  FILLER REDEFINES BEIT0F.                                         
             03 BEIT0A    PICTURE X.                                            
           02  BEIT0I  PIC X(7).                                                
           02  TEX10L    COMP  PIC  S9(4).                                      
           02  TEX10F    PICTURE X.                                             
           02  FILLER REDEFINES TEX10F.                                         
             03 TEX10A    PICTURE X.                                            
           02  TEX10I  PIC X(12).                                               
           02  SUMME0L    COMP  PIC  S9(4).                                     
           02  SUMME0F    PICTURE X.                                            
           02  FILLER REDEFINES SUMME0F.                                        
             03 SUMME0A    PICTURE X.                                           
           02  SUMME0I  PIC X(10).                                              
           02  SUMM0L    COMP  PIC  S9(4).                                      
           02  SUMM0F    PICTURE X.                                             
           02  FILLER REDEFINES SUMM0F.                                         
             03 SUMM0A    PICTURE X.                                            
           02  SUMM0I  PIC X(7).                                                
           02  AE0L    COMP  PIC  S9(4).                                        
           02  AE0F    PICTURE X.                                               
           02  FILLER REDEFINES AE0F.                                           
             03 AE0A    PICTURE X.                                              
           02  AE0I  PIC X(8).                                                  
           02  TAART0L    COMP  PIC  S9(4).                                     
           02  TAART0F    PICTURE X.                                            
           02  FILLER REDEFINES TAART0F.                                        
             03 TAART0A    PICTURE X.                                           
           02  TAART0I  PIC X(10).                                              
           02  AARTE0L    COMP  PIC  S9(4).                                     
           02  AARTE0F    PICTURE X.                                            
           02  FILLER REDEFINES AARTE0F.                                        
             03 AARTE0A    PICTURE X.                                           
           02  AARTE0I  PIC X(1).                                               
           02  AART0L    COMP  PIC  S9(4).                                      
           02  AART0F    PICTURE X.                                             
           02  FILLER REDEFINES AART0F.                                         
             03 AART0A    PICTURE X.                                            
           02  AART0I  PIC X(1).                                                
           02  TADAT0L    COMP  PIC  S9(4).                                     
           02  TADAT0F    PICTURE X.                                            
           02  FILLER REDEFINES TADAT0F.                                        
             03 TADAT0A    PICTURE X.                                           
           02  TADAT0I  PIC X(17).                                              
           02  ADATE0L    COMP  PIC  S9(4).                                     
           02  ADATE0F    PICTURE X.                                            
           02  FILLER REDEFINES ADATE0F.                                        
             03 ADATE0A    PICTURE X.                                           
           02  ADATE0I  PIC X(8).                                               
           02  ADAT0L    COMP  PIC  S9(4).                                      
           02  ADAT0F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT0F.                                         
             03 ADAT0A    PICTURE X.                                            
           02  ADAT0I  PIC X(6).                                                
           02  EDAT0L    COMP  PIC  S9(4).                                      
           02  EDAT0F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT0F.                                         
             03 EDAT0A    PICTURE X.                                            
           02  EDAT0I  PIC X(8).                                                
           02  TASTT0L    COMP  PIC  S9(4).                                     
           02  TASTT0F    PICTURE X.                                            
           02  FILLER REDEFINES TASTT0F.                                        
             03 TASTT0A    PICTURE X.                                           
           02  TASTT0I  PIC X(17).                                              
           02  ASTTE0L    COMP  PIC  S9(4).                                     
           02  ASTTE0F    PICTURE X.                                            
           02  FILLER REDEFINES ASTTE0F.                                        
             03 ASTTE0A    PICTURE X.                                           
           02  ASTTE0I  PIC X(8).                                               
           02  ASTT0L    COMP  PIC  S9(4).                                      
           02  ASTT0F    PICTURE X.                                             
           02  FILLER REDEFINES ASTT0F.                                         
             03 ASTT0A    PICTURE X.                                            
           02  ASTT0I  PIC X(6).                                                
           02  TSTAT0L    COMP  PIC  S9(4).                                     
           02  TSTAT0F    PICTURE X.                                            
           02  FILLER REDEFINES TSTAT0F.                                        
             03 TSTAT0A    PICTURE X.                                           
           02  TSTAT0I  PIC X(17).                                              
           02  STAT10L    COMP  PIC  S9(4).                                     
           02  STAT10F    PICTURE X.                                            
           02  FILLER REDEFINES STAT10F.                                        
             03 STAT10A    PICTURE X.                                           
           02  STAT10I  PIC X(2).                                               
           02  STAT20L    COMP  PIC  S9(4).                                     
           02  STAT20F    PICTURE X.                                            
           02  FILLER REDEFINES STAT20F.                                        
             03 STAT20A    PICTURE X.                                           
           02  STAT20I  PIC X(2).                                               
           02  STAT30L    COMP  PIC  S9(4).                                     
           02  STAT30F    PICTURE X.                                            
           02  FILLER REDEFINES STAT30F.                                        
             03 STAT30A    PICTURE X.                                           
           02  STAT30I  PIC X(2).                                               
           02  STAT0L    COMP  PIC  S9(4).                                      
           02  STAT0F    PICTURE X.                                             
           02  FILLER REDEFINES STAT0F.                                         
             03 STAT0A    PICTURE X.                                            
           02  STAT0I  PIC X(2).                                                
           02  DAT10L    COMP  PIC  S9(4).                                      
           02  DAT10F    PICTURE X.                                             
           02  FILLER REDEFINES DAT10F.                                         
             03 DAT10A    PICTURE X.                                            
           02  DAT10I  PIC X(8).                                                
           02  DAT20L    COMP  PIC  S9(4).                                      
           02  DAT20F    PICTURE X.                                             
           02  FILLER REDEFINES DAT20F.                                         
             03 DAT20A    PICTURE X.                                            
           02  DAT20I  PIC X(8).                                                
           02  DAT30L    COMP  PIC  S9(4).                                      
           02  DAT30F    PICTURE X.                                             
           02  FILLER REDEFINES DAT30F.                                         
             03 DAT30A    PICTURE X.                                            
           02  DAT30I  PIC X(8).                                                
           02  TPR0L    COMP  PIC  S9(4).                                       
           02  TPR0F    PICTURE X.                                              
           02  FILLER REDEFINES TPR0F.                                          
             03 TPR0A    PICTURE X.                                             
           02  TPR0I  PIC X(21).                                                
           02  KZ0L    COMP  PIC  S9(4).                                        
           02  KZ0F    PICTURE X.                                               
           02  FILLER REDEFINES KZ0F.                                           
             03 KZ0A    PICTURE X.                                              
           02  KZ0I  PIC X(1).                                                  
           02  FTEXT0L    COMP  PIC  S9(4).                                     
           02  FTEXT0F    PICTURE X.                                            
           02  FILLER REDEFINES FTEXT0F.                                        
             03 FTEXT0A    PICTURE X.                                           
           02  FTEXT0I  PIC X(78).                                              
       01  UA932O REDEFINES UA932I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERSNR0O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  DAT0O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR0O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TGES0O  PIC X(27).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR0O PIC 9(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VPRZ0O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  VM0O PIC Z(7).                                                   
           02  FILLER PICTURE X(3).                                             
           02  VMPRZ0O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVNR0O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRE0O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEXT0O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR0O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TVNRN0O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRN0O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRN0O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  TANR0O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRE0O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANR0O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TZUN0O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZUNE0O  PIC X(26).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUN0O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVNA0O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NAE0O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNA0O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPLZ0O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZE0O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ0O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TORT0O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAUSL0O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORTE0O  PIC X(21).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLE0O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORT0O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL0O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPROD0O  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODE0O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD0O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TZW0O  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZWE0O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZW0O  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  TEX0O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  BEITE0O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  BEIT0O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEX10O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  SUMME0O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  SUMM0O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE0O  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  TAART0O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  AARTE0O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  AART0O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TADAT0O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  ADATE0O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  ADAT0O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDAT0O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  TASTT0O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTTE0O PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  ASTT0O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSTAT0O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT10O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STAT20O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STAT30O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STAT0O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  DAT10O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  DAT20O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  DAT30O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPR0O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  KZ0O  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  FTEXT0O  PIC X(78).                                              
