       01  UA936I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRAL    COMP  PIC  S9(4).                                       
           02  PNRAF    PICTURE X.                                              
           02  FILLER REDEFINES PNRAF.                                          
             03 PNRAA    PICTURE X.                                             
           02  PNRAI  PIC X(7).                                                 
           02  DATUMAL    COMP  PIC  S9(4).                                     
           02  DATUMAF    PICTURE X.                                            
           02  FILLER REDEFINES DATUMAF.                                        
             03 DATUMAA    PICTURE X.                                           
           02  DATUMAI  PIC X(8).                                               
           02  UHRAL    COMP  PIC  S9(4).                                       
           02  UHRAF    PICTURE X.                                              
           02  FILLER REDEFINES UHRAF.                                          
             03 UHRAA    PICTURE X.                                             
           02  UHRAI  PIC X(5).                                                 
           02  UTXTL    COMP  PIC  S9(4).                                       
           02  UTXTF    PICTURE X.                                              
           02  FILLER REDEFINES UTXTF.                                          
             03 UTXTA    PICTURE X.                                             
           02  UTXTI  PIC X(43).                                                
           02  VBNRAL    COMP  PIC  S9(4).                                      
           02  VBNRAF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRAF.                                         
             03 VBNRAA    PICTURE X.                                            
           02  VBNRAI  PIC X(7).                                                
           02  GESAL    COMP  PIC  S9(4).                                       
           02  GESAF    PICTURE X.                                              
           02  FILLER REDEFINES GESAF.                                          
             03 GESAA    PICTURE X.                                             
           02  GESAI  PIC X(2).                                                 
           02  VNRAL    COMP  PIC  S9(4).                                       
           02  VNRAF    PICTURE X.                                              
           02  FILLER REDEFINES VNRAF.                                          
             03 VNRAA    PICTURE X.                                             
           02  VNRAI  PIC X(15).                                                
           02  VBNRA1L    COMP  PIC  S9(4).                                     
           02  VBNRA1F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA1F.                                        
             03 VBNRA1A    PICTURE X.                                           
           02  VBNRA1I  PIC X(7).                                               
           02  PRZA1L    COMP  PIC  S9(4).                                      
           02  PRZA1F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA1F.                                         
             03 PRZA1A    PICTURE X.                                            
           02  PRZA1I  PIC X(1).                                                
           02  STUFEA1L    COMP  PIC  S9(4).                                    
           02  STUFEA1F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA1F.                                       
             03 STUFEA1A    PICTURE X.                                          
           02  STUFEA1I  PIC X(4).                                              
           02  PROVA1L    COMP  PIC  S9(4).                                     
           02  PROVA1F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA1F.                                        
             03 PROVA1A    PICTURE X.                                           
           02  PROVA1I  PIC X(5).                                               
           02  VBNRAAL    COMP  PIC  S9(4).                                     
           02  VBNRAAF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAAF.                                        
             03 VBNRAAA    PICTURE X.                                           
           02  VBNRAAI  PIC X(7).                                               
           02  PRZAAL    COMP  PIC  S9(4).                                      
           02  PRZAAF    PICTURE X.                                             
           02  FILLER REDEFINES PRZAAF.                                         
             03 PRZAAA    PICTURE X.                                            
           02  PRZAAI  PIC X(1).                                                
           02  STUFEAAL    COMP  PIC  S9(4).                                    
           02  STUFEAAF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEAAF.                                       
             03 STUFEAAA    PICTURE X.                                          
           02  STUFEAAI  PIC X(4).                                              
           02  PROVAAL    COMP  PIC  S9(4).                                     
           02  PROVAAF    PICTURE X.                                            
           02  FILLER REDEFINES PROVAAF.                                        
             03 PROVAAA    PICTURE X.                                           
           02  PROVAAI  PIC X(5).                                               
           02  VBNRA2L    COMP  PIC  S9(4).                                     
           02  VBNRA2F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA2F.                                        
             03 VBNRA2A    PICTURE X.                                           
           02  VBNRA2I  PIC X(7).                                               
           02  PRZA2L    COMP  PIC  S9(4).                                      
           02  PRZA2F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA2F.                                         
             03 PRZA2A    PICTURE X.                                            
           02  PRZA2I  PIC X(1).                                                
           02  STUFEA2L    COMP  PIC  S9(4).                                    
           02  STUFEA2F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA2F.                                       
             03 STUFEA2A    PICTURE X.                                          
           02  STUFEA2I  PIC X(4).                                              
           02  PROVA2L    COMP  PIC  S9(4).                                     
           02  PROVA2F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA2F.                                        
             03 PROVA2A    PICTURE X.                                           
           02  PROVA2I  PIC X(5).                                               
           02  VBNRABL    COMP  PIC  S9(4).                                     
           02  VBNRABF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRABF.                                        
             03 VBNRABA    PICTURE X.                                           
           02  VBNRABI  PIC X(7).                                               
           02  PRZABL    COMP  PIC  S9(4).                                      
           02  PRZABF    PICTURE X.                                             
           02  FILLER REDEFINES PRZABF.                                         
             03 PRZABA    PICTURE X.                                            
           02  PRZABI  PIC X(1).                                                
           02  STUFEABL    COMP  PIC  S9(4).                                    
           02  STUFEABF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEABF.                                       
             03 STUFEABA    PICTURE X.                                          
           02  STUFEABI  PIC X(4).                                              
           02  PROVABL    COMP  PIC  S9(4).                                     
           02  PROVABF    PICTURE X.                                            
           02  FILLER REDEFINES PROVABF.                                        
             03 PROVABA    PICTURE X.                                           
           02  PROVABI  PIC X(5).                                               
           02  VBNRA3L    COMP  PIC  S9(4).                                     
           02  VBNRA3F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA3F.                                        
             03 VBNRA3A    PICTURE X.                                           
           02  VBNRA3I  PIC X(7).                                               
           02  PRZA3L    COMP  PIC  S9(4).                                      
           02  PRZA3F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA3F.                                         
             03 PRZA3A    PICTURE X.                                            
           02  PRZA3I  PIC X(1).                                                
           02  STUFEA3L    COMP  PIC  S9(4).                                    
           02  STUFEA3F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA3F.                                       
             03 STUFEA3A    PICTURE X.                                          
           02  STUFEA3I  PIC X(4).                                              
           02  PROVA3L    COMP  PIC  S9(4).                                     
           02  PROVA3F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA3F.                                        
             03 PROVA3A    PICTURE X.                                           
           02  PROVA3I  PIC X(5).                                               
           02  VBNRACL    COMP  PIC  S9(4).                                     
           02  VBNRACF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRACF.                                        
             03 VBNRACA    PICTURE X.                                           
           02  VBNRACI  PIC X(7).                                               
           02  PRZACL    COMP  PIC  S9(4).                                      
           02  PRZACF    PICTURE X.                                             
           02  FILLER REDEFINES PRZACF.                                         
             03 PRZACA    PICTURE X.                                            
           02  PRZACI  PIC X(1).                                                
           02  STUFEACL    COMP  PIC  S9(4).                                    
           02  STUFEACF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEACF.                                       
             03 STUFEACA    PICTURE X.                                          
           02  STUFEACI  PIC X(4).                                              
           02  PROVACL    COMP  PIC  S9(4).                                     
           02  PROVACF    PICTURE X.                                            
           02  FILLER REDEFINES PROVACF.                                        
             03 PROVACA    PICTURE X.                                           
           02  PROVACI  PIC X(5).                                               
           02  VBNRA4L    COMP  PIC  S9(4).                                     
           02  VBNRA4F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA4F.                                        
             03 VBNRA4A    PICTURE X.                                           
           02  VBNRA4I  PIC X(7).                                               
           02  PRZA4L    COMP  PIC  S9(4).                                      
           02  PRZA4F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA4F.                                         
             03 PRZA4A    PICTURE X.                                            
           02  PRZA4I  PIC X(1).                                                
           02  STUFEA4L    COMP  PIC  S9(4).                                    
           02  STUFEA4F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA4F.                                       
             03 STUFEA4A    PICTURE X.                                          
           02  STUFEA4I  PIC X(4).                                              
           02  PROVA4L    COMP  PIC  S9(4).                                     
           02  PROVA4F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA4F.                                        
             03 PROVA4A    PICTURE X.                                           
           02  PROVA4I  PIC X(5).                                               
           02  VBNRADL    COMP  PIC  S9(4).                                     
           02  VBNRADF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRADF.                                        
             03 VBNRADA    PICTURE X.                                           
           02  VBNRADI  PIC X(7).                                               
           02  PRZADL    COMP  PIC  S9(4).                                      
           02  PRZADF    PICTURE X.                                             
           02  FILLER REDEFINES PRZADF.                                         
             03 PRZADA    PICTURE X.                                            
           02  PRZADI  PIC X(1).                                                
           02  STUFEADL    COMP  PIC  S9(4).                                    
           02  STUFEADF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEADF.                                       
             03 STUFEADA    PICTURE X.                                          
           02  STUFEADI  PIC X(4).                                              
           02  PROVADL    COMP  PIC  S9(4).                                     
           02  PROVADF    PICTURE X.                                            
           02  FILLER REDEFINES PROVADF.                                        
             03 PROVADA    PICTURE X.                                           
           02  PROVADI  PIC X(5).                                               
           02  VBNRA5L    COMP  PIC  S9(4).                                     
           02  VBNRA5F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA5F.                                        
             03 VBNRA5A    PICTURE X.                                           
           02  VBNRA5I  PIC X(7).                                               
           02  PRZA5L    COMP  PIC  S9(4).                                      
           02  PRZA5F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA5F.                                         
             03 PRZA5A    PICTURE X.                                            
           02  PRZA5I  PIC X(1).                                                
           02  STUFEA5L    COMP  PIC  S9(4).                                    
           02  STUFEA5F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA5F.                                       
             03 STUFEA5A    PICTURE X.                                          
           02  STUFEA5I  PIC X(4).                                              
           02  PROVA5L    COMP  PIC  S9(4).                                     
           02  PROVA5F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA5F.                                        
             03 PROVA5A    PICTURE X.                                           
           02  PROVA5I  PIC X(5).                                               
           02  VBNRAEL    COMP  PIC  S9(4).                                     
           02  VBNRAEF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAEF.                                        
             03 VBNRAEA    PICTURE X.                                           
           02  VBNRAEI  PIC X(7).                                               
           02  PRZAEL    COMP  PIC  S9(4).                                      
           02  PRZAEF    PICTURE X.                                             
           02  FILLER REDEFINES PRZAEF.                                         
             03 PRZAEA    PICTURE X.                                            
           02  PRZAEI  PIC X(1).                                                
           02  STUFEAEL    COMP  PIC  S9(4).                                    
           02  STUFEAEF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEAEF.                                       
             03 STUFEAEA    PICTURE X.                                          
           02  STUFEAEI  PIC X(4).                                              
           02  PROVAEL    COMP  PIC  S9(4).                                     
           02  PROVAEF    PICTURE X.                                            
           02  FILLER REDEFINES PROVAEF.                                        
             03 PROVAEA    PICTURE X.                                           
           02  PROVAEI  PIC X(5).                                               
           02  VBNRA6L    COMP  PIC  S9(4).                                     
           02  VBNRA6F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA6F.                                        
             03 VBNRA6A    PICTURE X.                                           
           02  VBNRA6I  PIC X(7).                                               
           02  PRZA6L    COMP  PIC  S9(4).                                      
           02  PRZA6F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA6F.                                         
             03 PRZA6A    PICTURE X.                                            
           02  PRZA6I  PIC X(1).                                                
           02  STUFEA6L    COMP  PIC  S9(4).                                    
           02  STUFEA6F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA6F.                                       
             03 STUFEA6A    PICTURE X.                                          
           02  STUFEA6I  PIC X(4).                                              
           02  PROVA6L    COMP  PIC  S9(4).                                     
           02  PROVA6F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA6F.                                        
             03 PROVA6A    PICTURE X.                                           
           02  PROVA6I  PIC X(5).                                               
           02  VBNRAFL    COMP  PIC  S9(4).                                     
           02  VBNRAFF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAFF.                                        
             03 VBNRAFA    PICTURE X.                                           
           02  VBNRAFI  PIC X(7).                                               
           02  PRZAFL    COMP  PIC  S9(4).                                      
           02  PRZAFF    PICTURE X.                                             
           02  FILLER REDEFINES PRZAFF.                                         
             03 PRZAFA    PICTURE X.                                            
           02  PRZAFI  PIC X(1).                                                
           02  STUFEAFL    COMP  PIC  S9(4).                                    
           02  STUFEAFF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEAFF.                                       
             03 STUFEAFA    PICTURE X.                                          
           02  STUFEAFI  PIC X(4).                                              
           02  PROVAFL    COMP  PIC  S9(4).                                     
           02  PROVAFF    PICTURE X.                                            
           02  FILLER REDEFINES PROVAFF.                                        
             03 PROVAFA    PICTURE X.                                           
           02  PROVAFI  PIC X(5).                                               
           02  VBNRA7L    COMP  PIC  S9(4).                                     
           02  VBNRA7F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA7F.                                        
             03 VBNRA7A    PICTURE X.                                           
           02  VBNRA7I  PIC X(7).                                               
           02  PRZA7L    COMP  PIC  S9(4).                                      
           02  PRZA7F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA7F.                                         
             03 PRZA7A    PICTURE X.                                            
           02  PRZA7I  PIC X(1).                                                
           02  STUFEA7L    COMP  PIC  S9(4).                                    
           02  STUFEA7F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA7F.                                       
             03 STUFEA7A    PICTURE X.                                          
           02  STUFEA7I  PIC X(4).                                              
           02  PROVA7L    COMP  PIC  S9(4).                                     
           02  PROVA7F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA7F.                                        
             03 PROVA7A    PICTURE X.                                           
           02  PROVA7I  PIC X(5).                                               
           02  VBNRAGL    COMP  PIC  S9(4).                                     
           02  VBNRAGF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAGF.                                        
             03 VBNRAGA    PICTURE X.                                           
           02  VBNRAGI  PIC X(7).                                               
           02  PRZAGL    COMP  PIC  S9(4).                                      
           02  PRZAGF    PICTURE X.                                             
           02  FILLER REDEFINES PRZAGF.                                         
             03 PRZAGA    PICTURE X.                                            
           02  PRZAGI  PIC X(1).                                                
           02  STUFEAGL    COMP  PIC  S9(4).                                    
           02  STUFEAGF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEAGF.                                       
             03 STUFEAGA    PICTURE X.                                          
           02  STUFEAGI  PIC X(4).                                              
           02  PROVAGL    COMP  PIC  S9(4).                                     
           02  PROVAGF    PICTURE X.                                            
           02  FILLER REDEFINES PROVAGF.                                        
             03 PROVAGA    PICTURE X.                                           
           02  PROVAGI  PIC X(5).                                               
           02  VBNRA8L    COMP  PIC  S9(4).                                     
           02  VBNRA8F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA8F.                                        
             03 VBNRA8A    PICTURE X.                                           
           02  VBNRA8I  PIC X(7).                                               
           02  PRZA8L    COMP  PIC  S9(4).                                      
           02  PRZA8F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA8F.                                         
             03 PRZA8A    PICTURE X.                                            
           02  PRZA8I  PIC X(1).                                                
           02  STUFEA8L    COMP  PIC  S9(4).                                    
           02  STUFEA8F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA8F.                                       
             03 STUFEA8A    PICTURE X.                                          
           02  STUFEA8I  PIC X(4).                                              
           02  PROVA8L    COMP  PIC  S9(4).                                     
           02  PROVA8F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA8F.                                        
             03 PROVA8A    PICTURE X.                                           
           02  PROVA8I  PIC X(5).                                               
           02  VBNRAHL    COMP  PIC  S9(4).                                     
           02  VBNRAHF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAHF.                                        
             03 VBNRAHA    PICTURE X.                                           
           02  VBNRAHI  PIC X(7).                                               
           02  PRZAHL    COMP  PIC  S9(4).                                      
           02  PRZAHF    PICTURE X.                                             
           02  FILLER REDEFINES PRZAHF.                                         
             03 PRZAHA    PICTURE X.                                            
           02  PRZAHI  PIC X(1).                                                
           02  STUFEAHL    COMP  PIC  S9(4).                                    
           02  STUFEAHF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEAHF.                                       
             03 STUFEAHA    PICTURE X.                                          
           02  STUFEAHI  PIC X(4).                                              
           02  PROVAHL    COMP  PIC  S9(4).                                     
           02  PROVAHF    PICTURE X.                                            
           02  FILLER REDEFINES PROVAHF.                                        
             03 PROVAHA    PICTURE X.                                           
           02  PROVAHI  PIC X(5).                                               
           02  VBNRA9L    COMP  PIC  S9(4).                                     
           02  VBNRA9F    PICTURE X.                                            
           02  FILLER REDEFINES VBNRA9F.                                        
             03 VBNRA9A    PICTURE X.                                           
           02  VBNRA9I  PIC X(7).                                               
           02  PRZA9L    COMP  PIC  S9(4).                                      
           02  PRZA9F    PICTURE X.                                             
           02  FILLER REDEFINES PRZA9F.                                         
             03 PRZA9A    PICTURE X.                                            
           02  PRZA9I  PIC X(1).                                                
           02  STUFEA9L    COMP  PIC  S9(4).                                    
           02  STUFEA9F    PICTURE X.                                           
           02  FILLER REDEFINES STUFEA9F.                                       
             03 STUFEA9A    PICTURE X.                                          
           02  STUFEA9I  PIC X(4).                                              
           02  PROVA9L    COMP  PIC  S9(4).                                     
           02  PROVA9F    PICTURE X.                                            
           02  FILLER REDEFINES PROVA9F.                                        
             03 PROVA9A    PICTURE X.                                           
           02  PROVA9I  PIC X(5).                                               
           02  VBNRAIL    COMP  PIC  S9(4).                                     
           02  VBNRAIF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAIF.                                        
             03 VBNRAIA    PICTURE X.                                           
           02  VBNRAII  PIC X(7).                                               
           02  PRZAIL    COMP  PIC  S9(4).                                      
           02  PRZAIF    PICTURE X.                                             
           02  FILLER REDEFINES PRZAIF.                                         
             03 PRZAIA    PICTURE X.                                            
           02  PRZAII  PIC X(1).                                                
           02  STUFEAIL    COMP  PIC  S9(4).                                    
           02  STUFEAIF    PICTURE X.                                           
           02  FILLER REDEFINES STUFEAIF.                                       
             03 STUFEAIA    PICTURE X.                                          
           02  STUFEAII  PIC X(4).                                              
           02  PROVAIL    COMP  PIC  S9(4).                                     
           02  PROVAIF    PICTURE X.                                            
           02  FILLER REDEFINES PROVAIF.                                        
             03 PROVAIA    PICTURE X.                                           
           02  PROVAII  PIC X(5).                                               
           02  VBNRAZL    COMP  PIC  S9(4).                                     
           02  VBNRAZF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRAZF.                                        
             03 VBNRAZA    PICTURE X.                                           
           02  VBNRAZI  PIC X(7).                                               
           02  GESAZL    COMP  PIC  S9(4).                                      
           02  GESAZF    PICTURE X.                                             
           02  FILLER REDEFINES GESAZF.                                         
             03 GESAZA    PICTURE X.                                            
           02  GESAZI  PIC X(2).                                                
           02  VNRAZL    COMP  PIC  S9(4).                                      
           02  VNRAZF    PICTURE X.                                             
           02  FILLER REDEFINES VNRAZF.                                         
             03 VNRAZA    PICTURE X.                                            
           02  VNRAZI  PIC X(15).                                               
           02  NAMEAZL    COMP  PIC  S9(4).                                     
           02  NAMEAZF    PICTURE X.                                            
           02  FILLER REDEFINES NAMEAZF.                                        
             03 NAMEAZA    PICTURE X.                                           
           02  NAMEAZI  PIC X(8).                                               
           02  TRANSAEL    COMP  PIC  S9(4).                                    
           02  TRANSAEF    PICTURE X.                                           
           02  FILLER REDEFINES TRANSAEF.                                       
             03 TRANSAEA    PICTURE X.                                          
           02  TRANSAEI  PIC X(4).                                              
           02  FEHLERAL    COMP  PIC  S9(4).                                    
           02  FEHLERAF    PICTURE X.                                           
           02  FILLER REDEFINES FEHLERAF.                                       
             03 FEHLERAA    PICTURE X.                                          
           02  FEHLERAI  PIC X(79).                                             
       01  UA936O REDEFINES UA936I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRAO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUMAO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHRAO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UTXTO  PIC X(43).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRAO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  GESAO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VNRAO  PIC X(15).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRA1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAAO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZAAO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEAAO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVAAO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA2O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRABO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZABO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEABO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVABO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA3O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRACO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZACO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEACO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVACO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA4O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA4O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA4O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA4O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRADO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZADO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEADO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVADO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA5O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA5O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA5O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA5O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAEO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZAEO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEAEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVAEO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA6O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA6O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA6O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA6O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAFO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZAFO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEAFO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVAFO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA7O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA7O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA7O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA7O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAGO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZAGO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEAGO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVAGO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA8O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA8O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA8O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA8O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAHO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZAHO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEAHO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVAHO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA9O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZA9O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEA9O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVA9O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAIO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZAIO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFEAIO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVAIO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRAZO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GESAZO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNRAZO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEAZO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANSAEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLERAO  PIC X(79).                                             
