       01  UA942I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRCL    COMP  PIC  S9(4).                                       
           02  PNRCF    PICTURE X.                                              
           02  FILLER REDEFINES PNRCF.                                          
             03 PNRCA    PICTURE X.                                             
           02  PNRCI  PIC X(7).                                                 
           02  DATUMCL    COMP  PIC  S9(4).                                     
           02  DATUMCF    PICTURE X.                                            
           02  FILLER REDEFINES DATUMCF.                                        
             03 DATUMCA    PICTURE X.                                           
           02  DATUMCI  PIC X(8).                                               
           02  UHRCL    COMP  PIC  S9(4).                                       
           02  UHRCF    PICTURE X.                                              
           02  FILLER REDEFINES UHRCF.                                          
             03 UHRCA    PICTURE X.                                             
           02  UHRCI  PIC X(5).                                                 
           02  GESCL    COMP  PIC  S9(4).                                       
           02  GESCF    PICTURE X.                                              
           02  FILLER REDEFINES GESCF.                                          
             03 GESCA    PICTURE X.                                             
           02  GESCI  PIC X(27).                                                
           02  VBNRCL    COMP  PIC  S9(4).                                      
           02  VBNRCF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRCF.                                         
             03 VBNRCA    PICTURE X.                                            
           02  VBNRCI  PIC X(7).                                                
           02  PRZVBCL    COMP  PIC  S9(4).                                     
           02  PRZVBCF    PICTURE X.                                            
           02  FILLER REDEFINES PRZVBCF.                                        
             03 PRZVBCA    PICTURE X.                                           
           02  PRZVBCI  PIC X(1).                                               
           02  VBNRVMCL    COMP  PIC  S9(4).                                    
           02  VBNRVMCF    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVMCF.                                       
             03 VBNRVMCA    PICTURE X.                                          
           02  VBNRVMCI  PIC X(7).                                              
           02  PRZVMCL    COMP  PIC  S9(4).                                     
           02  PRZVMCF    PICTURE X.                                            
           02  FILLER REDEFINES PRZVMCF.                                        
             03 PRZVMCA    PICTURE X.                                           
           02  PRZVMCI  PIC X(1).                                               
           02  VNRCL    COMP  PIC  S9(4).                                       
           02  VNRCF    PICTURE X.                                              
           02  FILLER REDEFINES VNRCF.                                          
             03 VNRCA    PICTURE X.                                             
           02  VNRCI  PIC X(14).                                                
           02  TVNRACL    COMP  PIC  S9(4).                                     
           02  TVNRACF    PICTURE X.                                            
           02  FILLER REDEFINES TVNRACF.                                        
             03 TVNRACA    PICTURE X.                                           
           02  TVNRACI  PIC X(19).                                              
           02  VBNRACL    COMP  PIC  S9(4).                                     
           02  VBNRACF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRACF.                                        
             03 VBNRACA    PICTURE X.                                           
           02  VBNRACI  PIC X(7).                                               
           02  VNRACL    COMP  PIC  S9(4).                                      
           02  VNRACF    PICTURE X.                                             
           02  FILLER REDEFINES VNRACF.                                         
             03 VNRACA    PICTURE X.                                            
           02  VNRACI  PIC X(15).                                               
           02  ANREDECL    COMP  PIC  S9(4).                                    
           02  ANREDECF    PICTURE X.                                           
           02  FILLER REDEFINES ANREDECF.                                       
             03 ANREDECA    PICTURE X.                                          
           02  ANREDECI  PIC X(9).                                              
           02  ZNAMECL    COMP  PIC  S9(4).                                     
           02  ZNAMECF    PICTURE X.                                            
           02  FILLER REDEFINES ZNAMECF.                                        
             03 ZNAMECA    PICTURE X.                                           
           02  ZNAMECI  PIC X(26).                                              
           02  VNAMECL    COMP  PIC  S9(4).                                     
           02  VNAMECF    PICTURE X.                                            
           02  FILLER REDEFINES VNAMECF.                                        
             03 VNAMECA    PICTURE X.                                           
           02  VNAMECI  PIC X(26).                                              
           02  PLZCL    COMP  PIC  S9(4).                                       
           02  PLZCF    PICTURE X.                                              
           02  FILLER REDEFINES PLZCF.                                          
             03 PLZCA    PICTURE X.                                             
           02  PLZCI  PIC X(5).                                                 
           02  ORTCL    COMP  PIC  S9(4).                                       
           02  ORTCF    PICTURE X.                                              
           02  FILLER REDEFINES ORTCF.                                          
             03 ORTCA    PICTURE X.                                             
           02  ORTCI  PIC X(21).                                                
           02  AUSLCL    COMP  PIC  S9(4).                                      
           02  AUSLCF    PICTURE X.                                             
           02  FILLER REDEFINES AUSLCF.                                         
             03 AUSLCA    PICTURE X.                                            
           02  AUSLCI  PIC X(3).                                                
           02  PRODCL    COMP  PIC  S9(4).                                      
           02  PRODCF    PICTURE X.                                             
           02  FILLER REDEFINES PRODCF.                                         
             03 PRODCA    PICTURE X.                                            
           02  PRODCI  PIC X(2).                                                
           02  TBETCL    COMP  PIC  S9(4).                                      
           02  TBETCF    PICTURE X.                                             
           02  FILLER REDEFINES TBETCF.                                         
             03 TBETCA    PICTURE X.                                            
           02  TBETCI  PIC X(5).                                                
           02  SUMCL    COMP  PIC  S9(4).                                       
           02  SUMCF    PICTURE X.                                              
           02  FILLER REDEFINES SUMCF.                                          
             03 SUMCA    PICTURE X.                                             
           02  SUMCI  PIC X(10).                                                
           02  TBEGCL    COMP  PIC  S9(4).                                      
           02  TBEGCF    PICTURE X.                                             
           02  FILLER REDEFINES TBEGCF.                                         
             03 TBEGCA    PICTURE X.                                            
           02  TBEGCI  PIC X(6).                                                
           02  BEGCL    COMP  PIC  S9(4).                                       
           02  BEGCF    PICTURE X.                                              
           02  FILLER REDEFINES BEGCF.                                          
             03 BEGCA    PICTURE X.                                             
           02  BEGCI  PIC X(8).                                                 
           02  AECL    COMP  PIC  S9(4).                                        
           02  AECF    PICTURE X.                                               
           02  FILLER REDEFINES AECF.                                           
             03 AECA    PICTURE X.                                              
           02  AECI  PIC X(8).                                                  
           02  ANARTCL    COMP  PIC  S9(4).                                     
           02  ANARTCF    PICTURE X.                                            
           02  FILLER REDEFINES ANARTCF.                                        
             03 ANARTCA    PICTURE X.                                           
           02  ANARTCI  PIC X(1).                                               
           02  ANDATCL    COMP  PIC  S9(4).                                     
           02  ANDATCF    PICTURE X.                                            
           02  FILLER REDEFINES ANDATCF.                                        
             03 ANDATCA    PICTURE X.                                           
           02  ANDATCI  PIC X(8).                                               
           02  ERFDATCL    COMP  PIC  S9(4).                                    
           02  ERFDATCF    PICTURE X.                                           
           02  FILLER REDEFINES ERFDATCF.                                       
             03 ERFDATCA    PICTURE X.                                          
           02  ERFDATCI  PIC X(8).                                              
           02  STATC1L    COMP  PIC  S9(4).                                     
           02  STATC1F    PICTURE X.                                            
           02  FILLER REDEFINES STATC1F.                                        
             03 STATC1A    PICTURE X.                                           
           02  STATC1I  PIC X(2).                                               
           02  STDATC1L    COMP  PIC  S9(4).                                    
           02  STDATC1F    PICTURE X.                                           
           02  FILLER REDEFINES STDATC1F.                                       
             03 STDATC1A    PICTURE X.                                          
           02  STDATC1I  PIC X(8).                                              
           02  STATC2L    COMP  PIC  S9(4).                                     
           02  STATC2F    PICTURE X.                                            
           02  FILLER REDEFINES STATC2F.                                        
             03 STATC2A    PICTURE X.                                           
           02  STATC2I  PIC X(2).                                               
           02  STDATC2L    COMP  PIC  S9(4).                                    
           02  STDATC2F    PICTURE X.                                           
           02  FILLER REDEFINES STDATC2F.                                       
             03 STDATC2A    PICTURE X.                                          
           02  STDATC2I  PIC X(8).                                              
           02  STATC3L    COMP  PIC  S9(4).                                     
           02  STATC3F    PICTURE X.                                            
           02  FILLER REDEFINES STATC3F.                                        
             03 STATC3A    PICTURE X.                                           
           02  STATC3I  PIC X(2).                                               
           02  STDATC3L    COMP  PIC  S9(4).                                    
           02  STDATC3F    PICTURE X.                                           
           02  FILLER REDEFINES STDATC3F.                                       
             03 STDATC3A    PICTURE X.                                          
           02  STDATC3I  PIC X(8).                                              
           02  VBNRCEL    COMP  PIC  S9(4).                                     
           02  VBNRCEF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRCEF.                                        
             03 VBNRCEA    PICTURE X.                                           
           02  VBNRCEI  PIC X(7).                                               
           02  GESCEL    COMP  PIC  S9(4).                                      
           02  GESCEF    PICTURE X.                                             
           02  FILLER REDEFINES GESCEF.                                         
             03 GESCEA    PICTURE X.                                            
           02  GESCEI  PIC X(2).                                                
           02  VNRCEL    COMP  PIC  S9(4).                                      
           02  VNRCEF    PICTURE X.                                             
           02  FILLER REDEFINES VNRCEF.                                         
             03 VNRCEA    PICTURE X.                                            
           02  VNRCEI  PIC 9(15).                                               
           02  NAMECEL    COMP  PIC  S9(4).                                     
           02  NAMECEF    PICTURE X.                                            
           02  FILLER REDEFINES NAMECEF.                                        
             03 NAMECEA    PICTURE X.                                           
           02  NAMECEI  PIC X(8).                                               
           02  TRANSCEL    COMP  PIC  S9(4).                                    
           02  TRANSCEF    PICTURE X.                                           
           02  FILLER REDEFINES TRANSCEF.                                       
             03 TRANSCEA    PICTURE X.                                          
           02  TRANSCEI  PIC X(4).                                              
           02  FEHLERCL    COMP  PIC  S9(4).                                    
           02  FEHLERCF    PICTURE X.                                           
           02  FILLER REDEFINES FEHLERCF.                                       
             03 FEHLERCA    PICTURE X.                                          
           02  FEHLERCI  PIC X(79).                                             
       01  UA942O REDEFINES UA942I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRCO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUMCO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHRCO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GESCO  PIC X(27).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRCO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVBCO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVMCO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVMCO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRCO  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  TVNRACO  PIC X(19).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRACO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNRACO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREDECO  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZNAMECO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAMECO  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZCO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORTCO  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSLCO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRODCO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBETCO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  SUMCO  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBEGCO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  BEGCO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AECO  PIC X(8).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ANARTCO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDATCO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDATCO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STATC1O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDATC1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STATC2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDATC2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STATC3O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  STDATC3O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRCEO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  GESCEO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNRCEO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMECEO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANSCEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  FEHLERCO  PIC X(79).                                             
