      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  November 1995
      *            Kopf aus:  N:\PROFILE\KOPFCBL.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 1995 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   UU026S.CPY  $
      *    $Revision:   2.0  $
      *
      *    $Log:   L:\MF\CPY\UU026S.CPv  $
      *
      *   Rev 2.0   Feb 27 1999 15:15:08   P13SP20
      *NT-Umstellung
      *
      *   Rev 1.0   Nov 04 1995 09:47:46   P13SP99
      *Initial revision.
      *
      *---------------------------------------------------------------*
      *****  VERSION
      ******************************************************
      *                                                    *
      *          COPY-MEMBER PROV.-SATZ AG126              *
      *          ----------------------------              *
      *                                                    *
      *                             ERSTELLT AM 26.FEBR 81 *
      *                             VON E. HUEBNER / GEDO  *
      *                                                    *
      *           STAND 5. MAERZ 1981                      *
      *                                                    *
      ******************************************************
       01  UU026S.
           05  SA                  PIC XX.
           05  GESELLS             PIC X.
           05  VERNR               PIC 9(12).
           05  FILLER              PIC XX.
           05  NAME1               PIC X(20).
           05  PRODS               PIC XX.
           05  PRART               PIC X.
           05  SUMME               PIC 9(7)V99.
           05  FILLER              PIC XXX.
           05  PRORATA             PIC 9(7)V99.
           05  VBNR1               PIC X(6).
           05  PREMPF              PIC 9(7).
           05  KONTR               PIC X.
           05  PRZ1                PIC X.
           05  PROV1               PIC 999V9.

