       01  UU314I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS82L    COMP  PIC  S9(4).                                     
           02  PERS82F    PICTURE X.                                            
           02  FILLER REDEFINES PERS82F.                                        
             03 PERS82A    PICTURE X.                                           
           02  PERS82I  PIC X(7).                                               
           02  DATUM82L    COMP  PIC  S9(4).                                    
           02  DATUM82F    PICTURE X.                                           
           02  FILLER REDEFINES DATUM82F.                                       
             03 DATUM82A    PICTURE X.                                          
           02  DATUM82I  PIC X(8).                                              
           02  UHR82L    COMP  PIC  S9(4).                                      
           02  UHR82F    PICTURE X.                                             
           02  FILLER REDEFINES UHR82F.                                         
             03 UHR82A    PICTURE X.                                            
           02  UHR82I  PIC X(5).                                                
           02  GES82L    COMP  PIC  S9(4).                                      
           02  GES82F    PICTURE X.                                             
           02  FILLER REDEFINES GES82F.                                         
             03 GES82A    PICTURE X.                                            
           02  GES82I  PIC X(13).                                               
           02  VBNRA82L    COMP  PIC  S9(4).                                    
           02  VBNRA82F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRA82F.                                       
             03 VBNRA82A    PICTURE X.                                          
           02  VBNRA82I  PIC X(7).                                              
           02  PRZVB82L    COMP  PIC  S9(4).                                    
           02  PRZVB82F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVB82F.                                       
             03 PRZVB82A    PICTURE X.                                          
           02  PRZVB82I  PIC X(1).                                              
           02  DIR82L    COMP  PIC  S9(4).                                      
           02  DIR82F    PICTURE X.                                             
           02  FILLER REDEFINES DIR82F.                                         
             03 DIR82A    PICTURE X.                                            
           02  DIR82I  PIC X(3).                                                
           02  VBNA82L    COMP  PIC  S9(4).                                     
           02  VBNA82F    PICTURE X.                                            
           02  FILLER REDEFINES VBNA82F.                                        
             03 VBNA82A    PICTURE X.                                           
           02  VBNA82I  PIC X(20).                                              
           02  VBVM82L    COMP  PIC  S9(4).                                     
           02  VBVM82F    PICTURE X.                                            
           02  FILLER REDEFINES VBVM82F.                                        
             03 VBVM82A    PICTURE X.                                           
           02  VBVM82I  PIC X(7).                                               
           02  PRZVM82L    COMP  PIC  S9(4).                                    
           02  PRZVM82F    PICTURE X.                                           
           02  FILLER REDEFINES PRZVM82F.                                       
             03 PRZVM82A    PICTURE X.                                          
           02  PRZVM82I  PIC X(1).                                              
           02  VMNA82L    COMP  PIC  S9(4).                                     
           02  VMNA82F    PICTURE X.                                            
           02  FILLER REDEFINES VMNA82F.                                        
             03 VMNA82A    PICTURE X.                                           
           02  VMNA82I  PIC X(20).                                              
           02  TVT82L    COMP  PIC  S9(4).                                      
           02  TVT82F    PICTURE X.                                             
           02  FILLER REDEFINES TVT82F.                                         
             03 TVT82A    PICTURE X.                                            
           02  TVT82I  PIC X(10).                                               
           02  VNR182L    COMP  PIC  S9(4).                                     
           02  VNR182F    PICTURE X.                                            
           02  FILLER REDEFINES VNR182F.                                        
             03 VNR182A    PICTURE X.                                           
           02  VNR182I  PIC X(10).                                              
           02  TAN82L    COMP  PIC  S9(4).                                      
           02  TAN82F    PICTURE X.                                             
           02  FILLER REDEFINES TAN82F.                                         
             03 TAN82A    PICTURE X.                                            
           02  TAN82I  PIC X(6).                                                
           02  ANRE82L    COMP  PIC  S9(4).                                     
           02  ANRE82F    PICTURE X.                                            
           02  FILLER REDEFINES ANRE82F.                                        
             03 ANRE82A    PICTURE X.                                           
           02  ANRE82I  PIC X(9).                                               
           02  TZU82L    COMP  PIC  S9(4).                                      
           02  TZU82F    PICTURE X.                                             
           02  FILLER REDEFINES TZU82F.                                         
             03 TZU82A    PICTURE X.                                            
           02  TZU82I  PIC X(6).                                                
           02  ZNAME82L    COMP  PIC  S9(4).                                    
           02  ZNAME82F    PICTURE X.                                           
           02  FILLER REDEFINES ZNAME82F.                                       
             03 ZNAME82A    PICTURE X.                                          
           02  ZNAME82I  PIC X(28).                                             
           02  TVOR82L    COMP  PIC  S9(4).                                     
           02  TVOR82F    PICTURE X.                                            
           02  FILLER REDEFINES TVOR82F.                                        
             03 TVOR82A    PICTURE X.                                           
           02  TVOR82I  PIC X(7).                                               
           02  VNAME82L    COMP  PIC  S9(4).                                    
           02  VNAME82F    PICTURE X.                                           
           02  FILLER REDEFINES VNAME82F.                                       
             03 VNAME82A    PICTURE X.                                          
           02  VNAME82I  PIC X(28).                                             
           02  TSTRA82L    COMP  PIC  S9(4).                                    
           02  TSTRA82F    PICTURE X.                                           
           02  FILLER REDEFINES TSTRA82F.                                       
             03 TSTRA82A    PICTURE X.                                          
           02  TSTRA82I  PIC X(7).                                              
           02  STRA82L    COMP  PIC  S9(4).                                     
           02  STRA82F    PICTURE X.                                            
           02  FILLER REDEFINES STRA82F.                                        
             03 STRA82A    PICTURE X.                                           
           02  STRA82I  PIC X(28).                                              
           02  TPLZA82L    COMP  PIC  S9(4).                                    
           02  TPLZA82F    PICTURE X.                                           
           02  FILLER REDEFINES TPLZA82F.                                       
             03 TPLZA82A    PICTURE X.                                          
           02  TPLZA82I  PIC X(3).                                              
           02  TORTA82L    COMP  PIC  S9(4).                                    
           02  TORTA82F    PICTURE X.                                           
           02  FILLER REDEFINES TORTA82F.                                       
             03 TORTA82A    PICTURE X.                                          
           02  TORTA82I  PIC X(7).                                              
           02  TAUSL82L    COMP  PIC  S9(4).                                    
           02  TAUSL82F    PICTURE X.                                           
           02  FILLER REDEFINES TAUSL82F.                                       
             03 TAUSL82A    PICTURE X.                                          
           02  TAUSL82I  PIC X(4).                                              
           02  PLZA82L    COMP  PIC  S9(4).                                     
           02  PLZA82F    PICTURE X.                                            
           02  FILLER REDEFINES PLZA82F.                                        
             03 PLZA82A    PICTURE X.                                           
           02  PLZA82I  PIC X(5).                                               
           02  ORTA82L    COMP  PIC  S9(4).                                     
           02  ORTA82F    PICTURE X.                                            
           02  FILLER REDEFINES ORTA82F.                                        
             03 ORTA82A    PICTURE X.                                           
           02  ORTA82I  PIC X(21).                                              
           02  AUSL82L    COMP  PIC  S9(4).                                     
           02  AUSL82F    PICTURE X.                                            
           02  FILLER REDEFINES AUSL82F.                                        
             03 AUSL82A    PICTURE X.                                           
           02  AUSL82I  PIC X(3).                                               
           02  TPROD82L    COMP  PIC  S9(4).                                    
           02  TPROD82F    PICTURE X.                                           
           02  FILLER REDEFINES TPROD82F.                                       
             03 TPROD82A    PICTURE X.                                          
           02  TPROD82I  PIC X(7).                                              
           02  PRODU82L    COMP  PIC  S9(4).                                    
           02  PRODU82F    PICTURE X.                                           
           02  FILLER REDEFINES PRODU82F.                                       
             03 PRODU82A    PICTURE X.                                          
           02  PRODU82I  PIC X(2).                                              
           02  TART82L    COMP  PIC  S9(4).                                     
           02  TART82F    PICTURE X.                                            
           02  FILLER REDEFINES TART82F.                                        
             03 TART82A    PICTURE X.                                           
           02  TART82I  PIC X(10).                                              
           02  ANART82L    COMP  PIC  S9(4).                                    
           02  ANART82F    PICTURE X.                                           
           02  FILLER REDEFINES ANART82F.                                       
             03 ANART82A    PICTURE X.                                          
           02  ANART82I  PIC X(1).                                              
           02  TAND82L    COMP  PIC  S9(4).                                     
           02  TAND82F    PICTURE X.                                            
           02  FILLER REDEFINES TAND82F.                                        
             03 TAND82A    PICTURE X.                                           
           02  TAND82I  PIC X(6).                                               
           02  ANDAT82L    COMP  PIC  S9(4).                                    
           02  ANDAT82F    PICTURE X.                                           
           02  FILLER REDEFINES ANDAT82F.                                       
             03 ANDAT82A    PICTURE X.                                          
           02  ANDAT82I  PIC X(6).                                              
           02  TERD82L    COMP  PIC  S9(4).                                     
           02  TERD82F    PICTURE X.                                            
           02  FILLER REDEFINES TERD82F.                                        
             03 TERD82A    PICTURE X.                                           
           02  TERD82I  PIC X(10).                                              
           02  ERFD82L    COMP  PIC  S9(4).                                     
           02  ERFD82F    PICTURE X.                                            
           02  FILLER REDEFINES ERFD82F.                                        
             03 ERFD82A    PICTURE X.                                           
           02  ERFD82I  PIC X(6).                                               
           02  TSTAT82L    COMP  PIC  S9(4).                                    
           02  TSTAT82F    PICTURE X.                                           
           02  FILLER REDEFINES TSTAT82F.                                       
             03 TSTAT82A    PICTURE X.                                          
           02  TSTAT82I  PIC X(7).                                              
           02  STAT82L    COMP  PIC  S9(4).                                     
           02  STAT82F    PICTURE X.                                            
           02  FILLER REDEFINES STAT82F.                                        
             03 STAT82A    PICTURE X.                                           
           02  STAT82I  PIC X(2).                                               
           02  TEING82L    COMP  PIC  S9(4).                                    
           02  TEING82F    PICTURE X.                                           
           02  FILLER REDEFINES TEING82F.                                       
             03 TEING82A    PICTURE X.                                          
           02  TEING82I  PIC X(46).                                             
           02  EING82L    COMP  PIC  S9(4).                                     
           02  EING82F    PICTURE X.                                            
           02  FILLER REDEFINES EING82F.                                        
             03 EING82A    PICTURE X.                                           
           02  EING82I  PIC X(1).                                               
           02  FEHL82L    COMP  PIC  S9(4).                                     
           02  FEHL82F    PICTURE X.                                            
           02  FILLER REDEFINES FEHL82F.                                        
             03 FEHL82A    PICTURE X.                                           
           02  FEHL82I  PIC X(78).                                              
       01  UU314O REDEFINES UU314I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS82O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  DATUM82O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  UHR82O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  GES82O  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRA82O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVB82O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIR82O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNA82O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBVM82O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZVM82O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  VMNA82O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVT82O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNR182O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAN82O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANRE82O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TZU82O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZNAME82O  PIC X(28).                                             
           02  FILLER PICTURE X(3).                                             
           02  TVOR82O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VNAME82O  PIC X(28).                                             
           02  FILLER PICTURE X(3).                                             
           02  TSTRA82O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STRA82O  PIC X(28).                                              
           02  FILLER PICTURE X(3).                                             
           02  TPLZA82O  PIC X(3).                                              
           02  FILLER PICTURE X(3).                                             
           02  TORTA82O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAUSL82O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PLZA82O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ORTA82O  PIC X(21).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSL82O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROD82O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRODU82O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TART82O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ANART82O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAND82O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANDAT82O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TERD82O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  ERFD82O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TSTAT82O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  STAT82O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEING82O  PIC X(46).                                             
           02  FILLER PICTURE X(3).                                             
           02  EING82O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL82O  PIC X(78).                                              
