       01  UU590I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRFL    COMP  PIC  S9(4).                                       
           02  PNRFF    PICTURE X.                                              
           02  FILLER REDEFINES PNRFF.                                          
             03 PNRFA    PICTURE X.                                             
           02  PNRFI  PIC X(7).                                                 
           02  DATFL    COMP  PIC  S9(4).                                       
           02  DATFF    PICTURE X.                                              
           02  FILLER REDEFINES DATFF.                                          
             03 DATFA    PICTURE X.                                             
           02  DATFI  PIC X(8).                                                 
           02  UHRFL    COMP  PIC  S9(4).                                       
           02  UHRFF    PICTURE X.                                              
           02  FILLER REDEFINES UHRFF.                                          
             03 UHRFA    PICTURE X.                                             
           02  UHRFI  PIC X(5).                                                 
           02  VBNRFTL    COMP  PIC  S9(4).                                     
           02  VBNRFTF    PICTURE X.                                            
           02  FILLER REDEFINES VBNRFTF.                                        
             03 VBNRFTA    PICTURE X.                                           
           02  VBNRFTI  PIC X(20).                                              
           02  VBNRFL    COMP  PIC  S9(4).                                      
           02  VBNRFF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRFF.                                         
             03 VBNRFA    PICTURE X.                                            
           02  VBNRFI  PIC X(7).                                                
           02  VBNREL    COMP  PIC  S9(4).                                      
           02  VBNREF    PICTURE X.                                             
           02  FILLER REDEFINES VBNREF.                                         
             03 VBNREA    PICTURE X.                                            
           02  VBNREI  PIC X(6).                                                
           02  PRZEL    COMP  PIC  S9(4).                                       
           02  PRZEF    PICTURE X.                                              
           02  FILLER REDEFINES PRZEF.                                          
             03 PRZEA    PICTURE X.                                             
           02  PRZEI  PIC X(1).                                                 
           02  GESFL    COMP  PIC  S9(4).                                       
           02  GESFF    PICTURE X.                                              
           02  FILLER REDEFINES GESFF.                                          
             03 GESFA    PICTURE X.                                             
           02  GESFI  PIC X(2).                                                 
           02  VSNRFL    COMP  PIC  S9(4).                                      
           02  VSNRFF    PICTURE X.                                             
           02  FILLER REDEFINES VSNRFF.                                         
             03 VSNRFA    PICTURE X.                                            
           02  VSNRFI  PIC X(15).                                               
           02  VSNRAL    COMP  PIC  S9(4).                                      
           02  VSNRAF    PICTURE X.                                             
           02  FILLER REDEFINES VSNRAF.                                         
             03 VSNRAA    PICTURE X.                                            
           02  VSNRAI  PIC X(15).                                               
           02  FAELLFL    COMP  PIC  S9(4).                                     
           02  FAELLFF    PICTURE X.                                            
           02  FILLER REDEFINES FAELLFF.                                        
             03 FAELLFA    PICTURE X.                                           
           02  FAELLFI  PIC X(8).                                               
           02  LFDNRFL    COMP  PIC  S9(4).                                     
           02  LFDNRFF    PICTURE X.                                            
           02  FILLER REDEFINES LFDNRFF.                                        
             03 LFDNRFA    PICTURE X.                                           
           02  LFDNRFI  PIC X(2).                                               
           02  NAMEFL    COMP  PIC  S9(4).                                      
           02  NAMEFF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEFF.                                         
             03 NAMEFA    PICTURE X.                                            
           02  NAMEFI  PIC X(20).                                               
           02  HFTGTL    COMP  PIC  S9(4).                                      
           02  HFTGTF    PICTURE X.                                             
           02  FILLER REDEFINES HFTGTF.                                         
             03 HFTGTA    PICTURE X.                                            
           02  HFTGTI  PIC X(20).                                               
           02  HFTGAL    COMP  PIC  S9(4).                                      
           02  HFTGAF    PICTURE X.                                             
           02  FILLER REDEFINES HFTGAF.                                         
             03 HFTGAA    PICTURE X.                                            
           02  HFTGAI  PIC X(9).                                                
           02  GRPVTL    COMP  PIC  S9(4).                                      
           02  GRPVTF    PICTURE X.                                             
           02  FILLER REDEFINES GRPVTF.                                         
             03 GRPVTA    PICTURE X.                                            
           02  GRPVTI  PIC X(20).                                               
           02  GRPVFL    COMP  PIC  S9(4).                                      
           02  GRPVFF    PICTURE X.                                             
           02  FILLER REDEFINES GRPVFF.                                         
             03 GRPVFA    PICTURE X.                                            
           02  GRPVFI  PIC X(6).                                                
           02  HFTBTL    COMP  PIC  S9(4).                                      
           02  HFTBTF    PICTURE X.                                             
           02  FILLER REDEFINES HFTBTF.                                         
             03 HFTBTA    PICTURE X.                                            
           02  HFTBTI  PIC X(16).                                               
           02  HAFMML    COMP  PIC  S9(4).                                      
           02  HAFMMF    PICTURE X.                                             
           02  FILLER REDEFINES HAFMMF.                                         
             03 HAFMMA    PICTURE X.                                            
           02  HAFMMI  PIC X(2).                                                
           02  HAFJJL    COMP  PIC  S9(4).                                      
           02  HAFJJF    PICTURE X.                                             
           02  FILLER REDEFINES HAFJJF.                                         
             03 HAFJJA    PICTURE X.                                            
           02  HAFJJI  PIC X(4).                                                
           02  INTNRFTL    COMP  PIC  S9(4).                                    
           02  INTNRFTF    PICTURE X.                                           
           02  FILLER REDEFINES INTNRFTF.                                       
             03 INTNRFTA    PICTURE X.                                          
           02  INTNRFTI  PIC X(20).                                             
           02  INTNRFL    COMP  PIC  S9(4).                                     
           02  INTNRFF    PICTURE X.                                            
           02  FILLER REDEFINES INTNRFF.                                        
             03 INTNRFA    PICTURE X.                                           
           02  INTNRFI  PIC X(7).                                               
           02  PRZFL    COMP  PIC  S9(4).                                       
           02  PRZFF    PICTURE X.                                              
           02  FILLER REDEFINES PRZFF.                                          
             03 PRZFA    PICTURE X.                                             
           02  PRZFI  PIC X(2).                                                 
           02  INTNRFEL    COMP  PIC  S9(4).                                    
           02  INTNRFEF    PICTURE X.                                           
           02  FILLER REDEFINES INTNRFEF.                                       
             03 INTNRFEA    PICTURE X.                                          
           02  INTNRFEI  PIC X(7).                                              
           02  PRZFEL    COMP  PIC  S9(4).                                      
           02  PRZFEF    PICTURE X.                                             
           02  FILLER REDEFINES PRZFEF.                                         
             03 PRZFEA    PICTURE X.                                            
           02  PRZFEI  PIC X(2).                                                
           02  PSCHLFTL    COMP  PIC  S9(4).                                    
           02  PSCHLFTF    PICTURE X.                                           
           02  FILLER REDEFINES PSCHLFTF.                                       
             03 PSCHLFTA    PICTURE X.                                          
           02  PSCHLFTI  PIC X(20).                                             
           02  PSCHLFL    COMP  PIC  S9(4).                                     
           02  PSCHLFF    PICTURE X.                                            
           02  FILLER REDEFINES PSCHLFF.                                        
             03 PSCHLFA    PICTURE X.                                           
           02  PSCHLFI  PIC X(2).                                               
           02  PSCHLFEL    COMP  PIC  S9(4).                                    
           02  PSCHLFEF    PICTURE X.                                           
           02  FILLER REDEFINES PSCHLFEF.                                       
             03 PSCHLFEA    PICTURE X.                                          
           02  PSCHLFEI  PIC X(2).                                              
           02  PARTFTL    COMP  PIC  S9(4).                                     
           02  PARTFTF    PICTURE X.                                            
           02  FILLER REDEFINES PARTFTF.                                        
             03 PARTFTA    PICTURE X.                                           
           02  PARTFTI  PIC X(20).                                              
           02  PARTFL    COMP  PIC  S9(4).                                      
           02  PARTFF    PICTURE X.                                             
           02  FILLER REDEFINES PARTFF.                                         
             03 PARTFA    PICTURE X.                                            
           02  PARTFI  PIC X(1).                                                
           02  PARTFEL    COMP  PIC  S9(4).                                     
           02  PARTFEF    PICTURE X.                                            
           02  FILLER REDEFINES PARTFEF.                                        
             03 PARTFEA    PICTURE X.                                           
           02  PARTFEI  PIC X(1).                                               
           02  PSATZFTL    COMP  PIC  S9(4).                                    
           02  PSATZFTF    PICTURE X.                                           
           02  FILLER REDEFINES PSATZFTF.                                       
             03 PSATZFTA    PICTURE X.                                          
           02  PSATZFTI  PIC X(20).                                             
           02  PSATZFL    COMP  PIC  S9(4).                                     
           02  PSATZFF    PICTURE X.                                            
           02  FILLER REDEFINES PSATZFF.                                        
             03 PSATZFA    PICTURE X.                                           
           02  PSATZFI  PIC X(4).                                               
           02  PSATZFEL    COMP  PIC  S9(4).                                    
           02  PSATZFEF    PICTURE X.                                           
           02  FILLER REDEFINES PSATZFEF.                                       
             03 PSATZFEA    PICTURE X.                                          
           02  PSATZFEI  PIC X(4).                                              
           02  PRUEFFTL    COMP  PIC  S9(4).                                    
           02  PRUEFFTF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEFFTF.                                       
             03 PRUEFFTA    PICTURE X.                                          
           02  PRUEFFTI  PIC X(22).                                             
           02  PRUEFFEL    COMP  PIC  S9(4).                                    
           02  PRUEFFEF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEFFEF.                                       
             03 PRUEFFEA    PICTURE X.                                          
           02  PRUEFFEI  PIC X(1).                                              
           02  INFOFL    COMP  PIC  S9(4).                                      
           02  INFOFF    PICTURE X.                                             
           02  FILLER REDEFINES INFOFF.                                         
             03 INFOFA    PICTURE X.                                            
           02  INFOFI  PIC X(50).                                               
       01  UU590O REDEFINES UU590I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRFO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATFO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHRFO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNRFTO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VBNRFO PIC 9(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNREO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZEO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GESFO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VSNRFO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  VSNRAO  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  FAELLFO PIC 99.99.99.                                            
           02  FILLER PICTURE X(3).                                             
           02  LFDNRFO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEFO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  HFTGTO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  HFTGAO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  GRPVTO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  GRPVFO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  HFTBTO  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  HAFMMO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  HAFJJO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  INTNRFTO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  INTNRFO  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRZFO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  INTNRFEO  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZFEO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  PSCHLFTO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  PSCHLFO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  PSCHLFEO  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  PARTFTO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  PARTFO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PARTFEO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  PSATZFTO  PIC X(20).                                             
           02  FILLER PICTURE X(3).                                             
           02  PSATZFO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PSATZFEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRUEFFTO  PIC X(22).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEFFEO  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFOFO  PIC X(50).                                               
