       01  UU916I.                                                              
           02  FILLER PIC X(12).                                                
           02  PENRL    COMP  PIC  S9(4).                                       
           02  PENRF    PICTURE X.                                              
           02  FILLER REDEFINES PENRF.                                          
             03 PENRA    PICTURE X.                                             
           02  PENRI  PIC X(7).                                                 
           02  BIPLL    COMP  PIC  S9(4).                                       
           02  BIPLF    PICTURE X.                                              
           02  FILLER REDEFINES BIPLF.                                          
             03 BIPLA    PICTURE X.                                             
           02  BIPLI  PIC X(8).                                                 
           02  UHRZL    COMP  PIC  S9(4).                                       
           02  UHRZF    PICTURE X.                                              
           02  FILLER REDEFINES UHRZF.                                          
             03 UHRZA    PICTURE X.                                             
           02  UHRZI  PIC X(5).                                                 
           02  VEBNRL    COMP  PIC  S9(4).                                      
           02  VEBNRF    PICTURE X.                                             
           02  FILLER REDEFINES VEBNRF.                                         
             03 VEBNRA    PICTURE X.                                            
           02  VEBNRI  PIC X(7).                                                
           02  PRZL    COMP  PIC  S9(4).                                        
           02  PRZF    PICTURE X.                                               
           02  FILLER REDEFINES PRZF.                                           
             03 PRZA    PICTURE X.                                              
           02  PRZI  PIC X(1).                                                  
           02  DIR1L    COMP  PIC  S9(4).                                       
           02  DIR1F    PICTURE X.                                              
           02  FILLER REDEFINES DIR1F.                                          
             03 DIR1A    PICTURE X.                                             
           02  DIR1I  PIC X(3).                                                 
           02  WVBNRTL    COMP  PIC  S9(4).                                     
           02  WVBNRTF    PICTURE X.                                            
           02  FILLER REDEFINES WVBNRTF.                                        
             03 WVBNRTA    PICTURE X.                                           
           02  WVBNRTI  PIC X(12).                                              
           02  WVBNRL    COMP  PIC  S9(4).                                      
           02  WVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES WVBNRF.                                         
             03 WVBNRA    PICTURE X.                                            
           02  WVBNRI  PIC X(7).                                                
           02  WVBPRZL    COMP  PIC  S9(4).                                     
           02  WVBPRZF    PICTURE X.                                            
           02  FILLER REDEFINES WVBPRZF.                                        
             03 WVBPRZA    PICTURE X.                                           
           02  WVBPRZI  PIC X(1).                                               
           02  ANREDTL    COMP  PIC  S9(4).                                     
           02  ANREDTF    PICTURE X.                                            
           02  FILLER REDEFINES ANREDTF.                                        
             03 ANREDTA    PICTURE X.                                           
           02  ANREDTI  PIC X(6).                                               
           02  AUSLTL    COMP  PIC  S9(4).                                      
           02  AUSLTF    PICTURE X.                                             
           02  FILLER REDEFINES AUSLTF.                                         
             03 AUSLTA    PICTURE X.                                            
           02  AUSLTI  PIC X(9).                                                
           02  ANREDL    COMP  PIC  S9(4).                                      
           02  ANREDF    PICTURE X.                                             
           02  FILLER REDEFINES ANREDF.                                         
             03 ANREDA    PICTURE X.                                            
           02  ANREDI  PIC X(11).                                               
           02  AUSLL    COMP  PIC  S9(4).                                       
           02  AUSLF    PICTURE X.                                              
           02  FILLER REDEFINES AUSLF.                                          
             03 AUSLA    PICTURE X.                                             
           02  AUSLI  PIC X(3).                                                 
           02  ANREDEL    COMP  PIC  S9(4).                                     
           02  ANREDEF    PICTURE X.                                            
           02  FILLER REDEFINES ANREDEF.                                        
             03 ANREDEA    PICTURE X.                                           
           02  ANREDEI  PIC X(9).                                               
           02  AUSLEL    COMP  PIC  S9(4).                                      
           02  AUSLEF    PICTURE X.                                             
           02  FILLER REDEFINES AUSLEF.                                         
             03 AUSLEA    PICTURE X.                                            
           02  AUSLEI  PIC X(3).                                                
           02  ZUNAMTL    COMP  PIC  S9(4).                                     
           02  ZUNAMTF    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAMTF.                                        
             03 ZUNAMTA    PICTURE X.                                           
           02  ZUNAMTI  PIC X(6).                                               
           02  ZUNAML    COMP  PIC  S9(4).                                      
           02  ZUNAMF    PICTURE X.                                             
           02  FILLER REDEFINES ZUNAMF.                                         
             03 ZUNAMA    PICTURE X.                                            
           02  ZUNAMI  PIC X(20).                                               
           02  ZUNAMEL    COMP  PIC  S9(4).                                     
           02  ZUNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAMEF.                                        
             03 ZUNAMEA    PICTURE X.                                           
           02  ZUNAMEI  PIC X(20).                                              
           02  VORNTL    COMP  PIC  S9(4).                                      
           02  VORNTF    PICTURE X.                                             
           02  FILLER REDEFINES VORNTF.                                         
             03 VORNTA    PICTURE X.                                            
           02  VORNTI  PIC X(7).                                                
           02  VORNL    COMP  PIC  S9(4).                                       
           02  VORNF    PICTURE X.                                              
           02  FILLER REDEFINES VORNF.                                          
             03 VORNA    PICTURE X.                                             
           02  VORNI  PIC X(20).                                                
           02  VORNEL    COMP  PIC  S9(4).                                      
           02  VORNEF    PICTURE X.                                             
           02  FILLER REDEFINES VORNEF.                                         
             03 VORNEA    PICTURE X.                                            
           02  VORNEI  PIC X(20).                                               
           02  STRTL    COMP  PIC  S9(4).                                       
           02  STRTF    PICTURE X.                                              
           02  FILLER REDEFINES STRTF.                                          
             03 STRTA    PICTURE X.                                             
           02  STRTI  PIC X(7).                                                 
           02  STRL    COMP  PIC  S9(4).                                        
           02  STRF    PICTURE X.                                               
           02  FILLER REDEFINES STRF.                                           
             03 STRA    PICTURE X.                                              
           02  STRI  PIC X(20).                                                 
           02  STREL    COMP  PIC  S9(4).                                       
           02  STREF    PICTURE X.                                              
           02  FILLER REDEFINES STREF.                                          
             03 STREA    PICTURE X.                                             
           02  STREI  PIC X(20).                                                
           02  PLZTL    COMP  PIC  S9(4).                                       
           02  PLZTF    PICTURE X.                                              
           02  FILLER REDEFINES PLZTF.                                          
             03 PLZTA    PICTURE X.                                             
           02  PLZTI  PIC X(3).                                                 
           02  ORTTL    COMP  PIC  S9(4).                                       
           02  ORTTF    PICTURE X.                                              
           02  FILLER REDEFINES ORTTF.                                          
             03 ORTTA    PICTURE X.                                             
           02  ORTTI  PIC X(7).                                                 
           02  PBTL    COMP  PIC  S9(4).                                        
           02  PBTF    PICTURE X.                                               
           02  FILLER REDEFINES PBTF.                                           
             03 PBTA    PICTURE X.                                              
           02  PBTI  PIC X(5).                                                  
           02  PLZL    COMP  PIC  S9(4).                                        
           02  PLZF    PICTURE X.                                               
           02  FILLER REDEFINES PLZF.                                           
             03 PLZA    PICTURE X.                                              
           02  PLZI  PIC X(6).                                                  
           02  ORTL    COMP  PIC  S9(4).                                        
           02  ORTF    PICTURE X.                                               
           02  FILLER REDEFINES ORTF.                                           
             03 ORTA    PICTURE X.                                              
           02  ORTI  PIC X(16).                                                 
           02  PB1L    COMP  PIC  S9(4).                                        
           02  PB1F    PICTURE X.                                               
           02  FILLER REDEFINES PB1F.                                           
             03 PB1A    PICTURE X.                                              
           02  PB1I.                                                            
             03  KLAMMLI  PIC X(1).                                             
             03  PBI  PIC X(1).                                                 
             03  KLAMMRI  PIC X(1).                                             
           02  PLZEL    COMP  PIC  S9(4).                                       
           02  PLZEF    PICTURE X.                                              
           02  FILLER REDEFINES PLZEF.                                          
             03 PLZEA    PICTURE X.                                             
           02  PLZEI  PIC X(6).                                                 
           02  ORTEL    COMP  PIC  S9(4).                                       
           02  ORTEF    PICTURE X.                                              
           02  FILLER REDEFINES ORTEF.                                          
             03 ORTEA    PICTURE X.                                             
           02  ORTEI  PIC X(16).                                                
           02  PBEL    COMP  PIC  S9(4).                                        
           02  PBEF    PICTURE X.                                               
           02  FILLER REDEFINES PBEF.                                           
             03 PBEA    PICTURE X.                                              
           02  PBEI  PIC X(1).                                                  
           02  TGEFUNL    COMP  PIC  S9(4).                                     
           02  TGEFUNF    PICTURE X.                                            
           02  FILLER REDEFINES TGEFUNF.                                        
             03 TGEFUNA    PICTURE X.                                           
           02  TGEFUNI  PIC X(9).                                               
           02  TELTL    COMP  PIC  S9(4).                                       
           02  TELTF    PICTURE X.                                              
           02  FILLER REDEFINES TELTF.                                          
             03 TELTA    PICTURE X.                                             
           02  TELTI  PIC X(6).                                                 
           02  GEFUNL    COMP  PIC  S9(4).                                      
           02  GEFUNF    PICTURE X.                                             
           02  FILLER REDEFINES GEFUNF.                                         
             03 GEFUNA    PICTURE X.                                            
           02  GEFUNI  PIC X(8).                                                
           02  TELL    COMP  PIC  S9(4).                                        
           02  TELF    PICTURE X.                                               
           02  FILLER REDEFINES TELF.                                           
             03 TELA    PICTURE X.                                              
           02  TELI  PIC X(14).                                                 
           02  GEFUNKEL    COMP  PIC  S9(4).                                    
           02  GEFUNKEF    PICTURE X.                                           
           02  FILLER REDEFINES GEFUNKEF.                                       
             03 GEFUNKEA    PICTURE X.                                          
           02  GEFUNKEI  PIC X(6).                                              
           02  TELEL    COMP  PIC  S9(4).                                       
           02  TELEF    PICTURE X.                                              
           02  FILLER REDEFINES TELEF.                                          
             03 TELEA    PICTURE X.                                             
           02  TELEI  PIC X(14).                                                
           02  EDATTL    COMP  PIC  S9(4).                                      
           02  EDATTF    PICTURE X.                                             
           02  FILLER REDEFINES EDATTF.                                         
             03 EDATTA    PICTURE X.                                            
           02  EDATTI  PIC X(8).                                                
           02  EDAT1L    COMP  PIC  S9(4).                                      
           02  EDAT1F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT1F.                                         
             03 EDAT1A    PICTURE X.                                            
           02  EDAT1I  PIC X(8).                                                
           02  EDAT2L    COMP  PIC  S9(4).                                      
           02  EDAT2F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT2F.                                         
             03 EDAT2A    PICTURE X.                                            
           02  EDAT2I  PIC X(8).                                                
           02  EDAT3L    COMP  PIC  S9(4).                                      
           02  EDAT3F    PICTURE X.                                             
           02  FILLER REDEFINES EDAT3F.                                         
             03 EDAT3A    PICTURE X.                                            
           02  EDAT3I  PIC X(8).                                                
           02  EDATEL    COMP  PIC  S9(4).                                      
           02  EDATEF    PICTURE X.                                             
           02  FILLER REDEFINES EDATEF.                                         
             03 EDATEA    PICTURE X.                                            
           02  EDATEI  PIC X(6).                                                
           02  ADATTL    COMP  PIC  S9(4).                                      
           02  ADATTF    PICTURE X.                                             
           02  FILLER REDEFINES ADATTF.                                         
             03 ADATTA    PICTURE X.                                            
           02  ADATTI  PIC X(8).                                                
           02  ADAT1L    COMP  PIC  S9(4).                                      
           02  ADAT1F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT1F.                                         
             03 ADAT1A    PICTURE X.                                            
           02  ADAT1I  PIC X(8).                                                
           02  ADATKZL    COMP  PIC  S9(4).                                     
           02  ADATKZF    PICTURE X.                                            
           02  FILLER REDEFINES ADATKZF.                                        
             03 ADATKZA    PICTURE X.                                           
           02  ADATKZI  PIC X(1).                                               
           02  ADAT2L    COMP  PIC  S9(4).                                      
           02  ADAT2F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT2F.                                         
             03 ADAT2A    PICTURE X.                                            
           02  ADAT2I  PIC X(8).                                                
           02  ADAT3L    COMP  PIC  S9(4).                                      
           02  ADAT3F    PICTURE X.                                             
           02  FILLER REDEFINES ADAT3F.                                         
             03 ADAT3A    PICTURE X.                                            
           02  ADAT3I  PIC X(8).                                                
           02  ADATEL    COMP  PIC  S9(4).                                      
           02  ADATEF    PICTURE X.                                             
           02  FILLER REDEFINES ADATEF.                                         
             03 ADATEA    PICTURE X.                                            
           02  ADATEI  PIC X(6).                                                
           02  AUSGTL    COMP  PIC  S9(4).                                      
           02  AUSGTF    PICTURE X.                                             
           02  FILLER REDEFINES AUSGTF.                                         
             03 AUSGTA    PICTURE X.                                            
           02  AUSGTI  PIC X(9).                                                
           02  AUSG1L    COMP  PIC  S9(4).                                      
           02  AUSG1F    PICTURE X.                                             
           02  FILLER REDEFINES AUSG1F.                                         
             03 AUSG1A    PICTURE X.                                            
           02  AUSG1I  PIC X(2).                                                
           02  AUSG2L    COMP  PIC  S9(4).                                      
           02  AUSG2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSG2F.                                         
             03 AUSG2A    PICTURE X.                                            
           02  AUSG2I  PIC X(2).                                                
           02  AUSG3L    COMP  PIC  S9(4).                                      
           02  AUSG3F    PICTURE X.                                             
           02  FILLER REDEFINES AUSG3F.                                         
             03 AUSG3A    PICTURE X.                                            
           02  AUSG3I  PIC X(2).                                                
           02  AUSGEL    COMP  PIC  S9(4).                                      
           02  AUSGEF    PICTURE X.                                             
           02  FILLER REDEFINES AUSGEF.                                         
             03 AUSGEA    PICTURE X.                                            
           02  AUSGEI  PIC X(2).                                                
           02  PROVRTL    COMP  PIC  S9(4).                                     
           02  PROVRTF    PICTURE X.                                            
           02  FILLER REDEFINES PROVRTF.                                        
             03 PROVRTA    PICTURE X.                                           
           02  PROVRTI  PIC X(11).                                              
           02  PROVRL    COMP  PIC  S9(4).                                      
           02  PROVRF    PICTURE X.                                             
           02  FILLER REDEFINES PROVRF.                                         
             03 PROVRA    PICTURE X.                                            
           02  PROVRI  PIC X(5).                                                
           02  TSEITL    COMP  PIC  S9(4).                                      
           02  TSEITF    PICTURE X.                                             
           02  FILLER REDEFINES TSEITF.                                         
             03 TSEITA    PICTURE X.                                            
           02  TSEITI  PIC X(4).                                                
           02  PROVDATL    COMP  PIC  S9(4).                                    
           02  PROVDATF    PICTURE X.                                           
           02  FILLER REDEFINES PROVDATF.                                       
             03 PROVDATA    PICTURE X.                                          
           02  PROVDATI  PIC X(8).                                              
           02  SCHECKL    COMP  PIC  S9(4).                                     
           02  SCHECKF    PICTURE X.                                            
           02  FILLER REDEFINES SCHECKF.                                        
             03 SCHECKA    PICTURE X.                                           
           02  SCHECKI  PIC X(4).                                               
           02  PROVREL    COMP  PIC  S9(4).                                     
           02  PROVREF    PICTURE X.                                            
           02  FILLER REDEFINES PROVREF.                                        
             03 PROVREA    PICTURE X.                                           
           02  PROVREI  PIC X(5).                                               
           02  SCHECKTL    COMP  PIC  S9(4).                                    
           02  SCHECKTF    PICTURE X.                                           
           02  FILLER REDEFINES SCHECKTF.                                       
             03 SCHECKTA    PICTURE X.                                          
           02  SCHECKTI  PIC X(6).                                              
           02  SCHECKEL    COMP  PIC  S9(4).                                    
           02  SCHECKEF    PICTURE X.                                           
           02  FILLER REDEFINES SCHECKEF.                                       
             03 SCHECKEA    PICTURE X.                                          
           02  SCHECKEI  PIC X(4).                                              
           02  VDATTL    COMP  PIC  S9(4).                                      
           02  VDATTF    PICTURE X.                                             
           02  FILLER REDEFINES VDATTF.                                         
             03 VDATTA    PICTURE X.                                            
           02  VDATTI  PIC X(9).                                                
           02  VDAT1L    COMP  PIC  S9(4).                                      
           02  VDAT1F    PICTURE X.                                             
           02  FILLER REDEFINES VDAT1F.                                         
             03 VDAT1A    PICTURE X.                                            
           02  VDAT1I  PIC X(8).                                                
           02  VDAT2L    COMP  PIC  S9(4).                                      
           02  VDAT2F    PICTURE X.                                             
           02  FILLER REDEFINES VDAT2F.                                         
             03 VDAT2A    PICTURE X.                                            
           02  VDAT2I  PIC X(8).                                                
           02  VDAT3L    COMP  PIC  S9(4).                                      
           02  VDAT3F    PICTURE X.                                             
           02  FILLER REDEFINES VDAT3F.                                         
             03 VDAT3A    PICTURE X.                                            
           02  VDAT3I  PIC X(8).                                                
           02  VDATEL    COMP  PIC  S9(4).                                      
           02  VDATEF    PICTURE X.                                             
           02  FILLER REDEFINES VDATEF.                                         
             03 VDATEA    PICTURE X.                                            
           02  VDATEI  PIC X(6).                                                
           02  STRUKTL    COMP  PIC  S9(4).                                     
           02  STRUKTF    PICTURE X.                                            
           02  FILLER REDEFINES STRUKTF.                                        
             03 STRUKTA    PICTURE X.                                           
           02  STRUKTI  PIC X(11).                                              
           02  DIRTL    COMP  PIC  S9(4).                                       
           02  DIRTF    PICTURE X.                                              
           02  FILLER REDEFINES DIRTF.                                          
             03 DIRTA    PICTURE X.                                             
           02  DIRTI  PIC X(3).                                                 
           02  STRUK1L    COMP  PIC  S9(4).                                     
           02  STRUK1F    PICTURE X.                                            
           02  FILLER REDEFINES STRUK1F.                                        
             03 STRUK1A    PICTURE X.                                           
           02  STRUK1I  PIC X(8).                                               
           02  STRUK2L    COMP  PIC  S9(4).                                     
           02  STRUK2F    PICTURE X.                                            
           02  FILLER REDEFINES STRUK2F.                                        
             03 STRUK2A    PICTURE X.                                           
           02  STRUK2I  PIC X(8).                                               
           02  STRUK3L    COMP  PIC  S9(4).                                     
           02  STRUK3F    PICTURE X.                                            
           02  FILLER REDEFINES STRUK3F.                                        
             03 STRUK3A    PICTURE X.                                           
           02  STRUK3I  PIC X(8).                                               
           02  STRUKEL    COMP  PIC  S9(4).                                     
           02  STRUKEF    PICTURE X.                                            
           02  FILLER REDEFINES STRUKEF.                                        
             03 STRUKEA    PICTURE X.                                           
           02  STRUKEI  PIC X(4).                                               
           02  DIREL    COMP  PIC  S9(4).                                       
           02  DIREF    PICTURE X.                                              
           02  FILLER REDEFINES DIREF.                                          
             03 DIREA    PICTURE X.                                             
           02  DIREI  PIC X(3).                                                 
           02  TAPSL    COMP  PIC  S9(4).                                       
           02  TAPSF    PICTURE X.                                              
           02  FILLER REDEFINES TAPSF.                                          
             03 TAPSA    PICTURE X.                                             
           02  TAPSI  PIC X(9).                                                 
           02  APS1L    COMP  PIC  S9(4).                                       
           02  APS1F    PICTURE X.                                              
           02  FILLER REDEFINES APS1F.                                          
             03 APS1A    PICTURE X.                                             
           02  APS1I  PIC X(5).                                                 
           02  TAPS1L    COMP  PIC  S9(4).                                      
           02  TAPS1F    PICTURE X.                                             
           02  FILLER REDEFINES TAPS1F.                                         
             03 TAPS1A    PICTURE X.                                            
           02  TAPS1I  PIC X(1).                                                
           02  APS2L    COMP  PIC  S9(4).                                       
           02  APS2F    PICTURE X.                                              
           02  FILLER REDEFINES APS2F.                                          
             03 APS2A    PICTURE X.                                             
           02  APS2I  PIC X(5).                                                 
           02  TAPS2L    COMP  PIC  S9(4).                                      
           02  TAPS2F    PICTURE X.                                             
           02  FILLER REDEFINES TAPS2F.                                         
             03 TAPS2A    PICTURE X.                                            
           02  TAPS2I  PIC X(1).                                                
           02  APS3L    COMP  PIC  S9(4).                                       
           02  APS3F    PICTURE X.                                              
           02  FILLER REDEFINES APS3F.                                          
             03 APS3A    PICTURE X.                                             
           02  APS3I  PIC X(5).                                                 
           02  TAPS3L    COMP  PIC  S9(4).                                      
           02  TAPS3F    PICTURE X.                                             
           02  FILLER REDEFINES TAPS3F.                                         
             03 TAPS3A    PICTURE X.                                            
           02  TAPS3I  PIC X(1).                                                
           02  APSEL    COMP  PIC  S9(4).                                       
           02  APSEF    PICTURE X.                                              
           02  FILLER REDEFINES APSEF.                                          
             03 APSEA    PICTURE X.                                             
           02  APSEI  PIC X(5).                                                 
           02  TAPSEL    COMP  PIC  S9(4).                                      
           02  TAPSEF    PICTURE X.                                             
           02  FILLER REDEFINES TAPSEF.                                         
             03 TAPSEA    PICTURE X.                                            
           02  TAPSEI  PIC X(1).                                                
           02  TTAETL    COMP  PIC  S9(4).                                      
           02  TTAETF    PICTURE X.                                             
           02  FILLER REDEFINES TTAETF.                                         
             03 TTAETA    PICTURE X.                                            
           02  TTAETI  PIC X(16).                                               
           02  TAET1L    COMP  PIC  S9(4).                                      
           02  TAET1F    PICTURE X.                                             
           02  FILLER REDEFINES TAET1F.                                         
             03 TAET1A    PICTURE X.                                            
           02  TAET1I  PIC X(4).                                                
           02  TAET2L    COMP  PIC  S9(4).                                      
           02  TAET2F    PICTURE X.                                             
           02  FILLER REDEFINES TAET2F.                                         
             03 TAET2A    PICTURE X.                                            
           02  TAET2I  PIC X(4).                                                
           02  TAET3L    COMP  PIC  S9(4).                                      
           02  TAET3F    PICTURE X.                                             
           02  FILLER REDEFINES TAET3F.                                         
             03 TAET3A    PICTURE X.                                            
           02  TAET3I  PIC X(4).                                                
           02  BETRTL    COMP  PIC  S9(4).                                      
           02  BETRTF    PICTURE X.                                             
           02  FILLER REDEFINES BETRTF.                                         
             03 BETRTA    PICTURE X.                                            
           02  BETRTI  PIC X(13).                                               
           02  BETR1L    COMP  PIC  S9(4).                                      
           02  BETR1F    PICTURE X.                                             
           02  FILLER REDEFINES BETR1F.                                         
             03 BETR1A    PICTURE X.                                            
           02  BETR1I  PIC X(9).                                                
           02  BETR2L    COMP  PIC  S9(4).                                      
           02  BETR2F    PICTURE X.                                             
           02  FILLER REDEFINES BETR2F.                                         
             03 BETR2A    PICTURE X.                                            
           02  BETR2I  PIC X(9).                                                
           02  BETR3L    COMP  PIC  S9(4).                                      
           02  BETR3F    PICTURE X.                                             
           02  FILLER REDEFINES BETR3F.                                         
             03 BETR3A    PICTURE X.                                            
           02  BETR3I  PIC X(9).                                                
           02  BETREL    COMP  PIC  S9(4).                                      
           02  BETREF    PICTURE X.                                             
           02  FILLER REDEFINES BETREF.                                         
             03 BETREA    PICTURE X.                                            
           02  BETREI  PIC X(7).                                                
           02  PRZEL    COMP  PIC  S9(4).                                       
           02  PRZEF    PICTURE X.                                              
           02  FILLER REDEFINES PRZEF.                                          
             03 PRZEA    PICTURE X.                                             
           02  PRZEI  PIC X(1).                                                 
           02  TSTUFL    COMP  PIC  S9(4).                                      
           02  TSTUFF    PICTURE X.                                             
           02  FILLER REDEFINES TSTUFF.                                         
             03 TSTUFA    PICTURE X.                                            
           02  TSTUFI  PIC X(6).                                                
           02  STUF1L    COMP  PIC  S9(4).                                      
           02  STUF1F    PICTURE X.                                             
           02  FILLER REDEFINES STUF1F.                                         
             03 STUF1A    PICTURE X.                                            
           02  STUF1I  PIC X(4).                                                
           02  STUF2L    COMP  PIC  S9(4).                                      
           02  STUF2F    PICTURE X.                                             
           02  FILLER REDEFINES STUF2F.                                         
             03 STUF2A    PICTURE X.                                            
           02  STUF2I  PIC X(4).                                                
           02  STUF3L    COMP  PIC  S9(4).                                      
           02  STUF3F    PICTURE X.                                             
           02  FILLER REDEFINES STUF3F.                                         
             03 STUF3A    PICTURE X.                                            
           02  STUF3I  PIC X(4).                                                
           02  TNAMEL    COMP  PIC  S9(4).                                      
           02  TNAMEF    PICTURE X.                                             
           02  FILLER REDEFINES TNAMEF.                                         
             03 TNAMEA    PICTURE X.                                            
           02  TNAMEI  PIC X(5).                                                
           02  BNAM1L    COMP  PIC  S9(4).                                      
           02  BNAM1F    PICTURE X.                                             
           02  FILLER REDEFINES BNAM1F.                                         
             03 BNAM1A    PICTURE X.                                            
           02  BNAM1I  PIC X(8).                                                
           02  BNAM2L    COMP  PIC  S9(4).                                      
           02  BNAM2F    PICTURE X.                                             
           02  FILLER REDEFINES BNAM2F.                                         
             03 BNAM2A    PICTURE X.                                            
           02  BNAM2I  PIC X(8).                                                
           02  BNAM3L    COMP  PIC  S9(4).                                      
           02  BNAM3F    PICTURE X.                                             
           02  FILLER REDEFINES BNAM3F.                                         
             03 BNAM3A    PICTURE X.                                            
           02  BNAM3I  PIC X(8).                                                
           02  BPROVTL    COMP  PIC  S9(4).                                     
           02  BPROVTF    PICTURE X.                                            
           02  FILLER REDEFINES BPROVTF.                                        
             03 BPROVTA    PICTURE X.                                           
           02  BPROVTI  PIC X(9).                                               
           02  BPROV1L    COMP  PIC  S9(4).                                     
           02  BPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV1F.                                        
             03 BPROV1A    PICTURE X.                                           
           02  BPROV1I  PIC X(5).                                               
           02  BPRKZ1L    COMP  PIC  S9(4).                                     
           02  BPRKZ1F    PICTURE X.                                            
           02  FILLER REDEFINES BPRKZ1F.                                        
             03 BPRKZ1A    PICTURE X.                                           
           02  BPRKZ1I  PIC X(1).                                               
           02  BPROV2L    COMP  PIC  S9(4).                                     
           02  BPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV2F.                                        
             03 BPROV2A    PICTURE X.                                           
           02  BPROV2I  PIC X(5).                                               
           02  BPRKZ2L    COMP  PIC  S9(4).                                     
           02  BPRKZ2F    PICTURE X.                                            
           02  FILLER REDEFINES BPRKZ2F.                                        
             03 BPRKZ2A    PICTURE X.                                           
           02  BPRKZ2I  PIC X(1).                                               
           02  BPROV3L    COMP  PIC  S9(4).                                     
           02  BPROV3F    PICTURE X.                                            
           02  FILLER REDEFINES BPROV3F.                                        
             03 BPROV3A    PICTURE X.                                           
           02  BPROV3I  PIC X(5).                                               
           02  BPRKZ3L    COMP  PIC  S9(4).                                     
           02  BPRKZ3F    PICTURE X.                                            
           02  FILLER REDEFINES BPRKZ3F.                                        
             03 BPRKZ3A    PICTURE X.                                           
           02  BPRKZ3I  PIC X(1).                                               
           02  BPROVEL    COMP  PIC  S9(4).                                     
           02  BPROVEF    PICTURE X.                                            
           02  FILLER REDEFINES BPROVEF.                                        
             03 BPROVEA    PICTURE X.                                           
           02  BPROVEI  PIC X(5).                                               
           02  TBPROVL    COMP  PIC  S9(4).                                     
           02  TBPROVF    PICTURE X.                                            
           02  FILLER REDEFINES TBPROVF.                                        
             03 TBPROVA    PICTURE X.                                           
           02  TBPROVI  PIC X(1).                                               
           02  FEHL1L    COMP  PIC  S9(4).                                      
           02  FEHL1F    PICTURE X.                                             
           02  FILLER REDEFINES FEHL1F.                                         
             03 FEHL1A    PICTURE X.                                            
           02  FEHL1I  PIC X(75).                                               
           02  TEXT1L    COMP  PIC  S9(4).                                      
           02  TEXT1F    PICTURE X.                                             
           02  FILLER REDEFINES TEXT1F.                                         
             03 TEXT1A    PICTURE X.                                            
           02  TEXT1I  PIC X(21).                                               
           02  PRUEFL    COMP  PIC  S9(4).                                      
           02  PRUEFF    PICTURE X.                                             
           02  FILLER REDEFINES PRUEFF.                                         
             03 PRUEFA    PICTURE X.                                            
           02  PRUEFI  PIC X(1).                                                
           02  TEXT2L    COMP  PIC  S9(4).                                      
           02  TEXT2F    PICTURE X.                                             
           02  FILLER REDEFINES TEXT2F.                                         
             03 TEXT2A    PICTURE X.                                            
           02  TEXT2I  PIC X(26).                                               
           02  NBETR1L    COMP  PIC  S9(4).                                     
           02  NBETR1F    PICTURE X.                                            
           02  FILLER REDEFINES NBETR1F.                                        
             03 NBETR1A    PICTURE X.                                           
           02  NBETR1I  PIC X(3).                                               
           02  NBETR2L    COMP  PIC  S9(4).                                     
           02  NBETR2F    PICTURE X.                                            
           02  FILLER REDEFINES NBETR2F.                                        
             03 NBETR2A    PICTURE X.                                           
           02  NBETR2I  PIC X(4).                                               
           02  NPRZL    COMP  PIC  S9(4).                                       
           02  NPRZF    PICTURE X.                                              
           02  FILLER REDEFINES NPRZF.                                          
             03 NPRZA    PICTURE X.                                             
           02  NPRZI  PIC X(1).                                                 
       01  UU916O REDEFINES UU916I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PENRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  BIPLO  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHRZO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VEBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DIR1O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  WVBNRTO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  WVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  WVBPRZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANREDTO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANREDO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANREDEO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  AUSLEO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMTO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  ZUNAMEO  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VORNTO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VORNO  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  VORNEO  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  STRTO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STRO  PIC X(20).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STREO  PIC X(20).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZTO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORTTO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PBTO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  PLZO  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ORTO  PIC X(16).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PB1O.                                                            
             03  KLAMMLO  PIC X(1).                                             
             03  PBO  PIC X(1).                                                 
             03  KLAMMRO  PIC X(1).                                             
           02  FILLER PICTURE X(3).                                             
           02  PLZEO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORTEO  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  PBEO  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  TGEFUNO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  TELTO  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GEFUNO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TELO  PIC X(14).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GEFUNKEO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TELEO  PIC X(14).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDATTO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  EDAT1O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  EDAT2O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  EDAT3O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  EDATEO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ADATTO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  ADAT1O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  ADATKZO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  ADAT2O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  ADAT3O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  ADATEO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSGTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSG1O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSG2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSG3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSGEO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROVRTO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  PROVRO PIC ZZ9,9.                                                
           02  FILLER PICTURE X(3).                                             
           02  TSEITO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROVDATO PIC 99.99.99.                                           
           02  FILLER PICTURE X(3).                                             
           02  SCHECKO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVREO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  SCHECKTO  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  SCHECKEO  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  VDATTO  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  VDAT1O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  VDAT2O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  VDAT3O PIC 99.99.99.                                             
           02  FILLER PICTURE X(3).                                             
           02  VDATEO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  STRUKTO  PIC X(11).                                              
           02  FILLER PICTURE X(3).                                             
           02  DIRTO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STRUK1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STRUK2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STRUK3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STRUKEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIREO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPSO  PIC X(9).                                                 
           02  FILLER PICTURE X(3).                                             
           02  APS1O PIC ZZ9,9.                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPS1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APS2O PIC ZZ9,9.                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPS2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APS3O PIC ZZ9,9.                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPS3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  APSEO  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TAPSEO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TTAETO  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAET1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAET2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAET3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETRTO  PIC X(13).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR1O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETR2O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETR3O  PIC X(9).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETREO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZEO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TSTUFO  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUF1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUF2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUF3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TNAMEO  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  BNAM1O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  BNAM2O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  BNAM3O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPROVTO  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROV1O PIC ZZ9,9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROV2O PIC ZZ9,9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROV3O PIC ZZ9,9.                                               
           02  FILLER PICTURE X(3).                                             
           02  BPRKZ3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BPROVEO  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBPROVO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  FEHL1O  PIC X(75).                                               
           02  FILLER PICTURE X(3).                                             
           02  TEXT1O  PIC X(21).                                               
           02  FILLER PICTURE X(3).                                             
           02  PRUEFO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEXT2O  PIC X(26).                                               
           02  FILLER PICTURE X(3).                                             
           02  NBETR1O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  NBETR2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  NPRZO  PIC X(1).                                                 
