       01  UU919I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS3L    COMP  PIC  S9(4).                                      
           02  PERS3F    PICTURE X.                                             
           02  FILLER REDEFINES PERS3F.                                         
             03 PERS3A    PICTURE X.                                            
           02  PERS3I  PIC X(7).                                                
           02  DATUM3L    COMP  PIC  S9(4).                                     
           02  DATUM3F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM3F.                                        
             03 DATUM3A    PICTURE X.                                           
           02  DATUM3I  PIC X(8).                                               
           02  UHR3L    COMP  PIC  S9(4).                                       
           02  UHR3F    PICTURE X.                                              
           02  FILLER REDEFINES UHR3F.                                          
             03 UHR3A    PICTURE X.                                             
           02  UHR3I  PIC X(5).                                                 
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  PRZVB3L    COMP  PIC  S9(4).                                     
           02  PRZVB3F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB3F.                                        
             03 PRZVB3A    PICTURE X.                                           
           02  PRZVB3I  PIC X(1).                                               
           02  DIR3L    COMP  PIC  S9(4).                                       
           02  DIR3F    PICTURE X.                                              
           02  FILLER REDEFINES DIR3F.                                          
             03 DIR3A    PICTURE X.                                             
           02  DIR3I  PIC X(3).                                                 
           02  VBNA3L    COMP  PIC  S9(4).                                      
           02  VBNA3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNA3F.                                         
             03 VBNA3A    PICTURE X.                                            
           02  VBNA3I  PIC X(20).                                               
           02  VBNRVM3L    COMP  PIC  S9(4).                                    
           02  VBNRVM3F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM3F.                                       
             03 VBNRVM3A    PICTURE X.                                          
           02  VBNRVM3I  PIC X(7).                                              
           02  PRZVM3L    COMP  PIC  S9(4).                                     
           02  PRZVM3F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM3F.                                        
             03 PRZVM3A    PICTURE X.                                           
           02  PRZVM3I  PIC X(1).                                               
           02  VMNA3L    COMP  PIC  S9(4).                                      
           02  VMNA3F    PICTURE X.                                             
           02  FILLER REDEFINES VMNA3F.                                         
             03 VMNA3A    PICTURE X.                                            
           02  VMNA3I  PIC X(20).                                               
           02  TAN3L    COMP  PIC  S9(4).                                       
           02  TAN3F    PICTURE X.                                              
           02  FILLER REDEFINES TAN3F.                                          
             03 TAN3A    PICTURE X.                                             
           02  TAN3I  PIC X(6).                                                 
           02  ANREDE3L    COMP  PIC  S9(4).                                    
           02  ANREDE3F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE3F.                                       
             03 ANREDE3A    PICTURE X.                                          
           02  ANREDE3I  PIC X(9).                                              
           02  TZU3L    COMP  PIC  S9(4).                                       
           02  TZU3F    PICTURE X.                                              
           02  FILLER REDEFINES TZU3F.                                          
             03 TZU3A    PICTURE X.                                             
           02  TZU3I  PIC X(6).                                                 
           02  ZNAME3L    COMP  PIC  S9(4).                                     
           02  ZNAME3F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME3F.                                        
             03 ZNAME3A    PICTURE X.                                           
           02  ZNAME3I  PIC X(26).                                              
           02  TVOR3L    COMP  PIC  S9(4).                                      
           02  TVOR3F    PICTURE X.                                             
           02  FILLER REDEFINES TVOR3F.                                         
             03 TVOR3A    PICTURE X.                                            
           02  TVOR3I  PIC X(7).                                                
           02  VNAME3L    COMP  PIC  S9(4).                                     
           02  VNAME3F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME3F.                                        
             03 VNAME3A    PICTURE X.                                           
           02  VNAME3I  PIC X(26).                                              
           02  TSTR3L    COMP  PIC  S9(4).                                      
           02  TSTR3F    PICTURE X.                                             
           02  FILLER REDEFINES TSTR3F.                                         
             03 TSTR3A    PICTURE X.                                            
           02  TSTR3I  PIC X(7).                                                
           02  STR3L    COMP  PIC  S9(4).                                       
           02  STR3F    PICTURE X.                                              
           02  FILLER REDEFINES STR3F.                                          
             03 STR3A    PICTURE X.                                             
           02  STR3I  PIC X(26).                                                
           02  TPLZ3L    COMP  PIC  S9(4).                                      
           02  TPLZ3F    PICTURE X.                                             
           02  FILLER REDEFINES TPLZ3F.                                         
             03 TPLZ3A    PICTURE X.                                            
           02  TPLZ3I  PIC X(3).                                                
           02  TORT3L    COMP  PIC  S9(4).                                      
           02  TORT3F    PICTURE X.                                             
           02  FILLER REDEFINES TORT3F.                                         
             03 TORT3A    PICTURE X.                                            
           02  TORT3I  PIC X(7).                                                
           02  TAUSL3L    COMP  PIC  S9(4).                                     
           02  TAUSL3F    PICTURE X.                                            
           02  FILLER REDEFINES TAUSL3F.                                        
             03 TAUSL3A    PICTURE X.                                           
           02  TAUSL3I  PIC X(4).                                               
           02  PLZ3L    COMP  PIC  S9(4).                                       
           02  PLZ3F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ3F.                                          
             03 PLZ3A    PICTURE X.                                             
           02  PLZ3I  PIC X(5).                                                 
           02  ORT3L    COMP  PIC  S9(4).                                       
           02  ORT3F    PICTURE X.                                              
           02  FILLER REDEFINES ORT3F.                                          
             03 ORT3A    PICTURE X.                                             
           02  ORT3I  PIC X(21).                                                
           02  AUSL3L    COMP  PIC  S9(4).                                      
           02  AUSL3F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL3F.                                         
             03 AUSL3A    PICTURE X.                                            
           02  AUSL3I  PIC X(3).                                                
           02  TPRODL    COMP  PIC  S9(4).                                      
           02  TPRODF    PICTURE X.                                             
           02  FILLER REDEFINES TPRODF.                                         
             03 TPRODA    PICTURE X.                                            
           02  TPRODI  PIC X(7).                                                
           02  PROD3L    COMP  PIC  S9(4).                                      
           02  PROD3F    PICTURE X.                                             
           02  FILLER REDEFINES PROD3F.                                         
             03 PROD3A    PICTURE X.                                            
           02  PROD3I  PIC X(2).                                                
           02  TSUM3L    COMP  PIC  S9(4).                                      
           02  TSUM3F    PICTURE X.                                             
           02  FILLER REDEFINES TSUM3F.                                         
             03 TSUM3A    PICTURE X.                                            
           02  TSUM3I  PIC X(16).                                               
           02  SUMME3L    COMP  PIC  S9(4).                                     
           02  SUMME3F    PICTURE X.                                            
           02  FILLER REDEFINES SUMME3F.                                        
             03 SUMME3A    PICTURE X.                                           
           02  SUMME3I  PIC X(10).                                              
           02  TKRED3L    COMP  PIC  S9(4).                                     
           02  TKRED3F    PICTURE X.                                            
           02  FILLER REDEFINES TKRED3F.                                        
             03 TKRED3A    PICTURE X.                                           
           02  TKRED3I  PIC X(6).                                               
           02  KRED3L    COMP  PIC  S9(4).                                      
           02  KRED3F    PICTURE X.                                             
           02  FILLER REDEFINES KRED3F.                                         
             03 KRED3A    PICTURE X.                                            
           02  KRED3I  PIC X(10).                                               
           02  TART3L    COMP  PIC  S9(4).                                      
           02  TART3F    PICTURE X.                                             
           02  FILLER REDEFINES TART3F.                                         
             03 TART3A    PICTURE X.                                            
           02  TART3I  PIC X(10).                                               
           02  ANART3L    COMP  PIC  S9(4).                                     
           02  ANART3F    PICTURE X.                                            
           02  FILLER REDEFINES ANART3F.                                        
             03 ANART3A    PICTURE X.                                           
           02  ANART3I  PIC X(1).                                               
           02  TAND3L    COMP  PIC  S9(4).                                      
           02  TAND3F    PICTURE X.                                             
           02  FILLER REDEFINES TAND3F.                                         
             03 TAND3A    PICTURE X.                                            
           02  TAND3I  PIC X(6).                                                
           02  ANDAT3L    COMP  PIC  S9(4).                                     
           02  ANDAT3F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT3F.                                        
             03 ANDAT3A    PICTURE X.                                           
           02  ANDAT3I  PIC X(6).                                               
           02  TERD3L    COMP  PIC  S9(4).                                      
           02  TERD3F    PICTURE X.                                             
           02  FILLER REDEFINES TERD3F.                                         
             03 TERD3A    PICTURE X.                                            
           02  TERD3I  PIC X(10).                                               
           02  ERFDAT3L    COMP  PIC  S9(4).                                    
           02  ERFDAT3F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT3F.                                       
             03 ERFDAT3A    PICTURE X.                                          
           02  ERFDAT3I  PIC X(6).                                              
           02  TSTAT3L    COMP  PIC  S9(4).                                     
           02  TSTAT3F    PICTURE X.                                            
           02  FILLER REDEFINES TSTAT3F.                                        
             03 TSTAT3A    PICTURE X.                                           
           02  TSTAT3I  PIC X(7).                                               
           02  STATUS3L    COMP  PIC  S9(4).                                    
           02  STATUS3F    PICTURE X.                                           
           02  FILLER REDEFINES STATUS3F.                                       
             03 STATUS3A    PICTURE X.                                          
           02  STATUS3I  PIC X(2).                                              
           02  TEING3L    COMP  PIC  S9(4).                                     
           02  TEING3F    PICTURE X.                                            
           02  FILLER REDEFINES TEING3F.                                        
             03 TEING3A    PICTURE X.                                           
           02  TEING3I  PIC X(46).                                              
           02  EING3L    COMP  PIC  S9(4).                                      
           02  EING3F    PICTURE X.                                             
           02  FILLER REDEFINES EING3F.                                         
             03 EING3A    PICTURE X.                                            
           02  EING3I  PIC X(1).                                                
           02  FEHLER3L    COMP  PIC  S9(4).                                    
           02  FEHLER3F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER3F.                                       
             03 FEHLER3A    PICTURE X.                                          
           02  FEHLER3I  PIC X(78).                                             
       01  UU919O REDEFINES UU919I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIR3O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNA3O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM3O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VMNA3O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAN3O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANREDE3O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZU3O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZNAME3O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVOR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNAME3O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  STR3O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPLZ3O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TORT3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAUSL3O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT3O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL3O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPRODO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PROD3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TSUM3O  PIC X(16).                                               
           02  FILLER PICTURE X(3).                                             
           02  SUMME3O  PIC X(10).                                              
           02  FILLER PICTURE X(3).                                             
           02  TKRED3O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  KRED3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  TART3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANART3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAND3O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANDAT3O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TERD3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT3O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTAT3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  STATUS3O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEING3O  PIC X(46).                                              
           02  FILLER PICTURE X(3).                                             
           02  EING3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FEHLER3O  PIC X(78).                                             
