       01  UU918I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS2L    COMP  PIC  S9(4).                                      
           02  PERS2F    PICTURE X.                                             
           02  FILLER REDEFINES PERS2F.                                         
             03 PERS2A    PICTURE X.                                            
           02  PERS2I  PIC X(7).                                                
           02  DATUM2L    COMP  PIC  S9(4).                                     
           02  DATUM2F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM2F.                                        
             03 DATUM2A    PICTURE X.                                           
           02  DATUM2I  PIC X(8).                                               
           02  UHR2L    COMP  PIC  S9(4).                                       
           02  UHR2F    PICTURE X.                                              
           02  FILLER REDEFINES UHR2F.                                          
             03 UHR2A    PICTURE X.                                             
           02  UHR2I  PIC X(5).                                                 
           02  GES2L    COMP  PIC  S9(4).                                       
           02  GES2F    PICTURE X.                                              
           02  FILLER REDEFINES GES2F.                                          
             03 GES2A    PICTURE X.                                             
           02  GES2I  PIC X(13).                                                
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  PRZVB2L    COMP  PIC  S9(4).                                     
           02  PRZVB2F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVB2F.                                        
             03 PRZVB2A    PICTURE X.                                           
           02  PRZVB2I  PIC X(1).                                               
           02  DIR2L    COMP  PIC  S9(4).                                       
           02  DIR2F    PICTURE X.                                              
           02  FILLER REDEFINES DIR2F.                                          
             03 DIR2A    PICTURE X.                                             
           02  DIR2I  PIC X(3).                                                 
           02  VBNA2L    COMP  PIC  S9(4).                                      
           02  VBNA2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNA2F.                                         
             03 VBNA2A    PICTURE X.                                            
           02  VBNA2I  PIC X(20).                                               
           02  VBNRVM2L    COMP  PIC  S9(4).                                    
           02  VBNRVM2F    PICTURE X.                                           
           02  FILLER REDEFINES VBNRVM2F.                                       
             03 VBNRVM2A    PICTURE X.                                          
           02  VBNRVM2I  PIC X(7).                                              
           02  PRZVM2L    COMP  PIC  S9(4).                                     
           02  PRZVM2F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVM2F.                                        
             03 PRZVM2A    PICTURE X.                                           
           02  PRZVM2I  PIC X(1).                                               
           02  VMNA2L    COMP  PIC  S9(4).                                      
           02  VMNA2F    PICTURE X.                                             
           02  FILLER REDEFINES VMNA2F.                                         
             03 VMNA2A    PICTURE X.                                            
           02  VMNA2I  PIC X(20).                                               
           02  TVT2L    COMP  PIC  S9(4).                                       
           02  TVT2F    PICTURE X.                                              
           02  FILLER REDEFINES TVT2F.                                          
             03 TVT2A    PICTURE X.                                             
           02  TVT2I  PIC X(10).                                                
           02  VNR2L    COMP  PIC  S9(4).                                       
           02  VNR2F    PICTURE X.                                              
           02  FILLER REDEFINES VNR2F.                                          
             03 VNR2A    PICTURE X.                                             
           02  VNR2I  PIC X(11).                                                
           02  PRZVG2L    COMP  PIC  S9(4).                                     
           02  PRZVG2F    PICTURE X.                                            
           02  FILLER REDEFINES PRZVG2F.                                        
             03 PRZVG2A    PICTURE X.                                           
           02  PRZVG2I  PIC X(2).                                               
           02  TAN2L    COMP  PIC  S9(4).                                       
           02  TAN2F    PICTURE X.                                              
           02  FILLER REDEFINES TAN2F.                                          
             03 TAN2A    PICTURE X.                                             
           02  TAN2I  PIC X(6).                                                 
           02  ANREDE2L    COMP  PIC  S9(4).                                    
           02  ANREDE2F    PICTURE X.                                           
           02  FILLER REDEFINES ANREDE2F.                                       
             03 ANREDE2A    PICTURE X.                                          
           02  ANREDE2I  PIC X(9).                                              
           02  TZU2L    COMP  PIC  S9(4).                                       
           02  TZU2F    PICTURE X.                                              
           02  FILLER REDEFINES TZU2F.                                          
             03 TZU2A    PICTURE X.                                             
           02  TZU2I  PIC X(6).                                                 
           02  ZNAME2L    COMP  PIC  S9(4).                                     
           02  ZNAME2F    PICTURE X.                                            
           02  FILLER REDEFINES ZNAME2F.                                        
             03 ZNAME2A    PICTURE X.                                           
           02  ZNAME2I  PIC X(26).                                              
           02  TVOR2L    COMP  PIC  S9(4).                                      
           02  TVOR2F    PICTURE X.                                             
           02  FILLER REDEFINES TVOR2F.                                         
             03 TVOR2A    PICTURE X.                                            
           02  TVOR2I  PIC X(7).                                                
           02  VNAME2L    COMP  PIC  S9(4).                                     
           02  VNAME2F    PICTURE X.                                            
           02  FILLER REDEFINES VNAME2F.                                        
             03 VNAME2A    PICTURE X.                                           
           02  VNAME2I  PIC X(26).                                              
           02  TSTR2L    COMP  PIC  S9(4).                                      
           02  TSTR2F    PICTURE X.                                             
           02  FILLER REDEFINES TSTR2F.                                         
             03 TSTR2A    PICTURE X.                                            
           02  TSTR2I  PIC X(7).                                                
           02  STR2L    COMP  PIC  S9(4).                                       
           02  STR2F    PICTURE X.                                              
           02  FILLER REDEFINES STR2F.                                          
             03 STR2A    PICTURE X.                                             
           02  STR2I  PIC X(26).                                                
           02  TEPLZ2L    COMP  PIC  S9(4).                                     
           02  TEPLZ2F    PICTURE X.                                            
           02  FILLER REDEFINES TEPLZ2F.                                        
             03 TEPLZ2A    PICTURE X.                                           
           02  TEPLZ2I  PIC X(3).                                               
           02  TORT2L    COMP  PIC  S9(4).                                      
           02  TORT2F    PICTURE X.                                             
           02  FILLER REDEFINES TORT2F.                                         
             03 TORT2A    PICTURE X.                                            
           02  TORT2I  PIC X(7).                                                
           02  TAUSL2L    COMP  PIC  S9(4).                                     
           02  TAUSL2F    PICTURE X.                                            
           02  FILLER REDEFINES TAUSL2F.                                        
             03 TAUSL2A    PICTURE X.                                           
           02  TAUSL2I  PIC X(4).                                               
           02  PLZ2L    COMP  PIC  S9(4).                                       
           02  PLZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ2F.                                          
             03 PLZ2A    PICTURE X.                                             
           02  PLZ2I  PIC X(5).                                                 
           02  ORT2L    COMP  PIC  S9(4).                                       
           02  ORT2F    PICTURE X.                                              
           02  FILLER REDEFINES ORT2F.                                          
             03 ORT2A    PICTURE X.                                             
           02  ORT2I  PIC X(21).                                                
           02  AUSL2L    COMP  PIC  S9(4).                                      
           02  AUSL2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL2F.                                         
             03 AUSL2A    PICTURE X.                                            
           02  AUSL2I  PIC X(3).                                                
           02  TPROD2L    COMP  PIC  S9(4).                                     
           02  TPROD2F    PICTURE X.                                            
           02  FILLER REDEFINES TPROD2F.                                        
             03 TPROD2A    PICTURE X.                                           
           02  TPROD2I  PIC X(7).                                               
           02  PROD2L    COMP  PIC  S9(4).                                      
           02  PROD2F    PICTURE X.                                             
           02  FILLER REDEFINES PROD2F.                                         
             03 PROD2A    PICTURE X.                                            
           02  PROD2I  PIC X(2).                                                
           02  TBEG2L    COMP  PIC  S9(4).                                      
           02  TBEG2F    PICTURE X.                                             
           02  FILLER REDEFINES TBEG2F.                                         
             03 TBEG2A    PICTURE X.                                            
           02  TBEG2I  PIC X(15).                                               
           02  BEGINN2L    COMP  PIC  S9(4).                                    
           02  BEGINN2F    PICTURE X.                                           
           02  FILLER REDEFINES BEGINN2F.                                       
             03 BEGINN2A    PICTURE X.                                          
           02  BEGINN2I  PIC X(6).                                              
           02  TABL2L    COMP  PIC  S9(4).                                      
           02  TABL2F    PICTURE X.                                             
           02  FILLER REDEFINES TABL2F.                                         
             03 TABL2A    PICTURE X.                                            
           02  TABL2I  PIC X(7).                                                
           02  ABLAUF2L    COMP  PIC  S9(4).                                    
           02  ABLAUF2F    PICTURE X.                                           
           02  FILLER REDEFINES ABLAUF2F.                                       
             03 ABLAUF2A    PICTURE X.                                          
           02  ABLAUF2I  PIC X(6).                                              
           02  TZAHL2L    COMP  PIC  S9(4).                                     
           02  TZAHL2F    PICTURE X.                                            
           02  FILLER REDEFINES TZAHL2F.                                        
             03 TZAHL2A    PICTURE X.                                           
           02  TZAHL2I  PIC X(13).                                              
           02  ZAHLW2L    COMP  PIC  S9(4).                                     
           02  ZAHLW2F    PICTURE X.                                            
           02  FILLER REDEFINES ZAHLW2F.                                        
             03 ZAHLW2A    PICTURE X.                                           
           02  ZAHLW2I  PIC X(1).                                               
           02  TBEIT2L    COMP  PIC  S9(4).                                     
           02  TBEIT2F    PICTURE X.                                            
           02  FILLER REDEFINES TBEIT2F.                                        
             03 TBEIT2A    PICTURE X.                                           
           02  TBEIT2I  PIC X(7).                                               
           02  BEIT2L    COMP  PIC  S9(4).                                      
           02  BEIT2F    PICTURE X.                                             
           02  FILLER REDEFINES BEIT2F.                                         
             03 BEIT2A    PICTURE X.                                            
           02  BEIT2I  PIC X(8).                                                
           02  TART2L    COMP  PIC  S9(4).                                      
           02  TART2F    PICTURE X.                                             
           02  FILLER REDEFINES TART2F.                                         
             03 TART2A    PICTURE X.                                            
           02  TART2I  PIC X(10).                                               
           02  ANART2L    COMP  PIC  S9(4).                                     
           02  ANART2F    PICTURE X.                                            
           02  FILLER REDEFINES ANART2F.                                        
             03 ANART2A    PICTURE X.                                           
           02  ANART2I  PIC X(1).                                               
           02  TAND2L    COMP  PIC  S9(4).                                      
           02  TAND2F    PICTURE X.                                             
           02  FILLER REDEFINES TAND2F.                                         
             03 TAND2A    PICTURE X.                                            
           02  TAND2I  PIC X(6).                                                
           02  ANDAT2L    COMP  PIC  S9(4).                                     
           02  ANDAT2F    PICTURE X.                                            
           02  FILLER REDEFINES ANDAT2F.                                        
             03 ANDAT2A    PICTURE X.                                           
           02  ANDAT2I  PIC X(6).                                               
           02  TERD2L    COMP  PIC  S9(4).                                      
           02  TERD2F    PICTURE X.                                             
           02  FILLER REDEFINES TERD2F.                                         
             03 TERD2A    PICTURE X.                                            
           02  TERD2I  PIC X(10).                                               
           02  ERFDAT2L    COMP  PIC  S9(4).                                    
           02  ERFDAT2F    PICTURE X.                                           
           02  FILLER REDEFINES ERFDAT2F.                                       
             03 ERFDAT2A    PICTURE X.                                          
           02  ERFDAT2I  PIC X(6).                                              
           02  TSTAT2L    COMP  PIC  S9(4).                                     
           02  TSTAT2F    PICTURE X.                                            
           02  FILLER REDEFINES TSTAT2F.                                        
             03 TSTAT2A    PICTURE X.                                           
           02  TSTAT2I  PIC X(7).                                               
           02  STATUS2L    COMP  PIC  S9(4).                                    
           02  STATUS2F    PICTURE X.                                           
           02  FILLER REDEFINES STATUS2F.                                       
             03 STATUS2A    PICTURE X.                                          
           02  STATUS2I  PIC X(2).                                              
           02  TEING2L    COMP  PIC  S9(4).                                     
           02  TEING2F    PICTURE X.                                            
           02  FILLER REDEFINES TEING2F.                                        
             03 TEING2A    PICTURE X.                                           
           02  TEING2I  PIC X(46).                                              
           02  EING2L    COMP  PIC  S9(4).                                      
           02  EING2F    PICTURE X.                                             
           02  FILLER REDEFINES EING2F.                                         
             03 EING2A    PICTURE X.                                            
           02  EING2I  PIC X(1).                                                
           02  FEHLER2L    COMP  PIC  S9(4).                                    
           02  FEHLER2F    PICTURE X.                                           
           02  FILLER REDEFINES FEHLER2F.                                       
             03 FEHLER2A    PICTURE X.                                          
           02  FEHLER2I  PIC X(78).                                             
       01  UU918O REDEFINES UU918I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  GES2O  PIC X(13).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVB2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIR2O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNA2O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNRVM2O  PIC X(7).                                              
           02  FILLER PICTURE X(3).                                             
           02  PRZVM2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  VMNA2O  PIC X(20).                                               
           02  FILLER PICTURE X(3).                                             
           02  TVT2O  PIC X(10).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR2O  PIC X(11).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZVG2O  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAN2O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ANREDE2O  PIC X(9).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZU2O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZNAME2O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TVOR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNAME2O  PIC X(26).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  STR2O  PIC X(26).                                                
           02  FILLER PICTURE X(3).                                             
           02  TEPLZ2O  PIC X(3).                                               
           02  FILLER PICTURE X(3).                                             
           02  TORT2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAUSL2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PLZ2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT2O  PIC X(21).                                                
           02  FILLER PICTURE X(3).                                             
           02  AUSL2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  TPROD2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROD2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBEG2O  PIC X(15).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEGINN2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TABL2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ABLAUF2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TZAHL2O  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  ZAHLW2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TBEIT2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  BEIT2O  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  TART2O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANART2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  TAND2O  PIC X(6).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANDAT2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TERD2O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  ERFDAT2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  TSTAT2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  STATUS2O  PIC X(2).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEING2O  PIC X(46).                                              
           02  FILLER PICTURE X(3).                                             
           02  EING2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  FEHLER2O  PIC X(78).                                             
