       01  UU937I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR1L    COMP  PIC  S9(4).                                       
           02  PNR1F    PICTURE X.                                              
           02  FILLER REDEFINES PNR1F.                                          
             03 PNR1A    PICTURE X.                                             
           02  PNR1I  PIC X(7).                                                 
           02  DATUM1L    COMP  PIC  S9(4).                                     
           02  DATUM1F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM1F.                                        
             03 DATUM1A    PICTURE X.                                           
           02  DATUM1I  PIC X(8).                                               
           02  UHR1L    COMP  PIC  S9(4).                                       
           02  UHR1F    PICTURE X.                                              
           02  FILLER REDEFINES UHR1F.                                          
             03 UHR1A    PICTURE X.                                             
           02  UHR1I  PIC X(5).                                                 
           02  STAND1L    COMP  PIC  S9(4).                                     
           02  STAND1F    PICTURE X.                                            
           02  FILLER REDEFINES STAND1F.                                        
             03 STAND1A    PICTURE X.                                           
           02  STAND1I  PIC X(8).                                               
           02  VBNR1L    COMP  PIC  S9(4).                                      
           02  VBNR1F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR1F.                                         
             03 VBNR1A    PICTURE X.                                            
           02  VBNR1I  PIC X(7).                                                
           02  PRZ1L    COMP  PIC  S9(4).                                       
           02  PRZ1F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ1F.                                          
             03 PRZ1A    PICTURE X.                                             
           02  PRZ1I  PIC X(1).                                                 
           02  STUFE1L    COMP  PIC  S9(4).                                     
           02  STUFE1F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE1F.                                        
             03 STUFE1A    PICTURE X.                                           
           02  STUFE1I  PIC X(4).                                               
           02  PROV1L    COMP  PIC  S9(4).                                      
           02  PROV1F    PICTURE X.                                             
           02  FILLER REDEFINES PROV1F.                                         
             03 PROV1A    PICTURE X.                                            
           02  PROV1I  PIC X(5).                                                
           02  EPROV1L    COMP  PIC  S9(4).                                     
           02  EPROV1F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV1F.                                        
             03 EPROV1A    PICTURE X.                                           
           02  EPROV1I  PIC X(5).                                               
           02  NAME1L    COMP  PIC  S9(4).                                      
           02  NAME1F    PICTURE X.                                             
           02  FILLER REDEFINES NAME1F.                                         
             03 NAME1A    PICTURE X.                                            
           02  NAME1I  PIC X(7).                                                
           02  VBNRBL    COMP  PIC  S9(4).                                      
           02  VBNRBF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRBF.                                         
             03 VBNRBA    PICTURE X.                                            
           02  VBNRBI  PIC X(7).                                                
           02  PRZBL    COMP  PIC  S9(4).                                       
           02  PRZBF    PICTURE X.                                              
           02  FILLER REDEFINES PRZBF.                                          
             03 PRZBA    PICTURE X.                                             
           02  PRZBI  PIC X(1).                                                 
           02  STUFEBL    COMP  PIC  S9(4).                                     
           02  STUFEBF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEBF.                                        
             03 STUFEBA    PICTURE X.                                           
           02  STUFEBI  PIC X(4).                                               
           02  PROVBL    COMP  PIC  S9(4).                                      
           02  PROVBF    PICTURE X.                                             
           02  FILLER REDEFINES PROVBF.                                         
             03 PROVBA    PICTURE X.                                            
           02  PROVBI  PIC X(5).                                                
           02  EPROVBL    COMP  PIC  S9(4).                                     
           02  EPROVBF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVBF.                                        
             03 EPROVBA    PICTURE X.                                           
           02  EPROVBI  PIC X(5).                                               
           02  NAMEBL    COMP  PIC  S9(4).                                      
           02  NAMEBF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEBF.                                         
             03 NAMEBA    PICTURE X.                                            
           02  NAMEBI  PIC X(7).                                                
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  PRZ2L    COMP  PIC  S9(4).                                       
           02  PRZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ2F.                                          
             03 PRZ2A    PICTURE X.                                             
           02  PRZ2I  PIC X(1).                                                 
           02  STUFE2L    COMP  PIC  S9(4).                                     
           02  STUFE2F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE2F.                                        
             03 STUFE2A    PICTURE X.                                           
           02  STUFE2I  PIC X(4).                                               
           02  PROV2L    COMP  PIC  S9(4).                                      
           02  PROV2F    PICTURE X.                                             
           02  FILLER REDEFINES PROV2F.                                         
             03 PROV2A    PICTURE X.                                            
           02  PROV2I  PIC X(5).                                                
           02  EPROV2L    COMP  PIC  S9(4).                                     
           02  EPROV2F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV2F.                                        
             03 EPROV2A    PICTURE X.                                           
           02  EPROV2I  PIC X(5).                                               
           02  NAME2L    COMP  PIC  S9(4).                                      
           02  NAME2F    PICTURE X.                                             
           02  FILLER REDEFINES NAME2F.                                         
             03 NAME2A    PICTURE X.                                            
           02  NAME2I  PIC X(7).                                                
           02  VBNRCL    COMP  PIC  S9(4).                                      
           02  VBNRCF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRCF.                                         
             03 VBNRCA    PICTURE X.                                            
           02  VBNRCI  PIC X(7).                                                
           02  PRZCL    COMP  PIC  S9(4).                                       
           02  PRZCF    PICTURE X.                                              
           02  FILLER REDEFINES PRZCF.                                          
             03 PRZCA    PICTURE X.                                             
           02  PRZCI  PIC X(1).                                                 
           02  STUFECL    COMP  PIC  S9(4).                                     
           02  STUFECF    PICTURE X.                                            
           02  FILLER REDEFINES STUFECF.                                        
             03 STUFECA    PICTURE X.                                           
           02  STUFECI  PIC X(4).                                               
           02  PROVCL    COMP  PIC  S9(4).                                      
           02  PROVCF    PICTURE X.                                             
           02  FILLER REDEFINES PROVCF.                                         
             03 PROVCA    PICTURE X.                                            
           02  PROVCI  PIC X(5).                                                
           02  EPROVCL    COMP  PIC  S9(4).                                     
           02  EPROVCF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVCF.                                        
             03 EPROVCA    PICTURE X.                                           
           02  EPROVCI  PIC X(5).                                               
           02  NAMECL    COMP  PIC  S9(4).                                      
           02  NAMECF    PICTURE X.                                             
           02  FILLER REDEFINES NAMECF.                                         
             03 NAMECA    PICTURE X.                                            
           02  NAMECI  PIC X(7).                                                
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  PRZ3L    COMP  PIC  S9(4).                                       
           02  PRZ3F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ3F.                                          
             03 PRZ3A    PICTURE X.                                             
           02  PRZ3I  PIC X(1).                                                 
           02  STUFE3L    COMP  PIC  S9(4).                                     
           02  STUFE3F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE3F.                                        
             03 STUFE3A    PICTURE X.                                           
           02  STUFE3I  PIC X(4).                                               
           02  PROV3L    COMP  PIC  S9(4).                                      
           02  PROV3F    PICTURE X.                                             
           02  FILLER REDEFINES PROV3F.                                         
             03 PROV3A    PICTURE X.                                            
           02  PROV3I  PIC X(5).                                                
           02  EPROV3L    COMP  PIC  S9(4).                                     
           02  EPROV3F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV3F.                                        
             03 EPROV3A    PICTURE X.                                           
           02  EPROV3I  PIC X(5).                                               
           02  NAME3L    COMP  PIC  S9(4).                                      
           02  NAME3F    PICTURE X.                                             
           02  FILLER REDEFINES NAME3F.                                         
             03 NAME3A    PICTURE X.                                            
           02  NAME3I  PIC X(7).                                                
           02  VBNRDL    COMP  PIC  S9(4).                                      
           02  VBNRDF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRDF.                                         
             03 VBNRDA    PICTURE X.                                            
           02  VBNRDI  PIC X(7).                                                
           02  PRZDL    COMP  PIC  S9(4).                                       
           02  PRZDF    PICTURE X.                                              
           02  FILLER REDEFINES PRZDF.                                          
             03 PRZDA    PICTURE X.                                             
           02  PRZDI  PIC X(1).                                                 
           02  STUFEDL    COMP  PIC  S9(4).                                     
           02  STUFEDF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEDF.                                        
             03 STUFEDA    PICTURE X.                                           
           02  STUFEDI  PIC X(4).                                               
           02  PROVDL    COMP  PIC  S9(4).                                      
           02  PROVDF    PICTURE X.                                             
           02  FILLER REDEFINES PROVDF.                                         
             03 PROVDA    PICTURE X.                                            
           02  PROVDI  PIC X(5).                                                
           02  EPROVDL    COMP  PIC  S9(4).                                     
           02  EPROVDF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVDF.                                        
             03 EPROVDA    PICTURE X.                                           
           02  EPROVDI  PIC X(5).                                               
           02  NAMEDL    COMP  PIC  S9(4).                                      
           02  NAMEDF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEDF.                                         
             03 NAMEDA    PICTURE X.                                            
           02  NAMEDI  PIC X(7).                                                
           02  VBNR4L    COMP  PIC  S9(4).                                      
           02  VBNR4F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR4F.                                         
             03 VBNR4A    PICTURE X.                                            
           02  VBNR4I  PIC X(7).                                                
           02  PRZ4L    COMP  PIC  S9(4).                                       
           02  PRZ4F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ4F.                                          
             03 PRZ4A    PICTURE X.                                             
           02  PRZ4I  PIC X(1).                                                 
           02  STUFE4L    COMP  PIC  S9(4).                                     
           02  STUFE4F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE4F.                                        
             03 STUFE4A    PICTURE X.                                           
           02  STUFE4I  PIC X(4).                                               
           02  PROV4L    COMP  PIC  S9(4).                                      
           02  PROV4F    PICTURE X.                                             
           02  FILLER REDEFINES PROV4F.                                         
             03 PROV4A    PICTURE X.                                            
           02  PROV4I  PIC X(5).                                                
           02  EPROV4L    COMP  PIC  S9(4).                                     
           02  EPROV4F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV4F.                                        
             03 EPROV4A    PICTURE X.                                           
           02  EPROV4I  PIC X(5).                                               
           02  NAME4L    COMP  PIC  S9(4).                                      
           02  NAME4F    PICTURE X.                                             
           02  FILLER REDEFINES NAME4F.                                         
             03 NAME4A    PICTURE X.                                            
           02  NAME4I  PIC X(7).                                                
           02  VBNREL    COMP  PIC  S9(4).                                      
           02  VBNREF    PICTURE X.                                             
           02  FILLER REDEFINES VBNREF.                                         
             03 VBNREA    PICTURE X.                                            
           02  VBNREI  PIC X(7).                                                
           02  PRZEL    COMP  PIC  S9(4).                                       
           02  PRZEF    PICTURE X.                                              
           02  FILLER REDEFINES PRZEF.                                          
             03 PRZEA    PICTURE X.                                             
           02  PRZEI  PIC X(1).                                                 
           02  STUFEEL    COMP  PIC  S9(4).                                     
           02  STUFEEF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEEF.                                        
             03 STUFEEA    PICTURE X.                                           
           02  STUFEEI  PIC X(4).                                               
           02  PROVEL    COMP  PIC  S9(4).                                      
           02  PROVEF    PICTURE X.                                             
           02  FILLER REDEFINES PROVEF.                                         
             03 PROVEA    PICTURE X.                                            
           02  PROVEI  PIC X(5).                                                
           02  EPROVEL    COMP  PIC  S9(4).                                     
           02  EPROVEF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVEF.                                        
             03 EPROVEA    PICTURE X.                                           
           02  EPROVEI  PIC X(5).                                               
           02  NAMEEL    COMP  PIC  S9(4).                                      
           02  NAMEEF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEEF.                                         
             03 NAMEEA    PICTURE X.                                            
           02  NAMEEI  PIC X(7).                                                
           02  VBNR5L    COMP  PIC  S9(4).                                      
           02  VBNR5F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR5F.                                         
             03 VBNR5A    PICTURE X.                                            
           02  VBNR5I  PIC X(7).                                                
           02  PRZ5L    COMP  PIC  S9(4).                                       
           02  PRZ5F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ5F.                                          
             03 PRZ5A    PICTURE X.                                             
           02  PRZ5I  PIC X(1).                                                 
           02  STUFE5L    COMP  PIC  S9(4).                                     
           02  STUFE5F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE5F.                                        
             03 STUFE5A    PICTURE X.                                           
           02  STUFE5I  PIC X(4).                                               
           02  PROV5L    COMP  PIC  S9(4).                                      
           02  PROV5F    PICTURE X.                                             
           02  FILLER REDEFINES PROV5F.                                         
             03 PROV5A    PICTURE X.                                            
           02  PROV5I  PIC X(5).                                                
           02  EPROV5L    COMP  PIC  S9(4).                                     
           02  EPROV5F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV5F.                                        
             03 EPROV5A    PICTURE X.                                           
           02  EPROV5I  PIC X(5).                                               
           02  NAME5L    COMP  PIC  S9(4).                                      
           02  NAME5F    PICTURE X.                                             
           02  FILLER REDEFINES NAME5F.                                         
             03 NAME5A    PICTURE X.                                            
           02  NAME5I  PIC X(7).                                                
           02  VBNRFL    COMP  PIC  S9(4).                                      
           02  VBNRFF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRFF.                                         
             03 VBNRFA    PICTURE X.                                            
           02  VBNRFI  PIC X(7).                                                
           02  PRZFL    COMP  PIC  S9(4).                                       
           02  PRZFF    PICTURE X.                                              
           02  FILLER REDEFINES PRZFF.                                          
             03 PRZFA    PICTURE X.                                             
           02  PRZFI  PIC X(1).                                                 
           02  STUFEFL    COMP  PIC  S9(4).                                     
           02  STUFEFF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEFF.                                        
             03 STUFEFA    PICTURE X.                                           
           02  STUFEFI  PIC X(4).                                               
           02  PROVFL    COMP  PIC  S9(4).                                      
           02  PROVFF    PICTURE X.                                             
           02  FILLER REDEFINES PROVFF.                                         
             03 PROVFA    PICTURE X.                                            
           02  PROVFI  PIC X(5).                                                
           02  EPROVFL    COMP  PIC  S9(4).                                     
           02  EPROVFF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVFF.                                        
             03 EPROVFA    PICTURE X.                                           
           02  EPROVFI  PIC X(5).                                               
           02  NAMEFL    COMP  PIC  S9(4).                                      
           02  NAMEFF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEFF.                                         
             03 NAMEFA    PICTURE X.                                            
           02  NAMEFI  PIC X(7).                                                
           02  VBNR6L    COMP  PIC  S9(4).                                      
           02  VBNR6F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR6F.                                         
             03 VBNR6A    PICTURE X.                                            
           02  VBNR6I  PIC X(7).                                                
           02  PRZ6L    COMP  PIC  S9(4).                                       
           02  PRZ6F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ6F.                                          
             03 PRZ6A    PICTURE X.                                             
           02  PRZ6I  PIC X(1).                                                 
           02  STUFE6L    COMP  PIC  S9(4).                                     
           02  STUFE6F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE6F.                                        
             03 STUFE6A    PICTURE X.                                           
           02  STUFE6I  PIC X(4).                                               
           02  PROV6L    COMP  PIC  S9(4).                                      
           02  PROV6F    PICTURE X.                                             
           02  FILLER REDEFINES PROV6F.                                         
             03 PROV6A    PICTURE X.                                            
           02  PROV6I  PIC X(5).                                                
           02  EPROV6L    COMP  PIC  S9(4).                                     
           02  EPROV6F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV6F.                                        
             03 EPROV6A    PICTURE X.                                           
           02  EPROV6I  PIC X(5).                                               
           02  NAME6L    COMP  PIC  S9(4).                                      
           02  NAME6F    PICTURE X.                                             
           02  FILLER REDEFINES NAME6F.                                         
             03 NAME6A    PICTURE X.                                            
           02  NAME6I  PIC X(7).                                                
           02  VBNRGL    COMP  PIC  S9(4).                                      
           02  VBNRGF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRGF.                                         
             03 VBNRGA    PICTURE X.                                            
           02  VBNRGI  PIC X(7).                                                
           02  PRZGL    COMP  PIC  S9(4).                                       
           02  PRZGF    PICTURE X.                                              
           02  FILLER REDEFINES PRZGF.                                          
             03 PRZGA    PICTURE X.                                             
           02  PRZGI  PIC X(1).                                                 
           02  STUFEGL    COMP  PIC  S9(4).                                     
           02  STUFEGF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEGF.                                        
             03 STUFEGA    PICTURE X.                                           
           02  STUFEGI  PIC X(4).                                               
           02  PROVGL    COMP  PIC  S9(4).                                      
           02  PROVGF    PICTURE X.                                             
           02  FILLER REDEFINES PROVGF.                                         
             03 PROVGA    PICTURE X.                                            
           02  PROVGI  PIC X(5).                                                
           02  EPROVGL    COMP  PIC  S9(4).                                     
           02  EPROVGF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVGF.                                        
             03 EPROVGA    PICTURE X.                                           
           02  EPROVGI  PIC X(5).                                               
           02  NAMEGL    COMP  PIC  S9(4).                                      
           02  NAMEGF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEGF.                                         
             03 NAMEGA    PICTURE X.                                            
           02  NAMEGI  PIC X(7).                                                
           02  VBNR7L    COMP  PIC  S9(4).                                      
           02  VBNR7F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR7F.                                         
             03 VBNR7A    PICTURE X.                                            
           02  VBNR7I  PIC X(7).                                                
           02  PRZ7L    COMP  PIC  S9(4).                                       
           02  PRZ7F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ7F.                                          
             03 PRZ7A    PICTURE X.                                             
           02  PRZ7I  PIC X(1).                                                 
           02  STUFE7L    COMP  PIC  S9(4).                                     
           02  STUFE7F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE7F.                                        
             03 STUFE7A    PICTURE X.                                           
           02  STUFE7I  PIC X(4).                                               
           02  PROV7L    COMP  PIC  S9(4).                                      
           02  PROV7F    PICTURE X.                                             
           02  FILLER REDEFINES PROV7F.                                         
             03 PROV7A    PICTURE X.                                            
           02  PROV7I  PIC X(5).                                                
           02  EPROV7L    COMP  PIC  S9(4).                                     
           02  EPROV7F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV7F.                                        
             03 EPROV7A    PICTURE X.                                           
           02  EPROV7I  PIC X(5).                                               
           02  NAME7L    COMP  PIC  S9(4).                                      
           02  NAME7F    PICTURE X.                                             
           02  FILLER REDEFINES NAME7F.                                         
             03 NAME7A    PICTURE X.                                            
           02  NAME7I  PIC X(7).                                                
           02  VBNRHL    COMP  PIC  S9(4).                                      
           02  VBNRHF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRHF.                                         
             03 VBNRHA    PICTURE X.                                            
           02  VBNRHI  PIC X(7).                                                
           02  PRZHL    COMP  PIC  S9(4).                                       
           02  PRZHF    PICTURE X.                                              
           02  FILLER REDEFINES PRZHF.                                          
             03 PRZHA    PICTURE X.                                             
           02  PRZHI  PIC X(1).                                                 
           02  STUFEHL    COMP  PIC  S9(4).                                     
           02  STUFEHF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEHF.                                        
             03 STUFEHA    PICTURE X.                                           
           02  STUFEHI  PIC X(4).                                               
           02  PROVHL    COMP  PIC  S9(4).                                      
           02  PROVHF    PICTURE X.                                             
           02  FILLER REDEFINES PROVHF.                                         
             03 PROVHA    PICTURE X.                                            
           02  PROVHI  PIC X(5).                                                
           02  EPROVHL    COMP  PIC  S9(4).                                     
           02  EPROVHF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVHF.                                        
             03 EPROVHA    PICTURE X.                                           
           02  EPROVHI  PIC X(5).                                               
           02  NAMEHL    COMP  PIC  S9(4).                                      
           02  NAMEHF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEHF.                                         
             03 NAMEHA    PICTURE X.                                            
           02  NAMEHI  PIC X(7).                                                
           02  VBNR8L    COMP  PIC  S9(4).                                      
           02  VBNR8F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR8F.                                         
             03 VBNR8A    PICTURE X.                                            
           02  VBNR8I  PIC X(7).                                                
           02  PRZ8L    COMP  PIC  S9(4).                                       
           02  PRZ8F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ8F.                                          
             03 PRZ8A    PICTURE X.                                             
           02  PRZ8I  PIC X(1).                                                 
           02  STUFE8L    COMP  PIC  S9(4).                                     
           02  STUFE8F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE8F.                                        
             03 STUFE8A    PICTURE X.                                           
           02  STUFE8I  PIC X(4).                                               
           02  PROV8L    COMP  PIC  S9(4).                                      
           02  PROV8F    PICTURE X.                                             
           02  FILLER REDEFINES PROV8F.                                         
             03 PROV8A    PICTURE X.                                            
           02  PROV8I  PIC X(5).                                                
           02  EPROV8L    COMP  PIC  S9(4).                                     
           02  EPROV8F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV8F.                                        
             03 EPROV8A    PICTURE X.                                           
           02  EPROV8I  PIC X(5).                                               
           02  NAME8L    COMP  PIC  S9(4).                                      
           02  NAME8F    PICTURE X.                                             
           02  FILLER REDEFINES NAME8F.                                         
             03 NAME8A    PICTURE X.                                            
           02  NAME8I  PIC X(7).                                                
           02  VBNRJL    COMP  PIC  S9(4).                                      
           02  VBNRJF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRJF.                                         
             03 VBNRJA    PICTURE X.                                            
           02  VBNRJI  PIC X(7).                                                
           02  PRZJL    COMP  PIC  S9(4).                                       
           02  PRZJF    PICTURE X.                                              
           02  FILLER REDEFINES PRZJF.                                          
             03 PRZJA    PICTURE X.                                             
           02  PRZJI  PIC X(1).                                                 
           02  STUFEJL    COMP  PIC  S9(4).                                     
           02  STUFEJF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEJF.                                        
             03 STUFEJA    PICTURE X.                                           
           02  STUFEJI  PIC X(4).                                               
           02  PROVJL    COMP  PIC  S9(4).                                      
           02  PROVJF    PICTURE X.                                             
           02  FILLER REDEFINES PROVJF.                                         
             03 PROVJA    PICTURE X.                                            
           02  PROVJI  PIC X(5).                                                
           02  EPROVJL    COMP  PIC  S9(4).                                     
           02  EPROVJF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVJF.                                        
             03 EPROVJA    PICTURE X.                                           
           02  EPROVJI  PIC X(5).                                               
           02  NAMEJL    COMP  PIC  S9(4).                                      
           02  NAMEJF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEJF.                                         
             03 NAMEJA    PICTURE X.                                            
           02  NAMEJI  PIC X(7).                                                
           02  VBNR9L    COMP  PIC  S9(4).                                      
           02  VBNR9F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR9F.                                         
             03 VBNR9A    PICTURE X.                                            
           02  VBNR9I  PIC X(7).                                                
           02  PRZ9L    COMP  PIC  S9(4).                                       
           02  PRZ9F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ9F.                                          
             03 PRZ9A    PICTURE X.                                             
           02  PRZ9I  PIC X(1).                                                 
           02  STUFE9L    COMP  PIC  S9(4).                                     
           02  STUFE9F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE9F.                                        
             03 STUFE9A    PICTURE X.                                           
           02  STUFE9I  PIC X(4).                                               
           02  PROV9L    COMP  PIC  S9(4).                                      
           02  PROV9F    PICTURE X.                                             
           02  FILLER REDEFINES PROV9F.                                         
             03 PROV9A    PICTURE X.                                            
           02  PROV9I  PIC X(5).                                                
           02  EPROV9L    COMP  PIC  S9(4).                                     
           02  EPROV9F    PICTURE X.                                            
           02  FILLER REDEFINES EPROV9F.                                        
             03 EPROV9A    PICTURE X.                                           
           02  EPROV9I  PIC X(5).                                               
           02  NAME9L    COMP  PIC  S9(4).                                      
           02  NAME9F    PICTURE X.                                             
           02  FILLER REDEFINES NAME9F.                                         
             03 NAME9A    PICTURE X.                                            
           02  NAME9I  PIC X(7).                                                
           02  VBNRAL    COMP  PIC  S9(4).                                      
           02  VBNRAF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRAF.                                         
             03 VBNRAA    PICTURE X.                                            
           02  VBNRAI  PIC X(7).                                                
           02  PRZAL    COMP  PIC  S9(4).                                       
           02  PRZAF    PICTURE X.                                              
           02  FILLER REDEFINES PRZAF.                                          
             03 PRZAA    PICTURE X.                                             
           02  PRZAI  PIC X(1).                                                 
           02  STUFEAL    COMP  PIC  S9(4).                                     
           02  STUFEAF    PICTURE X.                                            
           02  FILLER REDEFINES STUFEAF.                                        
             03 STUFEAA    PICTURE X.                                           
           02  STUFEAI  PIC X(4).                                               
           02  PROVAL    COMP  PIC  S9(4).                                      
           02  PROVAF    PICTURE X.                                             
           02  FILLER REDEFINES PROVAF.                                         
             03 PROVAA    PICTURE X.                                            
           02  PROVAI  PIC X(5).                                                
           02  EPROVAL    COMP  PIC  S9(4).                                     
           02  EPROVAF    PICTURE X.                                            
           02  FILLER REDEFINES EPROVAF.                                        
             03 EPROVAA    PICTURE X.                                           
           02  EPROVAI  PIC X(5).                                               
           02  NAMEAL    COMP  PIC  S9(4).                                      
           02  NAMEAF    PICTURE X.                                             
           02  FILLER REDEFINES NAMEAF.                                         
             03 NAMEAA    PICTURE X.                                            
           02  NAMEAI  PIC X(7).                                                
           02  VMGESL    COMP  PIC  S9(4).                                      
           02  VMGESF    PICTURE X.                                             
           02  FILLER REDEFINES VMGESF.                                         
             03 VMGESA    PICTURE X.                                            
           02  VMGESI  PIC X(2).                                                
           02  VMOSTL    COMP  PIC  S9(4).                                      
           02  VMOSTF    PICTURE X.                                             
           02  FILLER REDEFINES VMOSTF.                                         
             03 VMOSTA    PICTURE X.                                            
           02  VMOSTI  PIC X(2).                                                
           02  VBNRML    COMP  PIC  S9(4).                                      
           02  VBNRMF    PICTURE X.                                             
           02  FILLER REDEFINES VBNRMF.                                         
             03 VBNRMA    PICTURE X.                                            
           02  VBNRMI  PIC X(7).                                                
           02  DATUMML    COMP  PIC  S9(4).                                     
           02  DATUMMF    PICTURE X.                                            
           02  FILLER REDEFINES DATUMMF.                                        
             03 DATUMMA    PICTURE X.                                           
           02  DATUMMI  PIC X(6).                                               
           02  TRANSML    COMP  PIC  S9(4).                                     
           02  TRANSMF    PICTURE X.                                            
           02  FILLER REDEFINES TRANSMF.                                        
             03 TRANSMA    PICTURE X.                                           
           02  TRANSMI  PIC X(4).                                               
           02  FTEXTL    COMP  PIC  S9(4).                                      
           02  FTEXTF    PICTURE X.                                             
           02  FILLER REDEFINES FTEXTF.                                         
             03 FTEXTA    PICTURE X.                                            
           02  FTEXTI  PIC X(79).                                               
       01  UU937O REDEFINES UU937I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR1O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DATUM1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR1O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STAND1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR1O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ1O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE1O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV1O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV1O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRBO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZBO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEBO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVBO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVBO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEBO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ2O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE2O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV2O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV2O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRCO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZCO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFECO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVCO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVCO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMECO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE3O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV3O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV3O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRDO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZDO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEDO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVDO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVDO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEDO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR4O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ4O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE4O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV4O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV4O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNREO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZEO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEEO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVEO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVEO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEEO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR5O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ5O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE5O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV5O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV5O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRFO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZFO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEFO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVFO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVFO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEFO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR6O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ6O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE6O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV6O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV6O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME6O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRGO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZGO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEGO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVGO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVGO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEGO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR7O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ7O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE7O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV7O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV7O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRHO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZHO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEHO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVHO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVHO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEHO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR8O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ8O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE8O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV8O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV8O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME8O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRJO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZJO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEJO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVJO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVJO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEJO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR9O PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZ9O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFE9O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROV9O PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROV9O PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME9O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNRAO PIC Z(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZAO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STUFEAO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  PROVAO PIC ZZ9.9.                                                
           02  FILLER PICTURE X(3).                                             
           02  EPROVAO PIC ZZ9.9.                                               
           02  FILLER PICTURE X(3).                                             
           02  NAMEAO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VMGESO PIC Z9.                                                   
           02  FILLER PICTURE X(3).                                             
           02  VMOSTO PIC Z9.                                                   
           02  FILLER PICTURE X(3).                                             
           02  VBNRMO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUMMO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TRANSMO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  FTEXTO  PIC X(79).                                               
