       01  UU946I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  KDNRL    COMP  PIC  S9(4).                                       
           02  KDNRF    PICTURE X.                                              
           02  FILLER REDEFINES KDNRF.                                          
             03 KDNRA    PICTURE X.                                             
           02  KDNRI  PIC X(7).                                                 
           02  PRZL    COMP  PIC  S9(4).                                        
           02  PRZF    PICTURE X.                                               
           02  FILLER REDEFINES PRZF.                                           
             03 PRZA    PICTURE X.                                              
           02  PRZI  PIC X(2).                                                  
           02  NR1L    COMP  PIC  S9(4).                                        
           02  NR1F    PICTURE X.                                               
           02  FILLER REDEFINES NR1F.                                           
             03 NR1A    PICTURE X.                                              
           02  NR1I  PIC X(2).                                                  
           02  NAME1L    COMP  PIC  S9(4).                                      
           02  NAME1F    PICTURE X.                                             
           02  FILLER REDEFINES NAME1F.                                         
             03 NAME1A    PICTURE X.                                            
           02  NAME1I  PIC X(25).                                               
           02  STR1L    COMP  PIC  S9(4).                                       
           02  STR1F    PICTURE X.                                              
           02  FILLER REDEFINES STR1F.                                          
             03 STR1A    PICTURE X.                                             
           02  STR1I  PIC X(17).                                                
           02  GTEXT1L    COMP  PIC  S9(4).                                     
           02  GTEXT1F    PICTURE X.                                            
           02  FILLER REDEFINES GTEXT1F.                                        
             03 GTEXT1A    PICTURE X.                                           
           02  GTEXT1I  PIC X(8).                                               
           02  PTEXT1L    COMP  PIC  S9(4).                                     
           02  PTEXT1F    PICTURE X.                                            
           02  FILLER REDEFINES PTEXT1F.                                        
             03 PTEXT1A    PICTURE X.                                           
           02  PTEXT1I  PIC X(14).                                              
           02  TGEBD1L    COMP  PIC  S9(4).                                     
           02  TGEBD1F    PICTURE X.                                            
           02  FILLER REDEFINES TGEBD1F.                                        
             03 TGEBD1A    PICTURE X.                                           
           02  TGEBD1I  PIC X(9).                                               
           02  GEBDAT1L    COMP  PIC  S9(4).                                    
           02  GEBDAT1F    PICTURE X.                                           
           02  FILLER REDEFINES GEBDAT1F.                                       
             03 GEBDAT1A    PICTURE X.                                          
           02  GEBDAT1I  PIC X(8).                                              
           02  AUSL1L    COMP  PIC  S9(4).                                      
           02  AUSL1F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL1F.                                         
             03 AUSL1A    PICTURE X.                                            
           02  AUSL1I  PIC X(3).                                                
           02  PLZ1L    COMP  PIC  S9(4).                                       
           02  PLZ1F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ1F.                                          
             03 PLZ1A    PICTURE X.                                             
           02  PLZ1I  PIC X(5).                                                 
           02  ORT1L    COMP  PIC  S9(4).                                       
           02  ORT1F    PICTURE X.                                              
           02  FILLER REDEFINES ORT1F.                                          
             03 ORT1A    PICTURE X.                                             
           02  ORT1I  PIC X(17).                                                
           02  VNR1L    COMP  PIC  S9(4).                                       
           02  VNR1F    PICTURE X.                                              
           02  FILLER REDEFINES VNR1F.                                          
             03 VNR1A    PICTURE X.                                             
           02  VNR1I  PIC X(16).                                                
           02  TAVERM1L    COMP  PIC  S9(4).                                    
           02  TAVERM1F    PICTURE X.                                           
           02  FILLER REDEFINES TAVERM1F.                                       
             03 TAVERM1A    PICTURE X.                                          
           02  TAVERM1I  PIC X(8).                                              
           02  AVERM1L    COMP  PIC  S9(4).                                     
           02  AVERM1F    PICTURE X.                                            
           02  FILLER REDEFINES AVERM1F.                                        
             03 AVERM1A    PICTURE X.                                           
           02  AVERM1I  PIC X(7).                                               
           02  APRZ1L    COMP  PIC  S9(4).                                      
           02  APRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES APRZ1F.                                         
             03 APRZ1A    PICTURE X.                                            
           02  APRZ1I  PIC X(1).                                                
           02  KAVMKZ1L    COMP  PIC  S9(4).                                    
           02  KAVMKZ1F    PICTURE X.                                           
           02  FILLER REDEFINES KAVMKZ1F.                                       
             03 KAVMKZ1A    PICTURE X.                                          
           02  KAVMKZ1I  PIC X(1).                                              
           02  TANAM1L    COMP  PIC  S9(4).                                     
           02  TANAM1F    PICTURE X.                                            
           02  FILLER REDEFINES TANAM1F.                                        
             03 TANAM1A    PICTURE X.                                           
           02  TANAM1I  PIC X(5).                                               
           02  ANAME1L    COMP  PIC  S9(4).                                     
           02  ANAME1F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME1F.                                        
             03 ANAME1A    PICTURE X.                                           
           02  ANAME1I  PIC X(17).                                              
           02  TASTUF1L    COMP  PIC  S9(4).                                    
           02  TASTUF1F    PICTURE X.                                           
           02  FILLER REDEFINES TASTUF1F.                                       
             03 TASTUF1A    PICTURE X.                                          
           02  TASTUF1I  PIC X(6).                                              
           02  ASTUFE1L    COMP  PIC  S9(4).                                    
           02  ASTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE1F.                                       
             03 ASTUFE1A    PICTURE X.                                          
           02  ASTUFE1I  PIC X(4).                                              
           02  TIAUS1L    COMP  PIC  S9(4).                                     
           02  TIAUS1F    PICTURE X.                                            
           02  FILLER REDEFINES TIAUS1F.                                        
             03 TIAUS1A    PICTURE X.                                           
           02  TIAUS1I  PIC X(6).                                               
           02  AAUSTR1L    COMP  PIC  S9(4).                                    
           02  AAUSTR1F    PICTURE X.                                           
           02  FILLER REDEFINES AAUSTR1F.                                       
             03 AAUSTR1A    PICTURE X.                                          
           02  AAUSTR1I  PIC X(8).                                              
           02  TBETR1L    COMP  PIC  S9(4).                                     
           02  TBETR1F    PICTURE X.                                            
           02  FILLER REDEFINES TBETR1F.                                        
             03 TBETR1A    PICTURE X.                                           
           02  TBETR1I  PIC X(8).                                               
           02  BETR1L    COMP  PIC  S9(4).                                      
           02  BETR1F    PICTURE X.                                             
           02  FILLER REDEFINES BETR1F.                                         
             03 BETR1A    PICTURE X.                                            
           02  BETR1I  PIC X(7).                                                
           02  BPRZ1L    COMP  PIC  S9(4).                                      
           02  BPRZ1F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ1F.                                         
             03 BPRZ1A    PICTURE X.                                            
           02  BPRZ1I  PIC X(1).                                                
           02  TBNAM1L    COMP  PIC  S9(4).                                     
           02  TBNAM1F    PICTURE X.                                            
           02  FILLER REDEFINES TBNAM1F.                                        
             03 TBNAM1A    PICTURE X.                                           
           02  TBNAM1I  PIC X(5).                                               
           02  BNAME1L    COMP  PIC  S9(4).                                     
           02  BNAME1F    PICTURE X.                                            
           02  FILLER REDEFINES BNAME1F.                                        
             03 BNAME1A    PICTURE X.                                           
           02  BNAME1I  PIC X(17).                                              
           02  TBSTUF1L    COMP  PIC  S9(4).                                    
           02  TBSTUF1F    PICTURE X.                                           
           02  FILLER REDEFINES TBSTUF1F.                                       
             03 TBSTUF1A    PICTURE X.                                          
           02  TBSTUF1I  PIC X(6).                                              
           02  BSTUFE1L    COMP  PIC  S9(4).                                    
           02  BSTUFE1F    PICTURE X.                                           
           02  FILLER REDEFINES BSTUFE1F.                                       
             03 BSTUFE1A    PICTURE X.                                          
           02  BSTUFE1I  PIC X(4).                                              
           02  TBAUS1L    COMP  PIC  S9(4).                                     
           02  TBAUS1F    PICTURE X.                                            
           02  FILLER REDEFINES TBAUS1F.                                        
             03 TBAUS1A    PICTURE X.                                           
           02  TBAUS1I  PIC X(6).                                               
           02  BAUSTR1L    COMP  PIC  S9(4).                                    
           02  BAUSTR1F    PICTURE X.                                           
           02  FILLER REDEFINES BAUSTR1F.                                       
             03 BAUSTR1A    PICTURE X.                                          
           02  BAUSTR1I  PIC X(8).                                              
           02  NR2L    COMP  PIC  S9(4).                                        
           02  NR2F    PICTURE X.                                               
           02  FILLER REDEFINES NR2F.                                           
             03 NR2A    PICTURE X.                                              
           02  NR2I  PIC X(2).                                                  
           02  NAME2L    COMP  PIC  S9(4).                                      
           02  NAME2F    PICTURE X.                                             
           02  FILLER REDEFINES NAME2F.                                         
             03 NAME2A    PICTURE X.                                            
           02  NAME2I  PIC X(25).                                               
           02  STR2L    COMP  PIC  S9(4).                                       
           02  STR2F    PICTURE X.                                              
           02  FILLER REDEFINES STR2F.                                          
             03 STR2A    PICTURE X.                                             
           02  STR2I  PIC X(17).                                                
           02  GTEXT2L    COMP  PIC  S9(4).                                     
           02  GTEXT2F    PICTURE X.                                            
           02  FILLER REDEFINES GTEXT2F.                                        
             03 GTEXT2A    PICTURE X.                                           
           02  GTEXT2I  PIC X(8).                                               
           02  PTEXT2L    COMP  PIC  S9(4).                                     
           02  PTEXT2F    PICTURE X.                                            
           02  FILLER REDEFINES PTEXT2F.                                        
             03 PTEXT2A    PICTURE X.                                           
           02  PTEXT2I  PIC X(14).                                              
           02  TGEBD2L    COMP  PIC  S9(4).                                     
           02  TGEBD2F    PICTURE X.                                            
           02  FILLER REDEFINES TGEBD2F.                                        
             03 TGEBD2A    PICTURE X.                                           
           02  TGEBD2I  PIC X(9).                                               
           02  GEBDAT2L    COMP  PIC  S9(4).                                    
           02  GEBDAT2F    PICTURE X.                                           
           02  FILLER REDEFINES GEBDAT2F.                                       
             03 GEBDAT2A    PICTURE X.                                          
           02  GEBDAT2I  PIC X(8).                                              
           02  AUSL2L    COMP  PIC  S9(4).                                      
           02  AUSL2F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL2F.                                         
             03 AUSL2A    PICTURE X.                                            
           02  AUSL2I  PIC X(3).                                                
           02  PLZ2L    COMP  PIC  S9(4).                                       
           02  PLZ2F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ2F.                                          
             03 PLZ2A    PICTURE X.                                             
           02  PLZ2I  PIC X(5).                                                 
           02  ORT2L    COMP  PIC  S9(4).                                       
           02  ORT2F    PICTURE X.                                              
           02  FILLER REDEFINES ORT2F.                                          
             03 ORT2A    PICTURE X.                                             
           02  ORT2I  PIC X(17).                                                
           02  VNR2L    COMP  PIC  S9(4).                                       
           02  VNR2F    PICTURE X.                                              
           02  FILLER REDEFINES VNR2F.                                          
             03 VNR2A    PICTURE X.                                             
           02  VNR2I  PIC X(16).                                                
           02  TAVERM2L    COMP  PIC  S9(4).                                    
           02  TAVERM2F    PICTURE X.                                           
           02  FILLER REDEFINES TAVERM2F.                                       
             03 TAVERM2A    PICTURE X.                                          
           02  TAVERM2I  PIC X(8).                                              
           02  AVERM2L    COMP  PIC  S9(4).                                     
           02  AVERM2F    PICTURE X.                                            
           02  FILLER REDEFINES AVERM2F.                                        
             03 AVERM2A    PICTURE X.                                           
           02  AVERM2I  PIC X(7).                                               
           02  APRZ2L    COMP  PIC  S9(4).                                      
           02  APRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES APRZ2F.                                         
             03 APRZ2A    PICTURE X.                                            
           02  APRZ2I  PIC X(1).                                                
           02  KAVMKZ2L    COMP  PIC  S9(4).                                    
           02  KAVMKZ2F    PICTURE X.                                           
           02  FILLER REDEFINES KAVMKZ2F.                                       
             03 KAVMKZ2A    PICTURE X.                                          
           02  KAVMKZ2I  PIC X(1).                                              
           02  TANAM2L    COMP  PIC  S9(4).                                     
           02  TANAM2F    PICTURE X.                                            
           02  FILLER REDEFINES TANAM2F.                                        
             03 TANAM2A    PICTURE X.                                           
           02  TANAM2I  PIC X(5).                                               
           02  ANAME2L    COMP  PIC  S9(4).                                     
           02  ANAME2F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME2F.                                        
             03 ANAME2A    PICTURE X.                                           
           02  ANAME2I  PIC X(17).                                              
           02  TASTUF2L    COMP  PIC  S9(4).                                    
           02  TASTUF2F    PICTURE X.                                           
           02  FILLER REDEFINES TASTUF2F.                                       
             03 TASTUF2A    PICTURE X.                                          
           02  TASTUF2I  PIC X(6).                                              
           02  ASTUFE2L    COMP  PIC  S9(4).                                    
           02  ASTUFE2F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE2F.                                       
             03 ASTUFE2A    PICTURE X.                                          
           02  ASTUFE2I  PIC X(4).                                              
           02  TAAUS2L    COMP  PIC  S9(4).                                     
           02  TAAUS2F    PICTURE X.                                            
           02  FILLER REDEFINES TAAUS2F.                                        
             03 TAAUS2A    PICTURE X.                                           
           02  TAAUS2I  PIC X(6).                                               
           02  AAUSTR2L    COMP  PIC  S9(4).                                    
           02  AAUSTR2F    PICTURE X.                                           
           02  FILLER REDEFINES AAUSTR2F.                                       
             03 AAUSTR2A    PICTURE X.                                          
           02  AAUSTR2I  PIC X(8).                                              
           02  TBETR2L    COMP  PIC  S9(4).                                     
           02  TBETR2F    PICTURE X.                                            
           02  FILLER REDEFINES TBETR2F.                                        
             03 TBETR2A    PICTURE X.                                           
           02  TBETR2I  PIC X(8).                                               
           02  BETR2L    COMP  PIC  S9(4).                                      
           02  BETR2F    PICTURE X.                                             
           02  FILLER REDEFINES BETR2F.                                         
             03 BETR2A    PICTURE X.                                            
           02  BETR2I  PIC X(7).                                                
           02  BPRZ2L    COMP  PIC  S9(4).                                      
           02  BPRZ2F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ2F.                                         
             03 BPRZ2A    PICTURE X.                                            
           02  BPRZ2I  PIC X(1).                                                
           02  TBNAM2L    COMP  PIC  S9(4).                                     
           02  TBNAM2F    PICTURE X.                                            
           02  FILLER REDEFINES TBNAM2F.                                        
             03 TBNAM2A    PICTURE X.                                           
           02  TBNAM2I  PIC X(5).                                               
           02  BNAME2L    COMP  PIC  S9(4).                                     
           02  BNAME2F    PICTURE X.                                            
           02  FILLER REDEFINES BNAME2F.                                        
             03 BNAME2A    PICTURE X.                                           
           02  BNAME2I  PIC X(17).                                              
           02  TBSTUF2L    COMP  PIC  S9(4).                                    
           02  TBSTUF2F    PICTURE X.                                           
           02  FILLER REDEFINES TBSTUF2F.                                       
             03 TBSTUF2A    PICTURE X.                                          
           02  TBSTUF2I  PIC X(6).                                              
           02  BSTUFE2L    COMP  PIC  S9(4).                                    
           02  BSTUFE2F    PICTURE X.                                           
           02  FILLER REDEFINES BSTUFE2F.                                       
             03 BSTUFE2A    PICTURE X.                                          
           02  BSTUFE2I  PIC X(4).                                              
           02  TBAUS2L    COMP  PIC  S9(4).                                     
           02  TBAUS2F    PICTURE X.                                            
           02  FILLER REDEFINES TBAUS2F.                                        
             03 TBAUS2A    PICTURE X.                                           
           02  TBAUS2I  PIC X(6).                                               
           02  BAUSTR2L    COMP  PIC  S9(4).                                    
           02  BAUSTR2F    PICTURE X.                                           
           02  FILLER REDEFINES BAUSTR2F.                                       
             03 BAUSTR2A    PICTURE X.                                          
           02  BAUSTR2I  PIC X(8).                                              
           02  NR3L    COMP  PIC  S9(4).                                        
           02  NR3F    PICTURE X.                                               
           02  FILLER REDEFINES NR3F.                                           
             03 NR3A    PICTURE X.                                              
           02  NR3I  PIC X(2).                                                  
           02  NAME3L    COMP  PIC  S9(4).                                      
           02  NAME3F    PICTURE X.                                             
           02  FILLER REDEFINES NAME3F.                                         
             03 NAME3A    PICTURE X.                                            
           02  NAME3I  PIC X(25).                                               
           02  STR3L    COMP  PIC  S9(4).                                       
           02  STR3F    PICTURE X.                                              
           02  FILLER REDEFINES STR3F.                                          
             03 STR3A    PICTURE X.                                             
           02  STR3I  PIC X(17).                                                
           02  GTEXT3L    COMP  PIC  S9(4).                                     
           02  GTEXT3F    PICTURE X.                                            
           02  FILLER REDEFINES GTEXT3F.                                        
             03 GTEXT3A    PICTURE X.                                           
           02  GTEXT3I  PIC X(8).                                               
           02  PTEXT3L    COMP  PIC  S9(4).                                     
           02  PTEXT3F    PICTURE X.                                            
           02  FILLER REDEFINES PTEXT3F.                                        
             03 PTEXT3A    PICTURE X.                                           
           02  PTEXT3I  PIC X(14).                                              
           02  TGEBD3L    COMP  PIC  S9(4).                                     
           02  TGEBD3F    PICTURE X.                                            
           02  FILLER REDEFINES TGEBD3F.                                        
             03 TGEBD3A    PICTURE X.                                           
           02  TGEBD3I  PIC X(9).                                               
           02  GEBDAT3L    COMP  PIC  S9(4).                                    
           02  GEBDAT3F    PICTURE X.                                           
           02  FILLER REDEFINES GEBDAT3F.                                       
             03 GEBDAT3A    PICTURE X.                                          
           02  GEBDAT3I  PIC X(8).                                              
           02  AUSL3L    COMP  PIC  S9(4).                                      
           02  AUSL3F    PICTURE X.                                             
           02  FILLER REDEFINES AUSL3F.                                         
             03 AUSL3A    PICTURE X.                                            
           02  AUSL3I  PIC X(3).                                                
           02  PLZ3L    COMP  PIC  S9(4).                                       
           02  PLZ3F    PICTURE X.                                              
           02  FILLER REDEFINES PLZ3F.                                          
             03 PLZ3A    PICTURE X.                                             
           02  PLZ3I  PIC X(5).                                                 
           02  ORT3L    COMP  PIC  S9(4).                                       
           02  ORT3F    PICTURE X.                                              
           02  FILLER REDEFINES ORT3F.                                          
             03 ORT3A    PICTURE X.                                             
           02  ORT3I  PIC X(17).                                                
           02  VNR3L    COMP  PIC  S9(4).                                       
           02  VNR3F    PICTURE X.                                              
           02  FILLER REDEFINES VNR3F.                                          
             03 VNR3A    PICTURE X.                                             
           02  VNR3I  PIC X(16).                                                
           02  TAVERM3L    COMP  PIC  S9(4).                                    
           02  TAVERM3F    PICTURE X.                                           
           02  FILLER REDEFINES TAVERM3F.                                       
             03 TAVERM3A    PICTURE X.                                          
           02  TAVERM3I  PIC X(8).                                              
           02  AVERM3L    COMP  PIC  S9(4).                                     
           02  AVERM3F    PICTURE X.                                            
           02  FILLER REDEFINES AVERM3F.                                        
             03 AVERM3A    PICTURE X.                                           
           02  AVERM3I  PIC X(7).                                               
           02  APRZ3L    COMP  PIC  S9(4).                                      
           02  APRZ3F    PICTURE X.                                             
           02  FILLER REDEFINES APRZ3F.                                         
             03 APRZ3A    PICTURE X.                                            
           02  APRZ3I  PIC X(1).                                                
           02  KAVMKZ3L    COMP  PIC  S9(4).                                    
           02  KAVMKZ3F    PICTURE X.                                           
           02  FILLER REDEFINES KAVMKZ3F.                                       
             03 KAVMKZ3A    PICTURE X.                                          
           02  KAVMKZ3I  PIC X(1).                                              
           02  TANAM3L    COMP  PIC  S9(4).                                     
           02  TANAM3F    PICTURE X.                                            
           02  FILLER REDEFINES TANAM3F.                                        
             03 TANAM3A    PICTURE X.                                           
           02  TANAM3I  PIC X(5).                                               
           02  ANAME3L    COMP  PIC  S9(4).                                     
           02  ANAME3F    PICTURE X.                                            
           02  FILLER REDEFINES ANAME3F.                                        
             03 ANAME3A    PICTURE X.                                           
           02  ANAME3I  PIC X(17).                                              
           02  TASTUF3L    COMP  PIC  S9(4).                                    
           02  TASTUF3F    PICTURE X.                                           
           02  FILLER REDEFINES TASTUF3F.                                       
             03 TASTUF3A    PICTURE X.                                          
           02  TASTUF3I  PIC X(6).                                              
           02  ASTUFE3L    COMP  PIC  S9(4).                                    
           02  ASTUFE3F    PICTURE X.                                           
           02  FILLER REDEFINES ASTUFE3F.                                       
             03 ASTUFE3A    PICTURE X.                                          
           02  ASTUFE3I  PIC X(4).                                              
           02  TAAUS3L    COMP  PIC  S9(4).                                     
           02  TAAUS3F    PICTURE X.                                            
           02  FILLER REDEFINES TAAUS3F.                                        
             03 TAAUS3A    PICTURE X.                                           
           02  TAAUS3I  PIC X(6).                                               
           02  AAUSTR3L    COMP  PIC  S9(4).                                    
           02  AAUSTR3F    PICTURE X.                                           
           02  FILLER REDEFINES AAUSTR3F.                                       
             03 AAUSTR3A    PICTURE X.                                          
           02  AAUSTR3I  PIC X(8).                                              
           02  TBETR3L    COMP  PIC  S9(4).                                     
           02  TBETR3F    PICTURE X.                                            
           02  FILLER REDEFINES TBETR3F.                                        
             03 TBETR3A    PICTURE X.                                           
           02  TBETR3I  PIC X(8).                                               
           02  BETR3L    COMP  PIC  S9(4).                                      
           02  BETR3F    PICTURE X.                                             
           02  FILLER REDEFINES BETR3F.                                         
             03 BETR3A    PICTURE X.                                            
           02  BETR3I  PIC X(7).                                                
           02  BPRZ3L    COMP  PIC  S9(4).                                      
           02  BPRZ3F    PICTURE X.                                             
           02  FILLER REDEFINES BPRZ3F.                                         
             03 BPRZ3A    PICTURE X.                                            
           02  BPRZ3I  PIC X(1).                                                
           02  TBNAM3L    COMP  PIC  S9(4).                                     
           02  TBNAM3F    PICTURE X.                                            
           02  FILLER REDEFINES TBNAM3F.                                        
             03 TBNAM3A    PICTURE X.                                           
           02  TBNAM3I  PIC X(5).                                               
           02  BNAME3L    COMP  PIC  S9(4).                                     
           02  BNAME3F    PICTURE X.                                            
           02  FILLER REDEFINES BNAME3F.                                        
             03 BNAME3A    PICTURE X.                                           
           02  BNAME3I  PIC X(17).                                              
           02  TBSTUF3L    COMP  PIC  S9(4).                                    
           02  TBSTUF3F    PICTURE X.                                           
           02  FILLER REDEFINES TBSTUF3F.                                       
             03 TBSTUF3A    PICTURE X.                                          
           02  TBSTUF3I  PIC X(6).                                              
           02  BSTUFE3L    COMP  PIC  S9(4).                                    
           02  BSTUFE3F    PICTURE X.                                           
           02  FILLER REDEFINES BSTUFE3F.                                       
             03 BSTUFE3A    PICTURE X.                                          
           02  BSTUFE3I  PIC X(4).                                              
           02  TBAUS3L    COMP  PIC  S9(4).                                     
           02  TBAUS3F    PICTURE X.                                            
           02  FILLER REDEFINES TBAUS3F.                                        
             03 TBAUS3A    PICTURE X.                                           
           02  TBAUS3I  PIC X(6).                                               
           02  BAUSTR3L    COMP  PIC  S9(4).                                    
           02  BAUSTR3F    PICTURE X.                                           
           02  FILLER REDEFINES BAUSTR3F.                                       
             03 BAUSTR3A    PICTURE X.                                          
           02  BAUSTR3I  PIC X(8).                                              
           02  NNRL    COMP  PIC  S9(4).                                        
           02  NNRF    PICTURE X.                                               
           02  FILLER REDEFINES NNRF.                                           
             03 NNRA    PICTURE X.                                              
           02  NNRI  PIC X(2).                                                  
           02  NKDNRL    COMP  PIC  S9(4).                                      
           02  NKDNRF    PICTURE X.                                             
           02  FILLER REDEFINES NKDNRF.                                         
             03 NKDNRA    PICTURE X.                                            
           02  NKDNRI  PIC X(7).                                                
           02  NPRZL    COMP  PIC  S9(4).                                       
           02  NPRZF    PICTURE X.                                              
           02  FILLER REDEFINES NPRZF.                                          
             03 NPRZA    PICTURE X.                                             
           02  NPRZI  PIC X(2).                                                 
           02  NTRANSL    COMP  PIC  S9(4).                                     
           02  NTRANSF    PICTURE X.                                            
           02  FILLER REDEFINES NTRANSF.                                        
             03 NTRANSA    PICTURE X.                                           
           02  NTRANSI  PIC X(4).                                               
           02  FTEXTL    COMP  PIC  S9(4).                                      
           02  FTEXTF    PICTURE X.                                             
           02  FILLER REDEFINES FTEXTF.                                         
             03 FTEXTA    PICTURE X.                                            
           02  FTEXTI  PIC X(78).                                               
           02  V2401L    COMP  PIC  S9(4).                                      
           02  V2401F    PICTURE X.                                             
           02  FILLER REDEFINES V2401F.                                         
             03 V2401A    PICTURE X.                                            
           02  V2401I  PIC X(70).                                               
       01  UU946O REDEFINES UU946I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  KDNRO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  PRZO  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NR1O  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NAME1O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  STR1O  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  GTEXT1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  PTEXT1O  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  TGEBD1O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  GEBDAT1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSL1O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ1O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT1O  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR1O  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAVERM1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVERM1O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  KAVMKZ1O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TANAM1O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANAME1O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TASTUF1O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TIAUS1O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAUSTR1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBETR1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBNAM1O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAME1O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBSTUF1O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  BSTUFE1O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBAUS1O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BAUSTR1O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  NR2O  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NAME2O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  STR2O  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  GTEXT2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  PTEXT2O  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  TGEBD2O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  GEBDAT2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSL2O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ2O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT2O  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR2O  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAVERM2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVERM2O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  KAVMKZ2O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TANAM2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANAME2O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TASTUF2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAAUS2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAUSTR2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBETR2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBNAM2O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAME2O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBSTUF2O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  BSTUFE2O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBAUS2O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BAUSTR2O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  NR3O  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NAME3O  PIC X(25).                                               
           02  FILLER PICTURE X(3).                                             
           02  STR3O  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  GTEXT3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  PTEXT3O  PIC X(14).                                              
           02  FILLER PICTURE X(3).                                             
           02  TGEBD3O  PIC X(9).                                               
           02  FILLER PICTURE X(3).                                             
           02  GEBDAT3O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUSL3O  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  PLZ3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ORT3O  PIC X(17).                                                
           02  FILLER PICTURE X(3).                                             
           02  VNR3O  PIC X(16).                                                
           02  FILLER PICTURE X(3).                                             
           02  TAVERM3O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  AVERM3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  APRZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  KAVMKZ3O  PIC X(1).                                              
           02  FILLER PICTURE X(3).                                             
           02  TANAM3O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANAME3O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TASTUF3O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  ASTUFE3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TAAUS3O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  AAUSTR3O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBETR3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  BPRZ3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  TBNAM3O  PIC X(5).                                               
           02  FILLER PICTURE X(3).                                             
           02  BNAME3O  PIC X(17).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBSTUF3O  PIC X(6).                                              
           02  FILLER PICTURE X(3).                                             
           02  BSTUFE3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  TBAUS3O  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  BAUSTR3O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  NNRO  PIC X(2).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NKDNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  NPRZO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  NTRANSO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  FTEXTO  PIC X(78).                                               
           02  FILLER PICTURE X(3).                                             
           02  V2401O  PIC X(70).                                               
