       01  UU957I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR3L    COMP  PIC  S9(4).                                       
           02  PNR3F    PICTURE X.                                              
           02  FILLER REDEFINES PNR3F.                                          
             03 PNR3A    PICTURE X.                                             
           02  PNR3I  PIC X(7).                                                 
           02  DAT3L    COMP  PIC  S9(4).                                       
           02  DAT3F    PICTURE X.                                              
           02  FILLER REDEFINES DAT3F.                                          
             03 DAT3A    PICTURE X.                                             
           02  DAT3I  PIC X(8).                                                 
           02  UHR3L    COMP  PIC  S9(4).                                       
           02  UHR3F    PICTURE X.                                              
           02  FILLER REDEFINES UHR3F.                                          
             03 UHR3A    PICTURE X.                                             
           02  UHR3I  PIC X(5).                                                 
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  PRZ3L    COMP  PIC  S9(4).                                       
           02  PRZ3F    PICTURE X.                                              
           02  FILLER REDEFINES PRZ3F.                                          
             03 PRZ3A    PICTURE X.                                             
           02  PRZ3I  PIC X(1).                                                 
           02  DIR3L    COMP  PIC  S9(4).                                       
           02  DIR3F    PICTURE X.                                              
           02  FILLER REDEFINES DIR3F.                                          
             03 DIR3A    PICTURE X.                                             
           02  DIR3I  PIC X(3).                                                 
           02  ZUNAM3L    COMP  PIC  S9(4).                                     
           02  ZUNAM3F    PICTURE X.                                            
           02  FILLER REDEFINES ZUNAM3F.                                        
             03 ZUNAM3A    PICTURE X.                                           
           02  ZUNAM3I  PIC X(20).                                              
           02  VNAM3L    COMP  PIC  S9(4).                                      
           02  VNAM3F    PICTURE X.                                             
           02  FILLER REDEFINES VNAM3F.                                         
             03 VNAM3A    PICTURE X.                                            
           02  VNAM3I  PIC X(10).                                               
           02  VBSEML    COMP  PIC  S9(4).                                      
           02  VBSEMF    PICTURE X.                                             
           02  FILLER REDEFINES VBSEMF.                                         
             03 VBSEMA    PICTURE X.                                            
           02  VBSEMI  PIC X(5).                                                
           02  IHKZERL    COMP  PIC  S9(4).                                     
           02  IHKZERF    PICTURE X.                                            
           02  FILLER REDEFINES IHKZERF.                                        
             03 IHKZERA    PICTURE X.                                           
           02  IHKZERI  PIC X(5).                                               
           02  KOFFER1L    COMP  PIC  S9(4).                                    
           02  KOFFER1F    PICTURE X.                                           
           02  FILLER REDEFINES KOFFER1F.                                       
             03 KOFFER1A    PICTURE X.                                          
           02  KOFFER1I  PIC X(5).                                              
           02  VBPRUL    COMP  PIC  S9(4).                                      
           02  VBPRUF    PICTURE X.                                             
           02  FILLER REDEFINES VBPRUF.                                         
             03 VBPRUA    PICTURE X.                                            
           02  VBPRUI  PIC X(5).                                                
           02  DAVZERL    COMP  PIC  S9(4).                                     
           02  DAVZERF    PICTURE X.                                            
           02  FILLER REDEFINES DAVZERF.                                        
             03 DAVZERA    PICTURE X.                                           
           02  DAVZERI  PIC X(5).                                               
           02  KOFFER2L    COMP  PIC  S9(4).                                    
           02  KOFFER2F    PICTURE X.                                           
           02  FILLER REDEFINES KOFFER2F.                                       
             03 KOFFER2A    PICTURE X.                                          
           02  KOFFER2I  PIC X(5).                                              
           02  DBBVBL    COMP  PIC  S9(4).                                      
           02  DBBVBF    PICTURE X.                                             
           02  FILLER REDEFINES DBBVBF.                                         
             03 DBBVBA    PICTURE X.                                            
           02  DBBVBI  PIC X(5).                                                
           02  DBBVAL    COMP  PIC  S9(4).                                      
           02  DBBVAF    PICTURE X.                                             
           02  FILLER REDEFINES DBBVAF.                                         
             03 DBBVAA    PICTURE X.                                            
           02  DBBVAI  PIC X(5).                                                
           02  MITGLL    COMP  PIC  S9(4).                                      
           02  MITGLF    PICTURE X.                                             
           02  FILLER REDEFINES MITGLF.                                         
             03 MITGLA    PICTURE X.                                            
           02  MITGLI  PIC X(1).                                                
           02  ALSEMDL    COMP  PIC  S9(4).                                     
           02  ALSEMDF    PICTURE X.                                            
           02  FILLER REDEFINES ALSEMDF.                                        
             03 ALSEMDA    PICTURE X.                                           
           02  ALSEMDI  PIC X(5).                                               
           02  ALSEML    COMP  PIC  S9(4).                                      
           02  ALSEMF    PICTURE X.                                             
           02  FILLER REDEFINES ALSEMF.                                         
             03 ALSEMA    PICTURE X.                                            
           02  ALSEMI  PIC X(1).                                                
           02  VBHANDBL    COMP  PIC  S9(4).                                    
           02  VBHANDBF    PICTURE X.                                           
           02  FILLER REDEFINES VBHANDBF.                                       
             03 VBHANDBA    PICTURE X.                                          
           02  VBHANDBI  PIC X(5).                                              
           02  BDVPRUL    COMP  PIC  S9(4).                                     
           02  BDVPRUF    PICTURE X.                                            
           02  FILLER REDEFINES BDVPRUF.                                        
             03 BDVPRUA    PICTURE X.                                           
           02  BDVPRUI  PIC X(5).                                               
           02  KARSEMDL    COMP  PIC  S9(4).                                    
           02  KARSEMDF    PICTURE X.                                           
           02  FILLER REDEFINES KARSEMDF.                                       
             03 KARSEMDA    PICTURE X.                                          
           02  KARSEMDI  PIC X(5).                                              
           02  KARSEML    COMP  PIC  S9(4).                                     
           02  KARSEMF    PICTURE X.                                            
           02  FILLER REDEFINES KARSEMF.                                        
             03 KARSEMA    PICTURE X.                                           
           02  KARSEMI  PIC X(1).                                               
           02  HALSTL    COMP  PIC  S9(4).                                      
           02  HALSTF    PICTURE X.                                             
           02  FILLER REDEFINES HALSTF.                                         
             03 HALSTA    PICTURE X.                                            
           02  HALSTI  PIC X(5).                                                
           02  RGSEMDL    COMP  PIC  S9(4).                                     
           02  RGSEMDF    PICTURE X.                                            
           02  FILLER REDEFINES RGSEMDF.                                        
             03 RGSEMDA    PICTURE X.                                           
           02  RGSEMDI  PIC X(5).                                               
           02  RGSEML    COMP  PIC  S9(4).                                      
           02  RGSEMF    PICTURE X.                                             
           02  FILLER REDEFINES RGSEMF.                                         
             03 RGSEMA    PICTURE X.                                            
           02  RGSEMI  PIC X(1).                                                
           02  RAUT1L    COMP  PIC  S9(4).                                      
           02  RAUT1F    PICTURE X.                                             
           02  FILLER REDEFINES RAUT1F.                                         
             03 RAUT1A    PICTURE X.                                            
           02  RAUT1I  PIC X(5).                                                
           02  AUFB1TL    COMP  PIC  S9(4).                                     
           02  AUFB1TF    PICTURE X.                                            
           02  FILLER REDEFINES AUFB1TF.                                        
             03 AUFB1TA    PICTURE X.                                           
           02  AUFB1TI  PIC X(15).                                              
           02  AUFB1L    COMP  PIC  S9(4).                                      
           02  AUFB1F    PICTURE X.                                             
           02  FILLER REDEFINES AUFB1F.                                         
             03 AUFB1A    PICTURE X.                                            
           02  AUFB1I  PIC X(5).                                                
           02  MESSINL    COMP  PIC  S9(4).                                     
           02  MESSINF    PICTURE X.                                            
           02  FILLER REDEFINES MESSINF.                                        
             03 MESSINA    PICTURE X.                                           
           02  MESSINI  PIC X(5).                                               
           02  RAUT2L    COMP  PIC  S9(4).                                      
           02  RAUT2F    PICTURE X.                                             
           02  FILLER REDEFINES RAUT2F.                                         
             03 RAUT2A    PICTURE X.                                            
           02  RAUT2I  PIC X(5).                                                
           02  PRUEF1TL    COMP  PIC  S9(4).                                    
           02  PRUEF1TF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF1TF.                                       
             03 PRUEF1TA    PICTURE X.                                          
           02  PRUEF1TI  PIC X(15).                                             
           02  PRUEF1L    COMP  PIC  S9(4).                                     
           02  PRUEF1F    PICTURE X.                                            
           02  FILLER REDEFINES PRUEF1F.                                        
             03 PRUEF1A    PICTURE X.                                           
           02  PRUEF1I  PIC X(5).                                               
           02  BMAPPEL    COMP  PIC  S9(4).                                     
           02  BMAPPEF    PICTURE X.                                            
           02  FILLER REDEFINES BMAPPEF.                                        
             03 BMAPPEA    PICTURE X.                                           
           02  BMAPPEI  PIC X(5).                                               
           02  RAUT3L    COMP  PIC  S9(4).                                      
           02  RAUT3F    PICTURE X.                                             
           02  FILLER REDEFINES RAUT3F.                                         
             03 RAUT3A    PICTURE X.                                            
           02  RAUT3I  PIC X(5).                                                
           02  RAUT4L    COMP  PIC  S9(4).                                      
           02  RAUT4F    PICTURE X.                                             
           02  FILLER REDEFINES RAUT4F.                                         
             03 RAUT4A    PICTURE X.                                            
           02  RAUT4I  PIC X(5).                                                
           02  AUFB2TL    COMP  PIC  S9(4).                                     
           02  AUFB2TF    PICTURE X.                                            
           02  FILLER REDEFINES AUFB2TF.                                        
             03 AUFB2TA    PICTURE X.                                           
           02  AUFB2TI  PIC X(15).                                              
           02  AUFB2L    COMP  PIC  S9(4).                                      
           02  AUFB2F    PICTURE X.                                             
           02  FILLER REDEFINES AUFB2F.                                         
             03 AUFB2A    PICTURE X.                                            
           02  AUFB2I  PIC X(5).                                                
           02  RAUT5L    COMP  PIC  S9(4).                                      
           02  RAUT5F    PICTURE X.                                             
           02  FILLER REDEFINES RAUT5F.                                         
             03 RAUT5A    PICTURE X.                                            
           02  RAUT5I  PIC X(5).                                                
           02  PRUEF2TL    COMP  PIC  S9(4).                                    
           02  PRUEF2TF    PICTURE X.                                           
           02  FILLER REDEFINES PRUEF2TF.                                       
             03 PRUEF2TA    PICTURE X.                                          
           02  PRUEF2TI  PIC X(15).                                             
           02  PRUEF2L    COMP  PIC  S9(4).                                     
           02  PRUEF2F    PICTURE X.                                            
           02  FILLER REDEFINES PRUEF2F.                                        
             03 PRUEF2A    PICTURE X.                                           
           02  PRUEF2I  PIC X(5).                                               
           02  GABSTUL    COMP  PIC  S9(4).                                     
           02  GABSTUF    PICTURE X.                                            
           02  FILLER REDEFINES GABSTUF.                                        
             03 GABSTUA    PICTURE X.                                           
           02  GABSTUI  PIC X(5).                                               
           02  NADELTL    COMP  PIC  S9(4).                                     
           02  NADELTF    PICTURE X.                                            
           02  FILLER REDEFINES NADELTF.                                        
             03 NADELTA    PICTURE X.                                           
           02  NADELTI  PIC X(19).                                              
           02  NADELL    COMP  PIC  S9(4).                                      
           02  NADELF    PICTURE X.                                             
           02  FILLER REDEFINES NADELF.                                         
             03 NADELA    PICTURE X.                                            
           02  NADELI  PIC X(3).                                                
           02  GABPRUL    COMP  PIC  S9(4).                                     
           02  GABPRUF    PICTURE X.                                            
           02  FILLER REDEFINES GABPRUF.                                        
             03 GABPRUA    PICTURE X.                                           
           02  GABPRUI  PIC X(5).                                               
           02  GUHRL    COMP  PIC  S9(4).                                       
           02  GUHRF    PICTURE X.                                              
           02  FILLER REDEFINES GUHRF.                                          
             03 GUHRA    PICTURE X.                                             
           02  GUHRI  PIC X(19).                                                
           02  GUHR1L    COMP  PIC  S9(4).                                      
           02  GUHR1F    PICTURE X.                                             
           02  FILLER REDEFINES GUHR1F.                                         
             03 GUHR1A    PICTURE X.                                            
           02  GUHR1I  PIC X(5).                                                
           02  GPENL    COMP  PIC  S9(4).                                       
           02  GPENF    PICTURE X.                                              
           02  FILLER REDEFINES GPENF.                                          
             03 GPENA    PICTURE X.                                             
           02  GPENI  PIC X(19).                                                
           02  GPENNRL    COMP  PIC  S9(4).                                     
           02  GPENNRF    PICTURE X.                                            
           02  FILLER REDEFINES GPENNRF.                                        
             03 GPENNRA    PICTURE X.                                           
           02  GPENNRI  PIC X(2).                                               
           02  GPENDATL    COMP  PIC  S9(4).                                    
           02  GPENDATF    PICTURE X.                                           
           02  FILLER REDEFINES GPENDATF.                                       
             03 GPENDATA    PICTURE X.                                          
           02  GPENDATI  PIC X(5).                                              
           02  CORRL    COMP  PIC  S9(4).                                       
           02  CORRF    PICTURE X.                                              
           02  FILLER REDEFINES CORRF.                                          
             03 CORRA    PICTURE X.                                             
           02  CORRI  PIC X(5).                                                 
           02  NVBNR3L    COMP  PIC  S9(4).                                     
           02  NVBNR3F    PICTURE X.                                            
           02  FILLER REDEFINES NVBNR3F.                                        
             03 NVBNR3A    PICTURE X.                                           
           02  NVBNR3I  PIC X(7).                                               
           02  NMCODE3L    COMP  PIC  S9(4).                                    
           02  NMCODE3F    PICTURE X.                                           
           02  FILLER REDEFINES NMCODE3F.                                       
             03 NMCODE3A    PICTURE X.                                          
           02  NMCODE3I  PIC X(18).                                             
           02  NTRANS3L    COMP  PIC  S9(4).                                    
           02  NTRANS3F    PICTURE X.                                           
           02  FILLER REDEFINES NTRANS3F.                                       
             03 NTRANS3A    PICTURE X.                                          
           02  NTRANS3I  PIC X(4).                                              
           02  INFO3L    COMP  PIC  S9(4).                                      
           02  INFO3F    PICTURE X.                                             
           02  FILLER REDEFINES INFO3F.                                         
             03 INFO3A    PICTURE X.                                            
           02  INFO3I  PIC X(75).                                               
       01  UU957O REDEFINES UU957I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR3O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT3O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  UHR3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRZ3O  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DIR3O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZUNAM3O  PIC X(20).                                              
           02  FILLER PICTURE X(3).                                             
           02  VNAM3O  PIC X(10).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBSEMO PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  IHKZERO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  KOFFER1O PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  VBPRUO PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  DAVZERO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  KOFFER2O PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  DBBVBO PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  DBBVAO PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  MITGLO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  ALSEMDO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  ALSEMO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBHANDBO PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  BDVPRUO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  KARSEMDO PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  KARSEMO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  HALSTO PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  RGSEMDO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RGSEMO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  RAUT1O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  AUFB1TO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUFB1O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  MESSINO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT2O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  PRUEF1TO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEF1O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  BMAPPEO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  RAUT3O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  RAUT4O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  AUFB2TO  PIC X(15).                                              
           02  FILLER PICTURE X(3).                                             
           02  AUFB2O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  RAUT5O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  PRUEF2TO  PIC X(15).                                             
           02  FILLER PICTURE X(3).                                             
           02  PRUEF2O PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  GABSTUO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  NADELTO  PIC X(19).                                              
           02  FILLER PICTURE X(3).                                             
           02  NADELO  PIC X(3).                                                
           02  FILLER PICTURE X(3).                                             
           02  GABPRUO PIC 99.99.                                               
           02  FILLER PICTURE X(3).                                             
           02  GUHRO  PIC X(19).                                                
           02  FILLER PICTURE X(3).                                             
           02  GUHR1O PIC 99.99.                                                
           02  FILLER PICTURE X(3).                                             
           02  GPENO  PIC X(19).                                                
           02  FILLER PICTURE X(3).                                             
           02  GPENNRO  PIC X(2).                                               
           02  FILLER PICTURE X(3).                                             
           02  GPENDATO PIC 99.99.                                              
           02  FILLER PICTURE X(3).                                             
           02  CORRO PIC 99.99.                                                 
           02  FILLER PICTURE X(3).                                             
           02  NVBNR3O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  NMCODE3O  PIC X(18).                                             
           02  FILLER PICTURE X(3).                                             
           02  NTRANS3O  PIC X(4).                                              
           02  FILLER PICTURE X(3).                                             
           02  INFO3O  PIC X(75).                                               
