       01  UU961I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNR1L    COMP  PIC  S9(4).                                       
           02  PNR1F    PICTURE X.                                              
           02  FILLER REDEFINES PNR1F.                                          
             03 PNR1A    PICTURE X.                                             
           02  PNR1I  PIC X(7).                                                 
           02  DAT1L    COMP  PIC  S9(4).                                       
           02  DAT1F    PICTURE X.                                              
           02  FILLER REDEFINES DAT1F.                                          
             03 DAT1A    PICTURE X.                                             
           02  DAT1I  PIC X(8).                                                 
           02  ZEIT1L    COMP  PIC  S9(4).                                      
           02  ZEIT1F    PICTURE X.                                             
           02  FILLER REDEFINES ZEIT1F.                                         
             03 ZEIT1A    PICTURE X.                                            
           02  ZEIT1I  PIC X(5).                                                
           02  VB1L    COMP  PIC  S9(4).                                        
           02  VB1F    PICTURE X.                                               
           02  FILLER REDEFINES VB1F.                                           
             03 VB1A    PICTURE X.                                              
           02  VB1I  PIC X(7).                                                  
           02  MON1L    COMP  PIC  S9(4).                                       
           02  MON1F    PICTURE X.                                              
           02  FILLER REDEFINES MON1F.                                          
             03 MON1A    PICTURE X.                                             
           02  MON1I  PIC X(5).                                                 
           02  AKT1L    COMP  PIC  S9(4).                                       
           02  AKT1F    PICTURE X.                                              
           02  FILLER REDEFINES AKT1F.                                          
             03 AKT1A    PICTURE X.                                             
           02  AKT1I  PIC X(2).                                                 
           02  VBNR1L    COMP  PIC  S9(4).                                      
           02  VBNR1F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR1F.                                         
             03 VBNR1A    PICTURE X.                                            
           02  VBNR1I  PIC X(7).                                                
           02  VBN1L    COMP  PIC  S9(4).                                       
           02  VBN1F    PICTURE X.                                              
           02  FILLER REDEFINES VBN1F.                                          
             03 VBN1A    PICTURE X.                                             
           02  VBN1I  PIC X(12).                                                
           02  VBVON1L    COMP  PIC  S9(4).                                     
           02  VBVON1F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON1F.                                        
             03 VBVON1A    PICTURE X.                                           
           02  VBVON1I  PIC X(8).                                               
           02  STUF1L    COMP  PIC  S9(4).                                      
           02  STUF1F    PICTURE X.                                             
           02  FILLER REDEFINES STUF1F.                                         
             03 STUF1A    PICTURE X.                                            
           02  STUF1I  PIC X(4).                                                
           02  AE1L    COMP  PIC  S9(4).                                        
           02  AE1F    PICTURE X.                                               
           02  FILLER REDEFINES AE1F.                                           
             03 AE1A    PICTURE X.                                              
           02  AE1I  PIC X(7).                                                  
           02  AG1L    COMP  PIC  S9(4).                                        
           02  AG1F    PICTURE X.                                               
           02  FILLER REDEFINES AG1F.                                           
             03 AG1A    PICTURE X.                                              
           02  AG1I  PIC X(7).                                                  
           02  NE1L    COMP  PIC  S9(4).                                        
           02  NE1F    PICTURE X.                                               
           02  FILLER REDEFINES NE1F.                                           
             03 NE1A    PICTURE X.                                              
           02  NE1I  PIC X(6).                                                  
           02  NG1L    COMP  PIC  S9(4).                                        
           02  NG1F    PICTURE X.                                               
           02  FILLER REDEFINES NG1F.                                           
             03 NG1A    PICTURE X.                                              
           02  NG1I  PIC X(6).                                                  
           02  VBNR2L    COMP  PIC  S9(4).                                      
           02  VBNR2F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR2F.                                         
             03 VBNR2A    PICTURE X.                                            
           02  VBNR2I  PIC X(7).                                                
           02  VBN2L    COMP  PIC  S9(4).                                       
           02  VBN2F    PICTURE X.                                              
           02  FILLER REDEFINES VBN2F.                                          
             03 VBN2A    PICTURE X.                                             
           02  VBN2I  PIC X(12).                                                
           02  VBVON2L    COMP  PIC  S9(4).                                     
           02  VBVON2F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON2F.                                        
             03 VBVON2A    PICTURE X.                                           
           02  VBVON2I  PIC X(8).                                               
           02  STUF2L    COMP  PIC  S9(4).                                      
           02  STUF2F    PICTURE X.                                             
           02  FILLER REDEFINES STUF2F.                                         
             03 STUF2A    PICTURE X.                                            
           02  STUF2I  PIC X(4).                                                
           02  AE2L    COMP  PIC  S9(4).                                        
           02  AE2F    PICTURE X.                                               
           02  FILLER REDEFINES AE2F.                                           
             03 AE2A    PICTURE X.                                              
           02  AE2I  PIC X(7).                                                  
           02  AG2L    COMP  PIC  S9(4).                                        
           02  AG2F    PICTURE X.                                               
           02  FILLER REDEFINES AG2F.                                           
             03 AG2A    PICTURE X.                                              
           02  AG2I  PIC X(7).                                                  
           02  NE2L    COMP  PIC  S9(4).                                        
           02  NE2F    PICTURE X.                                               
           02  FILLER REDEFINES NE2F.                                           
             03 NE2A    PICTURE X.                                              
           02  NE2I  PIC X(6).                                                  
           02  NG2L    COMP  PIC  S9(4).                                        
           02  NG2F    PICTURE X.                                               
           02  FILLER REDEFINES NG2F.                                           
             03 NG2A    PICTURE X.                                              
           02  NG2I  PIC X(6).                                                  
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  VBN3L    COMP  PIC  S9(4).                                       
           02  VBN3F    PICTURE X.                                              
           02  FILLER REDEFINES VBN3F.                                          
             03 VBN3A    PICTURE X.                                             
           02  VBN3I  PIC X(12).                                                
           02  VBVON3L    COMP  PIC  S9(4).                                     
           02  VBVON3F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON3F.                                        
             03 VBVON3A    PICTURE X.                                           
           02  VBVON3I  PIC X(8).                                               
           02  STUF3L    COMP  PIC  S9(4).                                      
           02  STUF3F    PICTURE X.                                             
           02  FILLER REDEFINES STUF3F.                                         
             03 STUF3A    PICTURE X.                                            
           02  STUF3I  PIC X(4).                                                
           02  AE3L    COMP  PIC  S9(4).                                        
           02  AE3F    PICTURE X.                                               
           02  FILLER REDEFINES AE3F.                                           
             03 AE3A    PICTURE X.                                              
           02  AE3I  PIC X(7).                                                  
           02  AG3L    COMP  PIC  S9(4).                                        
           02  AG3F    PICTURE X.                                               
           02  FILLER REDEFINES AG3F.                                           
             03 AG3A    PICTURE X.                                              
           02  AG3I  PIC X(7).                                                  
           02  NE3L    COMP  PIC  S9(4).                                        
           02  NE3F    PICTURE X.                                               
           02  FILLER REDEFINES NE3F.                                           
             03 NE3A    PICTURE X.                                              
           02  NE3I  PIC X(6).                                                  
           02  NG3L    COMP  PIC  S9(4).                                        
           02  NG3F    PICTURE X.                                               
           02  FILLER REDEFINES NG3F.                                           
             03 NG3A    PICTURE X.                                              
           02  NG3I  PIC X(6).                                                  
           02  VBNR4L    COMP  PIC  S9(4).                                      
           02  VBNR4F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR4F.                                         
             03 VBNR4A    PICTURE X.                                            
           02  VBNR4I  PIC X(7).                                                
           02  VBN4L    COMP  PIC  S9(4).                                       
           02  VBN4F    PICTURE X.                                              
           02  FILLER REDEFINES VBN4F.                                          
             03 VBN4A    PICTURE X.                                             
           02  VBN4I  PIC X(12).                                                
           02  VBVON4L    COMP  PIC  S9(4).                                     
           02  VBVON4F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON4F.                                        
             03 VBVON4A    PICTURE X.                                           
           02  VBVON4I  PIC X(8).                                               
           02  STUF4L    COMP  PIC  S9(4).                                      
           02  STUF4F    PICTURE X.                                             
           02  FILLER REDEFINES STUF4F.                                         
             03 STUF4A    PICTURE X.                                            
           02  STUF4I  PIC X(4).                                                
           02  AE4L    COMP  PIC  S9(4).                                        
           02  AE4F    PICTURE X.                                               
           02  FILLER REDEFINES AE4F.                                           
             03 AE4A    PICTURE X.                                              
           02  AE4I  PIC X(7).                                                  
           02  AG4L    COMP  PIC  S9(4).                                        
           02  AG4F    PICTURE X.                                               
           02  FILLER REDEFINES AG4F.                                           
             03 AG4A    PICTURE X.                                              
           02  AG4I  PIC X(7).                                                  
           02  NE4L    COMP  PIC  S9(4).                                        
           02  NE4F    PICTURE X.                                               
           02  FILLER REDEFINES NE4F.                                           
             03 NE4A    PICTURE X.                                              
           02  NE4I  PIC X(6).                                                  
           02  NG4L    COMP  PIC  S9(4).                                        
           02  NG4F    PICTURE X.                                               
           02  FILLER REDEFINES NG4F.                                           
             03 NG4A    PICTURE X.                                              
           02  NG4I  PIC X(6).                                                  
           02  VBNR5L    COMP  PIC  S9(4).                                      
           02  VBNR5F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR5F.                                         
             03 VBNR5A    PICTURE X.                                            
           02  VBNR5I  PIC X(7).                                                
           02  VBN5L    COMP  PIC  S9(4).                                       
           02  VBN5F    PICTURE X.                                              
           02  FILLER REDEFINES VBN5F.                                          
             03 VBN5A    PICTURE X.                                             
           02  VBN5I  PIC X(12).                                                
           02  VBVON5L    COMP  PIC  S9(4).                                     
           02  VBVON5F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON5F.                                        
             03 VBVON5A    PICTURE X.                                           
           02  VBVON5I  PIC X(8).                                               
           02  STUF5L    COMP  PIC  S9(4).                                      
           02  STUF5F    PICTURE X.                                             
           02  FILLER REDEFINES STUF5F.                                         
             03 STUF5A    PICTURE X.                                            
           02  STUF5I  PIC X(4).                                                
           02  AE5L    COMP  PIC  S9(4).                                        
           02  AE5F    PICTURE X.                                               
           02  FILLER REDEFINES AE5F.                                           
             03 AE5A    PICTURE X.                                              
           02  AE5I  PIC X(7).                                                  
           02  AG5L    COMP  PIC  S9(4).                                        
           02  AG5F    PICTURE X.                                               
           02  FILLER REDEFINES AG5F.                                           
             03 AG5A    PICTURE X.                                              
           02  AG5I  PIC X(7).                                                  
           02  NE5L    COMP  PIC  S9(4).                                        
           02  NE5F    PICTURE X.                                               
           02  FILLER REDEFINES NE5F.                                           
             03 NE5A    PICTURE X.                                              
           02  NE5I  PIC X(6).                                                  
           02  NG5L    COMP  PIC  S9(4).                                        
           02  NG5F    PICTURE X.                                               
           02  FILLER REDEFINES NG5F.                                           
             03 NG5A    PICTURE X.                                              
           02  NG5I  PIC X(6).                                                  
           02  VBNR6L    COMP  PIC  S9(4).                                      
           02  VBNR6F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR6F.                                         
             03 VBNR6A    PICTURE X.                                            
           02  VBNR6I  PIC X(7).                                                
           02  VBN6L    COMP  PIC  S9(4).                                       
           02  VBN6F    PICTURE X.                                              
           02  FILLER REDEFINES VBN6F.                                          
             03 VBN6A    PICTURE X.                                             
           02  VBN6I  PIC X(12).                                                
           02  VBVON6L    COMP  PIC  S9(4).                                     
           02  VBVON6F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON6F.                                        
             03 VBVON6A    PICTURE X.                                           
           02  VBVON6I  PIC X(8).                                               
           02  STUF6L    COMP  PIC  S9(4).                                      
           02  STUF6F    PICTURE X.                                             
           02  FILLER REDEFINES STUF6F.                                         
             03 STUF6A    PICTURE X.                                            
           02  STUF6I  PIC X(4).                                                
           02  AE6L    COMP  PIC  S9(4).                                        
           02  AE6F    PICTURE X.                                               
           02  FILLER REDEFINES AE6F.                                           
             03 AE6A    PICTURE X.                                              
           02  AE6I  PIC X(7).                                                  
           02  AG6L    COMP  PIC  S9(4).                                        
           02  AG6F    PICTURE X.                                               
           02  FILLER REDEFINES AG6F.                                           
             03 AG6A    PICTURE X.                                              
           02  AG6I  PIC X(7).                                                  
           02  NE6L    COMP  PIC  S9(4).                                        
           02  NE6F    PICTURE X.                                               
           02  FILLER REDEFINES NE6F.                                           
             03 NE6A    PICTURE X.                                              
           02  NE6I  PIC X(6).                                                  
           02  NG6L    COMP  PIC  S9(4).                                        
           02  NG6F    PICTURE X.                                               
           02  FILLER REDEFINES NG6F.                                           
             03 NG6A    PICTURE X.                                              
           02  NG6I  PIC X(6).                                                  
           02  VBNR7L    COMP  PIC  S9(4).                                      
           02  VBNR7F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR7F.                                         
             03 VBNR7A    PICTURE X.                                            
           02  VBNR7I  PIC X(7).                                                
           02  VBN7L    COMP  PIC  S9(4).                                       
           02  VBN7F    PICTURE X.                                              
           02  FILLER REDEFINES VBN7F.                                          
             03 VBN7A    PICTURE X.                                             
           02  VBN7I  PIC X(12).                                                
           02  VBVON7L    COMP  PIC  S9(4).                                     
           02  VBVON7F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON7F.                                        
             03 VBVON7A    PICTURE X.                                           
           02  VBVON7I  PIC X(8).                                               
           02  STUF7L    COMP  PIC  S9(4).                                      
           02  STUF7F    PICTURE X.                                             
           02  FILLER REDEFINES STUF7F.                                         
             03 STUF7A    PICTURE X.                                            
           02  STUF7I  PIC X(4).                                                
           02  AE7L    COMP  PIC  S9(4).                                        
           02  AE7F    PICTURE X.                                               
           02  FILLER REDEFINES AE7F.                                           
             03 AE7A    PICTURE X.                                              
           02  AE7I  PIC X(7).                                                  
           02  AG7L    COMP  PIC  S9(4).                                        
           02  AG7F    PICTURE X.                                               
           02  FILLER REDEFINES AG7F.                                           
             03 AG7A    PICTURE X.                                              
           02  AG7I  PIC X(7).                                                  
           02  NE7L    COMP  PIC  S9(4).                                        
           02  NE7F    PICTURE X.                                               
           02  FILLER REDEFINES NE7F.                                           
             03 NE7A    PICTURE X.                                              
           02  NE7I  PIC X(6).                                                  
           02  NG7L    COMP  PIC  S9(4).                                        
           02  NG7F    PICTURE X.                                               
           02  FILLER REDEFINES NG7F.                                           
             03 NG7A    PICTURE X.                                              
           02  NG7I  PIC X(6).                                                  
           02  VBNR8L    COMP  PIC  S9(4).                                      
           02  VBNR8F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR8F.                                         
             03 VBNR8A    PICTURE X.                                            
           02  VBNR8I  PIC X(7).                                                
           02  VBN8L    COMP  PIC  S9(4).                                       
           02  VBN8F    PICTURE X.                                              
           02  FILLER REDEFINES VBN8F.                                          
             03 VBN8A    PICTURE X.                                             
           02  VBN8I  PIC X(12).                                                
           02  VBVON8L    COMP  PIC  S9(4).                                     
           02  VBVON8F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON8F.                                        
             03 VBVON8A    PICTURE X.                                           
           02  VBVON8I  PIC X(8).                                               
           02  STUF8L    COMP  PIC  S9(4).                                      
           02  STUF8F    PICTURE X.                                             
           02  FILLER REDEFINES STUF8F.                                         
             03 STUF8A    PICTURE X.                                            
           02  STUF8I  PIC X(4).                                                
           02  AE8L    COMP  PIC  S9(4).                                        
           02  AE8F    PICTURE X.                                               
           02  FILLER REDEFINES AE8F.                                           
             03 AE8A    PICTURE X.                                              
           02  AE8I  PIC X(7).                                                  
           02  AG8L    COMP  PIC  S9(4).                                        
           02  AG8F    PICTURE X.                                               
           02  FILLER REDEFINES AG8F.                                           
             03 AG8A    PICTURE X.                                              
           02  AG8I  PIC X(7).                                                  
           02  NE8L    COMP  PIC  S9(4).                                        
           02  NE8F    PICTURE X.                                               
           02  FILLER REDEFINES NE8F.                                           
             03 NE8A    PICTURE X.                                              
           02  NE8I  PIC X(6).                                                  
           02  NG8L    COMP  PIC  S9(4).                                        
           02  NG8F    PICTURE X.                                               
           02  FILLER REDEFINES NG8F.                                           
             03 NG8A    PICTURE X.                                              
           02  NG8I  PIC X(6).                                                  
           02  VBNR9L    COMP  PIC  S9(4).                                      
           02  VBNR9F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR9F.                                         
             03 VBNR9A    PICTURE X.                                            
           02  VBNR9I  PIC X(7).                                                
           02  VBN9L    COMP  PIC  S9(4).                                       
           02  VBN9F    PICTURE X.                                              
           02  FILLER REDEFINES VBN9F.                                          
             03 VBN9A    PICTURE X.                                             
           02  VBN9I  PIC X(12).                                                
           02  VBVON9L    COMP  PIC  S9(4).                                     
           02  VBVON9F    PICTURE X.                                            
           02  FILLER REDEFINES VBVON9F.                                        
             03 VBVON9A    PICTURE X.                                           
           02  VBVON9I  PIC X(8).                                               
           02  STUF9L    COMP  PIC  S9(4).                                      
           02  STUF9F    PICTURE X.                                             
           02  FILLER REDEFINES STUF9F.                                         
             03 STUF9A    PICTURE X.                                            
           02  STUF9I  PIC X(4).                                                
           02  AE9L    COMP  PIC  S9(4).                                        
           02  AE9F    PICTURE X.                                               
           02  FILLER REDEFINES AE9F.                                           
             03 AE9A    PICTURE X.                                              
           02  AE9I  PIC X(7).                                                  
           02  AG9L    COMP  PIC  S9(4).                                        
           02  AG9F    PICTURE X.                                               
           02  FILLER REDEFINES AG9F.                                           
             03 AG9A    PICTURE X.                                              
           02  AG9I  PIC X(7).                                                  
           02  NE9L    COMP  PIC  S9(4).                                        
           02  NE9F    PICTURE X.                                               
           02  FILLER REDEFINES NE9F.                                           
             03 NE9A    PICTURE X.                                              
           02  NE9I  PIC X(6).                                                  
           02  NG9L    COMP  PIC  S9(4).                                        
           02  NG9F    PICTURE X.                                               
           02  FILLER REDEFINES NG9F.                                           
             03 NG9A    PICTURE X.                                              
           02  NG9I  PIC X(6).                                                  
           02  VBNR10L    COMP  PIC  S9(4).                                     
           02  VBNR10F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR10F.                                        
             03 VBNR10A    PICTURE X.                                           
           02  VBNR10I  PIC X(7).                                               
           02  VBN10L    COMP  PIC  S9(4).                                      
           02  VBN10F    PICTURE X.                                             
           02  FILLER REDEFINES VBN10F.                                         
             03 VBN10A    PICTURE X.                                            
           02  VBN10I  PIC X(12).                                               
           02  VBVON10L    COMP  PIC  S9(4).                                    
           02  VBVON10F    PICTURE X.                                           
           02  FILLER REDEFINES VBVON10F.                                       
             03 VBVON10A    PICTURE X.                                          
           02  VBVON10I  PIC X(8).                                              
           02  STUF10L    COMP  PIC  S9(4).                                     
           02  STUF10F    PICTURE X.                                            
           02  FILLER REDEFINES STUF10F.                                        
             03 STUF10A    PICTURE X.                                           
           02  STUF10I  PIC X(4).                                               
           02  AE10L    COMP  PIC  S9(4).                                       
           02  AE10F    PICTURE X.                                              
           02  FILLER REDEFINES AE10F.                                          
             03 AE10A    PICTURE X.                                             
           02  AE10I  PIC X(7).                                                 
           02  AG10L    COMP  PIC  S9(4).                                       
           02  AG10F    PICTURE X.                                              
           02  FILLER REDEFINES AG10F.                                          
             03 AG10A    PICTURE X.                                             
           02  AG10I  PIC X(7).                                                 
           02  NE10L    COMP  PIC  S9(4).                                       
           02  NE10F    PICTURE X.                                              
           02  FILLER REDEFINES NE10F.                                          
             03 NE10A    PICTURE X.                                             
           02  NE10I  PIC X(6).                                                 
           02  NG10L    COMP  PIC  S9(4).                                       
           02  NG10F    PICTURE X.                                              
           02  FILLER REDEFINES NG10F.                                          
             03 NG10A    PICTURE X.                                             
           02  NG10I  PIC X(6).                                                 
           02  EVBNRL    COMP  PIC  S9(4).                                      
           02  EVBNRF    PICTURE X.                                             
           02  FILLER REDEFINES EVBNRF.                                         
             03 EVBNRA    PICTURE X.                                            
           02  EVBNRI  PIC X(7).                                                
           02  ESCHLL    COMP  PIC  S9(4).                                      
           02  ESCHLF    PICTURE X.                                             
           02  FILLER REDEFINES ESCHLF.                                         
             03 ESCHLA    PICTURE X.                                            
           02  ESCHLI  PIC X(2).                                                
           02  ETRANSL    COMP  PIC  S9(4).                                     
           02  ETRANSF    PICTURE X.                                            
           02  FILLER REDEFINES ETRANSF.                                        
             03 ETRANSA    PICTURE X.                                           
           02  ETRANSI  PIC X(4).                                               
           02  MELD1L    COMP  PIC  S9(4).                                      
           02  MELD1F    PICTURE X.                                             
           02  FILLER REDEFINES MELD1F.                                         
             03 MELD1A    PICTURE X.                                            
           02  MELD1I  PIC X(79).                                               
       01  UU961O REDEFINES UU961I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNR1O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DAT1O  PIC X(8).                                                 
           02  FILLER PICTURE X(3).                                             
           02  ZEIT1O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  VB1O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  MON1O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AKT1O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBNR1O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN1O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON1O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF1O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE1O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG1O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE1O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG1O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR2O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN2O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON2O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF2O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE2O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG2O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE2O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG2O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN3O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE3O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG3O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE3O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG3O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR4O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN4O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON4O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF4O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE4O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG4O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE4O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG4O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR5O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN5O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON5O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF5O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE5O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG5O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE5O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG5O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR6O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN6O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON6O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF6O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE6O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG6O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE6O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG6O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR7O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN7O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON7O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF7O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE7O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG7O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE7O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG7O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR8O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN8O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON8O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF8O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE8O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG8O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE8O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG8O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR9O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBN9O  PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBVON9O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  STUF9O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  AE9O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AG9O  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NE9O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  NG9O  PIC X(6).                                                  
           02  FILLER PICTURE X(3).                                             
           02  VBNR10O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBN10O  PIC X(12).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBVON10O  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  STUF10O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  AE10O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AG10O  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  NE10O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  NG10O  PIC X(6).                                                 
           02  FILLER PICTURE X(3).                                             
           02  EVBNRO  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  ESCHLO  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  ETRANSO  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  MELD1O  PIC X(79).                                               
