       01  UU966I.                                                              
           02  FILLER PIC X(12).                                                
           02  PERS3L    COMP  PIC  S9(4).                                      
           02  PERS3F    PICTURE X.                                             
           02  FILLER REDEFINES PERS3F.                                         
             03 PERS3A    PICTURE X.                                            
           02  PERS3I  PIC X(7).                                                
           02  DATUM3L    COMP  PIC  S9(4).                                     
           02  DATUM3F    PICTURE X.                                            
           02  FILLER REDEFINES DATUM3F.                                        
             03 DATUM3A    PICTURE X.                                           
           02  DATUM3I  PIC X(8).                                               
           02  UHR3L    COMP  PIC  S9(4).                                       
           02  UHR3F    PICTURE X.                                              
           02  FILLER REDEFINES UHR3F.                                          
             03 UHR3A    PICTURE X.                                             
           02  UHR3I  PIC X(5).                                                 
           02  VBSTAT3L    COMP  PIC  S9(4).                                    
           02  VBSTAT3F    PICTURE X.                                           
           02  FILLER REDEFINES VBSTAT3F.                                       
             03 VBSTAT3A    PICTURE X.                                          
           02  VBSTAT3I  PIC X(12).                                             
           02  DAT3L    COMP  PIC  S9(4).                                       
           02  DAT3F    PICTURE X.                                              
           02  FILLER REDEFINES DAT3F.                                          
             03 DAT3A    PICTURE X.                                             
           02  DAT3I  PIC X(5).                                                 
           02  TEXT3L    COMP  PIC  S9(4).                                      
           02  TEXT3F    PICTURE X.                                             
           02  FILLER REDEFINES TEXT3F.                                         
             03 TEXT3A    PICTURE X.                                            
           02  TEXT3I  PIC X(5).                                                
           02  STUFE3L    COMP  PIC  S9(4).                                     
           02  STUFE3F    PICTURE X.                                            
           02  FILLER REDEFINES STUFE3F.                                        
             03 STUFE3A    PICTURE X.                                           
           02  STUFE3I  PIC X(4).                                               
           02  NAME3L    COMP  PIC  S9(4).                                      
           02  NAME3F    PICTURE X.                                             
           02  FILLER REDEFINES NAME3F.                                         
             03 NAME3A    PICTURE X.                                            
           02  NAME3I  PIC X(28).                                               
           02  DIR3L    COMP  PIC  S9(4).                                       
           02  DIR3F    PICTURE X.                                              
           02  FILLER REDEFINES DIR3F.                                          
             03 DIR3A    PICTURE X.                                             
           02  DIR3I  PIC X(3).                                                 
           02  STR31L    COMP  PIC  S9(4).                                      
           02  STR31F    PICTURE X.                                             
           02  FILLER REDEFINES STR31F.                                         
             03 STR31A    PICTURE X.                                            
           02  STR31I  PIC X(1).                                                
           02  VBNR3L    COMP  PIC  S9(4).                                      
           02  VBNR3F    PICTURE X.                                             
           02  FILLER REDEFINES VBNR3F.                                         
             03 VBNR3A    PICTURE X.                                            
           02  VBNR3I  PIC X(7).                                                
           02  PRUECKL    COMP  PIC  S9(4).                                     
           02  PRUECKF    PICTURE X.                                            
           02  FILLER REDEFINES PRUECKF.                                        
             03 PRUECKA    PICTURE X.                                           
           02  PRUECKI  PIC X(6).                                               
           02  TPROZRL    COMP  PIC  S9(4).                                     
           02  TPROZRF    PICTURE X.                                            
           02  FILLER REDEFINES TPROZRF.                                        
             03 TPROZRA    PICTURE X.                                           
           02  TPROZRI  PIC X(1).                                               
           02  KTOSTL    COMP  PIC  S9(4).                                      
           02  KTOSTF    PICTURE X.                                             
           02  FILLER REDEFINES KTOSTF.                                         
             03 KTOSTA    PICTURE X.                                            
           02  KTOSTI  PIC X(11).                                               
           02  TDMRL    COMP  PIC  S9(4).                                       
           02  TDMRF    PICTURE X.                                              
           02  FILLER REDEFINES TDMRF.                                          
             03 TDMRA    PICTURE X.                                             
           02  TDMRI  PIC X(2).                                                 
           02  AEMODUPL    COMP  PIC  S9(4).                                    
           02  AEMODUPF    PICTURE X.                                           
           02  FILLER REDEFINES AEMODUPF.                                       
             03 AEMODUPA    PICTURE X.                                          
           02  AEMODUPI  PIC X(8).                                              
           02  TE1L    COMP  PIC  S9(4).                                        
           02  TE1F    PICTURE X.                                               
           02  FILLER REDEFINES TE1F.                                           
             03 TE1A    PICTURE X.                                              
           02  TE1I  PIC X(1).                                                  
           02  AEMODUBL    COMP  PIC  S9(4).                                    
           02  AEMODUBF    PICTURE X.                                           
           02  FILLER REDEFINES AEMODUBF.                                       
             03 AEMODUBA    PICTURE X.                                          
           02  AEMODUBI  PIC X(8).                                              
           02  TE2L    COMP  PIC  S9(4).                                        
           02  TE2F    PICTURE X.                                               
           02  FILLER REDEFINES TE2F.                                           
             03 TE2A    PICTURE X.                                              
           02  TE2I  PIC X(1).                                                  
           02  DMBETRPL    COMP  PIC  S9(4).                                    
           02  DMBETRPF    PICTURE X.                                           
           02  FILLER REDEFINES DMBETRPF.                                       
             03 DMBETRPA    PICTURE X.                                          
           02  DMBETRPI  PIC X(10).                                             
           02  TDM1L    COMP  PIC  S9(4).                                       
           02  TDM1F    PICTURE X.                                              
           02  FILLER REDEFINES TDM1F.                                          
             03 TDM1A    PICTURE X.                                             
           02  TDM1I  PIC X(2).                                                 
           02  DMBETRBL    COMP  PIC  S9(4).                                    
           02  DMBETRBF    PICTURE X.                                           
           02  FILLER REDEFINES DMBETRBF.                                       
             03 DMBETRBA    PICTURE X.                                          
           02  DMBETRBI  PIC X(10).                                             
           02  TDM2L    COMP  PIC  S9(4).                                       
           02  TDM2F    PICTURE X.                                              
           02  FILLER REDEFINES TDM2F.                                          
             03 TDM2A    PICTURE X.                                             
           02  TDM2I  PIC X(2).                                                 
           02  QUOTEPL    COMP  PIC  S9(4).                                     
           02  QUOTEPF    PICTURE X.                                            
           02  FILLER REDEFINES QUOTEPF.                                        
             03 QUOTEPA    PICTURE X.                                           
           02  QUOTEPI  PIC X(6).                                               
           02  TPROZ1L    COMP  PIC  S9(4).                                     
           02  TPROZ1F    PICTURE X.                                            
           02  FILLER REDEFINES TPROZ1F.                                        
             03 TPROZ1A    PICTURE X.                                           
           02  TPROZ1I  PIC X(1).                                               
           02  QUOTEBL    COMP  PIC  S9(4).                                     
           02  QUOTEBF    PICTURE X.                                            
           02  FILLER REDEFINES QUOTEBF.                                        
             03 QUOTEBA    PICTURE X.                                           
           02  QUOTEBI  PIC X(6).                                               
           02  TPROZ2L    COMP  PIC  S9(4).                                     
           02  TPROZ2F    PICTURE X.                                            
           02  FILLER REDEFINES TPROZ2F.                                        
             03 TPROZ2A    PICTURE X.                                           
           02  TPROZ2I  PIC X(1).                                               
           02  QFMINDL    COMP  PIC  S9(4).                                     
           02  QFMINDF    PICTURE X.                                            
           02  FILLER REDEFINES QFMINDF.                                        
             03 QFMINDA    PICTURE X.                                           
           02  QFMINDI  PIC X(6).                                               
           02  TPROZ3L    COMP  PIC  S9(4).                                     
           02  TPROZ3F    PICTURE X.                                            
           02  FILLER REDEFINES TPROZ3F.                                        
             03 TPROZ3A    PICTURE X.                                           
           02  TPROZ3I  PIC X(1).                                               
           02  BETRAGPL    COMP  PIC  S9(4).                                    
           02  BETRAGPF    PICTURE X.                                           
           02  FILLER REDEFINES BETRAGPF.                                       
             03 BETRAGPA    PICTURE X.                                          
           02  BETRAGPI  PIC X(10).                                             
           02  TDMA1L    COMP  PIC  S9(4).                                      
           02  TDMA1F    PICTURE X.                                             
           02  FILLER REDEFINES TDMA1F.                                         
             03 TDMA1A    PICTURE X.                                            
           02  TDMA1I  PIC X(2).                                                
           02  BETRAGBL    COMP  PIC  S9(4).                                    
           02  BETRAGBF    PICTURE X.                                           
           02  FILLER REDEFINES BETRAGBF.                                       
             03 BETRAGBA    PICTURE X.                                          
           02  BETRAGBI  PIC X(10).                                             
           02  TDMA2L    COMP  PIC  S9(4).                                      
           02  TDMA2F    PICTURE X.                                             
           02  FILLER REDEFINES TDMA2F.                                         
             03 TDMA2A    PICTURE X.                                            
           02  TDMA2I  PIC X(2).                                                
           02  BETRAGGL    COMP  PIC  S9(4).                                    
           02  BETRAGGF    PICTURE X.                                           
           02  FILLER REDEFINES BETRAGGF.                                       
             03 BETRAGGA    PICTURE X.                                          
           02  BETRAGGI  PIC X(10).                                             
           02  TDMA3L    COMP  PIC  S9(4).                                      
           02  TDMA3F    PICTURE X.                                             
           02  FILLER REDEFINES TDMA3F.                                         
             03 TDMA3A    PICTURE X.                                            
           02  TDMA3I  PIC X(2).                                                
           02  BIS678GL    COMP  PIC  S9(4).                                    
           02  BIS678GF    PICTURE X.                                           
           02  FILLER REDEFINES BIS678GF.                                       
             03 BIS678GA    PICTURE X.                                          
           02  BIS678GI  PIC X(12).                                             
           02  TEBISL    COMP  PIC  S9(4).                                      
           02  TEBISF    PICTURE X.                                             
           02  FILLER REDEFINES TEBISF.                                         
             03 TEBISA    PICTURE X.                                            
           02  TEBISI  PIC X(1).                                                
           02  AB778EL    COMP  PIC  S9(4).                                     
           02  AB778EF    PICTURE X.                                            
           02  FILLER REDEFINES AB778EF.                                        
             03 AB778EA    PICTURE X.                                           
           02  AB778EI  PIC X(12).                                              
           02  TEAB1L    COMP  PIC  S9(4).                                      
           02  TEAB1F    PICTURE X.                                             
           02  FILLER REDEFINES TEAB1F.                                         
             03 TEAB1A    PICTURE X.                                            
           02  TEAB1I  PIC X(1).                                                
           02  AB778BL    COMP  PIC  S9(4).                                     
           02  AB778BF    PICTURE X.                                            
           02  FILLER REDEFINES AB778BF.                                        
             03 AB778BA    PICTURE X.                                           
           02  AB778BI  PIC X(12).                                              
           02  TEAB2L    COMP  PIC  S9(4).                                      
           02  TEAB2F    PICTURE X.                                             
           02  FILLER REDEFINES TEAB2F.                                         
             03 TEAB2A    PICTURE X.                                            
           02  TEAB2I  PIC X(1).                                                
           02  AB778GL    COMP  PIC  S9(4).                                     
           02  AB778GF    PICTURE X.                                            
           02  FILLER REDEFINES AB778GF.                                        
             03 AB778GA    PICTURE X.                                           
           02  AB778GI  PIC X(13).                                              
           02  TEAB3L    COMP  PIC  S9(4).                                      
           02  TEAB3F    PICTURE X.                                             
           02  FILLER REDEFINES TEAB3F.                                         
             03 TEAB3A    PICTURE X.                                            
           02  TEAB3I  PIC X(1).                                                
           02  HINW3L    COMP  PIC  S9(4).                                      
           02  HINW3F    PICTURE X.                                             
           02  FILLER REDEFINES HINW3F.                                         
             03 HINW3A    PICTURE X.                                            
           02  HINW3I  PIC X(79).                                               
           02  VBNR31L    COMP  PIC  S9(4).                                     
           02  VBNR31F    PICTURE X.                                            
           02  FILLER REDEFINES VBNR31F.                                        
             03 VBNR31A    PICTURE X.                                           
           02  VBNR31I  PIC X(7).                                               
           02  LMON3L    COMP  PIC  S9(4).                                      
           02  LMON3F    PICTURE X.                                             
           02  FILLER REDEFINES LMON3F.                                         
             03 LMON3A    PICTURE X.                                            
           02  LMON3I  PIC X(2).                                                
           02  VOND3L    COMP  PIC  S9(4).                                      
           02  VOND3F    PICTURE X.                                             
           02  FILLER REDEFINES VOND3F.                                         
             03 VOND3A    PICTURE X.                                            
           02  VOND3I  PIC X(4).                                                
           02  BISD3L    COMP  PIC  S9(4).                                      
           02  BISD3F    PICTURE X.                                             
           02  FILLER REDEFINES BISD3F.                                         
             03 BISD3A    PICTURE X.                                            
           02  BISD3I  PIC X(4).                                                
           02  ANW3L    COMP  PIC  S9(4).                                       
           02  ANW3F    PICTURE X.                                              
           02  FILLER REDEFINES ANW3F.                                          
             03 ANW3A    PICTURE X.                                             
           02  ANW3I  PIC X(4).                                                 
           02  FEHL3L    COMP  PIC  S9(4).                                      
           02  FEHL3F    PICTURE X.                                             
           02  FILLER REDEFINES FEHL3F.                                         
             03 FEHL3A    PICTURE X.                                            
           02  FEHL3I  PIC X(79).                                               
       01  UU966O REDEFINES UU966I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PERS3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  DATUM3O  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  UHR3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  VBSTAT3O  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  DAT3O  PIC X(5).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TEXT3O  PIC X(5).                                                
           02  FILLER PICTURE X(3).                                             
           02  STUFE3O  PIC X(4).                                               
           02  FILLER PICTURE X(3).                                             
           02  NAME3O  PIC X(28).                                               
           02  FILLER PICTURE X(3).                                             
           02  DIR3O  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STR31O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  VBNR3O  PIC X(7).                                                
           02  FILLER PICTURE X(3).                                             
           02  PRUECKO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROZRO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  KTOSTO  PIC X(11).                                               
           02  FILLER PICTURE X(3).                                             
           02  TDMRO  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  AEMODUPO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TE1O  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  AEMODUBO  PIC X(8).                                              
           02  FILLER PICTURE X(3).                                             
           02  TE2O  PIC X(1).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DMBETRPO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  TDM1O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  DMBETRBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  TDM2O  PIC X(2).                                                 
           02  FILLER PICTURE X(3).                                             
           02  QUOTEPO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROZ1O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  QUOTEBO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROZ2O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  QFMINDO  PIC X(6).                                               
           02  FILLER PICTURE X(3).                                             
           02  TPROZ3O  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  BETRAGPO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  TDMA1O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETRAGBO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  TDMA2O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  BETRAGGO  PIC X(10).                                             
           02  FILLER PICTURE X(3).                                             
           02  TDMA3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  BIS678GO  PIC X(12).                                             
           02  FILLER PICTURE X(3).                                             
           02  TEBISO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AB778EO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEAB1O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AB778BO  PIC X(12).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEAB2O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  AB778GO  PIC X(13).                                              
           02  FILLER PICTURE X(3).                                             
           02  TEAB3O  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  HINW3O  PIC X(79).                                               
           02  FILLER PICTURE X(3).                                             
           02  VBNR31O  PIC X(7).                                               
           02  FILLER PICTURE X(3).                                             
           02  LMON3O  PIC X(2).                                                
           02  FILLER PICTURE X(3).                                             
           02  VOND3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  BISD3O  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  ANW3O  PIC X(4).                                                 
           02  FILLER PICTURE X(3).                                             
           02  FEHL3O  PIC X(79).                                               
