       01  UU991I.                                                              
           02  FILLER PIC X(12).                                                
           02  PSL    COMP  PIC  S9(4).                                         
           02  PSF    PICTURE X.                                                
           02  FILLER REDEFINES PSF.                                            
             03 PSA    PICTURE X.                                               
           02  PSI  PIC X(10).                                                  
       01  UU991O REDEFINES UU991I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PSO  PIC X(10).                                                  
