       01  UU994I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  Z1L    COMP  PIC  S9(4).                                         
           02  Z1F    PICTURE X.                                                
           02  FILLER REDEFINES Z1F.                                            
             03 Z1A    PICTURE X.                                               
           02  Z1I  PIC X(34).                                                  
           02  Z2L    COMP  PIC  S9(4).                                         
           02  Z2F    PICTURE X.                                                
           02  FILLER REDEFINES Z2F.                                            
             03 Z2A    PICTURE X.                                               
           02  Z2I  PIC X(34).                                                  
           02  Z3L    COMP  PIC  S9(4).                                         
           02  Z3F    PICTURE X.                                                
           02  FILLER REDEFINES Z3F.                                            
             03 Z3A    PICTURE X.                                               
           02  Z3I  PIC X(34).                                                  
           02  Z4L    COMP  PIC  S9(4).                                         
           02  Z4F    PICTURE X.                                                
           02  FILLER REDEFINES Z4F.                                            
             03 Z4A    PICTURE X.                                               
           02  Z4I  PIC X(34).                                                  
           02  Z5L    COMP  PIC  S9(4).                                         
           02  Z5F    PICTURE X.                                                
           02  FILLER REDEFINES Z5F.                                            
             03 Z5A    PICTURE X.                                               
           02  Z5I  PIC X(34).                                                  
           02  Z6L    COMP  PIC  S9(4).                                         
           02  Z6F    PICTURE X.                                                
           02  FILLER REDEFINES Z6F.                                            
             03 Z6A    PICTURE X.                                               
           02  Z6I  PIC X(34).                                                  
           02  Z7L    COMP  PIC  S9(4).                                         
           02  Z7F    PICTURE X.                                                
           02  FILLER REDEFINES Z7F.                                            
             03 Z7A    PICTURE X.                                               
           02  Z7I  PIC X(34).                                                  
           02  Z8L    COMP  PIC  S9(4).                                         
           02  Z8F    PICTURE X.                                                
           02  FILLER REDEFINES Z8F.                                            
             03 Z8A    PICTURE X.                                               
           02  Z8I  PIC X(34).                                                  
           02  Z9L    COMP  PIC  S9(4).                                         
           02  Z9F    PICTURE X.                                                
           02  FILLER REDEFINES Z9F.                                            
             03 Z9A    PICTURE X.                                               
           02  Z9I  PIC X(34).                                                  
           02  Z10L    COMP  PIC  S9(4).                                        
           02  Z10F    PICTURE X.                                               
           02  FILLER REDEFINES Z10F.                                           
             03 Z10A    PICTURE X.                                              
           02  Z10I  PIC X(34).                                                 
           02  Z11L    COMP  PIC  S9(4).                                        
           02  Z11F    PICTURE X.                                               
           02  FILLER REDEFINES Z11F.                                           
             03 Z11A    PICTURE X.                                              
           02  Z11I  PIC X(34).                                                 
           02  Z12L    COMP  PIC  S9(4).                                        
           02  Z12F    PICTURE X.                                               
           02  FILLER REDEFINES Z12F.                                           
             03 Z12A    PICTURE X.                                              
           02  Z12I  PIC X(34).                                                 
           02  Z13L    COMP  PIC  S9(4).                                        
           02  Z13F    PICTURE X.                                               
           02  FILLER REDEFINES Z13F.                                           
             03 Z13A    PICTURE X.                                              
           02  Z13I  PIC X(34).                                                 
           02  Z14L    COMP  PIC  S9(4).                                        
           02  Z14F    PICTURE X.                                               
           02  FILLER REDEFINES Z14F.                                           
             03 Z14A    PICTURE X.                                              
           02  Z14I  PIC X(34).                                                 
           02  Z15L    COMP  PIC  S9(4).                                        
           02  Z15F    PICTURE X.                                               
           02  FILLER REDEFINES Z15F.                                           
             03 Z15A    PICTURE X.                                              
           02  Z15I  PIC X(34).                                                 
           02  FEHLERL    COMP  PIC  S9(4).                                     
           02  FEHLERF    PICTURE X.                                            
           02  FILLER REDEFINES FEHLERF.                                        
             03 FEHLERA    PICTURE X.                                           
           02  FEHLERI  PIC X(77).                                              
       01  UU994O REDEFINES UU994I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z1O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z2O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z3O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z4O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z5O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z6O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z7O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z8O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z9O  PIC X(34).                                                  
           02  FILLER PICTURE X(3).                                             
           02  Z10O  PIC X(34).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z11O  PIC X(34).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z12O  PIC X(34).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z13O  PIC X(34).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z14O  PIC X(34).                                                 
           02  FILLER PICTURE X(3).                                             
           02  Z15O  PIC X(34).                                                 
           02  FILLER PICTURE X(3).                                             
           02  FEHLERO  PIC X(77).                                              
