       01  UU992I.                                                              
           02  FILLER PIC X(12).                                                
           02  PNRL    COMP  PIC  S9(4).                                        
           02  PNRF    PICTURE X.                                               
           02  FILLER REDEFINES PNRF.                                           
             03 PNRA    PICTURE X.                                              
           02  PNRI  PIC X(7).                                                  
           02  DATUML    COMP  PIC  S9(4).                                      
           02  DATUMF    PICTURE X.                                             
           02  FILLER REDEFINES DATUMF.                                         
             03 DATUMA    PICTURE X.                                            
           02  DATUMI  PIC X(8).                                                
           02  UHRL    COMP  PIC  S9(4).                                        
           02  UHRF    PICTURE X.                                               
           02  FILLER REDEFINES UHRF.                                           
             03 UHRA    PICTURE X.                                              
           02  UHRI  PIC X(5).                                                  
           02  ANWL    COMP  PIC  S9(4).                                        
           02  ANWF    PICTURE X.                                               
           02  FILLER REDEFINES ANWF.                                           
             03 ANWA    PICTURE X.                                              
           02  ANWI  PIC X(4).                                                  
           02  BEZL    COMP  PIC  S9(4).                                        
           02  BEZF    PICTURE X.                                               
           02  FILLER REDEFINES BEZF.                                           
             03 BEZA    PICTURE X.                                              
           02  BEZI  PIC X(40).                                                 
           02  STATUSL    COMP  PIC  S9(4).                                     
           02  STATUSF    PICTURE X.                                            
           02  FILLER REDEFINES STATUSF.                                        
             03 STATUSA    PICTURE X.                                           
           02  STATUSI  PIC X(1).                                               
           02  KNRL    COMP  PIC  S9(4).                                        
           02  KNRF    PICTURE X.                                               
           02  FILLER REDEFINES KNRF.                                           
             03 KNRA    PICTURE X.                                              
           02  KNRI  PIC X(4).                                                  
           02  KNRBEZL    COMP  PIC  S9(4).                                     
           02  KNRBEZF    PICTURE X.                                            
           02  FILLER REDEFINES KNRBEZF.                                        
             03 KNRBEZA    PICTURE X.                                           
           02  KNRBEZI  PIC X(30).                                              
           02  DATEIL    COMP  PIC  S9(4).                                      
           02  DATEIF    PICTURE X.                                             
           02  FILLER REDEFINES DATEIF.                                         
             03 DATEIA    PICTURE X.                                            
           02  DATEII  PIC X(50).                                               
           02  BILDL    COMP  PIC  S9(4).                                       
           02  BILDF    PICTURE X.                                              
           02  FILLER REDEFINES BILDF.                                          
             03 BILDA    PICTURE X.                                             
           02  BILDI  PIC X(7).                                                 
           02  TEXTL    COMP  PIC  S9(4).                                       
           02  TEXTF    PICTURE X.                                              
           02  FILLER REDEFINES TEXTF.                                          
             03 TEXTA    PICTURE X.                                             
           02  TEXTI  PIC X(3).                                                 
           02  NAWKZL    COMP  PIC  S9(4).                                      
           02  NAWKZF    PICTURE X.                                             
           02  FILLER REDEFINES NAWKZF.                                         
             03 NAWKZA    PICTURE X.                                            
           02  NAWKZI  PIC X(1).                                                
           02  MENUEL    COMP  PIC  S9(4).                                      
           02  MENUEF    PICTURE X.                                             
           02  FILLER REDEFINES MENUEF.                                         
             03 MENUEA    PICTURE X.                                            
           02  MENUEI  PIC X(4).                                                
           02  TRTYPL    COMP  PIC  S9(4).                                      
           02  TRTYPF    PICTURE X.                                             
           02  FILLER REDEFINES TRTYPF.                                         
             03 TRTYPA    PICTURE X.                                            
           02  TRTYPI  PIC X(1).                                                
           02  PGNAMEL    COMP  PIC  S9(4).                                     
           02  PGNAMEF    PICTURE X.                                            
           02  FILLER REDEFINES PGNAMEF.                                        
             03 PGNAMEA    PICTURE X.                                           
           02  PGNAMEI  PIC X(8).                                               
           02  CTVL    COMP  PIC  S9(4).                                        
           02  CTVF    PICTURE X.                                               
           02  FILLER REDEFINES CTVF.                                           
             03 CTVA    PICTURE X.                                              
           02  CTVI  PIC X(16).                                                 
           02  FRAGEL    COMP  PIC  S9(4).                                      
           02  FRAGEF    PICTURE X.                                             
           02  FILLER REDEFINES FRAGEF.                                         
             03 FRAGEA    PICTURE X.                                            
           02  FRAGEI  PIC X(21).                                               
           02  ANTWL    COMP  PIC  S9(4).                                       
           02  ANTWF    PICTURE X.                                              
           02  FILLER REDEFINES ANTWF.                                          
             03 ANTWA    PICTURE X.                                             
           02  ANTWI  PIC X(1).                                                 
           02  BEM1L    COMP  PIC  S9(4).                                       
           02  BEM1F    PICTURE X.                                              
           02  FILLER REDEFINES BEM1F.                                          
             03 BEM1A    PICTURE X.                                             
           02  BEM1I  PIC X(32).                                                
           02  FEHLERL    COMP  PIC  S9(4).                                     
           02  FEHLERF    PICTURE X.                                            
           02  FILLER REDEFINES FEHLERF.                                        
             03 FEHLERA    PICTURE X.                                           
           02  FEHLERI  PIC X(76).                                              
       01  UU992O REDEFINES UU992I.                                             
           02  FILLER PIC X(12).                                                
           02  FILLER PICTURE X(3).                                             
           02  PNRO  PIC X(7).                                                  
           02  FILLER PICTURE X(3).                                             
           02  DATUMO  PIC X(8).                                                
           02  FILLER PICTURE X(3).                                             
           02  UHRO  PIC X(5).                                                  
           02  FILLER PICTURE X(3).                                             
           02  ANWO  PIC X(4).                                                  
           02  FILLER PICTURE X(3).                                             
           02  BEZO  PIC X(40).                                                 
           02  FILLER PICTURE X(3).                                             
           02  STATUSO  PIC X(1).                                               
           02  FILLER PICTURE X(3).                                             
           02  KNRO  PIC X(4).                                                  
           02  FILLER PICTURE X(3).                                             
           02  KNRBEZO  PIC X(30).                                              
           02  FILLER PICTURE X(3).                                             
           02  DATEIO  PIC X(50).                                               
           02  FILLER PICTURE X(3).                                             
           02  BILDO  PIC X(7).                                                 
           02  FILLER PICTURE X(3).                                             
           02  TEXTO  PIC X(3).                                                 
           02  FILLER PICTURE X(3).                                             
           02  NAWKZO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  MENUEO  PIC X(4).                                                
           02  FILLER PICTURE X(3).                                             
           02  TRTYPO  PIC X(1).                                                
           02  FILLER PICTURE X(3).                                             
           02  PGNAMEO  PIC X(8).                                               
           02  FILLER PICTURE X(3).                                             
           02  CTVO  PIC X(16).                                                 
           02  FILLER PICTURE X(3).                                             
           02  FRAGEO  PIC X(21).                                               
           02  FILLER PICTURE X(3).                                             
           02  ANTWO  PIC X(1).                                                 
           02  FILLER PICTURE X(3).                                             
           02  BEM1O  PIC X(32).                                                
           02  FILLER PICTURE X(3).                                             
           02  FEHLERO  PIC X(76).                                              
