      *****************************************************************         
        05  WU-WUKI0499.                                                        
           10 G79DVERTRAGSNR                PIC  X(0015).                       
           10 G79DMANDANT                   PIC S9(9) COMP.                     
           10 G79DABSCHLVBNR                PIC S9(9) COMP.                     
           10 G79DNACHNAME                  PIC  X(0030).                       
           10 G79DVORNAME                   PIC  X(0030).                       
           10 G79DFIRMENNAME                PIC  X(0070).                       
           10 G79DGEBDAT                    PIC  X(0008).                       
           10 G79DANREDE                    PIC  X(0001).                       
           10 G79DSTRHNR                    PIC  X(0040).                       
           10 G79DPLZ                       PIC  X(0009).                       
           10 G79DORT                       PIC  X(0030).                       
           10 G79DLAND                      PIC  X(0003).                       
           10 G79DEMAIL                     PIC  X(0040).                       
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 G79DKUNDENID                  PIC S9(9) COMP.                     
           10 G79DGESID                     PIC S9(4) COMP.                     
