      *****************************************************************         
        05  WU-WUKI0557.                                                        
           10 AKFFONDSID                    PIC S9(4) COMP.                     
           10 AKFGESID                      PIC S9(4) COMP.                     
           10 AKFWKN                        PIC  X(0006).                       
           10 AKFISIN                       PIC  X(0020).                       
           10 AKFVLKZN                      PIC  X(0001).                       
           10 AKFBEZEICHNUNG                PIC  X(0040).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
