      *****************************************************************         
        05  WU-WUKI0327.                                                        
           10 LFOVERTRAGSID                 PIC  X(0013).                       
           10 LFOVERSTARLFDNR               PIC S9(4) COMP.                     
           10 LFOLFDNR                      PIC S9(4) COMP.                     
           10 LFOANZAHLANTEILE              PIC S9(8)V9(6) COMP-3.              
           10 NIL-LFOANZAHLANTEILE          PIC  X(01).                         
           10 LFORUECKNAHMEBETR             PIC S9(11)V9(2) COMP-3.             
           10 NIL-LFORUECKNAHMEBETR         PIC  X(01).                         
           10 LFOPROZSPARBETR               PIC S9(3)V9(2) COMP-3.              
           10 NIL-LFOPROZSPARBETR           PIC  X(01).                         
           10 LFODECKUNGSKAPITAL            PIC S9(11)V9(2) COMP-3.             
           10 NIL-LFODECKUNGSKAPITAL        PIC  X(01).                         
           10 LFODECKKAPITWKZ               PIC  X(0001).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 NIL-LETZTEAENDERUNG           PIC  X(01).                         
           10 LFOFONDSKUERZEL               PIC  X(0002).                       
           10 LFOANZAHLANTBKZ               PIC  X(0001).                       
           10 NIL-LFOANZAHLANTBKZ           PIC  X(01).                         
           10 LFORUECKNAHMEBKZ              PIC  X(0001).                       
           10 NIL-LFORUECKNAHMEBKZ          PIC  X(01).                         
           10 LFOPROZSPARBKZ                PIC  X(0001).                       
           10 NIL-LFOPROZSPARBKZ            PIC  X(01).                         
           10 LFODECKKAPITBKZ               PIC  X(0001).                       
           10 NIL-LFODECKKAPITBKZ           PIC  X(01).                         
           10 LFOFONDSKUEBKZ                PIC  X(0001).                       
           10 NIL-LFOFONDSKUEBKZ            PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
