      *****************************************************************         
        05  WU-WUKI0562.                                                        
           10 G21VKVNR                      PIC  X(0015).                       
           10 G21VKVERARB-KZN               PIC  X(0001).                       
           10 G21VKNACHNAME                 PIC  X(0080).                       
           10 G21VKVORNAME                  PIC  X(0030).                       
           10 G21VKGEBDAT                   PIC  X(0010).                       
           10 G21VKANREDE                   PIC S9(4) COMP.                     
           10 G21VKGESCHLECHT               PIC  X(0001).                       
           10 G21VKSTR                      PIC  X(0045).                       
           10 G21VKPLZ                      PIC  X(0015).                       
           10 G21VKORT                      PIC  X(0030).                       
           10 G21VKLKZN                     PIC  X(0003).                       
           10 LETZTERAENDERER               PIC  X(0010).                       
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
