      *****************************************************************         
        05  WU-WUKI0461.                                                        
           10 VZAVERTRAGSID                 PIC  X(0013).                       
           10 VZALFDNR                      PIC S9(4) COMP.                     
           10 VZADAUER                      PIC S9(4) COMP.                     
           10 VZABEGINN                     PIC  X(010).                        
           10 NIL-VZABEGINN                 PIC  X(01).                         
           10 VZAZAHLBETRAG                 PIC S9(11)V9(2) COMP-3.             
           10 NIL-VZAZAHLBETRAG             PIC  X(01).                         
           10 VZAERSTELLTDAT                PIC  X(010).                        
           10 VZALFDMONRECHPGM              PIC S9(4) COMP.                     
           10 NIL-VZALFDMONRECHPGM          PIC  X(01).                         
           10 VZAANZMONVERARB               PIC S9(4) COMP.                     
           10 NIL-VZAANZMONVERARB           PIC  X(01).                         
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 VZATSCHICHTNR                 PIC S9(4) COMP.                     
           10 NIL-VZATSCHICHTNR             PIC  X(01).                         
           10 VZAKLBERHAUSSCHL              PIC  X(0001).                       
