      *****************************************************************         
        05  WU-WUKI0551.                                                        
           10 BDKVERTRAGSID                 PIC  X(0013).                       
           10 BDKLFDNR                      PIC S9(4) COMP.                     
           10 BDKWAEHRUNG                   PIC S9(4) COMP.                     
           10 BDKKARTENNR                   PIC  X(0013).                       
           10 BDKKARTENART                  PIC  X(0003).                       
           10 NIL-BDKKARTENART              PIC  X(01).                         
           10 BDKGUELTIGBIS                 PIC  X(0004).                       
           10 NIL-BDKGUELTIGBIS             PIC  X(01).                         
           10 BDKINHABERNAME1               PIC  X(0030).                       
           10 NIL-BDKINHABERNAME1           PIC  X(01).                         
           10 BDKINHABERNAME2               PIC  X(0030).                       
           10 NIL-BDKINHABERNAME2           PIC  X(01).                         
           10 BDKNFCKZN                     PIC  X(0001).                       
           10 NIL-BDKNFCKZN                 PIC  X(01).                         
           10 LETZTEAENDERUNG               PIC  X(0026).                       
           10 LETZTERAENDERER               PIC  X(0010).                       
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 BDKNFCSTATUS                  PIC  X(0001).                       
           10 NIL-BDKNFCSTATUS              PIC  X(01).                         
