      *****************************************************************         
        05  WU-WUKI0346.                                                        
           10 LTAVERTRAGSID                 PIC  X(0013).                       
           10 LTAVERSTARLFDNR               PIC S9(4) COMP.                     
           10 LTARUMSGRUPPE                 PIC  X(0006).                       
           10 NIL-LTARUMSGRUPPE             PIC  X(01).                         
           10 LTARENTENZAHLWID              PIC S9(4) COMP.                     
           10 NIL-LTARENTENZAHLWID          PIC  X(01).                         
           10 LTARENTENGARZEIT              PIC  X(010).                        
           10 NIL-LTARENTENGARZEIT          PIC  X(01).                         
           10 LTALVART                      PIC S9(4) COMP.                     
           10 NIL-LTALVART                  PIC  X(01).                         
           10 LTAKZKAPWRECHT                PIC  X(0001).                       
           10 LTAFONDSPALETTE               PIC  X(0008).                       
           10 NIL-LTAFONDSPALETTE           PIC  X(01).                         
           10 LTAFONDSAKTKZN                PIC  X(0001).                       
           10 NIL-LTAFONDSAKTKZN            PIC  X(01).                         
           10 LTADEPOTBETRAG                PIC S9(11)V9(2) COMP-3.             
           10 NIL-LTADEPOTBETRAG            PIC  X(01).                         
           10 LTADEPOTZINSEN                PIC S9(11)V9(2) COMP-3.             
           10 NIL-LTADEPOTZINSEN            PIC  X(01).                         
           10 LTADEPOTZINSSATZ              PIC S9(3)V9(2) COMP-3.              
           10 NIL-LTADEPOTZINSSATZ          PIC  X(01).                         
           10 LTADEPWERTTERMIN              PIC  X(010).                        
           10 NIL-LTADEPWERTTERMIN          PIC  X(01).                         
           10 LTAZULAGENART                 PIC S9(4) COMP.                     
           10 NIL-LTAZULAGENART             PIC  X(01).                         
           10 LTADAUZULAGENKZ               PIC  X(0001).                       
           10 NIL-LTADAUZULAGENKZ           PIC  X(01).                         
           10 LTASTVD0067-KTY               PIC S9(4) COMP.                     
           10 NIL-LTASTVD0067-KTY           PIC  X(01).                         
           10 LTASTVD0067-KNR               PIC S9(15)V COMP-3.                 
           10 NIL-LTASTVD0067-KNR           PIC  X(01).                         
           10 LTADIREKTVER-KTY              PIC S9(4) COMP.                     
           10 NIL-LTADIREKTVER-KTY          PIC  X(01).                         
           10 LTADIREKTVER-KNR              PIC S9(4) COMP.                     
           10 NIL-LTADIREKTVER-KNR          PIC  X(01).                         
           10 LTAABTRETUNGKZ                PIC  X(0001).                       
           10 NIL-LTAABTRETUNGKZ            PIC  X(01).                         
           10 LTARENTENBEZUG                PIC S9(4) COMP.                     
           10 NIL-LTARENTENBEZUG            PIC  X(01).                         
           10 LTABULEISTUNG                 PIC  X(0001).                       
           10 NIL-LTABULEISTUNG             PIC  X(01).                         
           10 LTANETTOBEITRAG               PIC S9(9)V9(2) COMP-3.              
           10 NIL-LTANETTOBEITRAG           PIC  X(01).                         
           10 LTABONUSKZ                    PIC  X(0001).                       
           10 NIL-LTABONUSKZ                PIC  X(01).                         
           10 LTAKONVANLPROZ                PIC S9(3)V COMP-3.                  
           10 NIL-LTAKONVANLPROZ            PIC  X(01).                         
           10 LTATSTHOST                    PIC  X(0026).                       
           10 NIL-LTATSTHOST                PIC  X(01).                         
           10 LTAPRODBEZ-KTY                PIC S9(4) COMP.                     
           10 NIL-LTAPRODBEZ-KTY            PIC  X(01).                         
           10 LTAPRODBEZ-KNR                PIC S9(15)V COMP-3.                 
           10 NIL-LTAPRODBEZ-KNR            PIC  X(01).                         
           10 LTALVURSPRBEG                 PIC  X(010).                        
           10 NIL-LTALVURSPRBEG             PIC  X(01).                         
           10 LTAURSPRPOLDAT                PIC  X(010).                        
           10 NIL-LTAURSPRPOLDAT            PIC  X(01).                         
           10 LTAFONDSMANKZ                 PIC  X(0001).                       
           10 LTAFOMGNTKWAB                 PIC  X(010).                        
           10 NIL-LTAFOMGNTKWAB             PIC  X(01).                         
           10 LTAFOMGNTKWBIS                PIC  X(010).                        
           10 NIL-LTAFOMGNTKWBIS            PIC  X(01).                         
           10 LTABUKTKZN                    PIC  X(0001).                       
           10 LTAVITALITYKZN-KTY            PIC S9(4) COMP.                     
           10 NIL-LTAVITALITYKZN-KTY        PIC  X(01).                         
           10 LTAVITALITYKZN-KNR            PIC S9(15)V COMP-3.                 
           10 NIL-LTAVITALITYKZN-KNR        PIC  X(01).                         
           10 ZUGANG                        PIC  X(0032).                       
           10 VON                           PIC  X(0032).                       
           10 BIS                           PIC  X(0032).                       
           10 DCOP                          PIC  X(0001).                       
           10 NIL-DCOP                      PIC  X(01).                         
           10 LTANEUABSCHLKZN               PIC  X(0001).                       
           10 LTABASISZINS-BETR             PIC S9(13)V9(2) COMP-3.             
           10 NIL-LTABASISZINS-BETR         PIC  X(01).                         
           10 LTAZINSBOOST-SATZ             PIC S9(6)V9(3) COMP-3.              
           10 NIL-LTAZINSBOOST-SATZ         PIC  X(01).                         
           10 LTAZINSBOOST-BETR             PIC S9(13)V9(2) COMP-3.             
           10 NIL-LTAZINSBOOST-BETR         PIC  X(01).                         
           10 LTAEUKLAUSELKZN               PIC  X(0001).                       
           10 LTASCHUELER-BU                PIC  X(0001).                       
           10 LTABTG-AG                     PIC S9(11)V9(2) COMP-3.             
           10 LTABTG-AN                     PIC S9(11)V9(2) COMP-3.             
           10 LTAKLBERHAUSSCHL              PIC  X(0001).                       
           10 LTAWERTSICHOPTKZN             PIC  X(0001).                       
