      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  27/02/18
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0494.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/WUKI0494.CPv  $
      *
      *   Rev 2.1   Jun 11 2018 14:38:24   t13ex27
      *AKI01570: FW - Generali-Partnergesellschaften-E/A/A-Kunden
      *
      *   Rev 2.0   Feb 27 2018 14:21:20   T13EX27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WUKI0494.
           10 GUPVERTRAGSID                 PIC  X(0013).
           10 GUPPRODLFDNR                  PIC S9(4) COMP.
           10 GUPLFDNR                      PIC S9(4) COMP.
           10 GUPNACHNAME                   PIC  X(0040).
           10 NIL-GUPNACHNAME               PIC  X(01).
           10 GUPVORNAME                    PIC  X(0030).
           10 NIL-GUPVORNAME                PIC  X(01).
           10 GUPGEBDATUM                   PIC  X(010).
           10 NIL-GUPGEBDATUM               PIC  X(01).
           10 LETZTEAENDERUNG               PIC  X(0026).

