      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  21/09/16
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0479.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/WUKI0479.CPv  $
      *
      *   Rev 2.2   Dec 19 2016 13:10:12   t13ac20
      *AKI01466: Standard OZP
      *
      *   Rev 2.1   Dec 07 2016 10:52:42   t13ac20
      *AKI01466: Standard OZP
      *
      *   Rev 2.0   Sep 21 2016 11:52:02   T13AC20
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WUKI0479.
           10 G51VVERTRAGSNR                PIC  X(0015).
           10 G51VSTATUS                    PIC  X(0001).
           10 G51VMAKLERDAT                 PIC  X(0008).
           10 G51VANTRAGSPIN                PIC S9(9) COMP.
           10 G51VVERSART                   PIC  X(0001).
           10 G51VMANDANT                   PIC S9(9) COMP.
           10 G51VABSCHLVBNR                PIC S9(9) COMP.
           10 G51VVRTRGBEGINN               PIC  X(0008).
           10 G51VVRTRGENDE                 PIC  X(0008).
           10 G51VNACHNAME                  PIC  X(0030).
           10 G51VVORNAME                   PIC  X(0030).
           10 G51VGEBDAT                    PIC  X(0008).
           10 G51VANREDE                    PIC S9(4) COMP.
           10 G51VGESCHLECHT                PIC  X(0001).
           10 G51VSTRASSE                   PIC  X(0040).
           10 G51VPLZ                       PIC  X(0009).
           10 G51VLANDID                    PIC  X(0003).
           10 G51VORT                       PIC  X(0030).
           10 G51VABRECHKZ                  PIC  X(0001).
           10 G51VZUSRAHMEN                 PIC  X(0001).
           10 G51VVORVENDDATUM              PIC  X(0008).
           10 G51VVORVGES                   PIC S9(4) COMP.
           10 G51VVORVKUENDKZ               PIC  X(0001).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).

