      *---------------------------------------------------------------*
      *    Standard für alle Objekte unter PVCS
      *            Datum   :  Januar 2001
      *            Kopf aus:  N:\PROFILE\KOPFCPY.DAT
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright 2001 ATLAS Dienstleistungs GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0044.CPY  $
      *    $Revision:   2.6  $
      *
      *    $Log:   L:/mf/CPY/WUKI0044.CPv  $
      *
      *   Rev 2.6   Sep 08 2003 16:28:58   t13ex27
      *AKI00360 - DB-Änderung für Fix 46
      *
      *   Rev 2.5   25 Jul 2001 10:33:02   p13sp16
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-PERSONADRESSBEZ.
           10 PERSABPERSONENID            PIC X(13).
           10 PERSABADRESSEID             PIC X(13).
           10 PERSABADRESSARTID           PIC S9(4) COMP.
           10 LETZTEAENDERUNG             PIC X(026).
           10 NIL-LETZTEAENDERUNG         PIC X(01).
           10 PERSABVERTRADRKZ            PIC X(1).
      *****************************************************************
