      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VersionManager
      *            Datum      :  30.01.2018
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *    Copyright (c) 2018 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0487.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/WUKI0487.CPv  $
      *
      *   Rev 2.2   Jun 08 2018 11:57:06   t13ae31
      *AKI01567: G10 Umstellung auf KSDS in DB2
      *
      *   Rev 2.1   Jun 07 2018 10:13:34   t13ae31
      *AKI01567: G10 Umstellung KSDS in DB2 OZP Kunde
      *
      *   Rev 2.0   Jan 30 2018 10:37:18   t13ae31
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WUKI0487.
           10 G10KDSPARTE                   PIC  X(0003).
           10 G10KDVERTRAGSNR               PIC  X(0015).
           10 G10KDROLLE                    PIC S9(4) COMP.
           10 G10KDAENDKZ                   PIC S9(4) COMP.
           10 G10KDNACHNAME                 PIC  X(0040).
           10 G10KDVORNAME                  PIC  X(0030).
           10 G10KDGEBDAT                   PIC  X(0008).
           10 G10KDANREDEKZ                 PIC  X(0002).
           10 G10KDGESCHLECHT               PIC  X(0001).
           10 G10KDSTRASSE                  PIC  X(0045).
           10 G10KDPOSTFACH                 PIC  X(0045).
           10 G10KDPLZ                      PIC  X(0009).
           10 G10KDORT                      PIC  X(0040).
           10 G10KDLKZ                      PIC  X(0003).
           10 G10KDIBAN                     PIC  X(0034).
           10 G10KDBIC                      PIC  X(0011).
           10 ZUGANG                        PIC  X(0032).
           10 VON                           PIC  X(0032).
           10 BIS                           PIC  X(0032).
 

