      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  09/10/14
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0471.CPY  $
      *    $Revision:   2.6  $
      *
      *    $Log:   L:/mf/CPY/WUKI0471.CPv  $
      *
      *   Rev 2.6   Mar 17 2015 14:38:58   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank - Co
      *pies
      *
      *   Rev 2.5   Mar 11 2015 12:29:22   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.4   Mar 09 2015 11:18:10   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.3   Mar 02 2015 10:54:10   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.2   Feb 25 2015 11:44:52   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.1   Jan 13 2015 13:09:16   t13ex78
      *AKI01251: Bestandsdatenübermittlung mit der Commerzbank
      *
      *   Rev 2.0   Oct 9 2014 12:53:31   T13EX78
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-G68_KUNDE.
           10 G68KVERTRAGSNR                PIC  X(0015).
           10 G68KLFDNR                     PIC S9(4) COMP.
           10 G68KNACHNAME                  PIC  X(0030).
           10 NIL-G68KNACHNAME              PIC  X(01).
           10 G68KVORNAME                   PIC  X(0030).
           10 NIL-G68KVORNAME               PIC  X(01).
           10 G68KGEBURTSDATUM              PIC  X(010).
           10 NIL-G68KGEBURTSDATUM          PIC  X(01).
           10 G68KANREDE                    PIC  X(0001).
           10 NIL-G68KANREDE                PIC  X(01).
           10 G68KGESCHLECHT                PIC  X(0001).
           10 NIL-G68KGESCHLECHT            PIC  X(01).
           10 G68KSTRASSE                   PIC  X(0040).
           10 NIL-G68KSTRASSE               PIC  X(01).
           10 G68KPOSTLEITZAHL              PIC  X(0009).
           10 NIL-G68KPOSTLEITZAHL          PIC  X(01).
           10 G68KORT                       PIC  X(0030).
           10 NIL-G68KORT                   PIC  X(01).
           10 G68KLAND                      PIC  X(0003).
           10 NIL-G68KLAND                  PIC  X(01).
           10 G68KLOESCHKZ                  PIC  X(0001).
           10 ZUGANG                        PIC  X(026).
           10 VON                           PIC  X(026).
           10 BIS                           PIC  X(026).
 
 
 
 
 

