      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  16/07/14
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2006 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0435.CPY  $
      *    $Revision:   2.2  $
      *
      *    $Log:   L:/mf/CPY/WUKI0435.CPv  $
      *
      *   Rev 2.2   Mar 02 2015 16:24:14   t13ex27
      *AKI01315: Masch. Verarbeitung von Fonds- und Paletteninforma
      *tionen-DB-Änderung und OZPs
      *
      *   Rev 2.1   Sep 01 2014 10:36:26   t13ex27
      *AKI01315: Masch. Verarbeitung von Fonds- und Paletteninforma
      *tionen-DB-Änderung und OZPs
      *
      *   Rev 2.0   Jul 16 2014 16:39:42   T13EX27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-FONDSPALETTE.
           10 FOPPALETTENNAME               PIC  X(0008).
           10 FOPFONDSKUERZEL               PIC  X(0002).

