      *---------------------------------------------------------------*
      *    Standard fuer alle Objekte unter PVCS VM
      *            Datum      :  13.05.2004
      *            Kategorie  :  Copystrecke
      *---------------------------------------------------------------*
      *
      *---------------------------------------------------------------*
      *    Copyright (c) 2004 ATLAS Dienstleistungen f. V. GmbH
      *---------------------------------------------------------------*
      *    $Workfile:   WUKI0399.CPY  $
      *    $Revision:   2.1  $
      *
      *    $Log:   L:/mf/CPY/WUKI0399.CPv  $
      *
      *   Rev 2.1   May 24 2004 11:45:44   t13ex27
      *DB-Änderung für Fix 61 PMKI0079 und WUKI's
      *
      *   Rev 2.0   May 13 2004 15:42:12   t13ex27
      *Archiverstellung
      *
      *---------------------------------------------------------------*
        05  WU-WOHNSPARSCHLUESSEL.
           10 WOHNSPARKEY                 PIC S9(4) COMP.
           10 WOHNSPARTEXT                PIC X(25).
      *****************************************************************
